{"id":"2408.05948","title":"ConvKGYarn: Spinning Configurable and Scalable Conversational Knowledge\n  Graph QA datasets with Large Language Models","authors":"Ronak Pradeep, Daniel Lee, Ali Mousavi, Jeff Pound, Yisi Sang, Jimmy\n  Lin, Ihab Ilyas, Saloni Potdar, Mostafa Arefiyan, Yunyao Li","authorsParsed":[["Pradeep","Ronak",""],["Lee","Daniel",""],["Mousavi","Ali",""],["Pound","Jeff",""],["Sang","Yisi",""],["Lin","Jimmy",""],["Ilyas","Ihab",""],["Potdar","Saloni",""],["Arefiyan","Mostafa",""],["Li","Yunyao",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:48:43 GMT"}],"updateDate":"2024-08-13","timestamp":1723445323000,"abstract":"  The rapid advancement of Large Language Models (LLMs) and conversational\nassistants necessitates dynamic, scalable, and configurable conversational\ndatasets for training and evaluation. These datasets must accommodate diverse\nuser interaction modes, including text and voice, each presenting unique\nmodeling challenges. Knowledge Graphs (KGs), with their structured and evolving\nnature, offer an ideal foundation for current and precise knowledge. Although\nhuman-curated KG-based conversational datasets exist, they struggle to keep\npace with the rapidly changing user information needs. We present ConvKGYarn, a\nscalable method for generating up-to-date and configurable conversational KGQA\ndatasets. Qualitative psychometric analyses confirm our method can generate\nhigh-quality datasets rivaling a popular conversational KGQA dataset while\noffering it at scale and covering a wide range of human-interaction\nconfigurations. We showcase its utility by testing LLMs on diverse\nconversations - exploring model behavior on conversational KGQA sets with\ndifferent configurations grounded in the same KG fact set. Our results\nhighlight the ability of ConvKGYarn to improve KGQA foundations and evaluate\nparametric knowledge of LLMs, thus offering a robust solution to the constantly\nevolving landscape of conversational assistants.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}