{"id":"2408.11995","title":"Compact Binary Merger Rate with Modified Gravity in Dark-Matter Spikes","authors":"Saeed Fakhry, Sara Gholamhoseinian, Marzieh Farhang","authorsParsed":[["Fakhry","Saeed",""],["Gholamhoseinian","Sara",""],["Farhang","Marzieh",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 21:10:27 GMT"}],"updateDate":"2024-08-23","timestamp":1724274627000,"abstract":"  In this study, we investigate the impact of modified gravity on the merger\nrate of compact binaries within dark-matter spikes surrounding super-massive\nblack holes (SMBHs). Specifically, we calculate binary merger rates involving\nprimordial black holes (PBHs) and/or neutron stars (NSs) in Hu-Sawicki $f(R)$\ngravity and the normal branch of Dvali-Gabadadze-Porrati (nDGP) gravity, with\nthree SMBH mass functions, Benson, Vika, and Shankar. The results show\nconsistently higher merger rates predicted for PBH-PBH and PBH-NS binaries in\nthese gravity models compared to general relativity (GR), in particular at\nlower SMBH masses and for steeper dark-matter spike density profiles. The\npredicted merger rates are compared to the LIGO-Virgo observations to constrain\nthe parameters of the theory. In particular we find steeper dark-matter spike\ndensity profiles in the modified gravity scenarios compared to GR. When\ncompared to current observational constraints on PBH abundance, the mass ranges\nallowed by Hu-Sawicki $f(R)$ models are found to be wider than by nDGP models,\nfor given merger rates. The results are highly dependent on the choice of SMBH\nmass function, with Vika and Shankar mass functions predicting lower\nabundances. The considerable sensitivity of the results on the assumed gravity\nscenario and SMBH mass function demonstrates the necessity of incorporating the\ncorresponding theoretical uncertainties in making relatively robust predictions\non compact binary merger rates and, as a result on PBH properties.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hbuSkwL-nuDhDLx21UqHgStO_Ly4fQp_cGPBBTQmqXY","pdfSize":"1848463"}
