{"id":"2408.16843","title":"Unveiling the HD 95086 system at mid-infrared wavelengths with JWST/MIRI","authors":"Mathilde M\\^alin, Anthony Boccaletti, Cl\\'ement Perrot, Pierre Baudoz,\n  Daniel Rouan, Pierre-Olivier Lagage, Rens Waters, Manuel G\\\"udel, Thomas\n  Henning, Bart Vandenbussche, Olivier Absil, David Barrado, Jeroen Bouwman,\n  Christophe Cossou, Leen Decin, Adrian M. Glauser, John Pye, Goran Olofsson,\n  Alistair Glasse, Fred Lahuis, Polychronis Patapis, Pierre Royer, Silvia\n  Scheithauer, Niall Whiteford, Eugene Serabyn, Elodie Choquet, Luis Colina,\n  G\\\"oran Ostlin, Ewine F. van Dishoeck, Tom P. Ray, Gillian Wright","authorsParsed":[["Mâlin","Mathilde",""],["Boccaletti","Anthony",""],["Perrot","Clément",""],["Baudoz","Pierre",""],["Rouan","Daniel",""],["Lagage","Pierre-Olivier",""],["Waters","Rens",""],["Güdel","Manuel",""],["Henning","Thomas",""],["Vandenbussche","Bart",""],["Absil","Olivier",""],["Barrado","David",""],["Bouwman","Jeroen",""],["Cossou","Christophe",""],["Decin","Leen",""],["Glauser","Adrian M.",""],["Pye","John",""],["Olofsson","Goran",""],["Glasse","Alistair",""],["Lahuis","Fred",""],["Patapis","Polychronis",""],["Royer","Pierre",""],["Scheithauer","Silvia",""],["Whiteford","Niall",""],["Serabyn","Eugene",""],["Choquet","Elodie",""],["Colina","Luis",""],["Ostlin","Göran",""],["van Dishoeck","Ewine F.",""],["Ray","Tom P.",""],["Wright","Gillian",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:19:43 GMT"}],"updateDate":"2024-09-02","timestamp":1724955583000,"abstract":"  Mid-infrared imaging of exoplanets and disks is now possible with the\ncoronagraphs of the MIRI on the JWST. This wavelength range unveils new\nfeatures of young directly imaged systems and allows us to obtain new\nconstraints for characterizing the atmosphere of young giant exoplanets and\nassociated disks. These observations aim to characterize the atmosphere of the\nplanet HD 95086 b by adding mid-infrared information so that the various\nhypotheses about its atmospheric parameters values can be unraveled. Improved\nimages of circumstellar disks are provided. We present the MIRI coronagraphic\nimaging of the system HD 95086 obtained with the F1065C, F1140, and F2300C\nfilters at central wavelengths of 10.575, 11.3, and 23 microns, respectively.\nWe explored the method for subtracting the stellar diffraction pattern in the\nparticular case when bright dust emitting at short separation is present.\nFurthermore, we compared different methods for extracting the photometry of the\nplanet. Using the atmospheric models Exo-REM and ATMO, we measured the\natmospheric parameters of HD 95086 b. The planet HD 95086 b and the\ncontribution from the inner disk are detected at the two shortest MIRI\nwavelengths F1065C and F1140C. The outer colder belt is imaged at 23 microns.\nThe mid-infrared photometry provides better constraints on the atmospheric\nparameters. We evaluate a temperature of 850-1020 K, consistent with one\nprevious hypothesis that only used NIR data. The radius measurement of 1.0-1.13\nRJup is better aligned with evolutionary models, but still smaller than\npredicted. These observations allow us to refute the hypothesis of a warm\ncircumplanetary disk. HD 95086 is one of the first exoplanetary systems to be\nrevealed at mid-infrared wavelengths. This highlights the interests and\nchallenges of observations at these wavelengths.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QU-gB6baCbaJLxjhpmwLKpN3p10rPoFcfCeotSZ354k","pdfSize":"8673822"}
