{"id":"2408.13304","title":"Phenomenology of Electroweak Portal Dark Showers: High Energy Direct\n  Probes and Low Energy Complementarity","authors":"Hsin-Chia Cheng, Xu-Hui Jiang, Lingfeng Li","authorsParsed":[["Cheng","Hsin-Chia",""],["Jiang","Xu-Hui",""],["Li","Lingfeng",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-27","timestamp":1724436000000,"abstract":"  We investigate the phenomenology of a dark QCD sector interacting with the\nStandard Model (SM) via the electroweak (EW) portals. The portal interactions\nallow SM bosons, such as $Z$ and $h$, or additional bosons that mix with them,\nto decay into dark quarks, producing dark showers. The light dark mesons are\nexpected to be long-lived particles (LLPs), as their decays back to the SM\nstates through the EW-portal interactions typically have macroscopic decay\nlengths. We focus on dark shower events initiated by various bosons at the\nLarge Hadron Collider (LHC). The most prominent signal is the displaced decay\nof GeV-scale dark pions as LLPs. Current limits on dark shower signals at LHC\ndetectors are recast from public data in a model-independent manner. Future\nlimits in the high-luminosity phase and proposed auxiliary detectors are also\nprojected. Additionally, we study the flavor-changing neutral current (FCNC)\n$B$ decays into dark pions, obtaining both current and projected constraints at\nthe LHC and other facilities. These constraints can be combined for specific\nmodels, which are illustrated in two EW-portal benchmarks: one with the heavy\ndoublet fermion mediation and another with the $Z^\\prime$ mediator including a\nmass mixing. The collider reach shows significant potential to probe the\nparameter space unconstrained by EW precision tests, highlighting the necessity\nof dedicated LLP search strategies and facilities.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}