{"id":"2408.14647","title":"KBSS-InCLOSE I: Design and First Results from the Inner CGM of QSO Line\n  Of Sight Emitting Galaxies at z~2-3","authors":"Evan Haze Nunez (Caltech), Charles C. Steidel (Caltech), Evan N. Kirby\n  (Notre Dame), Gwen C. Rudie (Carnegie), Nikolaus Z. Prusinski (Caltech),\n  Yuguang Chen (UC Davis), Zhuyun Zhuang (Caltech), Allison L. Strom\n  (Northwestern), Dawn K. Erb (UW Milwaukee), Max Pettini (Cambridge), Louise\n  Welsh (Trieste), Dave S. N. Rupke (Rhodes), Ryan J. Cooke (Durham)","authorsParsed":[["Nunez","Evan Haze","","Caltech"],["Steidel","Charles C.","","Caltech"],["Kirby","Evan N.","","Notre Dame"],["Rudie","Gwen C.","","Carnegie"],["Prusinski","Nikolaus Z.","","Caltech"],["Chen","Yuguang","","UC Davis"],["Zhuang","Zhuyun","","Caltech"],["Strom","Allison L.","","Northwestern"],["Erb","Dawn K.","","UW Milwaukee"],["Pettini","Max","","Cambridge"],["Welsh","Louise","","Trieste"],["Rupke","Dave S. N.","","Rhodes"],["Cooke","Ryan J.","","Durham"]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:23:42 GMT"}],"updateDate":"2024-08-28","timestamp":1724707422000,"abstract":"  We present the design and first results of the Inner Circumgalactic Medium\n(CGM) of QSO Line of Sight Emitting galaxies at $z\\sim 2-3$, KBSS-InCLOSE. The\nsurvey will connect galaxy properties (e.g., stellar mass $M_*$, interstellar\nmedium ISM metallicity) with the physical conditions of the inner CGM (e.g.,\nkinematics, metallicity) to directly observe the galaxy-scale baryon cycle. We\nobtain deep Keck/KCWI optical IFU pointings of Keck Baryonic Structure Survey\n(KBSS) QSOs to discover new star-forming galaxies at small projected distances\n$b\\lesssim12\"$ (98 kpc, $\\overline{z}=2.3$), then obtain follow-up Keck/MOSFIRE\nNIR spectra to confirm their redshifts. We leverage KBSS images and Keck/HIRES\nQSO spectra to model stellar populations and inner CGM absorption. In this\npaper, we analyze two QSO fields and discover more than 15 new galaxies with\nKCWI, then use MOSFIRE for two galaxies Q2343-G1 ($z=2.43$; G1) and Q2233-N1\n($z=3.15$; N1), which are both associated with Damped Lyman Alpha absorbers. We\nfind that G1 has typical $M_*$,UV/optical emission properties. N1 has lower\n$M_*$ with very strong nebular emission. We jointly analyze neutral phase CGM\nand ionized ISM in N/O (for the first time at this $z$), dust extinction, and\nhigh-ionization CGM finding that: G1's CGM is metal poor and less evolved than\nits ISM, while N1's CGM and ISM abundances are comparable; their CGM shows\n$\\sim1$ dex less dust extinction than the ISM; and G1's CGM has direct evidence\nof hot, metal-rich galactic outflow ejecta. These findings support that metals\nand dust are driven into the CGM from outflows, but may also be e.g., stripped\nISM gas or satellite enrichment. The full KBSS-InCLOSE sample will explore\nthese scenarios.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}