{"id":"2408.02703","title":"Self-calibrating Intelligent OCT-SLO System","authors":"Mayank Goswami","authorsParsed":[["Goswami","Mayank",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 19:19:12 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 03:24:24 GMT"}],"updateDate":"2024-08-08","timestamp":1722799152000,"abstract":"  A unique sample independent 3D self calibration methodology is tested on a\nunique optical coherence tomography and multi-spectral scanning laser\nophthalmoscope (OCT-SLO) hybrid system. Operators visual cognition is replaced\nby computer vision using the proposed novel fully automatic AI-driven system\ndesign. Sample specific automatic contrast adjustment of the beam is achieved\non the pre-instructed region of interest. The AI model deduces infrared,\nfluorescence, and visual spectrum optical alignment by estimating\npre-instructed features quantitatively. The tested approach, however, is\nflexible enough to utilize any apt AI model. Relative comparison with classical\nsignal-to-noise-driven automation is shown to be 200 percent inferior and 130\npercent slower than the AI-driven approach. The best spatial resolution of the\nsystem is found to be (a) 2.41 microns in glass bead eye phantom, 0.76 with STD\n0.46 microns in the mouse retina in the axial direction, and (b) better than\n228 line pair per millimeter (lp per mm) or 2 microns for all three spectrums,\ni.e., 488 nm, 840 nm, and 520 to 550 nm emission in coronal, frontal or x-y\nplane. Intelligent automation reduces the possibility of developing cold\ncataracts (especially in mouse imaging) and patient-associated discomfort due\nto delay during manual alignment by facilitating easy handling for swift ocular\nimaging and better accuracy. The automatic novel tabletop compact system\nprovides true functional 3D images in three different spectrums for dynamic\nsample profiles. This is especially useful for photodynamic imaging treatment.\n","subjects":["Physics/Medical Physics","Physics/Applied Physics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"b2iMmOlQpIX17JBI_A7X0z-C_68LBiG5oO4_ws21-Jw","pdfSize":"1609171"}
