{"id":"2408.05210","title":"Third-order corrections to the slow-roll expansion: calculation and\n  constraints with Planck, ACT, SPT, and BICEP/Keck","authors":"Mario Ballardini, Alessandro Davoli, Salvatore Samuele Sirletti","authorsParsed":[["Ballardini","Mario",""],["Davoli","Alessandro",""],["Sirletti","Salvatore Samuele",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:58:52 GMT"}],"updateDate":"2024-08-12","timestamp":1723226332000,"abstract":"  We investigate the primordial power spectra (PPS) of scalar and tensor\nperturbations, derived through the slow-roll approximation. By solving the\nMukhanov-Sasaki equation and the tensor perturbation equation with Green's\nfunction techniques, we extend the PPS calculations to third-order corrections,\nproviding a comprehensive perturbative expansion in terms of slow-roll\nparameters. We investigate the accuracy of the analytic predictions with the\nnumerical solutions of the perturbation equations for a selection of\nsingle-field slow-roll inflationary models. We derive the constraints on the\nHubble flow functions $\\epsilon_i$ from Planck, ACT, SPT, and BICEP/Keck data.\nWe find an upper bound $\\epsilon_1 \\lesssim 0.002$ at 95\\% CL dominated by\nBICEP/Keck data and robust to all the different combination of datasets. We\nderive the constraint $\\epsilon_2 \\simeq 0.031 \\pm 0.004$ at 68\\% confidence\nlevel (CL) from the combination of Planck data and late-time probes such as\nbaryon acoustic oscillations, redshift space distortions, and supernovae data\nat first order in the slow-roll expansion. The uncertainty on $\\epsilon_2$ gets\nlarger including second- and third-order corrections, allowing for a\nnon-vanishing running and running of the running respectively, leading to\n$\\epsilon_2 \\simeq 0.034 \\pm 0.007$ at 68\\% CL. We find $\\epsilon_3 \\simeq 0.1\n\\pm 0.4$ at 95\\% CL both at second and at third order in the slow-roll\nexpansion of the spectra. $\\epsilon_4$ remains always unconstrained. The\ncombination of Planck and SPT data leads to slightly tighter constraints on\n$\\epsilon_2$ and $\\epsilon_3$. On the contrary, the combination of Planck data\nwith ACT measurements, which point to higher values of the scalar spectral\nindex compared to Planck findings, leads to shifts in the means and maximum\nlikelihood values for $\\epsilon_2$ and $\\epsilon_3$.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}