{"id":"2408.02349","title":"Active Sensing of Knee Osteoarthritis Progression with Reinforcement\n  Learning","authors":"Khanh Nguyen, Huy Hoang Nguyen, Egor Panfilov, Aleksei Tiulpin","authorsParsed":[["Nguyen","Khanh",""],["Nguyen","Huy Hoang",""],["Panfilov","Egor",""],["Tiulpin","Aleksei",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:54:08 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 11:09:18 GMT"},{"version":"v3","created":"Thu, 22 Aug 2024 09:25:51 GMT"}],"updateDate":"2024-08-23","timestamp":1722851648000,"abstract":"  Osteoarthritis (OA) is the most common musculoskeletal disease, which has no\ncure. Knee OA (KOA) is one of the highest causes of disability worldwide, and\nit costs billions of United States dollars to the global community. Prediction\nof KOA progression has been of high interest to the community for years, as it\ncan advance treatment development through more efficient clinical trials and\nimprove patient outcomes through more efficient healthcare utilization.\nExisting approaches for predicting KOA, however, are predominantly static, i.e.\nconsider data from a single time point to predict progression many years into\nthe future, and knee level, i.e. consider progression in a single joint only.\nDue to these and related reasons, these methods fail to deliver the level of\npredictive performance, which is sufficient to result in cost savings and\nbetter patient outcomes. Collecting extensive data from all patients on a\nregular basis could address the issue, but it is limited by the high cost at a\npopulation level. In this work, we propose to go beyond static prediction\nmodels in OA, and bring a novel Active Sensing (AS) approach, designed to\ndynamically follow up patients with the objective of maximizing the number of\ninformative data acquisitions, while minimizing their total cost over a period\nof time. Our approach is based on Reinforcement Learning (RL), and it leverages\na novel reward function designed specifically for AS of disease progression in\nmore than one part of a human body. Our method is end-to-end, relies on\nmulti-modal Deep Learning, and requires no human input at inference time.\nThroughout an exhaustive experimental evaluation, we show that using RL can\nprovide a higher monetary benefit when compared to state-of-the-art baselines.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"qnA4_vTXrIwlWQP6BygRZLvPKFzsA-S9d8KMeGoAMEA","pdfSize":"2603709","txDigest":"B2HTMnPjJSceXVm6QLn8DZNjeZGu8kuVaxuW4RXZ8EBL","endEpoch":"1","status":"CERTIFIED"}
