{"id":"2408.16070","title":"Symmetries, correlation functions, and entanglement of general quantum\n  Motzkin spin-chains","authors":"Varun Menon, Andi Gu, Ramis Movassagh","authorsParsed":[["Menon","Varun",""],["Gu","Andi",""],["Movassagh","Ramis",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:10:16 GMT"}],"updateDate":"2024-08-30","timestamp":1724868616000,"abstract":"  Motzkin spin-chains, which include 'colorless' (integer spin $s=1$) and\n'colorful' ($s \\geq 2$) variants, are one-dimensional (1D) local integer spin\nmodels notable for their lack of a conformal field theory (CFT) description of\ntheir low-energy physics, despite being gapless. The colorful variants are\nparticularly unusual, as they exhibit power-law violation of the area-law of\nentanglement entropy (as $\\sqrt{n}$ in system size $n$), rather than a\nlogarithmic violation as seen in a CFT. In this work, we analytically discover\nseveral unique properties of these models, potentially suggesting a new\nuniversality class for their low-energy physics. We identify a complex\nstructure of symmetries and unexpected scaling behavior in spin-spin\ncorrelations, which deviate from known 1D universality classes. Specifically,\nthe $s=1$ chain exhibits $U(1)$ spontaneous symmetry breaking and ferromagnetic\norder. Meanwhile, the $s \\geq 2$ chains do not appear to spontaneously break\nany symmetries, but display quasi-long-range algebraic order with power-law\ndecaying correlations, inconsistent with standard\nBerezinskii-Kosterlitz-Thouless (BKT) critical exponents. We also derive exact\nasymptotic scaling expressions for entanglement measures in both colorless and\ncolorful chains, generalizing previous results of Movassagh [J. Math Phys.\n(2017)], while providing benchmarks for potential quantum simulation\nexperiments. The combination of hardness of classically simulating such systems\nalong with the analytical tractability of their ground state properties\nposition Motzkin spin chains as intriguing candidates for exploring quantum\ncomputational advantage in simulating many-body physics.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ez6YG134hXWVndWvZCB1alS_aBKedDG7V4klG1JgxSI","pdfSize":"1258587"}
