{"id":"2408.08531","title":"Detecting Unsuccessful Students in Cybersecurity Exercises in Two\n  Different Learning Environments","authors":"Valdemar \\v{S}v\\'abensk\\'y, Kristi\\'an Tk\\'a\\v{c}ik, Aubrey Birdwell,\n  Richard Weiss, Ryan S. Baker, Pavel \\v{C}eleda, Jan Vykopal, Jens Mache,\n  Ankur Chattopadhyay","authorsParsed":[["Švábenský","Valdemar",""],["Tkáčik","Kristián",""],["Birdwell","Aubrey",""],["Weiss","Richard",""],["Baker","Ryan S.",""],["Čeleda","Pavel",""],["Vykopal","Jan",""],["Mache","Jens",""],["Chattopadhyay","Ankur",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 04:57:54 GMT"}],"updateDate":"2024-08-19","timestamp":1723784274000,"abstract":"  This full paper in the research track evaluates the usage of data logged from\ncybersecurity exercises in order to predict students who are potentially at\nrisk of performing poorly. Hands-on exercises are essential for learning since\nthey enable students to practice their skills. In cybersecurity, hands-on\nexercises are often complex and require knowledge of many topics. Therefore,\nstudents may miss solutions due to gaps in their knowledge and become\nfrustrated, which impedes their learning. Targeted aid by the instructor helps,\nbut since the instructor's time is limited, efficient ways to detect struggling\nstudents are needed. This paper develops automated tools to predict when a\nstudent is having difficulty. We formed a dataset with the actions of 313\nstudents from two countries and two learning environments: KYPO CRP and\nEDURange. These data are used in machine learning algorithms to predict the\nsuccess of students in exercises deployed in these environments. After\nextracting features from the data, we trained and cross-validated eight\nclassifiers for predicting the exercise outcome and evaluated their predictive\npower. The contribution of this paper is comparing two approaches to feature\nengineering, modeling, and classification performance on data from two learning\nenvironments. Using the features from either learning environment, we were able\nto detect and distinguish between successful and struggling students. A\ndecision tree classifier achieved the highest balanced accuracy and sensitivity\nwith data from both learning environments. The results show that activity data\nfrom cybersecurity exercises are suitable for predicting student success. In a\npotential application, such models can aid instructors in detecting struggling\nstudents and providing targeted help. We publish data and code for building\nthese models so that others can adopt or adapt them.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Cryptography and Security","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}