{"id":"2408.04108","title":"Mathematical modelling of the vitamin C clock reaction: a study of two\n  kinetic regimes","authors":"Aliya Alsaleh, David J. Smith and Sara Jabbari","authorsParsed":[["Alsaleh","Aliya",""],["Smith","David J.",""],["Jabbari","Sara",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 22:13:43 GMT"}],"updateDate":"2024-08-09","timestamp":1723068823000,"abstract":"  Chemically reacting systems exhibiting a repeatable delay period before a\nvisible and sudden change are referred to as clock reactions; they have a long\nhistory in education and provide an idealisation of various biochemical and\nindustrial processes. We focus on a purely substrate-depletive clock reaction\nutilising vitamin C, hydrogen peroxide, iodine and starch. Building on a recent\nstudy of a simplified two-reaction model under high hydrogen peroxide\nconcentrations, we develop a more detailed model which breaks the slow reaction\ninto two steps, one of which is rate-limiting unless hydrogen peroxide levels\nare very high. Through asymptotic analysis, this model enables the effect of\nhydrogen peroxide concentration to be elucidated in a principled way, resolving\nan apparent discrepancy with earlier literature regarding the order of the slow\nreaction kinetics. The model is analysed in moderate- and high-hydrogen\nperoxide regimes, providing approximate solutions and expressions for the\nswitchover time which take into account hydrogen peroxide concentration. The\nsolutions are validated through simultaneously fitting the same set of\nparameters to several experimental series, then testing on independent\nexperiments across widely varying hydrogen peroxide concentration. The study\nthereby presents and further develops a validated mechanistic understanding of\na paradigm chemical kinetics system.\n","subjects":["Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e9h4Cgq2sAaTR-c7-0uI3TOmM3aAYwEzS53BoSGp-j4","pdfSize":"1899989"}
