{"id":"2408.11004","title":"Cosmoglobe DR2. III. Improved modelling of zodiacal light with\n  COBE-DIRBE through global Bayesian analysis","authors":"M. San, M. Galloway, E. Gjerl{\\o}w, D. J. Watts, R. Aurlien, A.\n  Basyrov, M. Brilenkov, H. K. Eriksen, U. Fuskeland, L. T. Hergt, D. Herman,\n  H. T. Ihle, J. G. S. Lunde, S. K. N{\\ae}ss, N.-O. Stutzer, H. Thommesen, and\n  I. K. Wehus","authorsParsed":[["San","M.",""],["Galloway","M.",""],["Gjerløw","E.",""],["Watts","D. J.",""],["Aurlien","R.",""],["Basyrov","A.",""],["Brilenkov","M.",""],["Eriksen","H. K.",""],["Fuskeland","U.",""],["Hergt","L. T.",""],["Herman","D.",""],["Ihle","H. T.",""],["Lunde","J. G. S.",""],["Næss","S. K.",""],["Stutzer","N. -O.",""],["Thommesen","H.",""],["Wehus","I. K.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:57:22 GMT"}],"updateDate":"2024-08-21","timestamp":1724173042000,"abstract":"  We present an improved zodiacal light model for COBE-DIRBE derived through\nglobal Bayesian analysis within the Cosmoglobe Data Release 2 framework. The\nparametric form of the ZL model is identical to that introduced by Kelsall et\nal. (1998), but the specific best-fit parameter values are re-derived using the\ncombination of DIRBE Calibrated Individual Observations, Planck HFI sky maps,\nand WISE and Gaia compact object catalogs. Furthermore, the ZL parameters are\nfitted jointly with astrophysical parameters, such as thermal dust and\nstarlight emission, and the new model takes into account excess radiation that\nappears stationary in solar-centric coordinates as reported in a companion\npaper. The relative differences between the predicted signals from K98 and our\nnew model are $\\lesssim 5\\%$ in the 12 and 25 $\\mu$m channels over the full\nsky. The zero-levels of the cleaned DR2 maps are lower than those of the K98\nZodiacal light Subtracted Mission Average maps by $\\sim 10$ kJy/sr at 1.25-3.5\n$\\mu$m, which is larger than the entire predicted contribution from\nhigh-redshift galaxies to the Cosmic Infrared Background at the same\nwavelengths. The total RMS of each DR2 map at wavelengths up to and including\n25 $\\mu$m are $\\sim 30$ $\\%$ lower at high Galactic latitudes than the\ncorresponding DIRBE ZSMA maps. Still, obvious ZL residuals can be seen in\nseveral of the DR2 maps, and further work is required to mitigate these. Joint\nanalysis with existing and future high-resolution full-sky surveys such as\nAKARI, IRAS, Planck HFI, and SPHEREx will be essential both to break key\ndegeneracies in the current model and to determine whether the reported\nsolar-centric excess radiation has a ZL or instrumental origin. Thus, while the\nresults presented in this paper do redefine the state-of-the-art for DIRBE\nmodelling, it also only represents the first among many steps toward a future\noptimal Bayesian ZL model.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}