{"id":"2408.12788","title":"The Evolution of Protostellar Outflow Opening Angles and the\n  Implications for the Growth of Protostars","authors":"Michael M. Dunham, Ian W. Stephens, Philip C. Myers, Tyler L. Bourke,\n  H\\'ector G. Arce, Riwaj Pokhrel, Jaime E. Pineda, and Joseph Vargas","authorsParsed":[["Dunham","Michael M.",""],["Stephens","Ian W.",""],["Myers","Philip C.",""],["Bourke","Tyler L.",""],["Arce","Héctor G.",""],["Pokhrel","Riwaj",""],["Pineda","Jaime E.",""],["Vargas","Joseph",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 01:43:41 GMT"}],"updateDate":"2024-08-26","timestamp":1724377421000,"abstract":"  We use 1-4\" (300-1200 au) resolution 12CO(2-1) data from the MASSES (Mass\nAssembly of Stellar Systems and their Evolution with the SMA) project to\nmeasure the projected opening angles of 46 protostellar outflows in the Perseus\nMolecular Cloud, 37 of which are measured with sufficiently high confidence to\nuse in further analysis. We find that there is a statistically significant\ndifference in the distributions of outflow opening angles for Class 0 and Class\nI outflows, with a distinct lack of both wide-angle Class 0 outflows and highly\ncollimated Class I outflows. Synthesizing our results with several previous\nstudies, we find that outflows widen with age through the Class 0 stage but do\nnot continue to widen in the Class I stage. The maximum projected opening angle\nreached is approximately 90 degrees +/- 20 degrees, with the transition between\nwidening and remaining constant occurring near the boundary between the Class 0\nand Class I phases of evolution. While the volume fractions occupied by these\noutflows are no more than a few tens of percent of the total core volume, at\nmost, recent theoretical work suggests outflows may still be capable of playing\na central role in setting the low star formation efficiencies of 25%-50%\nobserved on core scales.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}