{"id":"2408.14788","title":"Learning from Complementary Features","authors":"Kosuke Sugiyama and Masato Uchida","authorsParsed":[["Sugiyama","Kosuke",""],["Uchida","Masato",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 05:28:52 GMT"},{"version":"v2","created":"Tue, 17 Sep 2024 08:03:38 GMT"}],"updateDate":"2024-09-18","timestamp":1724736532000,"abstract":"  While precise data observation is essential for the learning processes of\npredictive models, it can be challenging owing to factors such as insufficient\nobservation accuracy, high collection costs, and privacy constraints. In this\npaper, we examines cases where some qualitative features are unavailable as\nprecise information indicating \"what it is,\" but rather as complementary\ninformation indicating \"what it is not.\" We refer to features defined by\nprecise information as ordinary features (OFs) and those defined by\ncomplementary information as complementary features (CFs). We then formulate a\nnew learning scenario termed Complementary Feature Learning (CFL), where\npredictive models are constructed using instances consisting of OFs and CFs.\nThe simplest formalization of CFL applies conventional supervised learning\ndirectly using the observed values of CFs. However, this approach does not\nresolve the ambiguity associated with CFs, making learning challenging and\ncomplicating the interpretation of the predictive model's specific predictions.\nTherefore, we derive an objective function from an information-theoretic\nperspective to estimate the OF values corresponding to CFs and to predict\noutput labels based on these estimations. Based on this objective function, we\npropose a theoretically guaranteed graph-based estimation method along with its\npractical approximation, for estimating OF values corresponding to CFs. The\nresults of numerical experiments conducted with real-world data demonstrate\nthat our proposed method effectively estimates OF values corresponding to CFs\nand predicts output labels.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}