{"id":"2408.07958","title":"Imaging coupled vibrational, rotational, and electronic wave packet\n  dynamics in a triatomic molecule","authors":"Huynh Van Sa Lam and Van-Hung Hoang and Anbu Selvam Venkatachalam and\n  Surjendu Bhattacharyya and Keyu Chen and Sina Jacob and Sanduni Kudagama and\n  Tu Thanh Nguyen and Daniel Rolles and Uwe Thumm and Artem Rudenko and Vinod\n  Kumarappan","authorsParsed":[["Lam","Huynh Van Sa",""],["Hoang","Van-Hung",""],["Venkatachalam","Anbu Selvam",""],["Bhattacharyya","Surjendu",""],["Chen","Keyu",""],["Jacob","Sina",""],["Kudagama","Sanduni",""],["Nguyen","Tu Thanh",""],["Rolles","Daniel",""],["Thumm","Uwe",""],["Rudenko","Artem",""],["Kumarappan","Vinod",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 06:13:04 GMT"}],"updateDate":"2024-08-16","timestamp":1723702384000,"abstract":"  Molecular dynamics triggered by interaction with light often involve the\nexcitation of several electronic, vibrational, and rotational states.\nCharacterizing the resulting coupled electronic and nuclear wave packet motion\nrepresents a severe challenge, even for small polyatomic systems. In this\nLetter, we demonstrate how the interplay between vibrational, rotational, and\nelectronic degrees of freedom governs the evolution of molecular wave packets\nin the low-lying states of strong-field-ionized sulfur dioxide. Using\ntime-resolved Coulomb explosion imaging (CEI) in combination with quantum\nmechanical wave packet simulations, we directly map bending vibrations of the\nmolecule, show how the vibrational wave packet is influenced by molecular\nalignment, and elucidate the role of the coupling between the two lowest\nelectronic states of the cation. A conical intersection between these states\ncouples the bending and asymmetric stretching coordinates, which is clearly\nreflected in the correlated fragment momenta. Our results suggest that\nmulti-coincident CEI represents an efficient experimental tool for\ncharacterizing coupled electronic and nuclear motion in polyatomic molecules.\n","subjects":["Physics/Chemical Physics","Physics/Atomic and Molecular Clusters","Physics/Optics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}