{"id":"2408.12120","title":"Which Combination of Test Metrics Can Predict Success of a Software\n  Project? A Case Study in a Year-Long Project Course","authors":"Marina Filipovic and Fabian Gilson","authorsParsed":[["Filipovic","Marina",""],["Gilson","Fabian",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:23:51 GMT"}],"updateDate":"2024-08-23","timestamp":1724300631000,"abstract":"  Testing plays an important role in securing the success of a software\ndevelopment project. Prior studies have demonstrated beneficial effects of\napplying acceptance testing within a Behavioural-Driven Development method. In\nthis research, we investigate whether we can quantify the effects various types\nof testing have on functional suitability, i.e. the software conformance to\nusers' functional expectations. We explore which combination of software\ntesting (automated and manual, including acceptance testing) should be applied\nto ensure the expected functional requirements are met, as well as whether the\nlack of testing during a development iteration causes a significant increase of\neffort spent fixing the project later on. To answer those questions, we\ncollected and analysed data from a year-long software engineering project\ncourse. We combined manual observations and statistical methods, namely Linear\nMixed-Effects Modelling, to evaluate the effects of coverage metrics as well as\ntime effort on passed stories over 5 Scrum sprints. The results suggest that a\ncombination of a high code coverage for all of automated unit, acceptance, and\nmanual testing has a significant impact on functional suitability. Similarly,\nbut to a lower extent, front-end unit testing and manual testing can predict\nthe success of a software delivery when taken independently. We observed a\nclose-to-significant effect between low back-end testing and deferral (i.e.\npostponement) of user stories.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"EGu0jxxvvYje5I4xQ35mSiVDbDfAQv5bONFpgwb1j2w","pdfSize":"756639"}
