{"id":"2408.11288","title":"Applying and Evaluating Large Language Models in Mental Health Care: A\n  Scoping Review of Human-Assessed Generative Tasks","authors":"Yining Hua, Hongbin Na, Zehan Li, Fenglin Liu, Xiao Fang, David\n  Clifton, John Torous","authorsParsed":[["Hua","Yining",""],["Na","Hongbin",""],["Li","Zehan",""],["Liu","Fenglin",""],["Fang","Xiao",""],["Clifton","David",""],["Torous","John",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 02:21:59 GMT"}],"updateDate":"2024-08-22","timestamp":1724206919000,"abstract":"  Large language models (LLMs) are emerging as promising tools for mental\nhealth care, offering scalable support through their ability to generate\nhuman-like responses. However, the effectiveness of these models in clinical\nsettings remains unclear. This scoping review aimed to assess the current\ngenerative applications of LLMs in mental health care, focusing on studies\nwhere these models were tested with human participants in real-world scenarios.\nA systematic search across APA PsycNet, Scopus, PubMed, and Web of Science\nidentified 726 unique articles, of which 17 met the inclusion criteria. These\nstudies encompassed applications such as clinical assistance, counseling,\ntherapy, and emotional support. However, the evaluation methods were often\nnon-standardized, with most studies relying on ad hoc scales that limit\ncomparability and robustness. Privacy, safety, and fairness were also\nfrequently underexplored. Moreover, reliance on proprietary models, such as\nOpenAI's GPT series, raises concerns about transparency and reproducibility.\nWhile LLMs show potential in expanding mental health care access, especially in\nunderserved areas, the current evidence does not fully support their use as\nstandalone interventions. More rigorous, standardized evaluations and ethical\noversight are needed to ensure these tools can be safely and effectively\nintegrated into clinical practice.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_U8Ybc6dSsvPT6gr1QFFATyaMuV554ZuTsgIJYP_3aY","pdfSize":"620008"}
