{"id":"2408.14929","title":"Compilation of Trotter-Based Time Evolution for Partially Fault-Tolerant\n  Quantum Computing Architecture","authors":"Yutaro Akahoshi, Riki Toshio, Jun Fujisaki, Hirotaka Oshima, Shintaro\n  Sato, Keisuke Fujii","authorsParsed":[["Akahoshi","Yutaro",""],["Toshio","Riki",""],["Fujisaki","Jun",""],["Oshima","Hirotaka",""],["Sato","Shintaro",""],["Fujii","Keisuke",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:07:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724753254000,"abstract":"  Achieving practical quantum speedup with limited resources is a crucial\nchallenge in both academic and industrial communities. To address this, a\npartially fault-tolerant quantum computing architecture called ``space-time\nefficient analog rotation quantum computing architecture (STAR architecture)''\nhas been recently proposed. This architecture focuses on minimizing resource\nrequirements while maximizing the precision of non-Clifford gates, essential\nfor universal quantum computation. However, non-deterministic processes such as\nthe repeat-until-success (RUS) protocol and state injection can introduce\nsignificant computational overhead. Therefore, optimizing the logical circuit\nto minimize this overhead by using efficient fault-tolerant operations is\nessential. This paper presents an efficient method for simulating the time\nevolution of the 2D Hubbard model Hamiltonian, a promising application of the\nSTAR architecture. We present two techniques, parallel injection protocol and\nadaptive injection region updating, to reduce unnecessary time overhead\nspecific to our architecture. By integrating these with the existing fSWAP\ntechnique, we develop an efficient Trotter-based time evolution operation for\nthe 2D Hubbard model. Our analysis reveals an acceleration of over 10 times\ncompared to naive serial compilation. This optimized compilation enables us to\nestimate the computational resources required for quantum phase estimation of\nthe 2D Hubbard model. For devices with a physical error rate of $p_{\\rm phys} =\n10^{-4}$, we estimate that approximately $6.5 \\times 10^4$ physical qubits are\nrequired to achieve faster ground state energy estimation of the $8\\times8$\nHubbard model compared to classical computation.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}