{"id":"2408.15152","title":"Evaluation of Local Planner-Based Stanley Control in Autonomous RC Car\n  Racing Series","authors":"M\\'at\\'e Fazekas, Zal\\'an Demeter, J\\'anos T\\'oth, \\'Armin\n  Bog\\'ar-N\\'emeth, Gergely B\\'ari","authorsParsed":[["Fazekas","Máté",""],["Demeter","Zalán",""],["Tóth","János",""],["Bogár-Németh","Ármin",""],["Bári","Gergely",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:50:31 GMT"}],"updateDate":"2024-08-28","timestamp":1724773831000,"abstract":"  This paper proposes a control technique for autonomous RC car racing. The\npresented method does not require any map-building phase beforehand since it\noperates only local path planning on the actual LiDAR point cloud. Racing\ncontrol algorithms must have the capability to be optimized to the actual track\nlayout for minimization of lap time. In the examined one, it is guaranteed with\nthe improvement of the Stanley controller with additive control components to\nstabilize the movement in both low and high-speed ranges, and with the\nintegration of an adaptive lookahead point to induce sharp and dynamic\ncornering for traveled distance reduction. The developed method is tested on a\n1/10-sized RC car, and the tuning procedure from a base solution to the optimal\nsetting in a real F1Tenth race is presented. Furthermore, the proposed method\nis evaluated with a comparison to a more simple reactive method, and in\nparallel to a more complex optimization-based technique that involves offline\nmap building the global optimal trajectory calculation. The performance of the\nproposed method compared to the latter, referring to the lap time, is that the\nproposed one has only 8% lower average speed. This demonstrates that with\nappropriate tuning, a local planning-based method can be comparable with a more\ncomplex optimization-based one. Thus, the performance gap is lower than 10%\nfrom the state-of-the-art method. Moreover, the proposed technique has\nsignificantly higher similarity to real scenarios, therefore the results can be\ninteresting in the context of automotive industry.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}