{"id":"2408.17184","title":"Secure Ownership Management and Transfer of Consumer Internet of Things\n  Devices with Self-sovereign Identity","authors":"Nazmus Sakib, Md Yeasin Ali, Nuran Mubashshira Momo, Marzia Islam\n  Mumu, Masum Al Nahid, Fairuz Rahaman Chowdhury, Md Sadek Ferdous","authorsParsed":[["Sakib","Nazmus",""],["Ali","Md Yeasin",""],["Momo","Nuran Mubashshira",""],["Mumu","Marzia Islam",""],["Nahid","Masum Al",""],["Chowdhury","Fairuz Rahaman",""],["Ferdous","Md Sadek",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:35:09 GMT"}],"updateDate":"2024-09-02","timestamp":1725014109000,"abstract":"  The popularity of the Internet of Things (IoT) has driven its usage in our\nhomes and industries over the past 10-12 years. However, there have been some\nmajor issues related to identity management and ownership transfer involving\nIoT devices, particularly for consumer IoT devices, e. g. smart appliances such\nas smart TVs, smart refrigerators, and so on. There have been a few attempts to\naddress this issue; however, user-centric and effective ownership and identity\nmanagement of IoT devices have not been very successful so far. Recently,\nblockchain technology has been used to address these issues with limited\nsuccess. This article presents a Self-sovereign Identity (SSI) based system\nthat facilitates a secure and user-centric ownership management and transfer of\nconsumer IoT devices. The system leverages a number of emerging technologies,\nsuch as blockchain and decentralized identifiers (DID), verifiable credentials\n(VC), under the umbrella of SSI. We present the architecture of the system\nbased on a threat model and requirement analysis, discuss the implementation of\na Proof-of-Concept based on the proposed system and illustrate a number of\nuse-cases with their detailed protocol flows. Furthermore, we analyse its\nsecurity using ProVerif, a state-of-the art protocol verification tool and\nexamine its performance.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}