{"id":"2408.10050","title":"Imaging ultrafast electronic domain fluctuations with X-ray speckle\n  visibility","authors":"N. Hua, Y. Sun, P. Rao, N. Zhou Hagstr\\\"om, B.K. Stoychev, E.S. Lamb,\n  M. Madhavi, S.T. Botu, S. Jeppson, M. Cl\\'emence, A.G. McConnell, S.-W.\n  Huang, S. Zerdane, R. Mankowsky, H.T. Lemke, M. Sander, V. Esposito, P.\n  Kramer, D. Zhu, T. Sato, S. Song, E.E. Fullerton, O.G. Shpyrko, R. Kukreja,\n  and S. Gerber","authorsParsed":[["Hua","N.",""],["Sun","Y.",""],["Rao","P.",""],["Hagström","N. Zhou",""],["Stoychev","B. K.",""],["Lamb","E. S.",""],["Madhavi","M.",""],["Botu","S. T.",""],["Jeppson","S.",""],["Clémence","M.",""],["McConnell","A. G.",""],["Huang","S. -W.",""],["Zerdane","S.",""],["Mankowsky","R.",""],["Lemke","H. T.",""],["Sander","M.",""],["Esposito","V.",""],["Kramer","P.",""],["Zhu","D.",""],["Sato","T.",""],["Song","S.",""],["Fullerton","E. E.",""],["Shpyrko","O. G.",""],["Kukreja","R.",""],["Gerber","S.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:45:03 GMT"}],"updateDate":"2024-08-20","timestamp":1724078703000,"abstract":"  Speckle patterns manifesting from the interaction of coherent X-rays with\nmatter offer a glimpse into the dynamics of nanoscale domains that underpin\nmany emergent phenomena in quantum materials. While the dynamics of the average\nstructure can be followed with time-resolved X-ray diffraction, the ultrafast\nevolution of local structures in nonequilibrium conditions have thus far eluded\ndetection due to experimental limitations, such as insufficient X-ray coherent\nflux. Here we demonstrate a nonequilibrium speckle visibility experiment using\na split-and-delay setup at an X-ray free-electron laser. Photoinduced\nelectronic domain fluctuations of the magnetic model material Fe$_{3}$O$_{4}$\nreveal changes of the trimeron network configuration due to charge dynamics\nthat exhibit liquid-like fluctuations, analogous to a supercooled liquid phase.\nThis suggests that ultrafast dynamics of electronic heterogeneities under\noptical stimuli are fundamentally different from thermally-driven ones.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}