{"id":"2408.09038","title":"Multiband polarimetric imaging of HD 34700 with SCExAO/CHARIS","authors":"Minghan Chen, Kellon Lawson, Timothy D. Brandt, Briley L. Lewis,\n  Taichi Uyama, Max Millar-Blanchaer, Ryo Tazaki, Thayne Currie","authorsParsed":[["Chen","Minghan",""],["Lawson","Kellon",""],["Brandt","Timothy D.",""],["Lewis","Briley L.",""],["Uyama","Taichi",""],["Millar-Blanchaer","Max",""],["Tazaki","Ryo",""],["Currie","Thayne",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:24:23 GMT"}],"updateDate":"2024-08-20","timestamp":1723847063000,"abstract":"  We present Subaru/SCExAO + CHARIS broadband (JHK) integral field spectroscopy\nof HD 34700 A in polarized light. CHARIS has the unique ability to obtain\npolarized integral field images at 22 wavelength channels in broadband, as the\nincoming light is first split into different polarization states before passing\nthough the lenslet array. We recover the transition disk around HD 34700 A in\nmultiband polarized light in our data. We combine our polarized intensity data\nwith previous total intensity data to examine the scattering profiles,\nscattering phase functions and polarized fraction of the disk at multiple\nwavelengths. We also carry out 3D Monte Carlo radiative transfer simulations of\nthe disk using MCFOST, and make qualitative comparisons between our models and\ndata to constrain dust grain properties. We find that in addition to\nmicron-sized dust grains, a population of sub-micron grains is needed to match\nthe surface brightness in polarized light and polarized fraction. This could\nindicate the existence of a population of small grains in the disk, or it could\nbe caused by Mie theory simulations using additional small grains to compensate\nfor sub-micron structures of real dust aggregates. We find models that match\nthe polarized fraction of the data but the models do not apply strong\nconstraints on the dust grain type or compositions. We find no models that can\nmatch all observed properties of the disk. More detailed modeling using\nrealistic dust aggregates with irregular surfaces and complex structures is\nrequired to further constrain the dust properties.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}