{"id":"2408.16700","title":"GradBias: Unveiling Word Influence on Bias in Text-to-Image Generative\n  Models","authors":"Moreno D'Inc\\`a, Elia Peruzzo, Massimiliano Mancini, Xingqian Xu,\n  Humphrey Shi, Nicu Sebe","authorsParsed":[["D'Incà","Moreno",""],["Peruzzo","Elia",""],["Mancini","Massimiliano",""],["Xu","Xingqian",""],["Shi","Humphrey",""],["Sebe","Nicu",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:51:07 GMT"}],"updateDate":"2024-08-30","timestamp":1724950267000,"abstract":"  Recent progress in Text-to-Image (T2I) generative models has enabled\nhigh-quality image generation. As performance and accessibility increase, these\nmodels are gaining significant attraction and popularity: ensuring their\nfairness and safety is a priority to prevent the dissemination and perpetuation\nof biases. However, existing studies in bias detection focus on closed sets of\npredefined biases (e.g., gender, ethnicity). In this paper, we propose a\ngeneral framework to identify, quantify, and explain biases in an open set\nsetting, i.e. without requiring a predefined set. This pipeline leverages a\nLarge Language Model (LLM) to propose biases starting from a set of captions.\nNext, these captions are used by the target generative model for generating a\nset of images. Finally, Vision Question Answering (VQA) is leveraged for bias\nevaluation. We show two variations of this framework: OpenBias and GradBias.\nOpenBias detects and quantifies biases, while GradBias determines the\ncontribution of individual prompt words on biases. OpenBias effectively detects\nboth well-known and novel biases related to people, objects, and animals and\nhighly aligns with existing closed-set bias detection methods and human\njudgment. GradBias shows that neutral words can significantly influence biases\nand it outperforms several baselines, including state-of-the-art foundation\nmodels. Code available here: https://github.com/Moreno98/GradBias.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"uyz63wslLGL09uDS2mgSc8_8kgQEMvUBSgBr1yhHUHA","pdfSize":"34046445"}
