{"id":"2408.16060","title":"The Remarkable X-ray Spectra and Variability of the Ultraluminous\n  Weak-Line Quasar SDSS J1521+5202","authors":"Shouyi Wang, W. Niel Brandt, Bin Luo, Zhibo Yu, Fan Zou, Qingling Ni,\n  Fabio Vito","authorsParsed":[["Wang","Shouyi",""],["Brandt","W. Niel",""],["Luo","Bin",""],["Yu","Zhibo",""],["Zou","Fan",""],["Ni","Qingling",""],["Vito","Fabio",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:00:42 GMT"}],"updateDate":"2024-08-30","timestamp":1724868042000,"abstract":"  We present a focused X-ray and multiwavelength study of the ultraluminous\nweak-line quasar (WLQ) SDSS J1521+5202, one of the few X-ray weak WLQs that is\namenable to basic X-ray spectral and variability investigations. J1521+5202\nshows striking X-ray variability during 2006--2023, by up to a factor of\n$\\approx 32$ in 0.5--2 keV flux, and our new 2023 Chandra observation caught it\nin its brightest X-ray flux state to date. Concurrent infrared/optical\nobservations show only mild variability. The 2023 Chandra spectrum can be\nacceptably described by a power law with intrinsic X-ray absorption, and it\nreveals a nominal intrinsic level of X-ray emission relative to its\noptical/ultraviolet emission. In contrast, an earlier Chandra spectrum from\n2013 shows apparent spectral complexity that is not well fit by a variety of\nmodels, including ionized-absorption or standard Compton-reflection models.\nOverall, the observations are consistent with the thick-disk plus outflow model\npreviously advanced for WLQs, where a nominal level of underlying X-ray\nemission plus variable absorption lead to the remarkable observed X-ray\nvariability. In the case of J1521+5202 it appears likely that the outflow, and\nnot the thick disk itself, lies along our line-of-sight and causes the X-ray\nabsorption.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g2WWKSqTZohDCGlCPKRicVLVXRkZsOD1pst0Y6Vg5PI","pdfSize":"3143731"}
