{"id":"2408.12635","title":"Information and motor constraints shape melodic diversity across\n  cultures","authors":"John M McBride, Nahie Kim, Yuri Nishikawa, Mekhmed Saadakeev, Marcus T\n  Pearce, Tsvi Tlusty","authorsParsed":[["McBride","John M",""],["Kim","Nahie",""],["Nishikawa","Yuri",""],["Saadakeev","Mekhmed",""],["Pearce","Marcus T",""],["Tlusty","Tsvi",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:33:11 GMT"}],"updateDate":"2024-08-26","timestamp":1724337191000,"abstract":"  The number of possible melodies is unfathomably large, yet despite this\nvirtually unlimited potential for melodic variation, melodies from different\nsocieties can be surprisingly similar. The motor constraint hypothesis accounts\nfor certain similarities, such as scalar motion and contour shape, but not for\nother major common features, such as repetition, song length, and scale size.\nHere we investigate the role of information constraints arising from\nlimitations on human memory in shaping these hallmarks of melodies. We measure\ndeterminants of information rate in 62 corpora of Folk melodies spanning\nseveral continents, finding multiple trade-offs that all act to constrain the\ninformation rate across societies. By contrast, 39 corpora of Art music from\nEurope (including Turkey) show longer, more complex melodies, and increased\ncomplexity over time, suggesting different cultural-evolutionary selection\npressures in Art and Folk music, possibly due to the use of written versus oral\ntransmission. Our parameter-free model predicts the empirical scale degree\ndistribution using information constraints on scalar motion, melody length,\nand, most importantly, information rate. This provides strong evidence that\ninformation constraints during cultural transmission of music limit the number\nof notes in a scale, and proposes that preference for intermediate melodic\ncomplexity is a fundamental constraint on the cultural evolution of melody.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Audio and Speech Processing","Mathematics/Information Theory","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"9dN4o4BFArhgJYfE7vDrXhIO-XXjxat6_34c506WtMQ","pdfSize":"5493039"}
