{"id":"2408.14421","title":"Evaluating saliency scores in point clouds of natural environments by\n  learning surface anomalies","authors":"Reuma Arav, Dennis Wittich, Franz Rottensteiner","authorsParsed":[["Arav","Reuma",""],["Wittich","Dennis",""],["Rottensteiner","Franz",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:04:52 GMT"}],"updateDate":"2024-08-27","timestamp":1724691892000,"abstract":"  In recent years, three-dimensional point clouds are used increasingly to\ndocument natural environments. Each dataset contains a diverse set of objects,\nat varying shapes and sizes, distributed throughout the data and intricately\nintertwined with the topography. Therefore, regions of interest are difficult\nto find and consequent analyses become a challenge. Inspired from visual\nperception principles, we propose to differentiate objects of interest from the\ncluttered environment by evaluating how much they stand out from their\nsurroundings, i.e., their geometric salience. Previous saliency detection\napproaches suggested mostly handcrafted attributes for the task. However, such\nmethods fail when the data are too noisy or have high levels of texture. Here\nwe propose a learning-based mechanism that accommodates noise and textured\nsurfaces. We assume that within the natural environment any change from the\nprevalent surface would suggest a salient object. Thus, we first learn the\nunderlying surface and then search for anomalies within it. Initially, a deep\nneural network is trained to reconstruct the surface. Regions where the\nreconstructed part deviates significantly from the original point cloud yield a\nsubstantial reconstruction error, signifying an anomaly, i.e., saliency. We\ndemonstrate the effectiveness of the proposed approach by searching for salient\nfeatures in various natural scenarios, which were acquired by different\nacquisition platforms. We show the strong correlation between the\nreconstruction error and salient objects.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}