{"id":"2408.11969","title":"DrivAerML: High-Fidelity Computational Fluid Dynamics Dataset for\n  Road-Car External Aerodynamics","authors":"Neil Ashton, Charles Mockett, Marian Fuchs, and Louis Fliessbach,\n  Hendrik Hetmann, Thilo Knacke, Norbert Schonwald, Vangelis Skaperdas,\n  Grigoris Fotiadis, Astrid Walle, Burkhard Hupertz, Danielle Maddix","authorsParsed":[["Ashton","Neil",""],["Mockett","Charles",""],["Fuchs","Marian",""],["Fliessbach","Louis",""],["Hetmann","Hendrik",""],["Knacke","Thilo",""],["Schonwald","Norbert",""],["Skaperdas","Vangelis",""],["Fotiadis","Grigoris",""],["Walle","Astrid",""],["Hupertz","Burkhard",""],["Maddix","Danielle",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:47:41 GMT"}],"updateDate":"2024-08-23","timestamp":1724269661000,"abstract":"  Machine Learning (ML) has the potential to revolutionise the field of\nautomotive aerodynamics, enabling split-second flow predictions early in the\ndesign process. However, the lack of open-source training data for realistic\nroad cars, using high-fidelity CFD methods, represents a barrier to their\ndevelopment. To address this, a high-fidelity open-source (CC-BY-SA) public\ndataset for automotive aerodynamics has been generated, based on 500\nparametrically morphed variants of the widely-used DrivAer notchback generic\nvehicle. Mesh generation and scale-resolving CFD was executed using consistent\nand validated automatic workflows representative of the industrial\nstate-of-the-art. Geometries and rich aerodynamic data are published in\nopen-source formats. To our knowledge, this is the first large, public-domain\ndataset for complex automotive configurations generated using high-fidelity\nCFD.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"KX2T1lBVSx2D_IZIIMPm8XBlaON3ePUPDwO7Sh4IbOA","pdfSize":"30301094"}
