{"id":"2408.07850","title":"Cyclical period changes in cataclysmic variables: a statistical study","authors":"Leandro Souza and Raymundo Baptista","authorsParsed":[["Souza","Leandro",""],["Baptista","Raymundo",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 23:31:26 GMT"}],"updateDate":"2024-08-16","timestamp":1723678286000,"abstract":"  We report the results of a statistical study of cyclical period changes in\ncataclysmic variables (CVs). Assuming the third-body hypothesis as the cause of\nperiod changes, we estimate the third-body mass, $m_3$, and its separation from\nthe binary, $a_3$, for 21 CVs showing cyclical period changes from well-sampled\nobserved-minus-calculated diagrams covering more than a decade of observations.\nThe inferred $a_3$ values are independent of the binary orbital period,\n$P_\\mathrm{orb}$, whereas the $m_3$ values increase with $P_\\mathrm{orb}$ by an\norder of magnitude from the shortest period (oldest) to the longest period\n(youngest) systems, implying significant mass loss from the third body with\ntime. A model for the time evolution of the triple system is not able to\nsimultaneously explain the observed behavior of the $m_3(P_\\mathrm{orb})$ and\n$a_3(P_\\mathrm{orb})$ distributions because the combined mass loss from the\nbinary and the third body demands an increase in orbital separation by factors\n$\\sim 140$ as the binary evolves toward shorter $P_\\mathrm{orb}$'s, in clear\ndisagreement with the observed distribution. We conclude that the third-body\nhypothesis is statistically inconsistent and cannot be used to explain cyclical\nperiod changes observed in CVs. On the other hand, the diagram of the amplitude\nof the period change versus the CV donor-star mass is consistent both with the\nalternative hypothesis that the observed cyclical period changes are a\nconsequence of magnetic activity in the solar-type donor star, and with the\nstandard evolutionary scenario for CVs.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}