{"id":"2408.00402","title":"Changing-look Active Galactic Nuclei from the Dark Energy Spectroscopic\n  Instrument. II. Statistical Properties from the First Data Release","authors":"Wei-Jian Guo, Hu Zou, Claire L. Greenwell, David M. Alexander,\n  Victoria A. Fawcett, Zhiwei Pan, Malgorzata Siudek, Jessica Nicole Aguilar,\n  Steven Ahlen, David Brooks, Todd Claybaugh, Kyle Dawson, Axel De La Macorra,\n  Peter Doel, Andreu Font-Ribera, Enrique Gaztanaga, Satya Gontcho A Gontcho,\n  Gaston Gutierrez, Robert Kehoe, Theodore Kisner, Martin Landriau, Laurent Le\n  Guillou, Marc Manera, Aaron Meisner, Ramon Mique, John Moustakas, Francisco\n  Prada, Graziano Rossi, Eusebio Sanchez, Michael Schubnell, David Sprayberry,\n  Jipeng Sui, Gregory Tarle, Benjamin Alan Weaver, Yun-Ao Xiao, Siwei Zou","authorsParsed":[["Guo","Wei-Jian",""],["Zou","Hu",""],["Greenwell","Claire L.",""],["Alexander","David M.",""],["Fawcett","Victoria A.",""],["Pan","Zhiwei",""],["Siudek","Malgorzata",""],["Aguilar","Jessica Nicole",""],["Ahlen","Steven",""],["Brooks","David",""],["Claybaugh","Todd",""],["Dawson","Kyle",""],["De La Macorra","Axel",""],["Doel","Peter",""],["Font-Ribera","Andreu",""],["Gaztanaga","Enrique",""],["Gontcho","Satya Gontcho A",""],["Gutierrez","Gaston",""],["Kehoe","Robert",""],["Kisner","Theodore",""],["Landriau","Martin",""],["Guillou","Laurent Le",""],["Manera","Marc",""],["Meisner","Aaron",""],["Mique","Ramon",""],["Moustakas","John",""],["Prada","Francisco",""],["Rossi","Graziano",""],["Sanchez","Eusebio",""],["Schubnell","Michael",""],["Sprayberry","David",""],["Sui","Jipeng",""],["Tarle","Gregory",""],["Weaver","Benjamin Alan",""],["Xiao","Yun-Ao",""],["Zou","Siwei",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:14:37 GMT"}],"updateDate":"2024-08-02","timestamp":1722503677000,"abstract":"  We present the identification of changing-look active galactic nuclei\n(CL-AGNs) from the Dark Energy Spectroscopic Instrument First Data Release and\nSloan Digital Sky Survey Data Release 16 at z \\leq 0.9. To confirm the CL-AGNs,\nwe utilize spectral flux calibration assessment via an [O\\,{\\sc iii}]-based\ncalibration, pseudo-photometry examination, and visual inspection. This\nrigorous selection process allows us to compile a statistical catalog of 561\nCL-AGNs, encompassing 527 $\\rm H\\beta$, 149$\\rm H\\alpha$, and 129 Mg II CL\nbehaviors. In this sample, we find 1) a 283:278 ratio of turn-on to turn-off\nCL-AGNs. 2) the critical value for CL events is confirmed around Eddington\nratio \\sim 0.01. 3) a strong correlation between the change in the luminosity\nof the broad emission lines (BEL) and variation in the continuum luminosity,\nwith Mg II and $\\rm H\\beta$ displaying similar responses during CL phases. 4)\nthe Baldwin-Phillips-Terlevich diagram for CL-AGNs shows no statistically\ndifference from the general AGN catalog. 5) five CL-AGNs are associated with\nasymmetrical mid-infrared flares, possibly linked to tidal disruption events.\nGiven the large CL-AGNs and the stochastic sampling of spectra, we propose that\nsome CL events are inherently due to typical AGN variability during low\naccretion rates, particularly for CL events of the singular BEL. Finally, we\nintroduce a Peculiar CL phase, characterized by a gradual decline over decades\nin the light curve and the complete disappearance of entire BEL in faint\nspectra, indicative of a real transition in the accretion disk.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"5Ebblhhn72Wj-UcSzP0E0b06hgNvoOGNoHFzVFCvb6w","pdfSize":"3945836"}
