{"id":"2408.15945","title":"Direct measurement of surface interactions experienced by sticky\n  microcapsules made from environmentally benign materials","authors":"Hairou Yu and Christopher L. Wirth","authorsParsed":[["Yu","Hairou",""],["Wirth","Christopher L.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:04:50 GMT"}],"updateDate":"2024-08-29","timestamp":1724864690000,"abstract":"  We present a study combining experimental measurements, theoretical analysis,\nand simulations to investigate core-shell microcapsules interacting with a\nsolid boundary, with a particular focus on understanding the short-range\npotential energy well arising from the tethered force. The microcapsules,\nfabricated using a Pickering emulsion template with a cinnamon oil core and\ncalcium alginate shell, were characterized for size (5-6 microns in diameter)\nand surface charge (-20 mV). We employed total internal reflection microscopy\nand particle tracking to measure the microcapsule-boundary interactions and\ndiffusion, from which potential energy and diffusivity profiles were derived.\nThe potential energy profile was analyzed and simulated by considering\nelectrostatic, gravitational, and tethered forces, while the diffusivity was\ncompared to that of a solid particle-boundary interaction, inclusive of\nhydrodynamic forces. The diffusivity was represented as a normalized diffusion\ncoefficient to eliminate the impact of fluid viscosity. The normalized\ndiffusion coefficient of polymer-shell microcapsules (0.02) was found to be an\norder of magnitude smaller than that of solid polystyrene particles (0.2). The\nmicrocapsule sampled a potential well consisting of two distinct minima, as\nobserved experimentally and supported by analytical expressions and Brownian\ndynamics simulations. A critical tethered height (49.8 nm) and the alginate\nradius of (35.2 nm) were obtained from fitting our model to experimental data.\nThis work concludes that these benign core shell microcapsules interact with a\nnearby boundary via a transient tethering interaction, overall producing a mild\nsticky interaction that would likely be beneficial for applications in consumer\nproducts.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SRTPg5wmJy-2BQUG58w_h0Mdmis1MXaYuGUhYvNXLZY","pdfSize":"1714677"}
