{"id":"2408.02338","title":"Modeling the Plasma Composition of 67P/C-G at different Heliocentric\n  Distances","authors":"Sana Ahmed, Vikas Soni","authorsParsed":[["Ahmed","Sana",""],["Soni","Vikas",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:31:39 GMT"}],"updateDate":"2024-08-06","timestamp":1722850299000,"abstract":"  The Rosetta spacecraft accompanied the comet 67P/C-G for nearly 2 years,\ncollecting valuable data on the neutral and ion composition of the coma. The\nRosetta Plasma Consortium (RPC) provided continuous measurements of the in situ\nplasma density while ROSINA-COPS monitored the neutral composition. In this\nwork, we aim to estimate the composition of the cometary ionosphere at\ndifferent heliocentric distances of the comet. Lauter et al. (2020) derived the\ntemporal evolution of the volatile sublimation rates for 50 separated time\nintervals on the orbit of 67P/C-G using the COPS and DFMS data. We use these\nsublimation rates as inputs in a multifluid chemical-hydrodynamical model for\n36 of the time intervals for heliocentric distances < 3 au. We compare the\ntotal ion densities obtained from our models with the local plasma density\nmeasured by the RPC instruments. We find that at the location of the\nspacecraft, our modeled ion densities match with the in situ measured plasma\ndensity within factors of 1 - 3 for many of the time intervals. We obtain the\ncometocentric distance variation of the ions H2O+ and H3O+ and the ion groups\ncreated respectively by the ionization and protonation of neutral species. We\nsee that H3O+ is dominant at the spacecraft location for nearly all the time\nintervals while ions created due to protonation are dominant at low\ncometocentric distances for the intervals near perihelion. We also discuss our\nion densities in the context of their detection by DFMS.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gh_7l0Y8sPBXmHMPSPLDFrmlvfZtLMPqUunBY4Dbvyw","pdfSize":"4078527"}
