{"id":"2408.04344","title":"Semantic-Enhanced Indirect Call Analysis with Large Language Models","authors":"Baijun Cheng, Cen Zhang, Kailong Wang, Ling Shi, Yang Liu, Haoyu Wang,\n  Yao Guo, Xiangqun Chen","authorsParsed":[["Cheng","Baijun",""],["Zhang","Cen",""],["Wang","Kailong",""],["Shi","Ling",""],["Liu","Yang",""],["Wang","Haoyu",""],["Guo","Yao",""],["Chen","Xiangqun",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 10:04:50 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 06:56:47 GMT"}],"updateDate":"2024-09-10","timestamp":1723111490000,"abstract":"  In contemporary software development, the widespread use of indirect calls to\nachieve dynamic features poses challenges in constructing precise control flow\ngraphs (CFGs), which further impacts the performance of downstream static\nanalysis tasks. To tackle this issue, various types of indirect call analyzers\nhave been proposed. However, they do not fully leverage the semantic\ninformation of the program, limiting their effectiveness in real-world\nscenarios. To address these issues, this paper proposes Semantic-Enhanced\nAnalysis (SEA), a new approach to enhance the effectiveness of indirect call\nanalysis. Our fundamental insight is that for common programming practices,\nindirect calls often exhibit semantic similarity with their invoked targets.\nThis semantic alignment serves as a supportive mechanism for static analysis\ntechniques in filtering out false targets. Notably, contemporary large language\nmodels (LLMs) are trained on extensive code corpora, encompassing tasks such as\ncode summarization, making them well-suited for semantic analysis.\nSpecifically, SEA leverages LLMs to generate natural language summaries of both\nindirect calls and target functions from multiple perspectives. Through further\nanalysis of these summaries, SEA can determine their suitability as\ncaller-callee pairs. Experimental results demonstrate that SEA can\nsignificantly enhance existing static analysis methods by producing more\nprecise target sets for indirect calls.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}