{"id":"2408.12466","title":"WCEbleedGen: A wireless capsule endoscopy dataset and its benchmarking\n  for automatic bleeding classification, detection, and segmentation","authors":"Palak Handa, Manas Dhir, Amirreza Mahbod, Florian Schwarzhans, Ramona\n  Woitek, Nidhi Goel, and Deepak Gunjan","authorsParsed":[["Handa","Palak",""],["Dhir","Manas",""],["Mahbod","Amirreza",""],["Schwarzhans","Florian",""],["Woitek","Ramona",""],["Goel","Nidhi",""],["Gunjan","Deepak",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:06:50 GMT"}],"updateDate":"2024-08-23","timestamp":1724339210000,"abstract":"  Computer-based analysis of Wireless Capsule Endoscopy (WCE) is crucial.\nHowever, a medically annotated WCE dataset for training and evaluation of\nautomatic classification, detection, and segmentation of bleeding and\nnon-bleeding frames is currently lacking. The present work focused on\ndevelopment of a medically annotated WCE dataset called WCEbleedGen for\nautomatic classification, detection, and segmentation of bleeding and\nnon-bleeding frames. It comprises 2,618 WCE bleeding and non-bleeding frames\nwhich were collected from various internet resources and existing WCE datasets.\nA comprehensive benchmarking and evaluation of the developed dataset was done\nusing nine classification-based, three detection-based, and three\nsegmentation-based deep learning models. The dataset is of high-quality, is\nclass-balanced and contains single and multiple bleeding sites. Overall, our\nstandard benchmark results show that Visual Geometric Group (VGG) 19, You Only\nLook Once version 8 nano (YOLOv8n), and Link network (Linknet) performed best\nin automatic classification, detection, and segmentation-based evaluations,\nrespectively. Automatic bleeding diagnosis is crucial for WCE video\ninterpretations. This diverse dataset will aid in developing of real-time,\nmulti-task learning-based innovative solutions for automatic bleeding diagnosis\nin WCE. The dataset and code are publicly available at\nhttps://zenodo.org/records/10156571 and\nhttps://github.com/misahub2023/Benchmarking-Codes-of-the-WCEBleedGen-dataset.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"04CEeyGUMkQfUf7LE4cUxWaBx0EFbNTZzB27dlBKGxk","pdfSize":"3189311"}
