{"id":"2408.06814","title":"Structure-preserving Planar Simplification for Indoor Environments","authors":"Bishwash Khanal, Sanjay Rijal, Manish Awale and Vaghawan Ojha","authorsParsed":[["Khanal","Bishwash",""],["Rijal","Sanjay",""],["Awale","Manish",""],["Ojha","Vaghawan",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 11:10:26 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 10:32:43 GMT"}],"updateDate":"2024-08-22","timestamp":1723547426000,"abstract":"  This paper presents a novel approach for structure-preserving planar\nsimplification of indoor scene point clouds for both simulated and real-world\nenvironments. Initially, the scene point cloud undergoes preprocessing steps,\nincluding noise reduction and Manhattan world alignment, to ensure robustness\nand coherence in subsequent analyses. We segment each captured scene into\nstructured (walls-ceiling-floor) and non-structured (indoor objects) scenes.\nLeveraging a RANSAC algorithm, we extract primitive planes from the input point\ncloud, facilitating the segmentation and simplification of the structured\nscene. The best-fitting wall meshes are then generated from the primitives,\nfollowed by adjacent mesh merging with the vertex-translation algorithm which\npreserves the mesh layout. To accurately represent ceilings and floors, we\nemploy the mesh clipping algorithm which clips the ceiling and floor meshes\nwith respect to wall normals. In the case of indoor scenes, we apply a surface\nreconstruction technique to enhance the fidelity. This paper focuses on the\nintricate steps of the proposed scene simplification methodology, addressing\ncomplex scenarios such as multi-story and slanted walls and ceilings. We also\nconduct qualitative and quantitative performance comparisons against popular\nsurface reconstruction, shape approximation, and floorplan generation\napproaches.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Computational Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/"}