{"id":"2408.01347","title":"Through-Thickness Modelling of Metal Rolling using Multiple-Scale\n  Asymptotics","authors":"Mozhdeh Erfanian, Edward James Brambley, Francis Flanagan, Doireann\n  O'Kiely and Alison O'Connor","authorsParsed":[["Erfanian","Mozhdeh",""],["Brambley","Edward James",""],["Flanagan","Francis",""],["O'Kiely","Doireann",""],["O'Connor","Alison",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:53:33 GMT"}],"updateDate":"2024-08-05","timestamp":1722614013000,"abstract":"  A new semi-analytic model of the metal rolling processes is presented and\nvalidated against finite element simulations. The model generalizes the\nclassical Slab Method of cold rolling, and for the first time is able to\npredict the through-thickness stress and strain oscillations present in\nlong-aspect-ratio roll gaps. The model is based on the asymptotic Method of\nMultiple-Scales, with the systematic assumptions of a long thin roll gap and a\ncomparably small Coulomb friction coefficient. The leading-order solution\nvaries only on the long length scale of the roll gap length $\\hat{\\ell}$, and\nmatches with Slab Theory. The next-order correction varies on both the long\nlength scale and the short length scale of the workpiece thickness\n$2\\hat{h}_0$, and reveals rapid stress and strain oscillation both in the\nrolling direction and through-thickness. For this initial derivation, the model\nassumes a rigid perfectly-plastic material behaviour. Despite these strong\nassumptions, the model is shown to compare well with finite element simulations\nusing realistic elasticity and hardening material models. These assumptions\nfacilitate the simplest possible model to provide a foundational understanding\nof the complex through-thickness behaviour observed in the finite element\nsimulations, while requiring an order of only seconds to compute. Matlab code\nfor evaluating the model is provided in the supplementary material.\n","subjects":["Condensed Matter/Materials Science","Physics/Classical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i1hu-fXxOtWldUgC2wOi2fFB_KN1LNdwmGRjzmkBa4k","pdfSize":"21011367","txDigest":"H2AZk1bBUmjgjKgxsvHwqobtGLuvUp5WQAKLrDK46yaS","endEpoch":"1","status":"CERTIFIED"}
