{"id":"2408.01122","title":"CFBench: A Comprehensive Constraints-Following Benchmark for LLMs","authors":"Tao Zhang, Yanjun Shen, Wenjing Luo, Yan Zhang, Hao Liang, Tao Zhang,\n  Fan Yang, Mingan Lin, Yujing Qiao, Weipeng Chen, Bin Cui, Wentao Zhang, Zenan\n  Zhou","authorsParsed":[["Zhang","Tao",""],["Shen","Yanjun",""],["Luo","Wenjing",""],["Zhang","Yan",""],["Liang","Hao",""],["Zhang","Tao",""],["Yang","Fan",""],["Lin","Mingan",""],["Qiao","Yujing",""],["Chen","Weipeng",""],["Cui","Bin",""],["Zhang","Wentao",""],["Zhou","Zenan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:03:48 GMT"}],"updateDate":"2024-08-05","timestamp":1722589428000,"abstract":"  The adeptness of Large Language Models (LLMs) in comprehending and following\nnatural language instructions is critical for their deployment in sophisticated\nreal-world applications. Existing evaluations mainly focus on fragmented\nconstraints or narrow scenarios, but they overlook the comprehensiveness and\nauthenticity of constraints from the user's perspective. To bridge this gap, we\npropose CFBench, a large-scale Comprehensive Constraints Following Benchmark\nfor LLMs, featuring 1,000 curated samples that cover more than 200 real-life\nscenarios and over 50 NLP tasks. CFBench meticulously compiles constraints from\nreal-world instructions and constructs an innovative systematic framework for\nconstraint types, which includes 10 primary categories and over 25\nsubcategories, and ensures each constraint is seamlessly integrated within the\ninstructions. To make certain that the evaluation of LLM outputs aligns with\nuser perceptions, we propose an advanced methodology that integrates\nmulti-dimensional assessment criteria with requirement prioritization, covering\nvarious perspectives of constraints, instructions, and requirement fulfillment.\nEvaluating current leading LLMs on CFBench reveals substantial room for\nimprovement in constraints following, and we further investigate influencing\nfactors and enhancement strategies. The data and code are publicly available at\nhttps://github.com/PKU-Baichuan-MLSystemLab/CFBench\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}