{"id":"2408.03448","title":"Post-Mortem Human Iris Segmentation Analysis with Deep Learning","authors":"Afzal Hossain, Tipu Sultan, Stephanie Schuckers","authorsParsed":[["Hossain","Afzal",""],["Sultan","Tipu",""],["Schuckers","Stephanie",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 21:00:02 GMT"}],"updateDate":"2024-08-08","timestamp":1722978002000,"abstract":"  Iris recognition is widely used in several fields such as mobile phones,\nfinancial transactions, identification cards, airport security, international\nborder control, voter registration for living persons. However, the possibility\nof identifying deceased individuals based on their iris patterns has emerged\nrecently as a supplementary or alternative method valuable in forensic\nanalysis. Simultaneously, it poses numerous new technological challenges and\none of the most challenging among them is the image segmentation stage as\nconventional iris recognition approaches have struggled to reliably execute it.\nThis paper presents and compares Deep Learning (DL) models designed for\nsegmenting iris images collected from the deceased subjects, by training SegNet\nand DeepLabV3+ semantic segmentation methods where using VGG19, ResNet18,\nResNet50, MobileNetv2, Xception, or InceptionResNetv2 as backbones. In this\nstudy, our experiments demonstrate that our proposed method effectively learns\nand identifies specific deformations inherent in post-mortem samples and\nproviding a significant improvement in accuracy. By employing our novel method\nMobileNetv2 as the backbone of DeepLabV3+ and replacing the final layer with a\nhybrid loss function combining Boundary and Dice loss, we achieve Mean\nIntersection over Union of 95.54% on the Warsaw-BioBase-PostMortem-Iris-v1\ndataset. To the best of our knowledge, this study provides the most extensive\nevaluation of DL models for post-mortem iris segmentation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}