{"id":"2408.01209","title":"Origin of unexpected weak Gilbert damping in the LSMO/Pt bilayer system","authors":"Pritam Das, Pushpendra Gupta, Seung-Cheol Lee, Subhankar Bedanta, and\n  Satadeep Bhattacharjee","authorsParsed":[["Das","Pritam",""],["Gupta","Pushpendra",""],["Lee","Seung-Cheol",""],["Bedanta","Subhankar",""],["Bhattacharjee","Satadeep",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:44:24 GMT"}],"updateDate":"2024-08-05","timestamp":1722599064000,"abstract":"  We investigated the Gilbert damping in La$_{0.7}$Sr$_{0.3}$MnO$_3$ (LSMO) and\nLa$_{0.7}$Sr$_{0.3}$MnO$_3$/Pt (LSMO/Pt) heterostructures using\nfirst-principles calculations and Wannier interpolation techniques. Our work is\nmotivated by recent experimental observations showing smaller Gilbert damping\nin LSMO/Pt films compared to their reference single-layer LSMO films, despite\nexpectations of enhanced spin-pumping effects in the former. We analyze the\nelectronic structures and transport behaviors, finding that LSMO thin films\nhave a high spin Hall angle ($|{\\theta_{\\mathrm{SH}}}|$). However, in LSMO/Pt,\nthe presence of platinum significantly increases longitudinal conductivity,\nreducing $|\\theta_{\\mathrm{SH}}|$. Despite the lower $|\\theta_{\\mathrm{SH}}|$,\nLSMO/Pt shows a notable anti-damping contribution to Gilbert damping due to a\nlarger spin diffusion length. In contrast, pure LSMO films with large\n$|\\theta_{\\mathrm{SH}}|$ exhibit higher damping due to efficient spin-to-charge\nconversion via a self-induced inverse spin Hall effect (ISHE), as reported in a\nrecent experiment. Finally, this work demonstrates that by fine-tuning the\nratio of spin Hall conductivity to longitudinal charge conductivity, it is\npossible to engineer heterostructures with desired spin-to-charge or\ncharge-to-spin conversion efficiencies even with weaker spin-orbit couplings.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}