{"id":"2408.08530","title":"Predicting the genetic component of gene expression using gene\n  regulatory networks","authors":"Gutama Ibrahim Mohammad and Tom Michoel","authorsParsed":[["Mohammad","Gutama Ibrahim",""],["Michoel","Tom",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 04:57:36 GMT"}],"updateDate":"2024-08-19","timestamp":1723784256000,"abstract":"  Gene expression prediction plays a vital role in transcriptome-wide\nassociation studies (TWAS), which seek to establish associations between tissue\ngene expression and complex traits. Traditional models rely on genetic variants\nin close genomic proximity to the gene of interest to predict the genetic\ncomponent of gene expression. In this study, we propose a novel approach\nincorporating distal genetic variants acting through gene regulatory networks\n(GRNs) into gene expression prediction models, in line with the omnigenic model\nof complex trait inheritance. Using causal and coexpression GRNs reconstructed\nfrom genomic and transcriptomic data and modeling the data as a Bayesian\nnetwork jointly over genetic variants and genes, inference of gene expression\nfrom observed genotypic data is achieved through a two-step process. Initially,\nthe expression level of each gene in the network is predicted using its local\ngenetic variants. The residuals, calculated as the differences between the\nobserved and predicted expression levels, are then modeled using the genotype\ninformation of parent and/or grandparent nodes in the GRN. The final predicted\nexpression level of the gene is obtained by summing the predictions from the\nlocal variants model and the residual model, effectively incorporating both\nlocal and distal genetic influences. Using various regularized regression\ntechniques for parameter estimation, we found that GRN-based gene expression\nprediction outperformed the traditional local-variant approach on simulated\ndata from the DREAM5 Systems Genetics Challenge and real data from the Geuvadis\nstudy and an eQTL mapping study in yeast. This study provides important\ninsights into the challenge of gene expression prediction for TWAS. It\nreaffirms the importance of GRNs for understanding the genetic effects on gene\nexpression and complex traits more generally.\n","subjects":["Quantitative Biology/Molecular Networks","Quantitative Biology/Genomics","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}