{"id":"2408.16107","title":"HR-GO I: Comprehensive NLTE abundance analysis of the Cetus stream","authors":"T. M. Sitnova, Z. Yuan, T. Matsuno, L. I. Mashonkina, S. A. Alexeeva,\n  E. Holmbeck, F. Sestito, L. Lombardo, P. Banerjee, N. F. Martin, F. Jiang","authorsParsed":[["Sitnova","T. M.",""],["Yuan","Z.",""],["Matsuno","T.",""],["Mashonkina","L. I.",""],["Alexeeva","S. A.",""],["Holmbeck","E.",""],["Sestito","F.",""],["Lombardo","L.",""],["Banerjee","P.",""],["Martin","N. F.",""],["Jiang","F.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 19:31:19 GMT"}],"updateDate":"2024-08-30","timestamp":1724873479000,"abstract":"  Dwarf galaxy streams encode vast amounts of information essential to\nunderstanding early galaxy formation and nucleosynthesis channels. Due to the\nvariation in the timescales of star formation history in their progenitors,\nstellar streams serve as `snapshots' that record different stages of galactic\nchemical evolution. This study focusses on the Cetus stream, stripped from a\nlow-mass dwarf galaxy. We carried out a comprehensive analysis of the chemical\ncomposition of 22 member stars based on their high-resolution spectra. We\nderived abundances for up to 28 chemical species from C to Dy and, for 20 of\nthem, we account for the departures from local thermodynamic equilibrium. We\nconfirm that the Cetus stream has a mean metallicity of [Fe/H] = $-2.11$ $\\pm$\n0.21. All observed Cetus stars are $\\alpha$ enhanced with [$\\alpha$/Fe]\n$\\simeq$ 0.3. The absence of the $\\alpha$-`knee' implies that star formation\nstopped before iron production in type Ia supernovae (SNe Ia) became\nsubstantial. Neutron capture element abundances suggest that both the rapid\n(r-) and the main slow (s-) processes contributed to their origin. The decrease\nin [Eu/Ba] from a typical r-process value of [Eu/Ba] = 0.7 to 0.3 with\nincreasing [Ba/H] indicates a distinct contribution of the r- and s-processes\nto the chemical composition of different Cetus stars. For barium, the r-process\ncontribution varies from 100 % to 20 % in different sample stars, with an\naverage value of 50 %. Our abundance analysis indicates that the star formation\nin the Cetus progenitor ceased after the onset of the main s-process in low- to\nintermediate-mass asymptotic giant branch stars but before SNe Ia played an\nimportant role. A distinct evolution scenario is revealed by comparing the\nabundances in the Ursa Minor dwarf spheroidal galaxy, showing the diversity in\nthe chemical evolution of low-mass dwarf galaxies.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oQkF1q4sHtKzYpvr1wQH6-33jXeadzFWHmiRae7ZkZE","pdfSize":"3320456"}
