{"id":"2408.10528","title":"NoMatterXAI: Generating \"No Matter What\" Alterfactual Examples for\n  Explaining Black-Box Text Classification Models","authors":"Tuc Nguyen, James Michels, Hua Shen, Thai Le","authorsParsed":[["Nguyen","Tuc",""],["Michels","James",""],["Shen","Hua",""],["Le","Thai",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 04:06:21 GMT"}],"updateDate":"2024-08-21","timestamp":1724126781000,"abstract":"  In Explainable AI (XAI), counterfactual explanations (CEs) are a well-studied\nmethod to communicate feature relevance through contrastive reasoning of \"what\nif\" to explain AI models' predictions. However, they only focus on important\n(i.e., relevant) features and largely disregard less important (i.e.,\nirrelevant) ones. Such irrelevant features can be crucial in many applications,\nespecially when users need to ensure that an AI model's decisions are not\naffected or biased against specific attributes such as gender, race, religion,\nor political affiliation. To address this gap, the concept of alterfactual\nexplanations (AEs) has been proposed. AEs explore an alternative reality of \"no\nmatter what\", where irrelevant features are substituted with alternative\nfeatures (e.g., \"republicans\" -> \"democrats\") within the same attribute (e.g.,\n\"politics\") while maintaining a similar prediction output. This serves to\nvalidate whether AI model predictions are influenced by the specified\nattributes. Despite the promise of AEs, there is a lack of computational\napproaches to systematically generate them, particularly in the text domain,\nwhere creating AEs for AI text classifiers presents unique challenges. This\npaper addresses this challenge by formulating AE generation as an optimization\nproblem and introducing MoMatterXAI, a novel algorithm that generates AEs for\ntext classification tasks. Our approach achieves high fidelity of up to 95%\nwhile preserving context similarity of over 90% across multiple models and\ndatasets. A human study further validates the effectiveness of AEs in\nexplaining AI text classifiers to end users. All codes will be publicly\navailable.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wy4OAlsGUax102AZFHhwoDfJXgujFXTrpP8E5KcjTR0","pdfSize":"1667178"}
