{"id":"2408.17406","title":"The Cosmological CPT Theorem","authors":"Harry Goodhew, Ayngaran Thavanesan, Aron C. Wall","authorsParsed":[["Goodhew","Harry",""],["Thavanesan","Ayngaran",""],["Wall","Aron C.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:47:31 GMT"}],"updateDate":"2024-09-02","timestamp":1725036451000,"abstract":"  The CPT theorem states that a unitary and Lorentz-invariant theory must also\nbe invariant under a discrete symmetry $\\mathbf{CRT}$ which reverses charge,\ntime, and one spatial direction. In this article, we study a $\\mathbb{Z}_2\n\\times \\mathbb{Z}_2$ symmetry group, in which two of the nontrivial symmetries\n(``Reflection Reality'' and a 180 degree rotation) are implied by Unitarity and\nLorentz Invariance respectively, while the third is $\\mathbf{CRT}$. (In\ncosmology, Scale Invariance plays the role of Lorentz Invariance.) This\nnaturally leads to converses of the CPT theorem, as any two of the discrete\n$\\mathbb{Z}_2$ symmetries will imply the third one. Furthermore, in many field\ntheories, the Reflection Reality $\\mathbb{Z}_2$ symmetry is actually sufficient\nto imply the theory is fully unitary, over a generic range of couplings.\nBuilding upon previous work on the Cosmological Optical Theorem, we derive\nnon-perturbative reality conditions associated with bulk Reflection Reality (in\nall flat FLRW models) and $\\mathbf{CRT}$ (in de Sitter spacetime), in arbitrary\ndimensions. Remarkably, this $\\mathbf{CRT}$ constraint suffices to fix the\nphase of all wavefunction coefficients at future infinity (up to a real sign)\n-- without requiring any analytic continuation, or comparison to past infinity\n-- although extra care is required in cases where the bulk theory has\nlogarithmic UV or IR divergences. This result has significant implications for\nde Sitter holography, as it allows us to determine the phases of arbitrary\n$n$-point functions in the dual CFT.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}