{"id":"2408.10992","title":"Generalizing the structural phase field crystal approach for modeling\n  solid-liquid-vapor phase transformations in pure materials","authors":"Daniel L. Coelho, Duncan Burns, Emily Wilson, Nikolas Provatas","authorsParsed":[["Coelho","Daniel L.",""],["Burns","Duncan",""],["Wilson","Emily",""],["Provatas","Nikolas",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:41:07 GMT"}],"updateDate":"2024-08-21","timestamp":1724172067000,"abstract":"  In a recent class of phase field crystal (PFC) models, the density order\nparameter is coupled to powers of its mean field. This effectively introduces a\nphenomenology of higher-order direct correlation functions acting on long\nwavelengths, which is required for modelling solid-liquid-vapor systems. The\npresent work generalizes these models by incorporating, into a single-field\ntheory, higher-order direct correlations, systematically constructed in\nreciprocal space to operate across long {\\it and} short wavelengths. The\ncorrelation kernels introduced are also readily adaptable to describe distinct\ncrystal structures. We examine the three-phase equilibrium properties and phase\ndiagrams of the proposed model, and reproduce parts of the aluminum phase\ndiagram as an example of its versatile parametrization. We assess the dynamics\nof the model, showing that it allows robust control of the interface energy\nbetween the vapor and condensed phases (liquid and solid). We also examine the\ndynamics of solid-vapor interfaces over a wide range of parameters and find\nthat dynamical artifacts reported in previous PFC models do not occur in the\npresent formalism. Additionally, we demonstrate the capacity of the proposed\nformalism for computing complex microstructures and defects such as\ndislocations, grain boundaries, and voids in solid-liquid-vapor systems, all of\nwhich are expected to be crucial for investigating rapid solidification\nprocesses.\n","subjects":["Condensed Matter/Materials Science","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}