{"id":"2408.15982","title":"Thoughtseeds: Evolutionary Priors, Nested Markov Blankets, and the\n  Emergence of Embodied Cognition","authors":"Prakash Chandra Kavi, Gorka Zamora Lopez, Daniel Ari Friedman","authorsParsed":[["Kavi","Prakash Chandra",""],["Lopez","Gorka Zamora",""],["Friedman","Daniel Ari",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:51:16 GMT"}],"updateDate":"2024-08-29","timestamp":1724867476000,"abstract":"  The emergence of cognition requires a framework that bridges evolutionary\nprinciples with neurocomputational mechanisms. This paper introduces the\n\"thoughtseed\" framework, proposing that cognition arises from the dynamic\ninteraction of self-organizing units of embodied knowledge called\n\"thoughtseeds.\" We leverage evolutionary theory, \"neuronal packets,\" and the\n\"Inner Screen\" hypothesis within Free Energy Principle, and propose a\nfour-level hierarchical model of the cognitive agent's internal states:\nNeuronal Packet Domains (NPDs), Knowledge Domains (KDs), thoughtseeds network,\nand meta-cognition. The dynamic interplay within this hierarchy, mediated by\nnested Markov blankets and reciprocal message passing, facilitates the\nemergence of thoughtseeds as coherent patterns of activity that guide\nperception, action, and learning. The framework further explores the role of\nthe organism's Umwelt and the principles of active inference, especially the\ngenerative model at each nested level, in shaping the selection and activation\nof thoughtseeds, leading to adaptive behavior through surprise minimization.\nThe \"Inner Screen\" is posited as the locus of conscious experience, where the\ncontent of the dominant thoughtseed is projected, maintaining a unitary\nconscious experience. Active thoughtseeds are proposed as the fundamental units\nof thought that contribute to the \"content of consciousness.\" We present a\nmathematical framework grounded in active inference and dynamical systems\ntheory. The thoughtseed framework represents an initial but promising step\ntowards a novel, biologically-grounded model for understanding the organizing\nprinciples and emergence of embodied cognition, offering a unified account of\ncognitive phenomena, from basic physiological regulation to higher-order\nthought processes, and potentially bridge neuroscience and contemplative\ntraditions.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}