{"id":"2408.01430","title":"SUSTechGAN: Image Generation for Object Recognition in Adverse\n  Conditions of Autonomous Driving","authors":"Gongjin Lan, Yang Peng, Qi Hao, Chengzhong Xu","authorsParsed":[["Lan","Gongjin",""],["Peng","Yang",""],["Hao","Qi",""],["Xu","Chengzhong",""]],"versions":[{"version":"v1","created":"Thu, 18 Jul 2024 15:32:25 GMT"}],"updateDate":"2024-08-06","timestamp":1721316745000,"abstract":"  Autonomous driving significantly benefits from data-driven deep neural\nnetworks. However, the data in autonomous driving typically fits the\nlong-tailed distribution, in which the critical driving data in adverse\nconditions is hard to collect. Although generative adversarial networks (GANs)\nhave been applied to augment data for autonomous driving, generating driving\nimages in adverse conditions is still challenging. In this work, we propose a\nnovel SUSTechGAN with dual attention modules and multi-scale generators to\ngenerate driving images for improving object recognition of autonomous driving\nin adverse conditions. We test the SUSTechGAN and the existing well-known GANs\nto generate driving images in adverse conditions of rain and night and apply\nthe generated images to retrain object recognition networks. Specifically, we\nadd generated images into the training datasets to retrain the well-known\nYOLOv5 and evaluate the improvement of the retrained YOLOv5 for object\nrecognition in adverse conditions. The experimental results show that the\ngenerated driving images by our SUSTechGAN significantly improved the\nperformance of retrained YOLOv5 in rain and night conditions, which outperforms\nthe well-known GANs. The open-source code, video description and datasets are\navailable on the page 1 to facilitate image generation development in\nautonomous driving under adverse conditions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hzMXn445pTHuyUciidHMgMFPsBmlc7BpSnMGtdMwAYE","pdfSize":"12013954"}
