{"id":"2408.01117","title":"Reduced-Rank Estimation for Ill-Conditioned Stochastic Linear Model with\n  High Signal-to-Noise Ratio","authors":"Tomasz Piotrowski and Isao Yamada","authorsParsed":[["Piotrowski","Tomasz",""],["Yamada","Isao",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:54:22 GMT"}],"updateDate":"2024-08-05","timestamp":1722588862000,"abstract":"  Reduced-rank approach has been used for decades in robust linear estimation\nof both deterministic and random vector of parameters in linear model\ny=Hx+\\sqrt{epsilon}n. In practical settings, estimation is frequently performed\nunder incomplete or inexact model knowledge, which in the stochastic case\nsignificantly increases mean-square-error (MSE) of an estimate obtained by the\nlinear minimum mean-square-error (MMSE) estimator, which is MSE-optimal among\nlinear estimators in the theoretical case of perfect model knowledge. However,\nthe improved performance of reduced-rank estimators over MMSE estimator in\nestimation under incomplete or inexact model knowledge has been established to\ndate only by means of numerical simulations and arguments indicating that the\nreduced-rank approach may provide improved performance over MMSE estimator in\ncertain settings. In this paper we focus on the high signal-to-noise ratio\n(SNR) case, which has not been previously considered as a natural area of\napplication of reduced-rank estimators. We first show explicit sufficient\nconditions under which familiar reduced-rank MMSE and truncated SVD estimators\nachieve lower MSE than MMSE estimator if singular values of array response\nmatrix H are perturbed. We then extend these results to the case of a generic\nperturbation of array response matrix H, and demonstrate why MMSE estimator\nfrequently attains higher MSE than reduced-rank MMSE and truncated SVD\nestimators if H is ill-conditioned. The main results of this paper are verified\nin numerical simulations.\n","subjects":["Mathematics/Optimization and Control","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"mR3sYkGG7x0b-jUa_esaqsidfttSM_1-d48V7RxiCls","pdfSize":"937028"}
