{"id":"2408.17370","title":"Optical variability of Gaia CRF3 sources with robust statistics and the\n  5000 most variable quasars","authors":"Valeri V. Makarov","authorsParsed":[["Makarov","Valeri V.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:02:04 GMT"}],"updateDate":"2024-09-02","timestamp":1725033724000,"abstract":"  Using the light curve time series data for more than 11.7 million variable\nsources published in the Gaia Data Release 3, the average magnitudes, colors,\nand variability parameters have been computed for 0.836 million Gaia CRF\nobjects, which are mostly quasars and active galactic nuclei (AGNs). To\nmitigate the effects of occasional flukes in the data, robust statistical\nmeasures have been employed, namely, the median, median absolute deviation, and\nSpearman correlation. We find that the majority of the CRF sources have\nmoderate amplitudes of variability in the Gaia $G$ band just below 0.1 mag. The\nheavy-tailed distribution of variability amplitudes (quantified as robust\nstandard deviations) does not find a single analytical form, but is closer to\nMaxwell distribution with a scale of 0.078 mag. The majority of CRF sources\nhave positive correlations between $G$ magnitude and $G_{\\rm BP}-G_{\\rm RP}$\ncolors, meaning that these quasars and AGNs become bluer when they are\nbrighter. The variations in the BP and RP bands are also mostly positively\ncorrelated. Dependencies of all variability parameters with cosmological\nredshift are fairly flat for the more accurate estimates above redshift 0.7,\nwhile the median color shows strong systematic variations with redshift. Using\na robust normalized score of magnitude deviations, a sample of 5000 most\nvariable quasars is selected and published. The intersection of this sample\nwith the ICRF3 catalog shows a much higher rate of strongly variable quasars\n(mostly, blazars) in ICRF3.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}