{"id":"2408.11451","title":"Bidirectional Gated Mamba for Sequential Recommendation","authors":"Ziwei Liu, Qidong Liu, Yejing Wang, Wanyu Wang, Pengyue Jia, Maolin\n  Wang, Zitao Liu, Yi Chang, Xiangyu Zhao","authorsParsed":[["Liu","Ziwei",""],["Liu","Qidong",""],["Wang","Yejing",""],["Wang","Wanyu",""],["Jia","Pengyue",""],["Wang","Maolin",""],["Liu","Zitao",""],["Chang","Yi",""],["Zhao","Xiangyu",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:12:59 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 01:56:29 GMT"}],"updateDate":"2024-08-26","timestamp":1724231579000,"abstract":"  In various domains, Sequential Recommender Systems (SRS) have become\nessential due to their superior capability to discern intricate user\npreferences. Typically, SRS utilize transformer-based architectures to forecast\nthe subsequent item within a sequence. Nevertheless, the quadratic\ncomputational complexity inherent in these models often leads to\ninefficiencies, hindering the achievement of real-time recommendations. Mamba,\na recent advancement, has exhibited exceptional performance in time series\nprediction, significantly enhancing both efficiency and accuracy. However,\nintegrating Mamba directly into SRS poses several challenges. Its inherently\nunidirectional nature may constrain the model's capacity to capture the full\ncontext of user-item interactions, while its instability in state estimation\ncan compromise its ability to detect short-term patterns within interaction\nsequences.\n  To overcome these issues, we introduce a new framework named Selective Gated\nMamba (SIGMA) for Sequential Recommendation. This framework leverages a\nPartially Flipped Mamba (PF-Mamba) to construct a bidirectional architecture\nspecifically tailored to improve contextual modeling. Additionally, an\ninput-sensitive Dense Selective Gate (DS Gate) is employed to optimize\ndirectional weights and enhance the processing of sequential information in\nPF-Mamba. For short sequence modeling, we have also developed a Feature Extract\nGRU (FE-GRU) to efficiently capture short-term dependencies. Empirical results\nindicate that SIGMA outperforms current models on five real-world datasets. Our\nimplementation code is available at https://github.com/ziwliu-cityu/SIMGA to\nease reproducibility.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}