{"id":"2408.10128","title":"Advancing Voice Cloning for Nepali: Leveraging Transfer Learning in a\n  Low-Resource Language","authors":"Manjil Karki, Pratik Shakya, Sandesh Acharya, Ravi Pandit, Dinesh\n  Gothe","authorsParsed":[["Karki","Manjil",""],["Shakya","Pratik",""],["Acharya","Sandesh",""],["Pandit","Ravi",""],["Gothe","Dinesh",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 16:15:09 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 16:15:30 GMT"}],"updateDate":"2024-08-26","timestamp":1724084109000,"abstract":"  Voice cloning is a prominent feature in personalized speech interfaces. A\nneural vocal cloning system can mimic someone's voice using just a few audio\nsamples. Both speaker encoding and speaker adaptation are topics of research in\nthe field of voice cloning. Speaker adaptation relies on fine-tuning a\nmulti-speaker generative model, which involves training a separate model to\ninfer a new speaker embedding used for speaker encoding. Both methods can\nachieve excellent performance, even with a small number of cloning audios, in\nterms of the speech's naturalness and similarity to the original speaker.\nSpeaker encoding approaches are more appropriate for low-resource deployment\nsince they require significantly less memory and have a faster cloning time\nthan speaker adaption, which can offer slightly greater naturalness and\nsimilarity. The main goal is to create a vocal cloning system that produces\naudio output with a Nepali accent or that sounds like Nepali. For the further\nadvancement of TTS, the idea of transfer learning was effectively used to\naddress several issues that were encountered in the development of this system,\nincluding the poor audio quality and the lack of available data.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}