{"id":"2408.12919","title":"Beam focusing and consequences for Doppler Backscattering measurements","authors":"Juan Ruiz Ruiz, Felix I. Parra, Valerian H. Hall-Chen, Nathan\n  Belrhali, Carine Giroud, Jon C. Hillesheim, Nicolas A. Lopez and JET\n  contributors","authorsParsed":[["Ruiz","Juan Ruiz",""],["Parra","Felix I.",""],["Hall-Chen","Valerian H.",""],["Belrhali","Nathan",""],["Giroud","Carine",""],["Hillesheim","Jon C.",""],["Lopez","Nicolas A.",""],["contributors","JET",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:51:33 GMT"}],"updateDate":"2024-08-26","timestamp":1724403093000,"abstract":"  The phenomenon of beam focusing of microwaves in a plasma near a\nturning-point caustic is discussed in the context of the analytical solution to\nthe Gaussian beam-tracing equations in the 2D linear-layer problem. The\nlocation of maximum beam focusing and the beam width at that location are\nstudied in terms of the beam initial conditions. The analytic solution is used\nto study the effect of this focusing on Doppler backscattering (DBS). We find\nthat the filter function that characterises the scattering intensity\ncontributions along the beam path through the plasma is inversely proportional\nto the beam width, predicting enhanced scattering contributions from the beam\nfocusing region. We show that the DBS signal enhancement for small incident\nangles between the beam path and the density gradient is due to beam focusing\nand not due to forward scattering. The analytic beam model is used to predict\nthe measurement of the $k_y$ density-fluctuation wavenumber power spectrum via\nDBS, showing that the spectral exponent of the turbulent, intermediate-to-high\n$k_y$ density-fluctuation spectrum might be quantitatively measurable via DBS,\nbut not the spectral peak corresponding to the driving scale of the turbulent\ncascade.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mKQEW_H82C2h_L0NCxMaKoXyQiyivPFs3Gbc7w3_jsc","pdfSize":"5679142"}
