{"id":"2408.08575","title":"Tell Codec What Worth Compressing: Semantically Disentangled Image\n  Coding for Machine with LMMs","authors":"Jinming Liu, Yuntao Wei, Junyan Lin, Shengyang Zhao, Heming Sun, Zhibo\n  Chen, Wenjun Zeng, Xin Jin","authorsParsed":[["Liu","Jinming",""],["Wei","Yuntao",""],["Lin","Junyan",""],["Zhao","Shengyang",""],["Sun","Heming",""],["Chen","Zhibo",""],["Zeng","Wenjun",""],["Jin","Xin",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 07:23:18 GMT"}],"updateDate":"2024-08-19","timestamp":1723792998000,"abstract":"  We present a new image compression paradigm to achieve ``intelligently coding\nfor machine'' by cleverly leveraging the common sense of Large Multimodal\nModels (LMMs). We are motivated by the evidence that large language/multimodal\nmodels are powerful general-purpose semantics predictors for understanding the\nreal world. Different from traditional image compression typically optimized\nfor human eyes, the image coding for machines (ICM) framework we focus on\nrequires the compressed bitstream to more comply with different downstream\nintelligent analysis tasks. To this end, we employ LMM to \\textcolor{red}{tell\ncodec what to compress}: 1) first utilize the powerful semantic understanding\ncapability of LMMs w.r.t object grounding, identification, and importance\nranking via prompts, to disentangle image content before compression, 2) and\nthen based on these semantic priors we accordingly encode and transmit objects\nof the image in order with a structured bitstream. In this way, diverse vision\nbenchmarks including image classification, object detection, instance\nsegmentation, etc., can be well supported with such a semantically structured\nbitstream. We dub our method ``\\textit{SDComp}'' for ``\\textit{S}emantically\n\\textit{D}isentangled \\textit{Comp}ression'', and compare it with\nstate-of-the-art codecs on a wide variety of different vision tasks. SDComp\ncodec leads to more flexible reconstruction results, promised decoded visual\nquality, and a more generic/satisfactory intelligent task-supporting ability.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}