{"id":"2408.12896","title":"Identifying band structure changes of FePS3 across the antiferromagnetic\n  phase transition","authors":"Benjamin Pestka, Jeff Strasdas, Gustav Bihlmayer, Adam K. Budniak,\n  Marcus Liebmann, Niklas Leuth, Honey Boban, Vitaliy Feyer, Iulia Cojocariu,\n  Daniel Baranowski, Simone Mearini, Yaron Amouyal, Lutz Waldecker, Bernd\n  Beschoten, Christoph Stampfer, Lukasz Plucinski, Efrat Lifshitz, Peter\n  Kratzer and Markus Morgenstern","authorsParsed":[["Pestka","Benjamin",""],["Strasdas","Jeff",""],["Bihlmayer","Gustav",""],["Budniak","Adam K.",""],["Liebmann","Marcus",""],["Leuth","Niklas",""],["Boban","Honey",""],["Feyer","Vitaliy",""],["Cojocariu","Iulia",""],["Baranowski","Daniel",""],["Mearini","Simone",""],["Amouyal","Yaron",""],["Waldecker","Lutz",""],["Beschoten","Bernd",""],["Stampfer","Christoph",""],["Plucinski","Lukasz",""],["Lifshitz","Efrat",""],["Kratzer","Peter",""],["Morgenstern","Markus",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 08:02:17 GMT"}],"updateDate":"2024-08-26","timestamp":1724400137000,"abstract":"  Magnetic 2D materials enable novel tuning options of magnetism. As an\nexample, the van der Waals material FePS3, a zigzag-type intralayer\nantiferromagnet, exhibits very strong magnetoelastic coupling due to the\ndifferent bond lengths along different ferromagnetic and antiferromagnetic\ncoupling directions enabling elastic tuning of magnetic properties. The likely\ncause of the length change is the intricate competition between direct exchange\nof the Fe atoms and superexchange via the S and P atoms. To elucidate this\ninterplay, we study the band structure of exfoliated FePS3 by mu m scale ARPES\n(Angular Resolved Photoelectron Spectroscopy), both, above and, for the first\ntime, below the Neel temperature TN. We find three characteristic changes\nacross TN. They involve S 3p-type bands, Fe 3d-type bands and P 3p-type bands,\nrespectively, as attributed by comparison with density functional theory\ncalculations (DFT+U). This highlights the involvement of all the atoms in the\nmagnetic phase transition providing independent evidence for the intricate\nexchange paths.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}