{"id":"2408.07298","title":"Improving the use of social contact studies in epidemic modelling","authors":"Tom Britton and Frank Ball","authorsParsed":[["Britton","Tom",""],["Ball","Frank",""]],"versions":[{"version":"v1","created":"Tue, 30 Jul 2024 19:38:14 GMT"}],"updateDate":"2024-08-15","timestamp":1722368294000,"abstract":"  Social contact studies, investigating social contact patterns in a population\nsample, have been an important contribution for epidemic models to better fit\nreal life epidemics. A contact matrix $M$, having the \\emph{mean} number of\ncontacts between individuals of different age groups as its elements, is\nestimated and used in combination with a multitype epidemic model to produce\nbetter data fitting and also giving more appropriate expressions for $R_0$ and\nother model outcomes. However, $M$ does not capture \\emph{variation} in\ncontacts \\emph{within} each age group, which is often large in empirical\nsettings. Here such variation within age groups is included in a simple way by\ndividing each age group into two halves: the socially active and the socially\nless active. The extended contact matrix, and its associated epidemic model,\nempirically show that acknowledging variation in social activity within age\ngroups has a substantial impact on modelling outcomes such as $R_0$ and the\nfinal fraction $\\tau$ getting infected. In fact, the variation in social\nactivity within age groups is often more important for data fitting than the\ndivision into different age groups itself. However, a difficulty with\nheterogeneity in social activity is that social contact studies typically lack\ninformation on if mixing with respect to social activity is assortative or not,\ni.e.\\ do socially active tend to mix more with other socially active or more\nwith socially less active? The analyses show that accounting for heterogeneity\nin social activity improves the analyses irrespective of if such mixing is\nassortative or not, but the different assumptions gives rather different\noutput. Future social contact studies should hence also try to infer the degree\nof assortativity of contacts with respect to social activity.\n","subjects":["Quantitative Biology/Populations and Evolution","Physics/Physics and Society","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"Fy92zk38YQnPN9QSX5P9vmTGuHs9worHTpYrF1NP-W0","pdfSize":"702807"}
