{"id":"2408.11338","title":"Automatic Dataset Construction (ADC): Sample Collection, Data Curation,\n  and Beyond","authors":"Minghao Liu, Zonglin Di, Jiaheng Wei, Zhongruo Wang, Hengxiang Zhang,\n  Ruixuan Xiao, Haoyu Wang, Jinlong Pang, Hao Chen, Ankit Shah, Hongxin Wei,\n  Xinlei He, Zhaowei Zhao, Haobo Wang, Lei Feng, Jindong Wang, James Davis,\n  Yang Liu","authorsParsed":[["Liu","Minghao",""],["Di","Zonglin",""],["Wei","Jiaheng",""],["Wang","Zhongruo",""],["Zhang","Hengxiang",""],["Xiao","Ruixuan",""],["Wang","Haoyu",""],["Pang","Jinlong",""],["Chen","Hao",""],["Shah","Ankit",""],["Wei","Hongxin",""],["He","Xinlei",""],["Zhao","Zhaowei",""],["Wang","Haobo",""],["Feng","Lei",""],["Wang","Jindong",""],["Davis","James",""],["Liu","Yang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:45:12 GMT"}],"updateDate":"2024-08-22","timestamp":1724215512000,"abstract":"  Large-scale data collection is essential for developing personalized training\ndata, mitigating the shortage of training data, and fine-tuning specialized\nmodels. However, creating high-quality datasets quickly and accurately remains\na challenge due to annotation errors, the substantial time and costs associated\nwith human labor. To address these issues, we propose Automatic Dataset\nConstruction (ADC), an innovative methodology that automates dataset creation\nwith negligible cost and high efficiency. Taking the image classification task\nas a starting point, ADC leverages LLMs for the detailed class design and code\ngeneration to collect relevant samples via search engines, significantly\nreducing the need for manual annotation and speeding up the data generation\nprocess. Despite these advantages, ADC also encounters real-world challenges\nsuch as label errors (label noise) and imbalanced data distributions (label\nbias). We provide open-source software that incorporates existing methods for\nlabel error detection, robust learning under noisy and biased data, ensuring a\nhigher-quality training data and more robust model training procedure.\nFurthermore, we design three benchmark datasets focused on label noise\ndetection, label noise learning, and class-imbalanced learning. These datasets\nare vital because there are few existing datasets specifically for label noise\ndetection, despite its importance. Finally, we evaluate the performance of\nexisting popular methods on these datasets, thereby facilitating further\nresearch in the field.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XFjvVsHo2C281AmbkrhivtvCsBhJmmSYI6_UPvVgjI0","pdfSize":"15418523"}
