{"id":"2408.08650","title":"An End-to-End Model for Photo-Sharing Multi-modal Dialogue Generation","authors":"Peiming Guo, Sinuo Liu, Yanzhao Zhang, Dingkun Long, Pengjun Xie,\n  Meishan Zhang, Min Zhang","authorsParsed":[["Guo","Peiming",""],["Liu","Sinuo",""],["Zhang","Yanzhao",""],["Long","Dingkun",""],["Xie","Pengjun",""],["Zhang","Meishan",""],["Zhang","Min",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 10:33:19 GMT"}],"updateDate":"2024-08-19","timestamp":1723804399000,"abstract":"  Photo-Sharing Multi-modal dialogue generation requires a dialogue agent not\nonly to generate text responses but also to share photos at the proper moment.\nUsing image text caption as the bridge, a pipeline model integrates an image\ncaption model, a text generation model, and an image generation model to handle\nthis complex multi-modal task. However, representing the images with text\ncaptions may loss important visual details and information and cause error\npropagation in the complex dialogue system. Besides, the pipeline model\nisolates the three models separately because discrete image text captions\nhinder end-to-end gradient propagation. We propose the first end-to-end model\nfor photo-sharing multi-modal dialogue generation, which integrates an image\nperceptron and an image generator with a large language model. The large\nlanguage model employs the Q-Former to perceive visual images in the input end.\nFor image generation in the output end, we propose a dynamic vocabulary\ntransformation matrix and use straight-through and gumbel-softmax techniques to\nalign the large language model and stable diffusion model and achieve\nend-to-end gradient propagation. We perform experiments on PhotoChat and\nDialogCC datasets to evaluate our end-to-end model. Compared with pipeline\nmodels, the end-to-end model gains state-of-the-art performances on various\nmetrics of text and image generation. More analysis experiments also verify the\neffectiveness of the end-to-end model for photo-sharing multi-modal dialogue\ngeneration.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}