{"id":"2408.12597","title":"Very Extended Ionized Gas Discovered around NGC 1068 with the\n  Circumgalactic H$\\alpha$ Spectrograph","authors":"Nicole Melso, David Schiminovich, Meghna Sitaram, Ignacio\n  Cevallos-Aleman, B\\'arbara Cruvinel Santiago, Brian Smiley, and Hwei Ru Ong","authorsParsed":[["Melso","Nicole",""],["Schiminovich","David",""],["Sitaram","Meghna",""],["Cevallos-Aleman","Ignacio",""],["Santiago","Bárbara Cruvinel",""],["Smiley","Brian",""],["Ong","Hwei Ru",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:58:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724349496000,"abstract":"  We have performed wide-field, ultra-low surface brightness H$\\alpha$ emission\nline mapping around NGC 1068 with the newly commissioned Circumgalactic\nH$\\alpha$ Spectrograph (\\chas). NGC 1068 is notable for its active galactic\nnucleus, which globally ionizes gas in the disk and halo. Line-emitting diffuse\nionized gas is distributed throughout the galactic disk and large-scale ionized\nfilaments are found well beyond the disk, aligned with the cone angle of the\ncentral jet. We report the discovery of a new Ribbon of ionized gas around NGC\n1068 beyond even the known outer filamentary structure, located 20 kpc from the\ngalaxy. The H$\\alpha$ surface brightness of this Ribbon is on the order of the\nbright Telluric lines, ranging from $[4-16]$ R with fainter regions on the\norder of the sky background continuum. Unlike previous extended emission, the\nRibbon is not as well aligned with the current axis of the central jet. It is\nnot associated with any galactic structure or known tidal features in the halo\nof NGC 1068, though it may originate from a larger distribution of unmapped\nneutral atomic or molecular gas in the halo. The morphology of the Ribbon\nemission in H$\\alpha$ is correlated with extended UV emission around NGC 1068.\nH$\\alpha$ to UV flux ratios in the Ribbon are comparable to extended emission\nline ratios in the halos of NGC 5128, NGC 253, and M82. The H$\\alpha$ excess in\nthe Ribbon gas suggests ionization by slow-shocks or a mixture of in-situ star\nformation and photoionization and collisional ionization processes.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Zwyx6iVsOB8v91AL90revSoSFwEO-ahohfNbaFcxwbU","pdfSize":"7593734"}
