{"id":"2408.16146","title":"Signatures of a Spin-Active Interface and Locally Enhanced Zeeman field\n  in a Superconductor-Chiral Material Heterostructure","authors":"Cliff Chen, Jason Tran, Anthony McFadden, Raymond Simmonds, Keisuke\n  Saito, En-De Chu, Daniel Morales, Varrick Suezaki, Yasen Hou, Joe Aumentado,\n  Patrick A. Lee, Jagadeesh S. Moodera and Peng Wei","authorsParsed":[["Chen","Cliff",""],["Tran","Jason",""],["McFadden","Anthony",""],["Simmonds","Raymond",""],["Saito","Keisuke",""],["Chu","En-De",""],["Morales","Daniel",""],["Suezaki","Varrick",""],["Hou","Yasen",""],["Aumentado","Joe",""],["Lee","Patrick A.",""],["Moodera","Jagadeesh S.",""],["Wei","Peng",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 21:28:11 GMT"}],"updateDate":"2024-08-30","timestamp":1724880491000,"abstract":"  A localized Zeeman field, intensified at heterostructure interfaces, could\nplay a crucial role in a broad area including spintronics and unconventional\nsuperconductors. Conventionally, the generation of a local Zeeman field is\nachieved through magnetic exchange coupling with a magnetic material. However,\nmagnetic elements often introduce defects, which could weaken or destroy\nsuperconductivity. Alternatively, the coupling between a superconductor with\nstrong spin-orbit coupling and a non-magnetic chiral material could serve as a\npromising approach to generate a spin active interface. In this study, we\nleverage an interface superconductor, namely induced superconductivity in noble\nmetal surface states, to probe the spin active interface. Our results unveil an\nenhanced interface Zeeman field, which selectively closes the surface\nsuperconducting gap while preserving the bulk superconducting pairing. The\nchiral material, i.e. trigonal tellurium, also induces Andreev bound states\n(ABS) exhibiting spin polarization. The field dependence of ABS manifests a\nsubstantially enhanced interface Land\\'e g-factor (g_eff ~ 12), thereby\ncorroborating the enhanced interface Zeeman energy.\n","subjects":["Condensed Matter/Superconductivity","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iHjtk0lT9FGDGWXyfR9WYKREWW0YB7zPZTYb0QRCreE","pdfSize":"1369961"}
