{"id":"2408.06772","title":"Exploring Domain Shift on Radar-Based 3D Object Detection Amidst Diverse\n  Environmental Conditions","authors":"Miao Zhang, Sherif Abdulatif, Benedikt Loesch, Marco Altmann, Marius\n  Schwarz and Bin Yang","authorsParsed":[["Zhang","Miao",""],["Abdulatif","Sherif",""],["Loesch","Benedikt",""],["Altmann","Marco",""],["Schwarz","Marius",""],["Yang","Bin",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:55:38 GMT"}],"updateDate":"2024-08-14","timestamp":1723542938000,"abstract":"  The rapid evolution of deep learning and its integration with autonomous\ndriving systems have led to substantial advancements in 3D perception using\nmultimodal sensors. Notably, radar sensors show greater robustness compared to\ncameras and lidar under adverse weather and varying illumination conditions.\nThis study delves into the often-overlooked yet crucial issue of domain shift\nin 4D radar-based object detection, examining how varying environmental\nconditions, such as different weather patterns and road types, impact 3D object\ndetection performance. Our findings highlight distinct domain shifts across\nvarious weather scenarios, revealing unique dataset sensitivities that\nunderscore the critical role of radar point cloud generation. Additionally, we\ndemonstrate that transitioning between different road types, especially from\nhighways to urban settings, introduces notable domain shifts, emphasizing the\nnecessity for diverse data collection across varied road environments. To the\nbest of our knowledge, this is the first comprehensive analysis of domain shift\neffects on 4D radar-based object detection. We believe this empirical study\ncontributes to understanding the complex nature of domain shifts in radar data\nand suggests paths forward for data collection strategy in the face of\nenvironmental variability.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}