{"id":"2408.07237","title":"Neural embedding of beliefs reveals the role of relative dissonance in\n  human decision-making","authors":"Byunghwee Lee, Rachith Aiyappa, Yong-Yeol Ahn, Haewoon Kwak, Jisun An","authorsParsed":[["Lee","Byunghwee",""],["Aiyappa","Rachith",""],["Ahn","Yong-Yeol",""],["Kwak","Haewoon",""],["An","Jisun",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 23:58:45 GMT"}],"updateDate":"2024-08-15","timestamp":1723593525000,"abstract":"  Beliefs serve as the foundation for human cognition and decision-making. They\nguide individuals in deriving meaning from their lives, shaping their\nbehaviors, and forming social connections. Therefore, a model that encapsulates\nbeliefs and their interrelationships is crucial for quantitatively studying the\ninfluence of beliefs on our actions. Despite its importance, research on the\ninterplay between human beliefs has often been limited to a small set of\nbeliefs pertaining to specific issues, with a heavy reliance on surveys or\nexperiments. Here, we propose a method for extracting nuanced relations between\nthousands of beliefs by leveraging large-scale user participation data from an\nonline debate platform and mapping these beliefs to an embedding space using a\nfine-tuned large language model (LLM). This belief embedding space effectively\nencapsulates the interconnectedness of diverse beliefs as well as polarization\nacross various social issues. We discover that the positions within this belief\nspace predict new beliefs of individuals. Furthermore, we find that the\nrelative distance between one's existing beliefs and new beliefs can serve as a\nquantitative estimate of cognitive dissonance, allowing us to predict new\nbeliefs. Our study highlights how modern LLMs, when combined with collective\nonline records of human beliefs, can offer insights into the fundamental\nprinciples that govern human belief formation and decision-making processes.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"z3BQl030KR6mtDC95qdjReV2qxKFWlEXa73TDFUiS7M","pdfSize":"11541361"}
