{"id":"2408.15818","title":"Communication-Free Robust Wireless Power Transfer with Constant Output\n  Power and Stable Frequency","authors":"Zhuoyu Zhang, Junan Lai, Yuangen Huang, Xianglin Hao, Ke Yin, Zhiqin\n  Jiang, Chao Wang, Xikui Ma, Ming Huang, Tianyu Dong","authorsParsed":[["Zhang","Zhuoyu",""],["Lai","Junan",""],["Huang","Yuangen",""],["Hao","Xianglin",""],["Yin","Ke",""],["Jiang","Zhiqin",""],["Wang","Chao",""],["Ma","Xikui",""],["Huang","Ming",""],["Dong","Tianyu",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:29:56 GMT"}],"updateDate":"2024-08-29","timestamp":1724855396000,"abstract":"  A primary challenge in wireless power transfer (WPT) systems is to achieve\nefficient and stable power transmission without complex control strategies when\nload conditions change dynamically. Addressing this issue, we propose a\nthird-order pseudo-Hermitian WPT system whose output characteristics exhibit a\nstable frequency and constant power. The frequency selection mechanism and\nenergy efficiency of the nonlinear WPT system based on pseudo-Hermitian under\nthe coupling mode theory approximation are analyzed. Theoretical analysis\nindicates that under certain coupling coefficients and load conditions, the\nproposed system can achieve frequency adaptation in a stable frequency mode\nwithout the need to change the circuit frequency. When the load changes\ndynamically, the stability of the power output is maintained using a\nproportional integral (PI) control strategy that only collects the voltage and\ncurrent at the transmitting end, eliminating the need for wireless\ncommunication circuits with feedback from the receiving side. Experimental\nresults demonstrate that the proposed design scheme can achieve constant power\ntransmission when load conditions change, maintaining stable and relatively\nhigh transmission efficiency. The proposed scheme exhibits benefits in\npractical applications since no communication is required.\n","subjects":["Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}