{"id":"2408.03372","title":"Spin-charge separation and resonant valence bond spin liquid in a\n  frustrated doped Mott insulator","authors":"Cecilie Glittum, Antonio \\v{S}trkalj, Dharmalingam Prabhakaran, Paul\n  A. Goddard, Cristian D. Batista and Claudio Castelnovo","authorsParsed":[["Glittum","Cecilie",""],["Štrkalj","Antonio",""],["Prabhakaran","Dharmalingam",""],["Goddard","Paul A.",""],["Batista","Cristian D.",""],["Castelnovo","Claudio",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-08","timestamp":1722967203000,"abstract":"  Anderson's groundbreaking ideas of resonant valence bond (RVB) liquid and\nspin-charge separation initiated a transformative shift in modern physics.\nExtensive implications influenced a broad spectrum of fields, from\nhigh-temperature superconductors to quantum computing, and gave birth to key\nconcepts in physics, such as quantum spin liquids, emergent gauge symmetries,\ntopological order, and fractionalisation. Despite extensive efforts to\ndemonstrate the existence of an RVB phase in the Hubbard model, a definitive\nrealisation has proven elusive. Here, we present a concise, realistic, and\nelegant solution to this longstanding problem by demonstrating analytically\nthat an RVB spin liquid, exhibiting spin-charge separation, emerges as the\nground state of doped Mott insulators on corner-sharing tetrahedral lattices\nwith frustrated hopping near half-filling -- a manifestation of the\ncounter-Nagaoka effect. We confirm numerically that this result holds for\nfinite-size systems, finite dopant density, and small exchange interactions.\nWhile much attention has been devoted to the emergence of new states from\ngeometrically frustrated interactions, our work demonstrates that kinetic\nenergy frustration in doped Mott insulators may be pivotal to stabilise robust,\ntopologically ordered states in real materials.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mNVlWQDYX_7I9UM-g1MBdj8QOHq5oz8y62GwCoe2NwY","pdfSize":"18884462"}
