{"id":"2408.14516","title":"Quasitopological Lifshitz dilaton black brane","authors":"A. Bazrafshan, M. Ghanaatian, S. Rezaei and Gh. Forozani","authorsParsed":[["Bazrafshan","A.",""],["Ghanaatian","M.",""],["Rezaei","S.",""],["Forozani","Gh.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 13:27:02 GMT"}],"updateDate":"2024-08-28","timestamp":1724592422000,"abstract":"  We construct a new class of $(n+1)$-dimensional Lifshitz dilaton black brane\nsolutions in the presence of the cubic quasitopological gravity for a flat\nboundary. The related action supports asymptotically Lifshitz solutions by\napplying some conditions which are used throughout the paper. We have to add a\nnew boundary term and some new counterterms to the bulk action to have finite\nsolutions. Then we define a finite stress tensor complex by which we can\ncalculate the energy density of the quasitopological Lifshitz dilaton black\nbrane. It is not possible to obtain analytical solutions, and so we use some\nexpantions to probe the functions behaviors near the horizon and at the\ninfinity. Combining the equations, we can attain a total constant along the\ncoordinate $r$. At the horizon, this constant is proportional to the product of\nthe temperature and the entropy and at the infinity, the total constant shows\nthe energ density of the quasitopological Lifshitz dilaton black brane.\nTherefore, we can reach to a relation between the conserved quantities\ntemperature, entropy and the energy density and get a smarr-type formula. Using\nthe first law of thermodynamics, we can find a relation between the entropy and\nthe temperature and then ontain the heat capacity. Our results show that the\nquasitopological Lifshitz dilaton black brane solutions are thermally stable\nfor each positive values of the dynamical critiacl exponent, $z$.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}