{"id":"2408.00287","title":"Construction of various time-dependent Hamiltonians on a single photonic\n  chip","authors":"Rui Ye, Guangzhen Li, Shuai Wan, Xiaotian Xue, Piyu Wang, Xin Qiao,\n  Hao Li, Shijie Liu, Jiayu Wang, Rui Ma, Fang Bo, Yuanlin Zheng, Chunhua Dong,\n  Luqi Yuan, and Xianfeng Chen","authorsParsed":[["Ye","Rui",""],["Li","Guangzhen",""],["Wan","Shuai",""],["Xue","Xiaotian",""],["Wang","Piyu",""],["Qiao","Xin",""],["Li","Hao",""],["Liu","Shijie",""],["Wang","Jiayu",""],["Ma","Rui",""],["Bo","Fang",""],["Zheng","Yuanlin",""],["Dong","Chunhua",""],["Yuan","Luqi",""],["Chen","Xianfeng",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 05:22:35 GMT"}],"updateDate":"2024-08-02","timestamp":1722489755000,"abstract":"  Integrated photonics provides an important platform for simulating physical\nmodels with high-performance chip-scale devices, where the lattice size and the\ntime-dependence of a model are key ingredients for further enriching the\nfunctionality of a photonic chip. Here, we propose and demonstrate the\nconstruction of various time-dependent Hamiltonian models using a single\nmicroresonator on thin-film lithium niobate chip. Such an integrated\nmicroresonator holds high quality factor to 10^6, and supports the construction\nof the synthetic frequency lattice with effective lattice sites up to 152 under\nthe electro-optic modulation. By further applying a bichromatic modulation\ncomposed of two radio-frequency signals oppositely detuned from the resonant\nfrequency in the microresonator, we build different time-dependent Hamiltonians\nwith the time-varying nearest-neighbor coupling strength in synthetic frequency\nlattice. We measure the temporal features from capturing the dynamic band\nstructures of the lattice and demonstrate a variety of time-dependent synthetic\nlattice models by engineering the driven pattern of the modulation,\nhighlighting great flexibility of the microresonator. Our work shows a photonic\nchip for simulating versatile time-dependent Hamiltonians, which pushes forward\nquantum simulations in integrated photonics with great experimental tunability\nand reconfigurability.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}