{"id":"2408.15538","title":"TrafficGamer: Reliable and Flexible Traffic Simulation for\n  Safety-Critical Scenarios with Game-Theoretic Oracles","authors":"Guanren Qiao and Guorui Quan and Jiawei Yu and Shujun Jia and Guiliang\n  Liu","authorsParsed":[["Qiao","Guanren",""],["Quan","Guorui",""],["Yu","Jiawei",""],["Jia","Shujun",""],["Liu","Guiliang",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 05:11:16 GMT"}],"updateDate":"2024-08-29","timestamp":1724821876000,"abstract":"  While modern Autonomous Vehicle (AV) systems can develop reliable driving\npolicies under regular traffic conditions, they frequently struggle with\nsafety-critical traffic scenarios. This difficulty primarily arises from the\nrarity of such scenarios in driving datasets and the complexities associated\nwith predictive modeling among multiple vehicles. To support the testing and\nrefinement of AV policies, simulating safety-critical traffic events is an\nessential challenge to be addressed. In this work, we introduce TrafficGamer,\nwhich facilitates game-theoretic traffic simulation by viewing common road\ndriving as a multi-agent game. In evaluating the empirical performance across\nvarious real-world datasets, TrafficGamer ensures both fidelity and\nexploitability of the simulated scenarios, guaranteeing that they not only\nstatically align with real-world traffic distribution but also efficiently\ncapture equilibriums for representing safety-critical scenarios involving\nmultiple agents. Additionally, the results demonstrate that TrafficGamer\nexhibits highly flexible simulation across various contexts. Specifically, we\ndemonstrate that the generated scenarios can dynamically adapt to equilibriums\nof varying tightness by configuring risk-sensitive constraints during\noptimization. To the best of our knowledge, TrafficGamer is the first simulator\ncapable of generating diverse traffic scenarios involving multiple agents. We\nhave provided a demo webpage for the project at\nhttps://qiaoguanren.github.io/trafficgamer-demo/.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}