{"id":"2408.16923","title":"Analyzing Errors in Controlled Turret System Given Target Location Input\n  from Artificial Intelligence Methods in Automatic Target Recognition","authors":"Matthew Karlson, Heng Ban, Daniel G. Cole, Mai Abdelhakim, Jennifer\n  Forsythe","authorsParsed":[["Karlson","Matthew",""],["Ban","Heng",""],["Cole","Daniel G.",""],["Abdelhakim","Mai",""],["Forsythe","Jennifer",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 21:50:08 GMT"}],"updateDate":"2024-09-02","timestamp":1724968208000,"abstract":"  In this paper, we assess the movement error of a targeting system given\ntarget location data from artificial intelligence (AI) methods in automatic\ntarget recognition (ATR) systems. Few studies evaluate the impacts on the\naccuracy in moving a targeting system to an aimpoint provided in this manner.\nTo address this knowledge gap, we assess the performance of a controlled gun\nturret system given target location from an object detector developed from AI\nmethods. In our assessment, we define a measure of object detector error and\nexamine the correlations with several standard metrics in object detection. We\nthen statistically analyze the object detector error data and turret movement\nerror data acquired from controlled targeting simulations, as well as their\naggregate error, to examine the impact on turret movement accuracy. Finally, we\nstudy the correlations between additional metrics and the probability of a hit.\nThe results indicate that AI technologies are a significant source of error to\ntargeting systems. Moreover, the results suggest that metrics such as the\nconfidence score, intersection-over-union, average precision and average recall\nare predictors of accuracy against stationary targets with our system\nparameters.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"XAQ9Wsv64nbCb2nJYAO9tWgYN0WDvoymgKQqsCp5P8w","pdfSize":"3032776"}
