{"id":"2408.17346","title":"On Nonparanormal Likelihoods","authors":"Torsten Hothorn","authorsParsed":[["Hothorn","Torsten",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 15:17:53 GMT"}],"updateDate":"2024-09-02","timestamp":1725031073000,"abstract":"  Nonparanormal models describe the joint distribution of multivariate\nresponses via latent Gaussian, and thus parametric, copulae while allowing\nflexible nonparametric marginals. Some aspects of such distributions, for\nexample conditional independence, are formulated parametrically. Other\nfeatures, such as marginal distributions, can be formulated non- or\nsemiparametrically. Such models are attractive when multivariate normality is\nquestionable.\n  Most estimation procedures perform two steps, first estimating the\nnonparametric part. The copula parameters come second, treating the marginal\nestimates as known. This is sufficient for some applications. For other\napplications, e.g. when a semiparametric margin features parameters of interest\nor when standard errors are important, a simultaneous estimation of all\nparameters might be more advantageous.\n  We present suitable parameterisations of nonparanormal models, possibly\nincluding semiparametric effects, and define four novel nonparanormal\nlog-likelihood functions. In general, the corresponding one-step optimization\nproblems are shown to be non-convex. In some cases, however, biconvex problems\nemerge. Several convex approximations are discussed.\n  From a low-level computational point of view, the core contribution is the\nscore function for multivariate normal log-probabilities computed via Genz'\nprocedure. We present transformation discriminant analysis when some biomarkers\nare subject to limit-of-detection problems as an application and illustrate\npossible empirical gains in semiparametric efficient polychoric correlation\nanalysis.\n","subjects":["Statistics/Methodology","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/"}