{"id":"2408.01548","title":"Trainable Pointwise Decoder Module for Point Cloud Segmentation","authors":"Bike Chen, Chen Gong, Antti Tikanm\\\"aki, Juha R\\\"oning","authorsParsed":[["Chen","Bike",""],["Gong","Chen",""],["Tikanmäki","Antti",""],["Röning","Juha",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 19:29:35 GMT"}],"updateDate":"2024-08-06","timestamp":1722626975000,"abstract":"  Point cloud segmentation (PCS) aims to make per-point predictions and enables\nrobots and autonomous driving cars to understand the environment. The range\nimage is a dense representation of a large-scale outdoor point cloud, and\nsegmentation models built upon the image commonly execute efficiently. However,\nthe projection of the point cloud onto the range image inevitably leads to\ndropping points because, at each image coordinate, only one point is kept\ndespite multiple points being projected onto the same location. More\nimportantly, it is challenging to assign correct predictions to the dropped\npoints that belong to the classes different from the kept point class. Besides,\nexisting post-processing methods, such as K-nearest neighbor (KNN) search and\nkernel point convolution (KPConv), cannot be trained with the models in an\nend-to-end manner or cannot process varying-density outdoor point clouds well,\nthereby enabling the models to achieve sub-optimal performance. To alleviate\nthis problem, we propose a trainable pointwise decoder module (PDM) as the\npost-processing approach, which gathers weighted features from the neighbors\nand then makes the final prediction for the query point. In addition, we\nintroduce a virtual range image-guided copy-rotate-paste (VRCrop) strategy in\ndata augmentation. VRCrop constrains the total number of points and eliminates\nundesirable artifacts in the augmented point cloud. With PDM and VRCrop,\nexisting range image-based segmentation models consistently perform better than\ntheir counterparts on the SemanticKITTI, SemanticPOSS, and nuScenes datasets.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}