{"id":"2408.14276","title":"SO as shock tracer in protoplanetary disks: the AB Aurigae case","authors":"A. Dutrey, E. Chapillon, S. Guilloteau, Y.W. Tang, A.Boccaletti,\n  L.Bouscasse, Th. Collin-Dufresne, E. Di Folco, A. Fuente, V.Pi\\'etu, P.\n  Rivi\\`ere-Marichalar, and D.Semenov","authorsParsed":[["Dutrey","A.",""],["Chapillon","E.",""],["Guilloteau","S.",""],["Tang","Y. W.",""],["Boccaletti","A.",""],["Bouscasse","L.",""],["Collin-Dufresne","Th.",""],["Di Folco","E.",""],["Fuente","A.",""],["Piétu","V.",""],["Rivière-Marichalar","P.",""],["Semenov","D.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:49:35 GMT"}],"updateDate":"2024-09-18","timestamp":1724680175000,"abstract":"  {Sulfur Monoxide is known to be a good shock tracer in molecular clouds and\nprotostar environments, but its abundance is difficult to reproduce even using\nstate-of-the-art astrochemical models. }\n  {We investigate the properties of the observed SO emission in the\nprotoplanetary disk of AB Auriga, a Herbig Ae star of 2.4 $\\Msun$ located at\n156 pc. The AB Aur system is unique because it exhibits a dust trap and at\nleast one young putative planet orbiting at about 30 au from the central star.}\n  {We reduced ALMA archival data (projects 2019.1.00579.S, 2021.1.00690.S and\n2021.1.01216.S) and analyzed the three detected SO lines (SO $6_5-5_4$,\n$6_7-5_6$ and $5_6-4_5$).\n  We also present C$^{17}$O and C$^{18}$O 2-1 data to complement the\ninterpretation of the SO data.}\n  {For the three SO lines, the maximum SO emission in the ring is not located\nin the dust trap. Moreover, the inner radius of the SO ring is significantly\nlarger than the CO emission inner radius, $\\sim 160$ au versus $\\sim 90$ au.\nThe SO emission traces gas located in part beyond the dust ring. This emission\nlikely originates from shocks at the interface of the outer spirals, observed\nin CO and scattered light emission, and the molecular and dust ring. SO is also\ndetected inside the cavity, at a radius $\\sim 20-30$ au and with a rotation\nvelocity compatible with the proto-planet P1. We speculate that this SO\nemission originates from accretion shocks onto the circumplanetary disk of the\nputative proto-planet P1.}\n  {These observations confirm that SO is a good tracer of shocks in\nprotoplanetary disks and could be a powerful, new tool to detect embedded\n(proto-)planets.} Conclusions. These observations confirm that SO is a good\ntracer of shocks in protoplanetary disks and could be a powerful, new tool to\ndetect embedded (proto-)planets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}