{"id":"2408.09552","title":"Inertial Focusing of Spherical Particles: The Effects of Rotational\n  Motion","authors":"Dmitry Alexeev and Sergey Litvinov and Athena Economides and Lucas\n  Amoudruz and Mehmet Toner and Petros Koumoutsakos","authorsParsed":[["Alexeev","Dmitry",""],["Litvinov","Sergey",""],["Economides","Athena",""],["Amoudruz","Lucas",""],["Toner","Mehmet",""],["Koumoutsakos","Petros",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 17:41:30 GMT"}],"updateDate":"2024-08-20","timestamp":1724002890000,"abstract":"  The identification of cells and particles based on their transport properties\nin microfluidic devices is crucial for numerous applications in biology and\nmedicine. Neutrally buoyant particles transported in microfluidic channels,\nmigrate laterally towards stable locations. However, the effect of the particle\nand flow properties on these focusing positions remain largely unknown. We\nconduct large scale simulations with dissipative particle dynamics,\ndemonstrating that freely moving particles exhibit significant differences in\ntheir focusing patterns from particles that are prevented from rotation. In\ncircular pipes, we observe drastic changes in rotating versus non-rotating\nfocusing positions. We demonstrate that rotation-induced lateral lift force is\nsignificant, unlike previously believed, and is linearly dependent on the\nrotation magnitude. A simple phenomenological explanation extending existing\ntheories is presented, that agrees well with our numerical findings. For flows\nin square ducts, we report four face-centered stable positions for the rotating\nparticles, in accordance with experimental studies. However, the non-rotating\nparticles stay scattered on a concentric one-dimensional annulus, thus\nrevealing qualitatively different behavior with respect to the free ones. Our\nfindings suggest new designs for micro-particle and cell sorting in\nmicrofluidics devices.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"47jMNf0kFUuN3H5nNIeFAajv0oYPkitb4iREx6MK2i8","pdfSize":"3859495"}
