{"id":"2408.11624","title":"On gamma rays as predictors of UHECR flux in AGNs","authors":"Cain\\~a de Oliveira, Rodrigo Guedes Lang, Pedro Batista","authorsParsed":[["de Oliveira","Cainã",""],["Lang","Rodrigo Guedes",""],["Batista","Pedro",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:49:10 GMT"}],"updateDate":"2024-08-22","timestamp":1724248150000,"abstract":"  Active galactic nuclei (AGN) are among the main candidates for\nultra-high-energy cosmic ray (UHECR) sources. However, while theoretical and\nsome phenomenological works favor AGNs as the main sources, recent works have\nshown that using the very-high-energy (VHE) $\\gamma$-ray flux as a proxy for\nthe UHECR flux leads to a bad agreement with data. In this context, the energy\nspectrum and composition data are hardly fitted. At the same time, the arrival\ndirections map is badly described and a spurious dipole direction is produced.\nIn this work, we propose a possible solution to these contradictions. Using the\nobserved $\\gamma$-ray flux as a proxy may carry the implicit assumption of\nbeamed UHECR emission and, consequently, its beam will remain collimated up to\nits detection on Earth. We show that assuming an isotropic UHECR emission and\ncorrecting the $\\gamma$-ray emission proxy by Doppler boosting can overcome the\nproblem. The combined fit of the spectrum and composition is improved by\n$3.56\\sigma$, while the predicted arrival directions agree much better with the\ndata. In particular, a spurious direction of the dipole can be reduced from\n$10.3 \\ (5.4)\\sigma$ away from the data to $2.2 \\ (1.5)\\sigma$ for $E > 8$ EeV\n($E > 32$ EeV). We also show that this effect is particularly important when\nincluding AGNs of different classes in the same analysis, such as radio\ngalaxies and blazars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4xGbx4KiQEd35vpBcj5mrvMj40hp-fWToT3yuQcmIts","pdfSize":"980177"}
