{"id":"2408.13754","title":"Multimodal Ensemble with Conditional Feature Fusion for Dysgraphia\n  Diagnosis in Children from Handwriting Samples","authors":"Jayakanth Kunhoth, Somaya Al-Maadeed, Moutaz Saleh, Younes Akbari","authorsParsed":[["Kunhoth","Jayakanth",""],["Al-Maadeed","Somaya",""],["Saleh","Moutaz",""],["Akbari","Younes",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 07:42:54 GMT"}],"updateDate":"2024-08-27","timestamp":1724571774000,"abstract":"  Developmental dysgraphia is a neurological disorder that hinders children's\nwriting skills. In recent years, researchers have increasingly explored machine\nlearning methods to support the diagnosis of dysgraphia based on offline and\nonline handwriting. In most previous studies, the two types of handwriting have\nbeen analysed separately, which does not necessarily lead to promising results.\nIn this way, the relationship between online and offline data cannot be\nexplored. To address this limitation, we propose a novel multimodal machine\nlearning approach utilizing both online and offline handwriting data. We\ncreated a new dataset by transforming an existing online handwritten dataset,\ngenerating corresponding offline handwriting images. We considered only\ndifferent types of word data (simple word, pseudoword & difficult word) in our\nmultimodal analysis. We trained SVM and XGBoost classifiers separately on\nonline and offline features as well as implemented multimodal feature fusion\nand soft-voted ensemble. Furthermore, we proposed a novel ensemble with\nconditional feature fusion method which intelligently combines predictions from\nonline and offline classifiers, selectively incorporating feature fusion when\nconfidence scores fall below a threshold. Our novel approach achieves an\naccuracy of 88.8%, outperforming SVMs for single modalities by 12-14%, existing\nmethods by 8-9%, and traditional multimodal approaches (soft-vote ensemble and\nfeature fusion) by 3% and 5%, respectively. Our methodology contributes to the\ndevelopment of accurate and efficient dysgraphia diagnosis tools, requiring\nonly a single instance of multimodal word/pseudoword data to determine the\nhandwriting impairment. This work highlights the potential of multimodal\nlearning in enhancing dysgraphia diagnosis, paving the way for accessible and\npractical diagnostic tools.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}