{"id":"2408.11837","title":"MicroXercise: A Micro-Level Comparative and Explainable System for\n  Remote Physical Therapy","authors":"Hanchen David Wang, Nibraas Khan, Anna Chen, Nilanjan Sarkar, Pamela\n  Wisniewski, Meiyi Ma","authorsParsed":[["Wang","Hanchen David",""],["Khan","Nibraas",""],["Chen","Anna",""],["Sarkar","Nilanjan",""],["Wisniewski","Pamela",""],["Ma","Meiyi",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:39:47 GMT"}],"updateDate":"2024-08-23","timestamp":1722983987000,"abstract":"  Recent global estimates suggest that as many as 2.41 billion individuals have\nhealth conditions that would benefit from rehabilitation services. Home-based\nPhysical Therapy (PT) faces significant challenges in providing interactive\nfeedback and meaningful observation for therapists and patients. To fill this\ngap, we present MicroXercise, which integrates micro-motion analysis with\nwearable sensors, providing therapists and patients with a comprehensive\nfeedback interface, including video, text, and scores. Crucially, it employs\nmulti-dimensional Dynamic Time Warping (DTW) and attribution-based explainable\nmethods to analyze the existing deep learning neural networks in monitoring\nexercises, focusing on a high granularity of exercise. This synergistic\napproach is pivotal, providing output matching the input size to precisely\nhighlight critical subtleties and movements in PT, thus transforming complex AI\nanalysis into clear, actionable feedback. By highlighting these micro-motions\nin different metrics, such as stability and range of motion, MicroXercise\nsignificantly enhances the understanding and relevance of feedback for\nend-users. Comparative performance metrics underscore its effectiveness over\ntraditional methods, such as a 39% and 42% improvement in Feature Mutual\nInformation (FMI) and Continuity. MicroXercise is a step ahead in home-based\nphysical therapy, providing a technologically advanced and intuitively helpful\nsolution to enhance patient care and outcomes.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ygzqZ8_9aNMi1_X5xWKqYOlb3T0nQ_p3uaju_YIyKq8","pdfSize":"14061093"}
