{"id":"2408.12464","title":"Extendable optical phase synchronization of remote and independent\n  quantum network nodes over deployed fibers","authors":"A.J. Stolk, J.J.B. Biemond, K.L. van der Enden, L. van Dooren, E.J.\n  van Zwet, R. Hanson","authorsParsed":[["Stolk","A. J.",""],["Biemond","J. J. B.",""],["van der Enden","K. L.",""],["van Dooren","L.",""],["van Zwet","E. J.",""],["Hanson","R.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:05:23 GMT"}],"updateDate":"2024-08-23","timestamp":1724339123000,"abstract":"  Entanglement generation between remote qubit systems is the central tasks for\nquantum communication. Future quantum networks will have to be compatible with\nlow-loss telecom bands and operate with large separation between qubit nodes.\nSingle-click heralding schemes can be used to increase entanglement rates at\nthe cost of needing an optically phase-synchronized architecture. In this paper\nwe present such a phase synchronization scheme for a metropolitan quantum\nnetwork, operating in the low-loss telecom L-band. To overcome various\nchallenges such as communication delays and optical power limitations, the\nscheme consists of multiple tasks that are individually stabilized. We\ncharacterize each task, identify the main noise sources, motivate the design\nchoices and describe the synchronization schemes. The performance of each of\nthe tasks is quantified by a transfer-function measurement that investigates\nthe frequency response and feedback bandwidth. Finally we investigate the\nresulting optical phase stability of the fully deployed system over a\ncontinuous period of 10 hours, reporting a short-term stability standard\ndeviation of ${\\sigma} \\approx 30 \\deg$ and a long-term stability of the\naverage optical phase to within a few degrees. The scheme presented served as a\nkey enabling technology for an NV-center based metropolitan quantum link. This\nscheme is of interest for other quantum network platforms that benefit from an\nextendable and telecom compatible phase synchronization solution.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Al6nG8hXliXKTpPDKyhg9U3UqqBDvQMW4sho4JwvEQY","pdfSize":"6622710"}
