{"id":"2408.15855","title":"Hints of a sulfur-rich atmosphere around the 1.6 R$_{\\oplus}$\n  Super-Earth L98-59 d from JWST NIRSpec G395H transmission spectroscopy","authors":"Am\\'elie Gressier, N\\'estor Espinoza, Natalie H. Allen, David K. Sing,\n  Agnibha Banerjee, Joanna K. Barstow, Jeff A. Valenti, Nikole K. Lewis,\n  Stephan M. Birkmann, Ryan C. Challener, Elena Manjavacas, Catarina Alves de\n  Oliveira, Nicolas Crouzet, Tracy. L Beck","authorsParsed":[["Gressier","Amélie",""],["Espinoza","Néstor",""],["Allen","Natalie H.",""],["Sing","David K.",""],["Banerjee","Agnibha",""],["Barstow","Joanna K.",""],["Valenti","Jeff A.",""],["Lewis","Nikole K.",""],["Birkmann","Stephan M.",""],["Challener","Ryan C.",""],["Manjavacas","Elena",""],["de Oliveira","Catarina Alves",""],["Crouzet","Nicolas",""],["Beck","Tracy. L",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:16:48 GMT"}],"updateDate":"2024-08-29","timestamp":1724858208000,"abstract":"  Detecting atmospheres around planets with a radius below 1.6 R$_{\\oplus}$,\ncommonly referred to as rocky planets (Rogers_2015, Rogers_2021), has proven to\nbe challenging. However, rocky planets orbiting M-dwarfs are ideal candidates\ndue to their favorable planet-to-star radius ratio. Here, we present one\ntransit observation of the Super-Earth L98-59d (1.58 R$_{\\oplus}$, 2.31\nM$_{\\oplus}$), at the limit of rocky/gas-rich, using the JWST NIRSpec G395H\nmode covering the 2.8 to 5.1 microns wavelength range. The extracted transit\nspectrum from a single transit observation deviates from a flat line by 2.6 to\n5.6$\\sigma$, depending on the data reduction and retrieval setup. The hints of\nan atmospheric detection are driven by a large absorption feature between 3.3\nto 4.8 microns. A stellar contamination retrieval analysis rejected the source\nof this feature as being due to stellar inhomogeneities, making the best fit an\natmospheric model including sulfur-bearing species, suggesting that the\natmosphere of L98-59d may not be at equilibrium. This result will need to be\nconfirmed by the analysis of the second NIRSpec G395H visit in addition to the\nNIRISS SOSS transit observation.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Mkx36Vq4Cb5ouKP-iFcrqklvIQMbFKn9QFbSoYET_94","pdfSize":"5559284"}
