{"id":"2408.12351","title":"A Search for Collisions and Planet-Disk Interactions in the Beta\n  Pictoris Disk with 26 Years of High Precision HST/STIS Imaging","authors":"Arin M. Avsar, Kevin Wagner, D\\'aniel Apai, Christopher C. Stark, Mark\n  C. Wyatt","authorsParsed":[["Avsar","Arin M.",""],["Wagner","Kevin",""],["Apai","Dániel",""],["Stark","Christopher C.",""],["Wyatt","Mark C.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:49:04 GMT"}],"updateDate":"2024-08-23","timestamp":1724330944000,"abstract":"  Beta Pictoris (Beta Pic)'s well-studied debris disk and two known giant\nplanets, in combination with the stability of HST/STIS (and now also JWST),\noffers a unique opportunity to test planet-disk interaction models and to\nobserve recent planetesimal collisions. We present HST/STIS coronagraphic\nimaging from two new epochs of data taken between 2021 and 2023, complementing\nearlier data taken in 1997 and 2012. This dataset enables the longest baseline\nand highest precision temporal comparison of any debris disk to date, with\nsensitivity to temporal surface brightness variations of sub-percentage levels\nin the midplane of the disk. While no localized surface brightness changes are\ndetected, which would be indicative of a recent planetesimal collision, there\nis a tentative brightening of the SE side of the disk over the past decade. We\nlink the constraints on surface brightness variations to dynamical models of\nthe planetary system's evolution and to the collisional history of\nplanetesimals. Using a coupled collisional model and injection/recovery\nframework, we estimate sensitivity to expanding collisional debris down to a\nCeres-mass per progenitor in the most sensitive regions of the disk midplane.\nThese results demonstrate the capabilities of long-baseline, temporal studies\nwith HST (and also soon with JWST) for constraining the physical processes\noccurring within debris disks.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}