{"id":"2408.02586","title":"Massive MIMO-OTFS-Based Random Access for Cooperative LEO Satellite\n  Constellations","authors":"Boxiao Shen, Yongpeng Wu, Shiqi Gong, Heng Liu, Bj\\\"orn Ottersten,\n  Wenjun Zhang","authorsParsed":[["Shen","Boxiao",""],["Wu","Yongpeng",""],["Gong","Shiqi",""],["Liu","Heng",""],["Ottersten","Björn",""],["Zhang","Wenjun",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:00:36 GMT"}],"updateDate":"2024-08-06","timestamp":1722873636000,"abstract":"  This paper investigates joint device identification, channel estimation, and\nsymbol detection for cooperative multi-satellite-enhanced random access, where\northogonal time-frequency space modulation with the large antenna array is\nutilized to combat the dynamics of the terrestrial-satellite links (TSLs). We\nintroduce the generalized complex exponential basis expansion model to\nparameterize TSLs, thereby reducing the pilot overhead. By exploiting the block\nsparsity of the TSLs in the angular domain, a message passing algorithm is\ndesigned for initial channel estimation. Subsequently, we examine two\ncooperative modes to leverage the spatial diversity within satellite\nconstellations: the centralized mode, where computations are performed at a\nhigh-power central server, and the distributed mode, where computations are\noffloaded to edge satellites with minimal signaling overhead. Specifically, in\nthe centralized mode, device identification is achieved by aggregating backhaul\ninformation from edge satellites, and channel estimation and symbol detection\nare jointly enhanced through a structured approximate expectation propagation\n(AEP) algorithm. In the distributed mode, edge satellites share channel\ninformation and exchange soft information about data symbols, leading to a\ndistributed version of AEP. The introduced basis expansion model for TSLs\nenables the efficient implementation of both centralized and distributed\nalgorithms via fast Fourier transform. Simulation results demonstrate that\nproposed schemes significantly outperform conventional algorithms in terms of\nthe activity error rate, the normalized mean squared error, and the symbol\nerror rate. Notably, the distributed mode achieves performance comparable to\nthe centralized mode with only two exchanges of soft information about data\nsymbols within the constellation.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}