{"id":"2408.16642","title":"A machine learning approach for computing solar flare locations in\n  X-rays on-board Solar Orbiter/STIX","authors":"Paolo Massa, Simon Felix, L\\'aszl\\'o Istv\\'an Etesi, Ewan C. M.\n  Dickson, Hualin Xiao, Francesco P. Ramunno, Merve Selcuk-Simsek, Brandon\n  Panos, Andr\\'e Csillaghy, S\\\"am Krucker","authorsParsed":[["Massa","Paolo",""],["Felix","Simon",""],["Etesi","László István",""],["Dickson","Ewan C. M.",""],["Xiao","Hualin",""],["Ramunno","Francesco P.",""],["Selcuk-Simsek","Merve",""],["Panos","Brandon",""],["Csillaghy","André",""],["Krucker","Säm",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:46:10 GMT"}],"updateDate":"2024-08-30","timestamp":1724946370000,"abstract":"  The Spectrometer/Telescope for Imaging X-rays (STIX) on-board the ESA Solar\nOrbiter mission retrieves the coordinates of solar flare locations by means of\na specific sub-collimator, named the Coarse Flare Locator (CFL). When a solar\nflare occurs on the Sun, the emitted X-ray radiation casts the shadow of a\npeculiar \"H-shaped\" tungsten grid over the CFL X-ray detector. From\nmeasurements of the areas of the detector that are illuminated by the X-ray\nradiation, it is possible to retrieve the $(x,y)$ coordinates of the flare\nlocation on the solar disk.\n  In this paper, we train a neural network on a dataset of real CFL\nobservations to estimate the coordinates of solar flare locations. Further, we\napply a post-training quantization technique specifically tailored to the\nadopted model architecture. This technique allows all computations to be in\ninteger arithmetic at inference time, making the model compatible with the STIX\ncomputational requirements. We show that our model outperforms the currently\nadopted algorithm for estimating the flare locations from CFL data regarding\nprediction accuracy while requiring fewer parameters. We finally discuss\npossible future applications of the proposed model on-board STIX.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Gk5nL_I2vJgoD3p60vEwTAourmqaeHZBucvVo2qmuEw","pdfSize":"1450867"}
