{"id":"2408.03931","title":"Superfluid quantum criticality and the thermal evolution of neutron\n  stars","authors":"Hao-Fu Zhu, Guo-Zhu Liu, Jing-Rong Wang, Xufen Wu","authorsParsed":[["Zhu","Hao-Fu",""],["Liu","Guo-Zhu",""],["Wang","Jing-Rong",""],["Wu","Xufen",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:46:49 GMT"}],"updateDate":"2024-08-08","timestamp":1723052809000,"abstract":"  The neutron star starts to cool down shortly after its birth by emitting\nneutrinos. When it is cold enough, the Cooper pairs of neutrons are formed,\nwhich triggers a superfluid transition. Previous works on neutron superfluidity\nare focused on the finite-temperature transition. Little attention is paid to\nthe potentially important quantum critical phenomena associated with\nsuperfluidity. Here, we provide the first theoretical analysis of superfluid\nquantum criticality, concentrating on its impact on neutron star cooling.\nExtensive calculations found that superfluidity occurs within a finite range of\nnuclear density $\\rho$. The density serves as a non-thermal parameter for\nsuperfluid quantum phase transition. In a broad quantum critical region, there\nis a strong coupling between the gapless neutrons and the quantum critical\nfluctuations of superfluid order parameter. We handle this coupling by using\nperturbation theory and renormalization group method, and show that it leads to\nnon-Fermi liquid behavior, which yields a logarithmic $T\\ln(1/T)$ correction to\nthe Fermi-liquid specific heat $c_{n}\\propto T$ and also markedly alters the\nneutrino emissivity. Quantum critical phenomena emerge at a time much earlier\nthan the onset of superfluidity and persist throughout almost the entire life\nof a neutron star. At a low $T$, such phenomena coexist with superfluidity in\nthe neutron star interior, yet occupying different layers. We include\nsuperfluid quantum criticality into the theoretical description of neutron star\ncooling and find that it obviously prolongs the thermal relaxation time. By\nvarying the strength of superfluid fluctuations and other quantities, we obtain\nan excellent fit to the observed cooling data of a variety of neutron stars.\nOur results indicate the existence of an intriguing correlation between\nsuperfluid quantum criticality and the thermal evolution of neutron stars.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}