{"id":"2408.12287","title":"Extremes of Dissolved Oxygen in the California Current System","authors":"J. Xavier Prochaska (1,2,3) and Daniel Rudnick (2) ((1) University of\n  California, Santa Cruz, (2) Scripps Institution of Oceanograph, (3) Simons\n  Pivot Fellow)","authorsParsed":[["Prochaska","J. Xavier",""],["Rudnick","Daniel",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 10:45:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724323516000,"abstract":"  Dissolved oxygen (DO) is a non-conservative tracer of interactions at the\nair-sea interface, respiration and photosynthesis, and advection. In this\nmanuscript, we study extremes in the degree of oxygen saturation (SO), the\nratio of DO to the maximum concentration given the water's temperature,\nsalinity, and depth with SO=1 critically saturated. We perform the analysis\nwith the California Underwater Glider Network (CUGN), which operates gliders on\nfour lines that extend from the California coast to several hundred kilometers\noffshore, profiling to 500m depth every 3km. Since ~2017, the gliders have been\nequipped with a Sea-Bird 63 optode sensor to measure the DO content. We find\nthat parcels with SO>1.1, hyperoxic extrema, occur primarily near-shore in the\nupper 50m of the water column and during non-winter months. Along Line 90 which\noriginates in San Diego, these hyperoxic events occur primarily in stratified\nwaters with shallow mixed layers. We hypothesize that photosynthesis elevates\nDO in sub-surface water that can not rapidly ventilate with the surface. Along\nthe three other lines, hyperoxic extrema occur almost exclusively at the\nsurface and are correlated with elevated Chl-a fluorescence suggesting they are\nprimarily driven by blooms of photosynthesis. We also examine hypoxic extrema,\nfinding that parcels with SO<0.9 and z<50m occur most frequently along the\nnorthernmost line where upwelling has greatest impact.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}