{"id":"2408.12634","title":"Joint Hypergraph Rewiring and Memory-Augmented Forecasting Techniques in\n  Digital Twin Technology","authors":"Sagar Srinivas Sakhinana, Krishna Sai Sudhir Aripirala, Shivam Gupta,\n  Venkataramana Runkana","authorsParsed":[["Sakhinana","Sagar Srinivas",""],["Aripirala","Krishna Sai Sudhir",""],["Gupta","Shivam",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:08:45 GMT"}],"updateDate":"2024-08-26","timestamp":1724335725000,"abstract":"  Digital Twin technology creates virtual replicas of physical objects,\nprocesses, or systems by replicating their properties, data, and behaviors.\nThis advanced technology offers a range of intelligent functionalities, such as\nmodeling, simulation, and data-driven decision-making, that facilitate design\noptimization, performance estimation, and monitoring operations. Forecasting\nplays a pivotal role in Digital Twin technology, as it enables the prediction\nof future outcomes, supports informed decision-making, minimizes risks, driving\nimprovements in efficiency, productivity, and cost reduction. Recently, Digital\nTwin technology has leveraged Graph forecasting techniques in large-scale\ncomplex sensor networks to enable accurate forecasting and simulation of\ndiverse scenarios, fostering proactive and data-driven decision making.\nHowever, existing Graph forecasting techniques lack scalability for many\nreal-world applications. They have limited ability to adapt to non-stationary\nenvironments, retain past knowledge, lack a mechanism to capture the higher\norder spatio-temporal dynamics, and estimate uncertainty in model predictions.\nTo surmount the challenges, we introduce a hybrid architecture that enhances\nthe hypergraph representation learning backbone by incorporating fast\nadaptation to new patterns and memory-based retrieval of past knowledge. This\nbalance aims to improve the slowly-learned backbone and achieve better\nperformance in adapting to recent changes. In addition, it models the\ntime-varying uncertainty of multi-horizon forecasts, providing estimates of\nprediction uncertainty. Our forecasting architecture has been validated through\nablation studies and has demonstrated promising results across multiple\nbenchmark datasets, surpassing state-ofthe-art forecasting methods by a\nsignificant margin.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}