{"id":"2408.14212","title":"A generalized skew-symmetric Lanczos bidiagonalization method for\n  computing several extreme eigenpairs of a large skew-symmetric/symmetric\n  positive definite matrix pair","authors":"Jinzhi Huang","authorsParsed":[["Huang","Jinzhi",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:11:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724674270000,"abstract":"  A generalized skew-symmetric Lanczos bidiagonalization (GSSLBD) method is\nproposed to compute several extreme eigenpairs of a large matrix pair $(A,B)$,\nwhere $A$ is skew-symmetric and $B$ is symmetric positive definite. The\nunderlying GSSLBD process produces two sets of $B$-orthonormal generalized\nLanczos basis vectors that are also $B$-biorthogonal and a series of bidiagonal\nmatrices whose singular values are taken as the approximations to the imaginary\nparts of the eigenvalues of $(A,B)$ and the corresponding left and right\nsingular vectors premultiplied with the left and right generalized Lanczos\nbasis matrices form the real and imaginary parts of the associated approximate\neigenvectors. A rigorous convergence analysis is made on the desired\neigenspaces approaching the Krylov subspaces generated by the GSSLBD process\nand accuracy estimates are made for the approximate eigenpairs. In finite\nprecision arithmetic, it is shown that the semi-$B$-orthogonality and\nsemi-$B$-biorthogonality of the computed left and right generalized Lanczos\nvectors suffice to compute the eigenvalues accurately. An efficient partial\nreorthogonalization strategy is adapted to GSSLBD in order to maintain the\ndesired semi-$B$-orthogonality and semi-$B$-biorthogonality. To be practical,\nan implicitly restarted GSSLBD algorithm, abbreviated as IRGSSLBD, is developed\nwith partial $B$-reorthogonalizations. Numerical experiments illustrate the\nrobustness and overall efficiency of the IRGSSLBD algorithm.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}