{"id":"2408.01690","title":"IDNet: A Novel Dataset for Identity Document Analysis and Fraud\n  Detection","authors":"Hong Guan, Yancheng Wang, Lulu Xie, Soham Nag, Rajeev Goel, Niranjan\n  Erappa Narayana Swamy, Yingzhen Yang, Chaowei Xiao, Jonathan Prisby, Ross\n  Maciejewski, Jia Zou","authorsParsed":[["Guan","Hong",""],["Wang","Yancheng",""],["Xie","Lulu",""],["Nag","Soham",""],["Goel","Rajeev",""],["Swamy","Niranjan Erappa Narayana",""],["Yang","Yingzhen",""],["Xiao","Chaowei",""],["Prisby","Jonathan",""],["Maciejewski","Ross",""],["Zou","Jia",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:05:40 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 22:30:34 GMT"}],"updateDate":"2024-09-05","timestamp":1722668740000,"abstract":"  Effective fraud detection and analysis of government-issued identity\ndocuments, such as passports, driver's licenses, and identity cards, are\nessential in thwarting identity theft and bolstering security on online\nplatforms. The training of accurate fraud detection and analysis tools depends\non the availability of extensive identity document datasets. However, current\npublicly available benchmark datasets for identity document analysis, including\nMIDV-500, MIDV-2020, and FMIDV, fall short in several respects: they offer a\nlimited number of samples, cover insufficient varieties of fraud patterns, and\nseldom include alterations in critical personal identifying fields like\nportrait images, limiting their utility in training models capable of detecting\nrealistic frauds while preserving privacy.\n  In response to these shortcomings, our research introduces a new benchmark\ndataset, IDNet, designed to advance privacy-preserving fraud detection efforts.\nThe IDNet dataset comprises 837,060 images of synthetically generated identity\ndocuments, totaling approximately 490 gigabytes, categorized into 20 types from\n$10$ U.S. states and 10 European countries. We evaluate the utility and present\nuse cases of the dataset, illustrating how it can aid in training\nprivacy-preserving fraud detection methods, facilitating the generation of\ncamera and video capturing of identity documents, and testing schema\nunification and other identity document management functionalities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BR38KvCdw6bZ243zzLuR6TBMCs7zESjjF6HQVpeq0JM","pdfSize":"43772254","txDigest":"HQthVc49Dye79iYDQjd1trMGnG57hqk16Jqp3AFd4nFc","endEpoch":"1","status":"CERTIFIED"}
