{"id":"2408.03962","title":"Investigation of thermal properties of Hulth\\'{e}n potential from\n  statistical and superstatistical perspectives with various distributions","authors":"Amir Hossein Khorram manesh, J. Sadeghi, Saeed Noori Gashti","authorsParsed":[["manesh","Amir Hossein Khorram",""],["Sadeghi","J.",""],["Gashti","Saeed Noori",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:22:45 GMT"}],"updateDate":"2024-09-11","timestamp":1722507765000,"abstract":"  The Hulth\\'{e}n potential is a short-range potential that has been widely\nused in various fields of physics. In this paper, we investigate the\ndistribution functions for the Hulth\\'{e}n potential by using statistical and\nsuperstatistical methods. We first review the ordinary statistics and\nsuperstatistics methods. We then consider some distribution functions, such as\nuniform, 2-level, gamma, and log-normal and F distributions. Finally, we\ninvestigate the behavior of the Hulth\\'{e}n potential for statistical and\nsuperstatistical methods and compare the results with each other. We use the\nTsallis statistics of the superstatistical system. We conclude that the Tsallis\nbehavior of different distribution functions for the Hulth\\'{e}n potential\nexhibits better results than the statistical method. We examined the thermal\nproperties of the Hulth\\'{e}n potential for five different distributions:\nUniform, 2-level, Gamma, Log-normal, and F. We plotted the Helmholtz free\nenergy and the entropy as functions of temperature for various values of q. It\nshows that the two uniform and 2-level distributions have the same results due\nto the universal relationship and that the F distribution does not become\nordinary statistics at q=1. It also reveals that the curves of the Helmholtz\nfree energy and the entropy change their order and behavior as q increases and\nthat some distributions disappear or coincide at certain values of q. One can\ndiscuss the physical implications of our results and their applications in\nnuclear and atomic physics in the future.\n","subjects":["Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SETjLXOHHpYgC-iEo1n3Vc3e5yw_2IHtSejL8DxLi1Y","pdfSize":"512985"}
