{"id":"2408.05415","title":"Double-eigenvalue bifurcation and multistability in serpentine strips\n  with tunable buckling behaviors","authors":"Qiyao Shi, Weicheng Huang, Tian Yu, Mingwu Li","authorsParsed":[["Shi","Qiyao",""],["Huang","Weicheng",""],["Yu","Tian",""],["Li","Mingwu",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 02:54:07 GMT"}],"updateDate":"2024-08-13","timestamp":1723258447000,"abstract":"  Serpentine structures, composed of straight and circular strips, have\ngarnered significant attention as potential designs for flexible electronics\ndue to their remarkable stretchability. When subjected to stretching, these\nserpentine strips buckle out of plane, and previous studies have identified two\ndistinct buckling modes whose order of appearance may interchange in serpentine\nstructures with a single cell. In this study, we employ anisotropic rod theory\nto model serpentine strips as a multi-segment boundary value problem (BVP),\nwith continuity conditions enforced at the interface between the straight and\ncurved strips. We solve the BVP using methods of continuation, and our results\nreveal that: 1) the exchange of the two buckling modes in a single-cell\nserpentine strip is induced by a double-eigenvalue and associated secondary\nbifurcations, which also alter the stability of the two buckling modes; 2) a\nvariety of stable states with reversible symmetry can be manually obtained in\ntabletop models and are found to be disconnected from the planar branch in\nnumerical continuation. Furthermore, we demonstrate that modulating the strip\nthickness across different cells leads to the initiation of buckling in the\nthinnest section, thereby allowing for the tuning of buckling modes in\nserpentine strips. In structures with two cells, the sequence of the two\nbuckling modes can also be controlled by designing serpentine strips with\nnonuniform height. This work could enhance the mechanical design of\nserpentine-interconnect-based flexible structures and could have applications\nin multistable actuators and mechanical memory devices.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://creativecommons.org/licenses/by/4.0/"}