{"id":"2408.16830","title":"gaspery: Optimized Scheduling of Radial Velocity Follow-Up Observations\n  for Active Host Stars","authors":"Christopher Lam, Megan Bedell, Lily L. Zhao, Arvind F. Gupta, and\n  Sarah A. Ballard","authorsParsed":[["Lam","Christopher",""],["Bedell","Megan",""],["Zhao","Lily L.",""],["Gupta","Arvind F.",""],["Ballard","Sarah A.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-09-02","timestamp":1724954406000,"abstract":"  Radial velocity (RV) follow-up is a critical complement of transiting\nexoplanet surveys like the Transiting Exoplanet Survey Satellite (TESS ), both\nfor validating discoveries of exoplanets and measuring their masses. Stellar\nactivity introduces challenges to interpreting these measurements because the\nnoise from the host star, which is often correlated in time, can result in high\nRV uncertainty. A robust understanding of stellar activity and how its\ntimescales interact with the observing cadence can optimize limited RV\nresources. For this reason, in the era of over-subscribed, high-precision RV\nmeasurements, folding stellar activity timescales into the scheduling of\nobservation campaigns is ideal. We present gaspery, an open-source code\nimplementation to enable the optimization of RV observing strategies. Gaspery\nemploys a generalized formulation of the Fisher Information for RV time series\nthat also incorporates information about stellar correlated noise. We show that\nthe information contained in an observing strategy can be significantly\naffected by beat frequencies between the orbital period of the planet, the\nstellar rotation period, and the observation epochs. We investigate how the\nfollow-up observing strategy will affect the resulting radial velocity\nuncertainty, as a function of stellar properties such as the spot decay\ntimescale and rotation period. We then describe two example use cases for\ngaspery: 1) calculating the minimum number of observations to reach an\nuncertainty tolerance in a correlated noise regime and 2) finding an optimal\nstrategy given a fixed observing budget. Finally, we outline a prescription for\nselecting an observing strategy that is generalizable to different targets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yDUMs8n3_0FliViKjVw9m_0oG0xrTyqq_p-FT9-7YDQ","pdfSize":"2524464"}
