{"id":"2408.15864","title":"FlowAct: A Proactive Multimodal Human-robot Interaction System with\n  Continuous Flow of Perception and Modular Action Sub-systems","authors":"Timoth\\'ee Dhaussy, Bassam Jabaian, Fabrice Lef\\`evre","authorsParsed":[["Dhaussy","Timothée",""],["Jabaian","Bassam",""],["Lefèvre","Fabrice",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:23:08 GMT"}],"updateDate":"2024-08-29","timestamp":1724858588000,"abstract":"  The evolution of autonomous systems in the context of human-robot interaction\nsystems necessitates a synergy between the continuous perception of the\nenvironment and the potential actions to navigate or interact within it. We\npresent Flowact, a proactive multimodal human-robot interaction architecture,\nworking as an asynchronous endless loop of robot sensors into actuators and\norganized by two controllers, the Environment State Tracking (EST) and the\nAction Planner. The EST continuously collects and publishes a representation of\nthe operative environment, ensuring a steady flow of perceptual data. This\npersistent perceptual flow is pivotal for our advanced Action Planner which\norchestrates a collection of modular action subsystems, such as movement and\nspeaking modules, governing their initiation or cessation based on the evolving\nenvironmental narrative. The EST employs a fusion of diverse sensory modalities\nto build a rich, real-time representation of the environment that is\ndistributed to the Action Planner. This planner uses a decision-making\nframework to dynamically coordinate action modules, allowing them to respond\nproactively and coherently to changes in the environment. Through a series of\nreal-world experiments, we exhibit the efficacy of the system in maintaining a\ncontinuous perception-action loop, substantially enhancing the responsiveness\nand adaptability of autonomous pro-active agents. The modular architecture of\nthe action subsystems facilitates easy extensibility and adaptability to a\nbroad spectrum of tasks and scenarios.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}