{"id":"2408.09426","title":"A Robust Algorithm for Contactless Fingerprint Enhancement and Matching","authors":"Mahrukh Siddiqui, Shahzaib Iqbal, Bandar AlShammari, Bandar Alhaqbani,\n  Tariq M. Khan, Imran Razzak","authorsParsed":[["Siddiqui","Mahrukh",""],["Iqbal","Shahzaib",""],["AlShammari","Bandar",""],["Alhaqbani","Bandar",""],["Khan","Tariq M.",""],["Razzak","Imran",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 10:01:42 GMT"}],"updateDate":"2024-08-20","timestamp":1723975302000,"abstract":"  Compared to contact fingerprint images, contactless fingerprint images\nexhibit four distinct characteristics: (1) they contain less noise; (2) they\nhave fewer discontinuities in ridge patterns; (3) the ridge-valley pattern is\nless distinct; and (4) they pose an interoperability problem, as they lack the\nelastic deformation caused by pressing the finger against the capture device.\nThese properties present significant challenges for the enhancement of\ncontactless fingerprint images. In this study, we propose a novel contactless\nfingerprint identification solution that enhances the accuracy of minutiae\ndetection through improved frequency estimation and a new region-quality-based\nminutia extraction algorithm. In addition, we introduce an efficient and highly\naccurate minutiae-based encoding and matching algorithm. We validate the\neffectiveness of our approach through extensive experimental testing. Our\nmethod achieves a minimum Equal Error Rate (EER) of 2.84\\% on the PolyU\ncontactless fingerprint dataset, demonstrating its superior performance\ncompared to existing state-of-the-art techniques. The proposed fingerprint\nidentification method exhibits notable precision and resilience, proving to be\nan effective and feasible solution for contactless fingerprint-based\nidentification systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XG3Nmcya-bd8Hd9jixMvffrHbPF1ApWwMY2m5kOWASU","pdfSize":"856731"}
