{"id":"2408.01980","title":"Measurement Induced Magic Resources","authors":"Gongchu Li, Lei Chen, Si-Qi Zhang, Xu-Song Hong, Huaqing Xu, Yuancheng\n  Liu, You Zhou, Geng Chen, Chuan-Feng Li, Alioscia Hamma, Guang-Can Guo","authorsParsed":[["Li","Gongchu",""],["Chen","Lei",""],["Zhang","Si-Qi",""],["Hong","Xu-Song",""],["Xu","Huaqing",""],["Liu","Yuancheng",""],["Zhou","You",""],["Chen","Geng",""],["Li","Chuan-Feng",""],["Hamma","Alioscia",""],["Guo","Guang-Can",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:57:33 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 17:48:04 GMT"},{"version":"v3","created":"Thu, 29 Aug 2024 05:53:10 GMT"}],"updateDate":"2024-08-30","timestamp":1722765453000,"abstract":"  Magic states and magic gates are crucial for achieving universal computation,\nbut some important questions about how magic resources should be implemented to\nattain quantum advantage have remained unexplored, for instance, in the context\nof Measurement-based Quantum Computation (MQC) with only single-qubit\nmeasurements. This work bridges the gap between MQC and the resource theory of\nmagic by introducing the concept of ``invested'' and ``potential\" magic\nresources. The former quantifies the magic cost associated with the MQC\nframework, serving both as a witness of magic resources and an upper bound for\nthe realization of a desired unitary transformation. Potential magic resources\nrepresent the maximum achievable magic resource in a given graph structure\ndefining the MQC. We utilize these concepts to analyze the magic resource\nrequirements of the Quantum Fourier Transform (QFT) and provide a fresh\nperspective on the universality of MQC of different resource states,\nhighlighting the crucial role of non-Pauli measurements for injecting magic. We\ndemonstrate experimentally our theoretical predictions in a high-fidelity\nfour-photon setup and demonstrate the efficiency of MQC in generating magic\nstates, surpassing the limitations of conventional magic state injection\nmethods. Our findings pave the way for future research exploring magic resource\noptimization and novel distillation schemes within the MQC framework,\ncontributing to the advancement of fault-tolerant universal quantum\ncomputation.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}