{"id":"2408.07261","title":"Numerical analysis of a class of penalty discontinuous Galerkin methods\n  for nonlocal diffusion problems","authors":"Qiang Du, Lili Ju, Jianfang Lu, and Xiaochuan Tian","authorsParsed":[["Du","Qiang",""],["Ju","Lili",""],["Lu","Jianfang",""],["Tian","Xiaochuan",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 02:48:59 GMT"}],"updateDate":"2024-08-15","timestamp":1723603739000,"abstract":"  In this paper, we consider a class of discontinuous Galerkin (DG) methods for\none-dimensional nonlocal diffusion (ND) problems. The nonlocal models, which\nare integral equations, are widely used in describing many physical phenomena\nwith long-range interactions. The ND problem is the nonlocal analog of the\nclassic diffusion problem, and as the interaction radius (horizon) vanishes,\nthen the nonlocality disappears and the ND problem converges to the classic\ndiffusion problem. Under certain conditions, the exact solution to the ND\nproblem may exhibit discontinuities, setting it apart from the classic\ndiffusion problem. Since the DG method shows its great advantages in resolving\nproblems with discontinuities in computational fluid dynamics over the past\nseveral decades, it is natural to adopt the DG method to compute the ND\nproblems. Based on [Du-Ju-Lu-Tian-CAMC2020], we develop the DG methods with\ndifferent penalty terms, ensuring that the proposed DG methods have local\ncounterparts as the horizon vanishes. This indicates the proposed methods will\nconverge to the existing DG schemes as the horizon vanishes, which is crucial\nfor achieving asymptotic compatibility. Rigorous proofs are provided to\ndemonstrate the stability, error estimates, and asymptotic compatibility of the\nproposed DG schemes. To observe the effect of the nonlocal diffusion, we also\nconsider the time-dependent convection-diffusion problems with nonlocal\ndiffusion. We conduct several numerical experiments, including accuracy tests\nand Burgers' equation with nonlocal diffusion, and various horizons are taken\nto show the good performance of the proposed algorithm and validate the\ntheoretical findings.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}