{"id":"2408.02878","title":"Ultrahigh-speed thin-film lithium niobate optical coherent receiver","authors":"Xiaojun Xie, Chao Wei, Xingchen He, Yake Chen, Chenghao Wang, Jihui\n  Sun, Lin Jiang, Jia Ye, Xihua Zou, Wei Pan, and Lianshan Yan","authorsParsed":[["Xie","Xiaojun",""],["Wei","Chao",""],["He","Xingchen",""],["Chen","Yake",""],["Wang","Chenghao",""],["Sun","Jihui",""],["Jiang","Lin",""],["Ye","Jia",""],["Zou","Xihua",""],["Pan","Wei",""],["Yan","Lianshan",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 01:07:50 GMT"}],"updateDate":"2024-08-07","timestamp":1722906470000,"abstract":"  The rapid advancement of the thin-film lithium niobate platform has\nestablished it as a premier choice for high-performance photonics integration.\nHigh-speed optical coherent receivers are essential for supporting the large\ncommunication capacities required by data center interconnects. Although\nhigh-speed photodiodes have been demonstrated on the thin-film LiNbO3 platform,\nthe development of an ultrahigh-speed optical coherent receiver on this\nplatform has not yet been realized. Here, we propose and experimentally\ndemonstrate an ultra-wideband PD and ultrahigh-speed optical coherent receiver\non an InP-LiNbO3 wafer-level heterogeneous integration platform. The fabricated\nsingle PD exhibits a record-high bandwidth of 140 GHz and successfully receives\na high-quality 100-Gbaud pulse amplitude modulation (PAM4) signal. Furthermore,\na thin-film LiNbO3 optical coherent receiver, featuring a large balanced\ndetection bandwidth of 60 GHz, a large common mode rejection ratio (CMRR)\nexceeding 20 dB, and a low energy consumption of 9.6 fJ per bit, enables an\nultrahigh-speed coherent reception with advanced modulation formats. The\nsingle-polarization I-Q coherent receiver, incorporating a compact 2x4 90\noptical hybrid and a balanced photodetector array, achieves a receiving\ncapacity of 600 Gbps per channel with 100-Gbaud 64 quadrature amplitude\nmodulation (QAM) signal and 512 Gbps per channel with 128-Gbaud 16 QAM signal.\nAdditionally, we demonstrate a long-distance reception of 100 Gbaud quadrature\nphase-shift keying (QPSK) and 16 QAM signals over transmission distances of\n1040 km and 25 km. A seven-channel single-polarization I-Q coherent receiving\nchip achieves a total receiving capacity of 3.584 Tbps. This\nheterogeneous-integrated thin-film LiNbO3 optical coherent receiver shows the\npotential for Pbps-scale applications in future hyperscale data center\ninterconnects.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}