{"id":"2408.03260","title":"Employing Vector Field Techniques on the Analysis of Memristor Cellular\n  Nonlinear Networks Cell Dynamics","authors":"Chandan Singh, Vasileios Ntinas, Dimitrios Prousalis, Yongmin Wang,\n  Ahmet Samil Demirkol, Ioannis Messaris, Vikas Rana, Stephan Menzel, Alon\n  Ascoli, Ronald Tetzlaff","authorsParsed":[["Singh","Chandan",""],["Ntinas","Vasileios",""],["Prousalis","Dimitrios",""],["Wang","Yongmin",""],["Demirkol","Ahmet Samil",""],["Messaris","Ioannis",""],["Rana","Vikas",""],["Menzel","Stephan",""],["Ascoli","Alon",""],["Tetzlaff","Ronald",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 15:50:57 GMT"}],"updateDate":"2024-08-07","timestamp":1722959457000,"abstract":"  This paper introduces an innovative graphical analysis tool for investigating\nthe dynamics of Memristor Cellular Nonlinear Networks (M-CNNs) featuring\n2nd-order processing elements, known as M-CNN cells. In the era of specialized\nhardware catering to the demands of intelligent autonomous systems, the\nintegration of memristors within Cellular Nonlinear Networks (CNNs) has emerged\nas a promising paradigm due to their exceptional characteristics. However, the\nstandard Dynamic Route Map (DRM) analysis, applicable to 1st-order systems,\nfails to address the intricacies of 2nd-order M-CNN cell dynamics, as well the\n2nd-order DRM (DRM2) exhibits limitations on the graphical illustration of\nlocal dynamical properties of the M-CNN cells, e.g. state derivative's\nmagnitude. To address this limitation, we propose a novel integration of M-CNN\ncell vector field into the cell's phase portrait, enhancing the analysis\nefficacy and enabling efficient M-CNN cell design. A comprehensive exploration\nof M-CNN cell dynamics is presented, showcasing the utility of the proposed\ngraphical tool for various scenarios, including bistable and monostable\nbehavior, and demonstrating its superior ability to reveal subtle variations in\ncell behavior. Through this work, we offer a refined perspective on the\nanalysis and design of M-CNNs, paving the way for advanced applications in edge\ncomputing and specialized hardware.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}