{"id":"2408.00919","title":"Proposal for unambiguous measurement of braid statistics in fractional\n  quantum Hall effect","authors":"Mytraya Gattu, G.J. Sreejith and J. K. Jain","authorsParsed":[["Gattu","Mytraya",""],["Sreejith","G. J.",""],["Jain","J. K.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 21:19:42 GMT"}],"updateDate":"2024-08-05","timestamp":1722547182000,"abstract":"  The quasiparticles (QPs) or quasiholes (QHs) of fractional quantum Hall\nstates have been predicted to obey fractional braid statistics, which refers to\nthe Berry phase (in addition to the usual Aharonov-Bohm phase) associated with\nan exchange of two QPs or two QHs, or equivalently, to half of the phase\nassociated with a QP / QH going around another. Certain phase slips in\ninterference experiments in the fractional quantum Hall regime have been\ninterpreted as arising from the statistics associated with a QP moving along\nthe edge of the sample around another QP in the interior. A conceptual\ndifficulty with this interpretation is that the edge, being compressible, does\nnot support a QP or a QH with a sharply quantized fractional charge or\nfractional statistics. We analyze the experiment in terms of composite fermions\n(CFs) obeying integral braid statistics and suggest that the observed phase\nslips can be naturally understood as a measure of the relative braid statistics\nof a CF in the ground state at the edge and a fractionally charged QP / QH in\nthe interior; in contrast to fractionally charged excitations, the CFs are\nknown to remain sharply defined even in compressible regions such as the edge\nor the CF Fermi liquid state at half filled Landau level. We further propose\nthat transport through a closed $\\textit{tunneling}$ loop confined entirely in\nthe bulk can, in principle, allow an unambiguous measurement of the relative\nbraid statistics of a fractionally charged QP / QH braiding around another\nfractionally charged QP / QH. Optimal parameters for this experimental geometry\nare determined from quantitative calculations.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zQxnOc9uWEW5QCb4C2QDpS_rXq0H8snFohX1A-_uBz8","pdfSize":"8966708","txDigest":"CpcNRd9Jsedj1CZxjZEvERzTC5gQkvUnP45D2JijXQqK","endEpoch":"1","status":"CERTIFIED"}
