{"id":"2408.13803","title":"Gravitational Waves from High Temperature Strings","authors":"Andrew R. Frey, Ratul Mahanta, Anshuman Maharana, Fernando Quevedo,\n  Gonzalo Villa","authorsParsed":[["Frey","Andrew R.",""],["Mahanta","Ratul",""],["Maharana","Anshuman",""],["Quevedo","Fernando",""],["Villa","Gonzalo",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 10:50:14 GMT"},{"version":"v2","created":"Mon, 16 Sep 2024 09:43:33 GMT"}],"updateDate":"2024-09-18","timestamp":1724583014000,"abstract":"  We study finite temperature effects in string cosmology and their potential\ngravitational wave signature. Expanding on our recent work arXiv:2310.11494 ,\nwe consider a general configuration of highly excited open and closed strings\nat high enough temperature to be in the Hagedorn phase in 3+1 dimensions, in\norder to explore its cosmological implications. We find conditions, which can\nbe satisfied in compactifications with moduli stabilization, that allow the\nlong strings to remain in equilibrium in a controlled effective field theory,\nwith equilibration driven by the joining and splitting of the dominant open\nstring population. We calculate the emission rate of gravitons by long open\nstrings, which we show is determined by ten dimensional flat space transition\namplitudes available in the literature, and then find the total gravitational\nwave spectrum generated by the gas of long strings. The gravitational wave\nspectrum has robust characteristics. It peaks at frequencies of order 50-100\nGHz, the same as for gravitational waves from the reheating epoch of the\nStandard Model. But the amplitude of the string signal is significantly larger\nthan predicted by the Standard Model and its field theoretic extensions. The\namplitude and other physical observables (such as the contribution to $\\Delta\nN_{\\text eff}$) are directly proportional to the string scale $M_s$; indicating\nthat a potential signal may also determine the string scale. Our calculations\nprovide one of the few examples of a signal of stringy origin that dominates\nover the field theory predictions. We give a physical explanation of our\nresults and discuss further implications.\n","subjects":["Physics/High Energy Physics - Theory","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}