{"id":"2408.12233","title":"Gas dynamics around a Jupiter-mass planet I. Influence of protoplanetary\n  disk properties","authors":"E. Lega, M. Benisty, A. Cridland, A. Morbidelli, M. Schulik and M.\n  Lambrechts","authorsParsed":[["Lega","E.",""],["Benisty","M.",""],["Cridland","A.",""],["Morbidelli","A.",""],["Schulik","M.",""],["Lambrechts","M.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:08:55 GMT"}],"updateDate":"2024-08-23","timestamp":1724317735000,"abstract":"  Giant planets grow and acquire their gas envelope during the disk phase. At\nthe time of the discovery of giant planets in their host disk, it is important\nto understand the interplay between the host disk and the envelope and\ncircum-planetary disk properties of the planet. Our aim is to investigate the\ndynamical and physical structure of the gas in the vicinity of a Jupiter-mass\nplanet and study how protoplanetary disk propertiesy, determine the planetary\nsystem as well as the accretion rate inside the planet's Hill sphere.We ran\nglobal 3D simulations with the grid-based code fargOCA, using a fully radiative\nequation of state and a dust-to-gas ratio of 0.01. We explored three models.\nThe nominal one features a disk with surface density, Sigma, corresponding to\nthe MMSN at the planet's location, characterised by an alpha viscosity value of\n0.004. The second model has a surface density ten times smaller than the\nnominal one and the same viscosity. In the third model, we also reduced the\nviscosity value by a factor of 10. During gap formation gas is heated by\ncompression and cools according to opacity, density, and temperature values. In\nthe analysis of our disks, we find that the gas flowing into the Hill sphere is\napproximately scaled as the product Sigma nu , as expected from viscous\ntransport while The accretion rate is scaled as sqrt(Sigma nu ).Previous\nstudies have shown that pressure or rotationally supported structures are\nformed around giant planets, depending on the equation of state (EoS) or on the\nopacity. In the case of a fully radiative EoS and a constant dust to gas ratio\nof 0.01, we find that low-mass and low-viscosity circum-stellar disks favour\nthe formation of a rotationally supported circum-planetary disk. Gas accretion\nleading to the doubling time of the planetary system >10^5 years has only been\nfound in the case of a low-viscosity disk.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}