{"id":"2408.15089","title":"SiHGNN: Leveraging Properties of Semantic Graphs for Efficient HGNN\n  Acceleration","authors":"Runzhen Xue, Mingyu Yan, Dengke Han, Zhimin Tang, Xiaochun Ye and\n  Dongrui Fan","authorsParsed":[["Xue","Runzhen",""],["Yan","Mingyu",""],["Han","Dengke",""],["Tang","Zhimin",""],["Ye","Xiaochun",""],["Fan","Dongrui",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:20:21 GMT"}],"updateDate":"2024-08-28","timestamp":1724768421000,"abstract":"  Heterogeneous Graph Neural Networks (HGNNs) have expanded graph\nrepresentation learning to heterogeneous graph fields. Recent studies have\ndemonstrated their superior performance across various applications, including\nmedical analysis and recommendation systems, often surpassing existing methods.\nHowever, GPUs often experience inefficiencies when executing HGNNs due to their\nunique and complex execution patterns. Compared to traditional Graph Neural\nNetworks, these patterns further exacerbate irregularities in memory access. To\ntackle these challenges, recent studies have focused on developing\ndomain-specific accelerators for HGNNs. Nonetheless, most of these efforts have\nconcentrated on optimizing the datapath or scheduling data accesses, while\nlargely overlooking the potential benefits that could be gained from leveraging\nthe inherent properties of the semantic graph, such as its topology, layout,\nand generation.\n  In this work, we focus on leveraging the properties of semantic graphs to\nenhance HGNN performance. First, we analyze the Semantic Graph Build (SGB)\nstage and identify significant opportunities for data reuse during semantic\ngraph generation. Next, we uncover the phenomenon of buffer thrashing during\nthe Graph Feature Processing (GFP) stage, revealing potential optimization\nopportunities in semantic graph layout. Furthermore, we propose a lightweight\nhardware accelerator frontend for HGNNs, called SiHGNN. This accelerator\nfrontend incorporates a tree-based Semantic Graph Builder for efficient\nsemantic graph generation and features a novel Graph Restructurer for\noptimizing semantic graph layouts. Experimental results show that SiHGNN\nenables the state-of-the-art HGNN accelerator to achieve an average performance\nimprovement of 2.95$\\times$.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}