{"id":"2408.13076","title":"The rates and host galaxies of pair-instability supernovae through\n  cosmic time: Predictions from BPASS and IllustrisTNG","authors":"Max M. Briel, Benjamin Metha, Jan J. Eldridge, Takashi J. Moriya,\n  Michele Trenti","authorsParsed":[["Briel","Max M.",""],["Metha","Benjamin",""],["Eldridge","Jan J.",""],["Moriya","Takashi J.",""],["Trenti","Michele",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:59:50 GMT"}],"updateDate":"2024-08-26","timestamp":1724421590000,"abstract":"  Pair-instability supernovae (PISNe) have long been predicted to be the final\nfates of near-zero-metallicity very massive stars ($Z < Z_\\odot/3$,\n$\\mathrm{M}_\\mathrm{ZAMS} \\gtrsim 140 \\mathrm{M}_\\odot$). However, no definite\nPISN has been observed to date, leaving theoretical modelling validation open.\nTo investigate the observability of these explosive transients, we combine\ndetailed stellar evolution models for PISNe formation, computed from the Binary\nPopulation and Spectral Synthesis code suite, BPASS, with the star formation\nhistory of all individual computational elements in the Illustris-TNG\nsimulation. This allows us to compute comic PISN rates and predict their host\ngalaxy properties. Of particular importance is that IllustrisTNG galaxies do\nnot have uniform metallicities throughout, with metal-enriched galaxies often\nharbouring metal-poor pockets of gas where PISN progenitors may form.\nAccounting for the chemical inhomogeneities within these galaxies, we find that\nthe peak redshift of PISNe formation is $z=3.5$ instead of the value of $z=6$\nwhen ignoring chemical inhomogeneities within galaxies. Furthermore, the rate\nincreases by an order of magnitude from 1.9 to 29 PISN Gpc$^{-3}$ yr$^{-1}$ at\n$z=0$, if the chemical inhomogeneities are considered. Using state-of-the-art\ntheoretical PISN light curves, we find an observed rate of $13.8$ (1.2) visible\nPISNe per year for the Euclid-Deep survey, or $83$ (7.3) over the six-year\nlifetime of the mission when considering chemically inhomogeneous (homogenous)\nsystems. Interestingly, only 12 per cent of helium PISN progenitors are\nsufficiently massive to power a super-luminous supernova event, which can\npotentially explain why PISN identification in time-domain surveys remains\nelusive and progress requires dedicated strategies.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}