{"id":"2408.11960","title":"Application of Convolutional Neural Networks to time domain\n  astrophysics. 2D image analysis of OGLE light curves","authors":"N. Monsalves, M. Jaque Arancibia, A. Bayo, P. S\\'anchez-S\\'aez, R.\n  Angeloni, G Damke, J. Segura Van de Perre","authorsParsed":[["Monsalves","N.",""],["Arancibia","M. Jaque",""],["Bayo","A.",""],["Sánchez-Sáez","P.",""],["Angeloni","R.",""],["Damke","G",""],["Van de Perre","J. Segura",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:27:12 GMT"}],"updateDate":"2024-08-23","timestamp":1724268432000,"abstract":"  In recent years the amount of publicly available astronomical data has\nincreased exponentially, with a remarkable example being large scale multiepoch\nphotometric surveys. This wealth of data poses challenges to the classical\nmethodologies commonly employed in the study of variable objects. As a\nresponse, deep learning techniques are increasingly being explored to\neffectively classify, analyze, and interpret these large datasets. In this\npaper we use two-dimensional histograms to represent Optical Gravitational\nLensing Experiment (OGLE) phasefolded light curves as images. We use a\nConvolutional Neural Network (CNN) to classify variable objects within eight\ndifferent categories (from now on labels): Classical Cepheid (CEP), RR Lyrae\n(RR), Long Period Variable (LPV), Miras (M), Ellipsoidal Binary (ELL), Delta\nScuti (DST), Eclipsing Binary (E), and spurious class with Incorrect Periods\n(Rndm). We set up different training sets to train the same CNN architecture in\norder to characterize the impact of the training. The training sets were built\nfrom the same source of labels but different filters and balancing techniques\nwere applied. Namely: Undersampling (U), Data Augmentation (DA), and Batch\nBalancing (BB). The best performance was achieved with the BB approach and a\ntraining sample size of $\\sim$370000 stars. Regarding computational\nperformance, the image representation production rate is of $\\sim$76 images per\ncore per second, and the time to predict is $\\sim$ 60$\\, \\mu\\text{s}$ per star.\nThe accuracy of the classification improves from $\\sim$ 92%, when based only on\nthe CNN, to $\\sim$ 98% when the results of the CNN are combined with the period\nand amplitude features in a two step approach. This methodology achieves\ncomparable results with previous studies but with two main advantages: the\nidentification of miscalculated periods and the improvement in computational\ntime cost.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pk5cDz35AvWe4ye1cpbEPO2ditP_eHDUIS8Sz6me5cg","pdfSize":"767048"}
