{"id":"2408.07121","title":"Quiet Please: Detrending Radial Velocity Variations from Stellar\n  Activity with a Physically Motivated Spot Model","authors":"Jared C. Siegel, Samuel Halverson, Jacob K. Luhn, Lily L. Zhao, Khaled\n  Al Moulla, Paul Robertson, Chad F. Bender, Ryan C. Terrien, Arpita Roy,\n  Suvrath Mahadevan, Fred Hearty, Joe P. Ninan, Jason T. Wright, Eric B. Ford,\n  Christian Schwab, Gu{\\dh}mundur Stef\\'ansson, Cullen H. Blake, Michael W.\n  McElwain","authorsParsed":[["Siegel","Jared C.",""],["Halverson","Samuel",""],["Luhn","Jacob K.",""],["Zhao","Lily L.",""],["Moulla","Khaled Al",""],["Robertson","Paul",""],["Bender","Chad F.",""],["Terrien","Ryan C.",""],["Roy","Arpita",""],["Mahadevan","Suvrath",""],["Hearty","Fred",""],["Ninan","Joe P.",""],["Wright","Jason T.",""],["Ford","Eric B.",""],["Schwab","Christian",""],["Stefánsson","Guðmundur",""],["Blake","Cullen H.",""],["McElwain","Michael W.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-15","timestamp":1723572001000,"abstract":"  For solar-type stars, spots and their associated magnetic regions induce\nradial velocity perturbations through the Doppler rotation signal and the\nsuppression of convective blueshift -- collectively known as\nrotation-modulation. We developed the Rotation-Convection (RC) model: a method\nof detrending and characterizing rotation-modulation, using only\ncross-correlation functions or 1-dimensional spectra, without the need for\ncontinuous high cadence measurements. The RC method uses a simple model for the\nanomalous radial velocity induced by an active region and has two inputs:\nstellar flux (or a flux proxy) and the relative radial velocity between\nstrongly and weakly absorbed wavelengths (analogous to the bisector-inverse\nslope). On NEID solar data (three month baseline), the RC model lowers the\namplitude of rotationally-modulated stellar activity to below the\nmeter-per-second level. For the standard star HD 26965, the RC model detrends\nthe activity signal to the meter-per-second level for HARPS, EXPRES, and NEID\nobservations, even though the temporal density and timespan of the observations\ndiffers by an order of magnitude between the three datasets. In addition to\ndetrending, the RC model also characterizes the rotation-modulation signal.\nFrom comparison with the Solar Dynamics Observatory, we confirmed that the\nmodel accurately recovers and separates the rotation and convection radial\nvelocity components. We also mapped the amplitude of the rotation and\nconvection perturbations as a function of height within the stellar atmosphere.\nProbing stellar atmospheres with our revised spot model will fuel future\ninnovations in stellar activity mitigation, enabling robust exoplanet\ndetection.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"EJdZtQpZWVzKqnPRv0wjIgug-gd0hAJTl1mFWQGkh4M","pdfSize":"1396604"}
