{"id":"2408.16833","title":"Secure Integration of 5G in Industrial Networks: State of the Art,\n  Challenges and Opportunities","authors":"Sotiris Michaelides and Thomas Vogt and Martin Henze","authorsParsed":[["Michaelides","Sotiris",""],["Vogt","Thomas",""],["Henze","Martin",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:00:17 GMT"}],"updateDate":"2024-09-02","timestamp":1724954417000,"abstract":"  The industrial landscape is undergoing a significant transformation, moving\naway from traditional wired fieldbus networks to cutting-edge 5G mobile\nnetworks. This transition, extending from local applications to company-wide\nuse and spanning multiple factories, is driven by the promise of low-latency\ncommunication and seamless connectivity for various devices in industrial\nsettings. However, besides these tremendous benefits, the integration of 5G as\nthe communication infrastructure in industrial networks introduces a new set of\nrisks and threats to the security of industrial systems. The inherent\ncomplexity of 5G systems poses unique challenges for ensuring a secure\nintegration, surpassing those encountered with any technology previously\nutilized in industrial networks. Most importantly, the distinct characteristics\nof industrial networks, such as real-time operation, required safety\nguarantees, and high availability requirements, further complicate this task.\nAs the industrial transition from wired to wireless networks is a relatively\nnew concept, a lack of guidance and recommendations on securely integrating 5G\nrenders many industrial systems vulnerable and exposed to threats associated\nwith 5G. To address this situation, in this paper, we summarize the\nstate-of-the-art and derive a set of recommendations for the secure integration\nof 5G into industrial networks based on a thorough analysis of the research\nlandscape. Furthermore, we identify opportunities to utilize 5G to further\nenhance security and indicate remaining challenges, potentially identifying\nfuture academic potential\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}