{"id":"2408.12223","title":"The SAMI Galaxy Survey: On the importance of applying multiple selection\n  criteria for finding Milky Way Analogues","authors":"Sujeeporn Tuntipong, Jesse van de Sande, Scott M. Croom, Stefania\n  Barsanti, Joss Bland-Hawthorn, Sarah Brough, Julia J. Bryant, Sarah Casura,\n  Amelia Fraser-McKelvie, Jon S. Lawrence, Andrei Ristea, Sarah M. Sweet and\n  Tayyaba Zafar","authorsParsed":[["Tuntipong","Sujeeporn",""],["van de Sande","Jesse",""],["Croom","Scott M.",""],["Barsanti","Stefania",""],["Bland-Hawthorn","Joss",""],["Brough","Sarah",""],["Bryant","Julia J.",""],["Casura","Sarah",""],["Fraser-McKelvie","Amelia",""],["Lawrence","Jon S.",""],["Ristea","Andrei",""],["Sweet","Sarah M.",""],["Zafar","Tayyaba",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:49:51 GMT"}],"updateDate":"2024-08-23","timestamp":1724316591000,"abstract":"  Milky Way Analogues (MWAs) provide an alternative insight into the various\npathways that lead to the formation of disk galaxies with similar properties to\nthe Milky Way. In this study, we explore different selection techniques for\nidentifying MWAs in the SAMI Galaxy Survey. We utilise a nearest neighbours\nmethod to define MWAs using four selection parameters including stellar mass\n($M_{\\star}$), star formation rate ($SFR$), bulge-to-total ratio ($B/T$) and\ndisk effective radius ($R_{\\rm{e}}$). Based on 15 different selection\ncombinations, we find that including $M_{\\star}$ and SFR is essential for\nminimising biases in the average MWA properties as compared to the Milky Way.\nFurthermore, given the Milky Way's smaller-than-average size, selection\ncombinations without $R_{\\rm{e}}$ result in MWAs being too large. Lastly, we\nfind that $B/T$ is the least important parameter out of the four tested\nparameters. Using all four selection criteria, we define the top 10 most Milky\nWay-like galaxies in the GAMA and Cluster regions of the SAMI survey. These\nmost Milky-Way-like galaxies are typically barred spirals, with kinematically\ncold rotating disks and reside in a wide range of environments. Surprisingly,\nwe find no significant differences between the MWAs selected from the GAMA and\nCluster regions. Our work highlights the importance of using multiple selection\ncriteria for finding MWAs and also demonstrates potential biases in previous\nMWA studies.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}