{"id":"2408.13926","title":"FedGlu: A personalized federated learning-based glucose forecasting\n  algorithm for improved performance in glycemic excursion regions","authors":"Darpit Dave, Kathan Vyas, Jagadish Kumaran Jayagopal, Alfredo Garcia,\n  Madhav Erraguntla, Mark Lawley","authorsParsed":[["Dave","Darpit",""],["Vyas","Kathan",""],["Jayagopal","Jagadish Kumaran",""],["Garcia","Alfredo",""],["Erraguntla","Madhav",""],["Lawley","Mark",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 19:51:27 GMT"}],"updateDate":"2024-08-27","timestamp":1724615487000,"abstract":"  Continuous glucose monitoring (CGM) devices provide real-time glucose\nmonitoring and timely alerts for glycemic excursions, improving glycemic\ncontrol among patients with diabetes. However, identifying rare events like\nhypoglycemia and hyperglycemia remain challenging due to their infrequency.\nMoreover, limited access to sensitive patient data hampers the development of\nrobust machine learning models. Our objective is to accurately predict glycemic\nexcursions while addressing data privacy concerns. To tackle excursion\nprediction, we propose a novel Hypo-Hyper (HH) loss function, which\nsignificantly improves performance in the glycemic excursion regions. The HH\nloss function demonstrates a 46% improvement over mean-squared error (MSE) loss\nacross 125 patients. To address privacy concerns, we propose FedGlu, a machine\nlearning model trained in a federated learning (FL) framework. FL allows\ncollaborative learning without sharing sensitive data by training models\nlocally and sharing only model parameters across other patients. FedGlu\nachieves a 35% superior glycemic excursion detection rate compared to local\nmodels. This improvement translates to enhanced performance in predicting both,\nhypoglycemia and hyperglycemia, for 105 out of 125 patients. These results\nunderscore the effectiveness of the proposed HH loss function in augmenting the\npredictive capabilities of glucose predictions. Moreover, implementing models\nwithin a federated learning framework not only ensures better predictive\ncapabilities but also safeguards sensitive data concurrently.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}