{"id":"2408.06170","title":"Zero-shot 3D Segmentation of Abdominal Organs in CT Scans Using Segment\n  Anything Model 2: Adapting Video Tracking Capabilities for 3D Medical Imaging","authors":"Yosuke Yamagishi, Shouhei Hanaoka, Tomohiro Kikuchi, Takahiro Nakao,\n  Yuta Nakamura, Yukihiro Nomura, Soichiro Miki, Takeharu Yoshikawa, Osamu Abe","authorsParsed":[["Yamagishi","Yosuke",""],["Hanaoka","Shouhei",""],["Kikuchi","Tomohiro",""],["Nakao","Takahiro",""],["Nakamura","Yuta",""],["Nomura","Yukihiro",""],["Miki","Soichiro",""],["Yoshikawa","Takeharu",""],["Abe","Osamu",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:16:10 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 05:53:17 GMT"}],"updateDate":"2024-09-05","timestamp":1723472170000,"abstract":"  Purpose:\n  To evaluate the zero-shot performance of Segment Anything Model 2 (SAM 2) in\n3D segmentation of abdominal organs in CT scans, and to investigate the effects\nof prompt settings on segmentation results.\n  Materials and Methods:\n  Using a subset of the TotalSegmentator CT dataset (n = 123) from eight\ninstitutions, we assessed SAM 2's ability to segment eight abdominal organs.\nSegmentation was initiated from three different z-coordinate levels (caudal,\nmid, and cranial levels) of each organ. Performance was measured using the Dice\nsimilarity coefficient (DSC). We also analyzed the impact of \"negative\nprompts,\" which explicitly exclude certain regions from the segmentation\nprocess, on accuracy. Additionally, we analyzed organ volumes to contextualize\nthe segmentation performance.\n  Results:\n  As a zero-shot approach, larger organs with clear boundaries demonstrated\nhigh segmentation performance, with mean(median) DSCs as follows: liver\n0.821(0.898), left kidney 0.870(0.921), right kidney 0.862(0.935), and spleen\n0.891(0.932). Smaller organs showed lower performance: gallbladder\n0.531(0.590), pancreas 0.361(0.359), and adrenal glands, right 0.203(0.109),\nleft 0.308(0.231). The initial slice for segmentation and the use of negative\nprompts significantly influenced the results. By removing negative prompts from\nthe input, the DSCs significantly decreased for six organs. Moderate positive\ncorrelations were observed between volume sizes and DSCs.\n  Conclusion:\n  SAM 2 demonstrated promising zero-shot performance in segmenting certain\nabdominal organs in CT scans, particularly larger organs with clear boundaries.\nPerformance was significantly influenced by input negative prompts and initial\nslice selection, highlighting the importance of optimizing these factors for\neffective segmentation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}