{"id":"2408.11876","title":"From Glucose Patterns to Health Outcomes: A Generalizable Foundation\n  Model for Continuous Glucose Monitor Data Analysis","authors":"Guy Lutsker, Gal Sapir, Anastasia Godneva, Smadar Shilo, Jerry R\n  Greenfield, Dorit Samocha-Bonet, Shie Mannor, Eli Meirom, Gal Chechik, Hagai\n  Rossman, Eran Segal","authorsParsed":[["Lutsker","Guy",""],["Sapir","Gal",""],["Godneva","Anastasia",""],["Shilo","Smadar",""],["Greenfield","Jerry R",""],["Samocha-Bonet","Dorit",""],["Mannor","Shie",""],["Meirom","Eli",""],["Chechik","Gal",""],["Rossman","Hagai",""],["Segal","Eran",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:19:06 GMT"}],"updateDate":"2024-08-23","timestamp":1724159946000,"abstract":"  Recent advances in self-supervised learning enabled novel medical AI models,\nknown as foundation models (FMs) that offer great potential for characterizing\nhealth from diverse biomedical data. Continuous glucose monitoring (CGM)\nprovides rich, temporal data on glycemic patterns, but its full potential for\npredicting broader health outcomes remains underutilized. Here, we present\nGluFormer, a generative foundation model on biomedical temporal data based on a\ntransformer architecture, and trained on over 10 million CGM measurements from\n10,812 non-diabetic individuals. We tokenized the CGM training data and trained\nGluFormer using next token prediction in a generative, autoregressive manner.\nWe demonstrate that GluFormer generalizes effectively to 15 different external\ndatasets, including 4936 individuals across 5 different geographical regions, 6\ndifferent CGM devices, and several metabolic disorders, including\nnormoglycemic, prediabetic, and diabetic populations, as well as those with\ngestational diabetes and obesity. GluFormer produces embeddings which\noutperform traditional CGM analysis tools, and achieves high Pearson\ncorrelations in predicting clinical parameters such as HbA1c, liver-related\nparameters, blood lipids, and sleep-related indices. Notably, GluFormer can\nalso predict onset of future health outcomes even 4 years in advance. We also\nshow that CGM embeddings from pre-intervention periods in Randomized Clinical\nTrials (RCTs) outperform other methods in predicting primary and secondary\noutcomes. When integrating dietary data into GluFormer, we show that the\nenhanced model can accurately generate CGM data based only on dietary intake\ndata, simulate outcomes of dietary interventions, and predict individual\nresponses to specific foods. Overall, we show that GluFormer accurately\npredicts health outcomes which generalize across different populations\nmetabolic conditions.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}