{"id":"2408.03274","title":"Compress and Compare: Interactively Evaluating Efficiency and Behavior\n  Across ML Model Compression Experiments","authors":"Angie Boggust, Venkatesh Sivaraman, Yannick Assogba, Donghao Ren,\n  Dominik Moritz, Fred Hohman","authorsParsed":[["Boggust","Angie",""],["Sivaraman","Venkatesh",""],["Assogba","Yannick",""],["Ren","Donghao",""],["Moritz","Dominik",""],["Hohman","Fred",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:17:51 GMT"}],"updateDate":"2024-08-07","timestamp":1722961071000,"abstract":"  To deploy machine learning models on-device, practitioners use compression\nalgorithms to shrink and speed up models while maintaining their high-quality\noutput. A critical aspect of compression in practice is model comparison,\nincluding tracking many compression experiments, identifying subtle changes in\nmodel behavior, and negotiating complex accuracy-efficiency trade-offs.\nHowever, existing compression tools poorly support comparison, leading to\ntedious and, sometimes, incomplete analyses spread across disjoint tools. To\nsupport real-world comparative workflows, we develop an interactive visual\nsystem called Compress and Compare. Within a single interface, Compress and\nCompare surfaces promising compression strategies by visualizing provenance\nrelationships between compressed models and reveals compression-induced\nbehavior changes by comparing models' predictions, weights, and activations. We\ndemonstrate how Compress and Compare supports common compression analysis tasks\nthrough two case studies, debugging failed compression on generative language\nmodels and identifying compression artifacts in image classification models. We\nfurther evaluate Compress and Compare in a user study with eight compression\nexperts, illustrating its potential to provide structure to compression\nworkflows, help practitioners build intuition about compression, and encourage\nthorough analysis of compression's effect on model behavior. Through these\nevaluations, we identify compression-specific challenges that future visual\nanalytics tools should consider and Compress and Compare visualizations that\nmay generalize to broader model comparison tasks.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}