{"id":"2408.09106","title":"Fragment-Masked Molecular Optimization","authors":"Kun Li, Xiantao Cai, Jia Wu, Bo Du, Wenbin Hu","authorsParsed":[["Li","Kun",""],["Cai","Xiantao",""],["Wu","Jia",""],["Du","Bo",""],["Hu","Wenbin",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 06:00:58 GMT"}],"updateDate":"2024-08-20","timestamp":1723874458000,"abstract":"  Molecular optimization is a crucial aspect of drug discovery, aimed at\nrefining molecular structures to enhance drug efficacy and minimize side\neffects, ultimately accelerating the overall drug development process. Many\ntarget-based molecular optimization methods have been proposed, significantly\nadvancing drug discovery. These methods primarily on understanding the specific\ndrug target structures or their hypothesized roles in combating diseases.\nHowever, challenges such as a limited number of available targets and a\ndifficulty capturing clear structures hinder innovative drug development. In\ncontrast, phenotypic drug discovery (PDD) does not depend on clear target\nstructures and can identify hits with novel and unbiased polypharmacology\nsignatures. As a result, PDD-based molecular optimization can reduce potential\nsafety risks while optimizing phenotypic activity, thereby increasing the\nlikelihood of clinical success. Therefore, we propose a fragment-masked\nmolecular optimization method based on PDD (FMOP). FMOP employs a\nregression-free diffusion model to conditionally optimize the molecular masked\nregions without training, effectively generating new molecules with similar\nscaffolds. On the large-scale drug response dataset GDSCv2, we optimize the\npotential molecules across all 945 cell lines. The overall experiments\ndemonstrate that the in-silico optimization success rate reaches 94.4%, with an\naverage efficacy increase of 5.3%. Additionally, we conduct extensive ablation\nand visualization experiments, confirming that FMOP is an effective and robust\nmolecular optimization method. The code is available\nat:https://anonymous.4open.science/r/FMOP-98C2.\n","subjects":["Quantitative Biology/Biomolecules","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}