{"id":"2408.11045","title":"Representation Theory of Solitons","authors":"Clay Cordova, Nicholas Holfester, Kantaro Ohmori","authorsParsed":[["Cordova","Clay",""],["Holfester","Nicholas",""],["Ohmori","Kantaro",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:55:06 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 14:46:35 GMT"}],"updateDate":"2024-09-04","timestamp":1724176506000,"abstract":"  Solitons in two-dimensional quantum field theory exhibit patterns of\ndegeneracies and associated selection rules on scattering amplitudes. We\ndevelop a representation theory that captures these intriguing features of\nsolitons. This representation theory is based on an algebra we refer to as the\n\"strip algebra\", $\\textrm{Str}_{\\mathcal{C}}(\\mathcal{M})$, which is defined in\nterms of the non-invertible symmetry, $\\mathcal{C},$ a fusion category, and its\naction on boundary conditions encoded by a module category, $\\mathcal{M}$. The\nstrip algebra is a $C^*$-weak Hopf algebra, a fact which can be elegantly\ndeduced by quantizing the three-dimensional Drinfeld center TQFT,\n$\\mathcal{Z}(\\mathcal{C}),$ on a spatial manifold with corners. These\nstructures imply that the representation category of the strip algebra is also\na unitary fusion category which we identify with a dual category\n$\\mathcal{C}_{\\mathcal{M}}^{*}.$ We present a straightforward method for\nanalyzing these representations in terms of quiver diagrams where nodes are\nvacua and arrows are solitons and provide examples demonstrating how the\nrepresentation theory reproduces known degeneracies and selection rules of\nsoliton scattering. Our analysis provides the general framework for analyzing\nnon-invertible symmetry on manifolds with boundary and applies both to the case\nof boundaries at infinity, relevant to particle physics, and boundaries at\nfinite distance, relevant in conformal field theory or condensed matter\nsystems.\n","subjects":["Physics/High Energy Physics - Theory","Condensed Matter/Strongly Correlated Electrons","Mathematics/Quantum Algebra"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}