{"id":"2408.01924","title":"The Dusty Aftermath of a Rapid Nova: V5579 Sgr","authors":"A. Raj, M. S. Bisht, F. M. Walter, R. Pandey, C. E. Woodward, D. E.\n  Harker, D. Bisht, H. P. Singh, A. Agarwal, J. C. Pandey, A. Joshi, K. Belwal,\n  and Christian Buil","authorsParsed":[["Raj","A.",""],["Bisht","M. S.",""],["Walter","F. M.",""],["Pandey","R.",""],["Woodward","C. E.",""],["Harker","D. E.",""],["Bisht","D.",""],["Singh","H. P.",""],["Agarwal","A.",""],["Pandey","J. C.",""],["Joshi","A.",""],["Belwal","K.",""],["Buil","Christian",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 04:37:42 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 12:53:59 GMT"}],"updateDate":"2024-08-08","timestamp":1722746262000,"abstract":"  V5579 Sgr was a fast nova discovered in 2008 April 18.784 UT. We present the\noptical spectroscopic observations of the nova observed from the Castanet\nTolosan, SMARTS and CTIO observatories spanning over 2008 April 23 to 2015 May\n11. The spectra are dominated by hydrogen Balmer, Fe II and O I lines with\nP-Cygni profiles in the early phase, typical of an Fe II class nova. The\nspectra show He I and He II lines along with forbidden lines from N, Ar, S, and\nO in the nebular phase. The nova showed a pronounced dust formation episode\nthat began about 20 days after the outburst. The dust temperature and mass were\nestimated using the WISE data from spectral energy distribution (SED) fits. The\nPAH-like features are also seen in the nova ejecta in the mid-IR Gemini spectra\ntaken 522 d after the discovery. Analysis of the light curve indicates values\nof t$_2$ and t$_3$ about 9 and 13 days, respectively, placing the nova in the\ncategory of fast nova. The best fit cloudy model of the early decline phase JHK\nspectra obtained on 2008 May 3 and the nebular optical spectrum obtained on\n2011 June 2 shows a hot white dwarf source with T$_{BB}$ $\\sim$ 2.6 $\\times$\n10$^5$ K having a luminosity of 9.8 $\\times$ 10$^{36}$ ergs s$^{-1}$. Our\nabundance analysis shows that the ejecta is significantly enhanced relative to\nsolar, O/H = 32.2, C/H = 15.5 and N/H = 40.0 in the early decline phase and O/H\n= 5.8, He/H = 1.5 and N/H = 22.0 in the nebular phase.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}