{"id":"2408.15802","title":"Visual Prompt Engineering for Medical Vision Language Models in\n  Radiology","authors":"Stefan Denner, Markus Bujotzek, Dimitrios Bounias, David Zimmerer,\n  Raphael Stock, Paul F. J\\\"ager, Klaus Maier-Hein","authorsParsed":[["Denner","Stefan",""],["Bujotzek","Markus",""],["Bounias","Dimitrios",""],["Zimmerer","David",""],["Stock","Raphael",""],["Jäger","Paul F.",""],["Maier-Hein","Klaus",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:53:27 GMT"}],"updateDate":"2024-08-29","timestamp":1724853207000,"abstract":"  Medical image classification in radiology faces significant challenges,\nparticularly in generalizing to unseen pathologies. In contrast, CLIP offers a\npromising solution by leveraging multimodal learning to improve zero-shot\nclassification performance. However, in the medical domain, lesions can be\nsmall and might not be well represented in the embedding space. Therefore, in\nthis paper, we explore the potential of visual prompt engineering to enhance\nthe capabilities of Vision Language Models (VLMs) in radiology. Leveraging\nBiomedCLIP, trained on extensive biomedical image-text pairs, we investigate\nthe impact of embedding visual markers directly within radiological images to\nguide the model's attention to critical regions. Our evaluation on the JSRT\ndataset, focusing on lung nodule malignancy classification, demonstrates that\nincorporating visual prompts $\\unicode{x2013}$ such as arrows, circles, and\ncontours $\\unicode{x2013}$ significantly improves classification metrics\nincluding AUROC, AUPRC, F1 score, and accuracy. Moreover, the study provides\nattention maps, showcasing enhanced model interpretability and focus on\nclinically relevant areas. These findings underscore the efficacy of visual\nprompt engineering as a straightforward yet powerful approach to advance VLM\nperformance in medical image analysis.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}