{"id":"2408.12148","title":"Multi-tool Integration Application for Math Reasoning Using Large\n  Language Model","authors":"Zhihua Duan, Jialin Wang","authorsParsed":[["Duan","Zhihua",""],["Wang","Jialin",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:27:10 GMT"}],"updateDate":"2024-08-23","timestamp":1724308030000,"abstract":"  Mathematical reasoning is an important research direction in the field of\nartificial intelligence. This article proposes a novel multi tool application\nframework for mathematical reasoning, aiming to achieve more comprehensive and\naccurate mathematical reasoning by utilizing the collaborative effect of large\nlanguage models (LLMs) and multiple external tools. Firstly, use a Math Tool to\nperform basic mathematical calculations during the inference process through\ninteraction with LLM. Secondly, Code Tool can generate code fragments that\ncomply with syntax rules and execute them, providing support for complex\nmathematical problems. Then, through the iterative reasoning of the CoT Tool,\nthe logical coherence and accuracy of mathematical reasoning are enhanced.\nUltimately, by using self consistency tools to select the final answer based on\ndifferent parameters, the consistency and reliability of reasoning are\nimproved. Through the synergistic effect of these tools, the framework has\nachieved significant performance improvement in mathematical reasoning tasks.\nWe conducted experiments on the NumGLUE Task 4 test set, which includes 220\nmathematical reasoning fill in the blank questions. The experimental results\nshowed that, based on Math Tool, Code Tool, and CoT Tool, in Task 4 task,our\nmethod achieved an accuracy of 89.09,compared with the GPT3+FewShot baseline,\nFew Shot+ERNIE-4.0+self consistency improved by 49.09%, and compared with\nfine-tuning the Fine tuning baseline, Few Shot+ERNIE-4.0+self consistency\nimproved by 52.29%\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}