{"id":"2408.12805","title":"A Safe Self-evolution Algorithm for Autonomous Driving Based on\n  Data-Driven Risk Quantification Model","authors":"Shuo Yang, Shizhen Li, Yanjun Huang, Hong Chen","authorsParsed":[["Yang","Shuo",""],["Li","Shizhen",""],["Huang","Yanjun",""],["Chen","Hong",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 02:52:35 GMT"}],"updateDate":"2024-08-26","timestamp":1724381555000,"abstract":"  Autonomous driving systems with self-evolution capabilities have the\npotential to independently evolve in complex and open environments, allowing to\nhandle more unknown scenarios. However, as a result of the safety-performance\ntrade-off mechanism of evolutionary algorithms, it is difficult to ensure safe\nexploration without sacrificing the improvement ability. This problem is\nespecially prominent in dynamic traffic scenarios. Therefore, this paper\nproposes a safe self-evolution algorithm for autonomous driving based on\ndata-driven risk quantification model. Specifically, a risk quantification\nmodel based on the attention mechanism is proposed by modeling the way humans\nperceive risks during driving, with the idea of achieving safety situation\nestimation of the surrounding environment through a data-driven approach. To\nprevent the impact of over-conservative safety guarding policies on the\nself-evolution capability of the algorithm, a safety-evolutionary\ndecision-control integration algorithm with adjustable safety limits is\nproposed, and the proposed risk quantization model is integrated into it.\nSimulation and real-vehicle experiments results illustrate the effectiveness of\nthe proposed method. The results show that the proposed algorithm can generate\nsafe and reasonable actions in a variety of complex scenarios and guarantee\nsafety without losing the evolutionary potential of learning-based autonomous\ndriving systems.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}