{"id":"2408.08000","title":"MVInpainter: Learning Multi-View Consistent Inpainting to Bridge 2D and\n  3D Editing","authors":"Chenjie Cao, Chaohui Yu, Yanwei Fu, Fan Wang, Xiangyang Xue","authorsParsed":[["Cao","Chenjie",""],["Yu","Chaohui",""],["Fu","Yanwei",""],["Wang","Fan",""],["Xue","Xiangyang",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:57:28 GMT"}],"updateDate":"2024-08-16","timestamp":1723708648000,"abstract":"  Novel View Synthesis (NVS) and 3D generation have recently achieved prominent\nimprovements. However, these works mainly focus on confined categories or\nsynthetic 3D assets, which are discouraged from generalizing to challenging\nin-the-wild scenes and fail to be employed with 2D synthesis directly.\nMoreover, these methods heavily depended on camera poses, limiting their\nreal-world applications. To overcome these issues, we propose MVInpainter,\nre-formulating the 3D editing as a multi-view 2D inpainting task. Specifically,\nMVInpainter partially inpaints multi-view images with the reference guidance\nrather than intractably generating an entirely novel view from scratch, which\nlargely simplifies the difficulty of in-the-wild NVS and leverages unmasked\nclues instead of explicit pose conditions. To ensure cross-view consistency,\nMVInpainter is enhanced by video priors from motion components and appearance\nguidance from concatenated reference key&value attention. Furthermore,\nMVInpainter incorporates slot attention to aggregate high-level optical flow\nfeatures from unmasked regions to control the camera movement with pose-free\ntraining and inference. Sufficient scene-level experiments on both\nobject-centric and forward-facing datasets verify the effectiveness of\nMVInpainter, including diverse tasks, such as multi-view object removal,\nsynthesis, insertion, and replacement. The project page is\nhttps://ewrfcas.github.io/MVInpainter/.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vtMCdqvSz1GpBxyx-GqjXBIiFRRrXSRxr_AzyDUSCME","pdfSize":"25666138"}
