{"id":"2408.16584","title":"$\\varepsilon$-MSR Codes for Any Set of Helper Nodes","authors":"Vinayak Ramkumar, Netanel Raviv, Itzhak Tamo","authorsParsed":[["Ramkumar","Vinayak",""],["Raviv","Netanel",""],["Tamo","Itzhak",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:48:56 GMT"}],"updateDate":"2024-08-30","timestamp":1724942936000,"abstract":"  Minimum storage regenerating (MSR) codes are a class of maximum distance\nseparable (MDS) array codes capable of repairing any single failed node by\ndownloading the minimum amount of information from each of the helper nodes.\nHowever, MSR codes require large sub-packetization levels, which hinders their\nusefulness in practical settings. This led to the development of another class\nof MDS array codes called $\\varepsilon$-MSR codes, for which the repair\ninformation downloaded from each helper node is at most a factor of\n$(1+\\varepsilon)$ from the minimum amount for some $\\varepsilon > 0$. The\nadvantage of $\\varepsilon$-MSR codes over MSR codes is their small\nsub-packetization levels. In previous constructions of epsilon-MSR codes,\nhowever, several specific nodes are required to participate in the repair of a\nfailed node, which limits the performance of the code in cases where these\nnodes are not available. In this work, we present a construction of\n$\\varepsilon$-MSR codes without this restriction. For a code with $n$ nodes,\nout of which $k$ store uncoded information, and for any number $d$ of helper\nnodes ($k\\le d<n$), the repair of a failed node can be done by contacting any\nset of $d$ surviving nodes. Our construction utilizes group algebra techniques,\nand requires linear field size. We also generalize the construction to MDS\narray codes capable of repairing $h$ failed nodes using $d$ helper nodes with a\nslightly sub-optimal download from each helper node, for all $h \\le r$ and $k\n\\le d \\le n-h$ simultaneously.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"D9FwiJMHnxWLaDrXJV97qpOpaDnYKmHLxFqTtKnc51A","pdfSize":"488151"}
