{"id":"2408.13107","title":"Quarkyonic equation of state with a momentum dependent interaction and\n  neutron star structure","authors":"K. Folias and Ch.C. Moustakidis","authorsParsed":[["Folias","K.",""],["Moustakidis","Ch. C.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:32:40 GMT"}],"updateDate":"2024-08-26","timestamp":1724423560000,"abstract":"  The structure and basic properties of dense nuclear matter still remain one\nof the open problems of Physics. In particular, the composition of the matter\nthat composes neutron stars is under theoretical and experimental\ninvestigation. Among the theories that have been proposed, apart from the\nclassical one where the composition is dominated by hadrons, the existence or\ncoexistence of free quark matter is a dominant guess. An approach towards this\nsolution is the phenomenological view according to which the existence of\nquarkyonic matter plays a dominant role in the construction of the equation of\nstate (EOS). According to it the structure of the EOS is based on the existence\nof the quarkyonic particle which is a hybrid state of a particle that combines\nproperties of hadronic and quark matter with a corresponding representation in\nmomentum space. In this paper we propose a phenomenological model for\nquarkyonic matter, borrowed from corresponding applications in hadronic models,\nwhere the interaction in the quarkyonic matter depends not only on the position\nbut also on the momentum of the quarkyonic particles. This consideration, as we\ndemonstrate, can have a remarkable consequence on the shape of the EOS and thus\non the properties of neutron stars, offering a sufficiently flexible model.\nComparison with recent observational data can place constraints on the\nparameterization of the particular model and help improve its reliability.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}