{"id":"2408.06119","title":"Period-doubling in the phase dynamics of a shunted HgTe quantum well\n  Josephson junction","authors":"Wei Liu, Stanislau U. Piatrusha, Xianhu Liang, Sandeep Upadhyay, Lena\n  F\\\"urst, Charles Gould, Johannes Kleinlein, Hartmut Buhmann, Martin P. Stehno\n  and Laurens W. Molenkamp","authorsParsed":[["Liu","Wei",""],["Piatrusha","Stanislau U.",""],["Liang","Xianhu",""],["Upadhyay","Sandeep",""],["Fürst","Lena",""],["Gould","Charles",""],["Kleinlein","Johannes",""],["Buhmann","Hartmut",""],["Stehno","Martin P.",""],["Molenkamp","Laurens W.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:00:12 GMT"}],"updateDate":"2024-08-13","timestamp":1723467612000,"abstract":"  The fractional AC Josephson effect is a discerning property of topological\nsuperconductivity in hybrid Josephson junctions. Recent experimental\nobservations of missing odd Shapiro steps and half Josephson frequency emission\nin various materials have sparked significant debate regarding their potential\norigin in the effect. In this study, we present microwave emission measurements\non a resistively shunted Josephson junction based on a HgTe quantum well. We\ndemonstrate that, with significant spurious inductance in the shunt wiring, the\nexperiment operates in a nonlinear dynamic regime characterized by\nperiod-doubling. This leads to additional microwave emission peaks at half of\nthe Josephson frequency, $f_J/2$, which can mimic the $4\\pi$-periodicity of\ntopological Andreev states. The observed current-voltage characteristics and\nemission spectra are well-described by a simple RCLSJ model. Furthermore, we\nshow that the nonlinear dynamics of the junction can be controlled using gate\nvoltage, magnetic field, and temperature, with our model accurately reproducing\nthese effects without incorporating any topological attributes. Our\nobservations urge caution in interpreting emission at $f_J/2$ as evidence for\ngapless Andreev bound states in topological junctions and suggest the\nappropriate parameter range for future experiments.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}