{"id":"2408.08151","title":"Spin and orbital Edelstein effect in spin-orbit coupled\n  noncentrosymmetric superconductor","authors":"Satoshi Ando, Yukio Tanaka, Mario Cuoco, Luca Chirolli, and Maria\n  Teresa Mercaldo","authorsParsed":[["Ando","Satoshi",""],["Tanaka","Yukio",""],["Cuoco","Mario",""],["Chirolli","Luca",""],["Mercaldo","Maria Teresa",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 13:38:12 GMT"}],"updateDate":"2024-08-16","timestamp":1723729092000,"abstract":"  Superconductors without inversion symmetry can exhibit a non-zero\nmagnetization when a supercurrent is present, leading to non-dissipative\nmagnetoelectric effects. Here, we focus on understanding the relation between\nthe spin and orbital properties of these effects in conventional spin-singlet\nnoncentrosymmetric superconductors with orbital Rashba coupling, particularly\nfor multiorbital electronic systems with coupled spin and orbital moments. We\ninvestigate how atomic spin-orbit coupling influences the magnitude and\ndirection of the spin and orbital Edelstein effect. Our findings indicate that\nthe correlation between spin and orbital moments induced by supercurrents is\ngenerally not determined by the sign of atomic spin-orbit coupling, but rather\nby the number of bands at the Fermi level and the orbital characteristics of\nthose bands with respect to the mirror parity. We investigate the character of\nthe spin and orbital Edelstein effect by examining its dependence in momentum\nspace and the role of avoiding crossings in determining the induced\nmagnetization. The outcomes demonstrate that the sign change of the orbital\nEdelstein effect near avoiding crossing bands remains robust despite\nmodifications to the atomic spin-orbit amplitude. Furthermore, we observe that\nthe spin Edelstein effect is typically one order of magnitude smaller than the\norbital Edelstein effect, but can be significantly enhanced in certain\nscenarios with increased atomic spin-orbit coupling. These results indicate\nthat by manipulating the orbital degrees of freedom in noncentrosymmetric\nmaterials, the relationship between the spin and orbital Edelstein moments can\nbe effectively controlled.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}