{"id":"2408.12518","title":"A disruption-restoration-based MILP model for elective surgical\n  scheduling in a children's hospital using scenarios","authors":"Martina Doneda, Gloria Pelizzo, Sara Costanzo, and Giuliana Carello","authorsParsed":[["Doneda","Martina",""],["Pelizzo","Gloria",""],["Costanzo","Sara",""],["Carello","Giuliana",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:15:06 GMT"}],"updateDate":"2024-08-23","timestamp":1724343306000,"abstract":"  We consider the problem of scheduling elective surgeries in a Children's\nHospital, where disruptions due to emergencies and no-shows may arise. We\naccount for two features that occur in many pediatric settings: i) that it is\nnot uncommon for pediatric patients to fall ill on the very day of their\noperation and, consequentially, to be unable to undergo surgery and ii) that\noperating rooms normally reserved for elective surgeries can be used to treat\nemergency cases. Elective surgeries are scheduled taking into account the time\nspent on the waiting list and the patient's priority, which considers the\nseverity of their condition and their surgical deadline, generating a nominal\nschedule. This schedule is optimized in conjunction with a series of back-up\nschedules: in fact, back-up schedules shall be available in advance so as to\nguarantee that the operating rooms activity immediately recovers in case of a\ndisruption. We propose an Integer Linear Programming-based approach for the\nproblem. As there is no consolidated data on the features of both emergencies\nand no show, we enumerate a representative subset of the possible emergency and\nno-show scenarios and for each of them a back-up plan is designed. The approach\nreschedules patients in a way that minimizes disruption with respect to the\nnominal schedule and applies an as-soon-as-possible policy in case of\nemergencies to ensure that all patients receive timely care. The approach shows\nto be effective in managing disruptions, ensuring that the waiting list is\nmanaged properly, with a balanced mix of urgent and less urgent patients.\nTherefore, the approach provides an effective solution for scheduling patients\nin a pediatric hospital, taking into account the unique features of such\nfacilities.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}