{"id":"2408.17157","title":"Optimizing Traversal Queries of Sensor Data Using a Rule-Based\n  Reachability Approach","authors":"Bryan-Elliott Tam and Ruben Taelman and Juli\\'an Rojas Mel\\'endez and\n  Pieter Colpaert","authorsParsed":[["Tam","Bryan-Elliott",""],["Taelman","Ruben",""],["Meléndez","Julián Rojas",""],["Colpaert","Pieter",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:52:20 GMT"}],"updateDate":"2024-09-02","timestamp":1725011540000,"abstract":"  Link Traversal queries face challenges in completeness and long execution\ntime due to the size of the web. Reachability criteria define completeness by\nrestricting the links followed by engines. However, the number of links to\ndereference remains the bottleneck of the approach. Web environments often have\nstructures exploitable by query engines to prune irrelevant sources. Current\ncriteria rely on using information from the query definition and predefined\npredicate. However, it is difficult to use them to traverse environments where\nlogical expressions indicate the location of resources. We propose to use a\nrule-based reachability criterion that captures logical statements expressed in\nhypermedia descriptions within linked data documents to prune irrelevant\nsources. In this poster paper, we show how the Comunica link traversal engine\nis modified to take hints from a hypermedia control vocabulary, to prune\nirrelevant sources. Our preliminary findings show that by using this strategy,\nthe query engine can significantly reduce the number of HTTP requests and the\nquery execution time without sacrificing the completeness of results. Our work\nshows that the investigation of hypermedia controls in link pruning of\ntraversal queries is a worthy effort for optimizing web queries of unindexed\ndecentralized databases.\n","subjects":["Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vrAND8fpJGDgE9BggTdwyV4j7P2B_tCnOUHLfhpSdyQ","pdfSize":"740179"}
