{"id":"2408.16761","title":"Nonlocal Moments in the Chern Bands of Twisted Bilayer Graphene","authors":"Patrick J. Ledwith, Junkai Dong, Ashvin Vishwanath, and Eslam Khalaf","authorsParsed":[["Ledwith","Patrick J.",""],["Dong","Junkai",""],["Vishwanath","Ashvin",""],["Khalaf","Eslam",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:56:59 GMT"}],"updateDate":"2024-08-30","timestamp":1724954219000,"abstract":"  Twisted bilayer graphene (TBG) has elements in common with two paradigmatic\nexamples of strongly correlated physics: quantum Hall physics and Hubbard\nphysics. On one hand, TBG hosts flat topological Landau-level-like bands which\nexhibits quantum anomalous Hall effects. On the other hand, these bands have\nconcentrated charge density and show signs of extensive entropy resembling\nlocal moments. The combination of these features leads to a question: can\ndecoupled moments emerge in an isolated topological band, despite the lack of\nexponentially localized Wannier states? In this work, we answer the question\naffirmatively by proposing a minimal model for these bands in TBG that combines\ntopology and charge concentration at the AA sites, leading to analytic\nwavefunctions that closely approximate those of the BM model with realistic\nparameters. Importantly, charge concentration also leads to Berry curvature\nconcentration at $\\Gamma$, generating a small parameter $s$ that yields\nanalytic tractability. We show that, rather surprisingly, the model hosts\nnearly decoupled flavor moments without any extra degrees of freedom. These\nmoments are non-local due to topology-enforced power-law tails, yet have\nparametrically small overlap. We further develop a diagrammatic expansion in\nwhich the self energy can be computed exactly to leading order in $s^2$ in the\nfluctuating moment regime. At charge neutrality, we find a \"Mott semimetal\",\nwith large flavor entropy and a Mott gap everywhere in the BZ except for the\nvicinity of the $\\Gamma$ point. Away from neutrality, the Mott semimetal gaps\nout in a spectrally imbalanced manner, with one Mott band having zero $Z_k$ at\nthe $\\Gamma$ point. The model accurately reproduces results from finite\ntemperature thermodynamic measurements, leads to new experimental predictions,\nand resolves the problem of the emergence of Hubbard physics in isolated\ntopological bands.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qaidnJ0l_qGLI_bWaiw5kiFHdZqykRtZ6JGSDhxoWZI","pdfSize":"3062875"}
