{"id":"2408.02736","title":"Non-Hermitian entanglement dip from scaling-induced exceptional\n  criticality","authors":"Sirui Liu, Hui Jiang, Wen-Tan Xue, Qingya Li, Jiangbin Gong, Xiaogang\n  Liu, Ching Hua Lee","authorsParsed":[["Liu","Sirui",""],["Jiang","Hui",""],["Xue","Wen-Tan",""],["Li","Qingya",""],["Gong","Jiangbin",""],["Liu","Xiaogang",""],["Lee","Ching Hua",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-07","timestamp":1722880806000,"abstract":"  It is well established that the entanglement entropy of a critical system\ngenerally scales logarithmically with system size. Yet, in this work, we report\na new class of non-Hermitian critical transitions that exhibit dramatic\ndivergent dips in their entanglement entropy scaling, strongly violating\nconventional logarithmic behavior. Dubbed scaling-induced exceptional\ncriticality (SIEC), it transcends existing non-Hermitian mechanisms such as\nexceptional bound states and non-Hermitian skin effect (NHSE)-induced gap\nclosures, which are nevertheless still governed by logarithmic entanglement\nscaling. Key to SIEC is its strongly scale-dependent spectrum, where eigenbands\nexhibit an exceptional crossing only at a particular system size. As such, the\ncritical behavior is dominated by how the generalized Brillouin zone (GBZ)\nsweeps through the exceptional crossing with increasing system size, and not\njust by the gap closure per se. We provide a general approach for constructing\nSIEC systems based on the non-local competition between heterogeneous NHSE\npumping directions, and show how a scale-dependent GBZ can be analytically\nderived to excellent accuracy. Beyond 1D free fermions, SIEC is expected to\noccur more prevalently in higher-dimensional or even interacting systems, where\nantagonistic NHSE channels generically proliferate. SIEC-induced entanglement\ndips generalize straightforwardly to kinks in other entanglement measures such\nas Renyi entropy, and serve as spectacular demonstrations of how algebraic and\ngeometric singularities in complex band structures manifest in quantum\ninformation.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}