{"id":"2408.03581","title":"Design and Analysis of Binaural Signal Matching with Arbitrary\n  Microphone Arrays","authors":"Lior Madmoni, Zamir Ben-Hur, Jacob Donley, Vladimir Tourbabin, Boaz\n  Rafaely","authorsParsed":[["Madmoni","Lior",""],["Ben-Hur","Zamir",""],["Donley","Jacob",""],["Tourbabin","Vladimir",""],["Rafaely","Boaz",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 06:34:52 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 05:28:42 GMT"}],"updateDate":"2024-08-09","timestamp":1723012492000,"abstract":"  Binaural reproduction is rapidly becoming a topic of great interest in the\nresearch community, especially with the surge of new and popular devices, such\nas virtual reality headsets, smart glasses, and head-tracked headphones. In\norder to immerse the listener in a virtual or remote environment with such\ndevices, it is essential to generate realistic and accurate binaural signals.\nThis is challenging, especially since the microphone arrays mounted on these\ndevices are typically composed of an arbitrarily-arranged small number of\nmicrophones, which impedes the use of standard audio formats like Ambisonics,\nand provides limited spatial resolution. The binaural signal matching (BSM)\nmethod was developed recently to overcome these challenges. While it produced\nbinaural signals with low error using relatively simple arrays, its performance\ndegraded significantly when head rotation was introduced. This paper aims to\ndevelop the BSM method further and overcome its limitations. For this purpose,\nthe method is first analyzed in detail, and a design framework that guarantees\naccurate binaural reproduction for relatively complex acoustic environments is\npresented. Next, it is shown that the BSM accuracy may significantly degrade at\nhigh frequencies, and thus, a perceptually motivated extension to the method is\nproposed, based on a magnitude least-squares (MagLS) formulation. These\ninsights and developments are then analyzed with the help of an extensive\nsimulation study of a simple six-microphone semi-circular array. It is further\nshown that the BSM-MagLS method can be very useful in compensating for head\nrotations with this array. Finally, a listening experiment is conducted with a\nfour-microphone array on a pair of glasses in a reverberant speech environment\nand including head rotations, where it is shown that BSM-MagLS can indeed\nproduce binaural signals with a high perceived quality.\n","subjects":["Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}