{"id":"2408.10599","title":"Vision Calorimeter for Anti-neutron Reconstruction: A Baseline","authors":"Hongtian Yu, Yangu Li, Mingrui Wu, Letian Shen, Yue Liu, Yunxuan Song,\n  Qixiang Ye, Xiaorui Lyu, Yajun Mao, Yangheng Zheng, Yunfan Liu","authorsParsed":[["Yu","Hongtian",""],["Li","Yangu",""],["Wu","Mingrui",""],["Shen","Letian",""],["Liu","Yue",""],["Song","Yunxuan",""],["Ye","Qixiang",""],["Lyu","Xiaorui",""],["Mao","Yajun",""],["Zheng","Yangheng",""],["Liu","Yunfan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:14:28 GMT"}],"updateDate":"2024-08-21","timestamp":1724138068000,"abstract":"  In high-energy physics, anti-neutrons ($\\bar{n}$) are fundamental particles\nthat frequently appear as final-state particles, and the reconstruction of\ntheir kinematic properties provides an important probe for understanding the\ngoverning principles. However, this confronts significant challenges\ninstrumentally with the electromagnetic calorimeter (EMC), a typical\nexperimental sensor but recovering the information of incident $\\bar{n}$\ninsufficiently. In this study, we introduce Vision Calorimeter (ViC), a\nbaseline method for anti-neutron reconstruction that leverages deep learning\ndetectors to analyze the implicit relationships between EMC responses and\nincident $\\bar{n}$ characteristics. Our motivation lies in that energy\ndistributions of $\\bar{n}$ samples deposited in the EMC cell arrays embody rich\ncontextual information. Converted to 2-D images, such contextual energy\ndistributions can be used to predict the status of $\\bar{n}$ ($i.e.$, incident\nposition and momentum) through a deep learning detector along with pseudo\nbounding boxes and a specified training objective. Experimental results\ndemonstrate that ViC substantially outperforms the conventional reconstruction\napproach, reducing the prediction error of incident position by 42.81% (from\n17.31$^{\\circ}$ to 9.90$^{\\circ}$). More importantly, this study for the first\ntime realizes the measurement of incident $\\bar{n}$ momentum, underscoring the\npotential of deep learning detectors for particle reconstruction. Code is\navailable at https://github.com/yuhongtian17/ViC.\n","subjects":["Physics/High Energy Physics - Experiment","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}