{"id":"2408.04465","title":"A Multi-wavelength, Multi-epoch Monitoring Campaign of Accretion\n  Variability in T Tauri Stars from the ODYSSEUS Survey. III. Optical Spectra","authors":"John Wendeborn, Catherine C. Espaillat, Thanawuth Thanathibodee,\n  Connor E. Robinson, Caeley V. Pittman, Nuria Calvet, James Muzerolle,\n  Fredrick M. Walter, Jochen Eisloffel, Eleonora Fiorellino, Carlo F. Manara,\n  Agnes Kospal, Peter Abraham, Rik Claes, Elisabetta Rigliaco, Laura Venuti,\n  Justyn Campbell-White, Pauline McGinnis, Manuele Gangi, Karina Mauco, Filipe\n  Gameiro, Antonio Frasca, Zhen Guo","authorsParsed":[["Wendeborn","John",""],["Espaillat","Catherine C.",""],["Thanathibodee","Thanawuth",""],["Robinson","Connor E.",""],["Pittman","Caeley V.",""],["Calvet","Nuria",""],["Muzerolle","James",""],["Walter","Fredrick M.",""],["Eisloffel","Jochen",""],["Fiorellino","Eleonora",""],["Manara","Carlo F.",""],["Kospal","Agnes",""],["Abraham","Peter",""],["Claes","Rik",""],["Rigliaco","Elisabetta",""],["Venuti","Laura",""],["Campbell-White","Justyn",""],["McGinnis","Pauline",""],["Gangi","Manuele",""],["Mauco","Karina",""],["Gameiro","Filipe",""],["Frasca","Antonio",""],["Guo","Zhen",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 13:49:25 GMT"}],"updateDate":"2024-08-09","timestamp":1723124965000,"abstract":"  Classical T Tauri Stars (CTTSs) are highly variable stars that possess gas-\nand dust-rich disks from which planets form. Much of their variability is\ndriven by mass accretion from the surrounding disk, a process that is still not\nentirely understood. A multi-epoch optical spectral monitoring campaign of four\nCTTSs (TW Hya, RU Lup, BP Tau, and GM Aur) was conducted along with\ncontemporaneous HST UV spectra and ground-based photometry in an effort to\ndetermine accretion characteristics and gauge variability in this sample. Using\nan accretion flow model, we find that the magnetospheric truncation radius\nvaries between 2.5-5 R* across all of our observations. There is also\nsignificant variability in all emission lines studied, particularly Halpha,\nHbeta, and Hgamma. Using previously established relationships between line\nluminosity and accretion, we find that, on average, most lines reproduce\naccretion rates consistent with accretion shock modeling of HST spectra to\nwithin 0.5 dex. Looking at individual contemporaneous observations, however,\nthese relationships are less accurate, suggesting that variability trends\ndiffer from the trends of the population and that these empirical relationships\nshould be used with caution in studies of variability.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"AGzusH6bwKya9XOEzvoSVsgENeLAIXNGVdhgPKMH6UE","pdfSize":"15109499"}
