{"id":"2408.05891","title":"CMAB: A First National-Scale Multi-Attribute Building Dataset in China\n  Derived from Open Source Data and GeoAI","authors":"Yecheng Zhang, Huimin Zhao, Ying Long","authorsParsed":[["Zhang","Yecheng",""],["Zhao","Huimin",""],["Long","Ying",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 02:09:25 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 15:56:15 GMT"},{"version":"v3","created":"Sat, 31 Aug 2024 02:52:26 GMT"}],"updateDate":"2024-09-04","timestamp":1723428565000,"abstract":"  Rapidly acquiring three-dimensional (3D) building data, including geometric\nattributes like rooftop, height and orientations, as well as indicative\nattributes like function, quality, and age, is essential for accurate urban\nanalysis, simulations, and policy updates. Current building datasets suffer\nfrom incomplete coverage of building multi-attributes. This paper introduces a\ngeospatial artificial intelligence (GeoAI) framework for large-scale building\nmodeling, presenting the first national-scale Multi-Attribute Building dataset\n(CMAB), covering 3,667 spatial cities, 29 million buildings, and 21.3 billion\nsquare meters of rooftops with an F1-Score of 89.93% in OCRNet-based\nextraction, totaling 337.7 billion cubic meters of building stock. We trained\nbootstrap aggregated XGBoost models with city administrative classifications,\nincorporating features such as morphology, location, and function. Using\nmulti-source data, including billions of high-resolution Google Earth images\nand 60 million street view images (SVIs), we generated rooftop, height,\nfunction, age, and quality attributes for each building. Accuracy was validated\nthrough model benchmarks, existing similar products, and manual SVI validation,\nmostly above 80%. Our dataset and results are crucial for global SDGs and urban\nplanning.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}