{"id":"2408.10717","title":"Accelerated training of deep learning surrogate models for surface\n  displacement and flow, with application to MCMC-based history matching of CO2\n  storage operations","authors":"Yifu Han, Francois P. Hamon, Louis J. Durlofsky","authorsParsed":[["Han","Yifu",""],["Hamon","Francois P.",""],["Durlofsky","Louis J.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 10:31:52 GMT"}],"updateDate":"2024-08-21","timestamp":1724149912000,"abstract":"  Deep learning surrogate modeling shows great promise for subsurface flow\napplications, but the training demands can be substantial. Here we introduce a\nnew surrogate modeling framework to predict CO2 saturation, pressure and\nsurface displacement for use in the history matching of carbon storage\noperations. Rather than train using a large number of expensive coupled\nflow-geomechanics simulation runs, training here involves a large number of\ninexpensive flow-only simulations combined with a much smaller number of\ncoupled runs. The flow-only runs use an effective rock compressibility, which\nis shown to provide accurate predictions for saturation and pressure for our\nsystem. A recurrent residual U-Net architecture is applied for the saturation\nand pressure surrogate models, while a new residual U-Net model is introduced\nto predict surface displacement. The surface displacement surrogate accepts, as\ninputs, geomodel quantities along with saturation and pressure surrogate\npredictions. Median relative error for a diverse test set is less than 4% for\nall variables. The surrogate models are incorporated into a hierarchical Markov\nchain Monte Carlo history matching workflow. Surrogate error is included using\na new treatment involving the full model error covariance matrix. A high degree\nof prior uncertainty, with geomodels characterized by uncertain geological\nscenario parameters (metaparameters) and associated realizations, is\nconsidered. History matching results for a synthetic true model are generated\nusing in-situ monitoring-well data only, surface displacement data only, and\nboth data types. The enhanced uncertainty reduction achieved with both data\ntypes is quantified. Posterior saturation and surface displacement fields are\nshown to correspond well with the true solution.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}