{"id":"2408.01678","title":"iControl3D: An Interactive System for Controllable 3D Scene Generation","authors":"Xingyi Li, Yizheng Wu, Jun Cen, Juewen Peng, Kewei Wang, Ke Xian, Zhe\n  Wang, Zhiguo Cao, Guosheng Lin","authorsParsed":[["Li","Xingyi",""],["Wu","Yizheng",""],["Cen","Jun",""],["Peng","Juewen",""],["Wang","Kewei",""],["Xian","Ke",""],["Wang","Zhe",""],["Cao","Zhiguo",""],["Lin","Guosheng",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 06:35:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722666909000,"abstract":"  3D content creation has long been a complex and time-consuming process, often\nrequiring specialized skills and resources. While recent advancements have\nallowed for text-guided 3D object and scene generation, they still fall short\nof providing sufficient control over the generation process, leading to a gap\nbetween the user's creative vision and the generated results. In this paper, we\npresent iControl3D, a novel interactive system that empowers users to generate\nand render customizable 3D scenes with precise control. To this end, a 3D\ncreator interface has been developed to provide users with fine-grained control\nover the creation process. Technically, we leverage 3D meshes as an\nintermediary proxy to iteratively merge individual 2D diffusion-generated\nimages into a cohesive and unified 3D scene representation. To ensure seamless\nintegration of 3D meshes, we propose to perform boundary-aware depth alignment\nbefore fusing the newly generated mesh with the existing one in 3D space.\nAdditionally, to effectively manage depth discrepancies between remote content\nand foreground, we propose to model remote content separately with an\nenvironment map instead of 3D meshes. Finally, our neural rendering interface\nenables users to build a radiance field of their scene online and navigate the\nentire scene. Extensive experiments have been conducted to demonstrate the\neffectiveness of our system. The code will be made available at\nhttps://github.com/xingyi-li/iControl3D.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}