{"id":"2408.07270","title":"Orientation-dependent surface radiation damage in $\\beta$-Ga2O3 explored\n  by multiscale atomic simulations","authors":"Taiqiao Liu and Zeyuan Li and Junlei Zhao and Xiaoyu Fei and Jiaren\n  Feng and Yijing Zuo and Mengyuan Hua and Yuzheng Guo and Sheng Liu and Zhaofu\n  Zhang","authorsParsed":[["Liu","Taiqiao",""],["Li","Zeyuan",""],["Zhao","Junlei",""],["Fei","Xiaoyu",""],["Feng","Jiaren",""],["Zuo","Yijing",""],["Hua","Mengyuan",""],["Guo","Yuzheng",""],["Liu","Sheng",""],["Zhang","Zhaofu",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 03:39:25 GMT"}],"updateDate":"2024-08-15","timestamp":1723606765000,"abstract":"  Ultrawide bandgap semiconductor $\\beta$-Ga2O3 holds extensive potential for\napplications in high-radiation environments. One of the primary challenges in\nits practical application is unveiling the mechanisms of surface irradiation\ndamage under extreme conditions. In this study, we investigate the\norientation-dependent mechanisms of radiation damage on four experimentally\nrelevant $\\beta$-Ga2O3 surface facets, namely, (100), (010), (001), and (-201),\nat various temperatures. We employ a multiscale atomic simulation approach,\ncombining machine-learning-driven molecular dynamics (ML-MD) simulations and\ndensity functional theory (DFT) calculations. The results reveal that Ga\nvacancies and O interstitials are the predominant defects across all four\nsurfaces, with the formation of many antisite defects Ga_O and few O_Ga\nobserved. Among the two Ga sites and three O sites, the vacancy found in the O2\nsite is dominant, while the interstitials at the Ga1 and O1 sites are more\nsignificant. Interestingly, the (010) surface exhibits the lowest defect\ndensity, owing to its more profound channeling effect leading to a broader\nspread of defects. The influence of temperature on surface irradiation damage\nof $\\beta$-Ga2O3 should be evaluated based on the unique crystal surface\ncharacteristics. Moreover, the formation energy and defect concentration\ncalculated by DFT corroborate the results of the MD simulations. Comprehending\nsurface radiation damage at the atomic level is crucial for assessing the\nradiation tolerance and predicting the performance changes of\n$\\beta$-Ga2O3-based device in high-radiation environments.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}