{"id":"2408.06273","title":"FuxiTranyu: A Multilingual Large Language Model Trained with Balanced\n  Data","authors":"Haoran Sun, Renren Jin, Shaoyang Xu, Leiyu Pan, Supryadi, Menglong\n  Cui, Jiangcun Du, Yikun Lei, Lei Yang, Ling Shi, Juesi Xiao, Shaolin Zhu,\n  Deyi Xiong","authorsParsed":[["Sun","Haoran",""],["Jin","Renren",""],["Xu","Shaoyang",""],["Pan","Leiyu",""],["Supryadi","",""],["Cui","Menglong",""],["Du","Jiangcun",""],["Lei","Yikun",""],["Yang","Lei",""],["Shi","Ling",""],["Xiao","Juesi",""],["Zhu","Shaolin",""],["Xiong","Deyi",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 16:34:56 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 14:57:25 GMT"}],"updateDate":"2024-08-14","timestamp":1723480496000,"abstract":"  Large language models (LLMs) have demonstrated prowess in a wide range of\ntasks. However, many LLMs exhibit significant performance discrepancies between\nhigh- and low-resource languages. To mitigate this challenge, we present\nFuxiTranyu, an open-source multilingual LLM, which is designed to satisfy the\nneed of the research community for balanced and high-performing multilingual\ncapabilities. FuxiTranyu-8B, the base model with 8 billion parameters, is\ntrained from scratch on a meticulously balanced multilingual data repository\nthat contains 600 billion tokens covering 43 natural languages and 16\nprogramming languages. In addition to the base model, we also develop two\ninstruction-tuned models: FuxiTranyu-8B-SFT that is fine-tuned on a diverse\nmultilingual instruction dataset, and FuxiTranyu-8B-DPO that is further refined\nwith DPO on a preference dataset for enhanced alignment ability. Extensive\nexperiments on a wide range of multilingual benchmarks demonstrate the\ncompetitive performance of FuxiTranyu against existing multilingual LLMs, e.g.,\nBLOOM-7B, PolyLM-13B, Llama-2-Chat-7B and Mistral-7B-Instruct. Interpretability\nanalyses at both the neuron and representation level suggest that FuxiTranyu is\nable to learn consistent multilingual representations across different\nlanguages. To promote further research into multilingual LLMs and their working\nmechanisms, we release both the base and instruction-tuned FuxiTranyu models\ntogether with 58 pretraining checkpoints at HuggingFace and Github.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}