{"id":"2408.05269","title":"Gas-rich \"ultra-diffuse\" galaxies are consistent with the baryonic\n  Tully-Fisher relation and with Milgromian dynamics","authors":"Federico Lelli (INAF - Arcetri Astrophysical Observatory)","authorsParsed":[["Lelli","Federico","","INAF - Arcetri Astrophysical Observatory"]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-13","timestamp":1723226402000,"abstract":"  Some gas-rich \"ultra-diffuse\" galaxies (UDGs), which are extreme examples of\nlow surface brightness (LSB) dwarf galaxies, have been reported to lack dark\nmatter and to be offset from the baryonic Tully-Fisher relation (BTFR). If\nconfirmed, these UDGs would represent a serious challenge for both LCDM\ngalaxy-formation models and Milgromian dynamics. Here I demonstrate that these\nconclusions are very dubious due to underestimated uncertainties on\ninclinations and/or distances. First, I show that UDGs are offset from the BTFR\nin the same way as usual face-on LSB dwarfs due to systematic biases at low\ninclinations. Next, I analyze the two UDGs with the best available\nrotation-curve data. The first UDG (AGC 242019) is ideally inclined for\nkinematic studies; MOND can fit the observed rotation curve with a distance of\n12.5 +/- 0.6 Mpc, which is consistent with Virgocentric flow models. The second\nUDG (AGC 114905) is close to face-on, so not ideal for kinematic studies; MOND\ncan fit the observed rotation curve with a distance of 68 +/- 13 Mpc and\ninclination of 15 +/- 2 degrees, which are consistent with existing data. In\nparticular, I show that the disk inclination is more uncertain than previously\nestimated due to significant asymmetries (lopsidedness) in the stellar\ndistribution. In conclusion, there is no strong evidence that gas-rich UDGs and\ngas-rich LSB dwarfs are distinct galaxy populations with different dynamical\nproperties; instead, UDGs seem to be a subset of LSB dwarf galaxies biased\ntoward face-on systems.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}