{"id":"2408.15986","title":"A geometric phase approach to quark confinement from stochastic\n  gauge-geometry flows","authors":"Torsten Asselmeyer-Maluga, Matteo Lulli, Antonino Marciano, Roman\n  Pasechnik, Emanuele Zappala","authorsParsed":[["Asselmeyer-Maluga","Torsten",""],["Lulli","Matteo",""],["Marciano","Antonino",""],["Pasechnik","Roman",""],["Zappala","Emanuele",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:53:48 GMT"}],"updateDate":"2024-08-29","timestamp":1724867628000,"abstract":"  We apply a stochastic version of the geometric (Ricci) flow, complemented\nwith the stochastic flow of the gauge Yang-Mills sector, in order to seed the\nchromo-magnetic and chromo-electric vortices that source the area-law for QCD\nconfinement. The area-law is the key signature of quark confinement in\nYang-Mills gauge theories with a non-trivial center symmetry. In particular,\nchromo-magnetic vortices enclosed within the chromo-electric Wilson loops\ninstantiate the area-law asymptotic behaviour of the Wilson loop vacuum\nexpectation values. The stochastic gauge-geometry flow is responsible for the\ntopology changes that induce the appearance of the vortices. When vortices\nvanish, due to topology changes in the manifolds associated to the hadronic\nground states, the evaluation of the Wilson loop yields a dependence on the\nlength of the path, hence reproducing the perimeter law of the hadronic (Higgs)\nphase of real QCD. Confinement, instead, is naturally achieved within this\ncontext as a by-product of the topology change of the manifold over which the\ndynamics of the Yang-Mills fields is defined. It is then provided by the\nAharonov-Bohm effect induced by the concatenation of the compact\nchromo-electric and chromo-magnetic fluxes originated by the topology changes.\nThe stochastic gauge-geometry flow naturally accomplishes a treatment of the\nemergence of the vortices and the generation of turbulence effects. Braiding\nand knotting, resulting from topology changes, namely stochastic fluctuations\nof the Einstein-Yang-Mills system, stabilise the chromo-magnetic vortices and\ndynamically induce, as non-trivial topological features, chiral\nsymmetry-breaking. The latter is due to the appearance of torsional degrees of\nfreedom, to which four fermion interactions are related, and to the formation\nof fermion condensates, in which gluon strings get stabilised by non-trivial\nbraiding.\n","subjects":["Physics/High Energy Physics - Theory","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}