{"id":"2408.10233","title":"FPCA: Field-Programmable Pixel Convolutional Array for Extreme-Edge\n  Intelligence","authors":"Zihan Yin, Akhilesh Jaiswal","authorsParsed":[["Yin","Zihan",""],["Jaiswal","Akhilesh",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 21:12:41 GMT"}],"updateDate":"2024-08-21","timestamp":1722719561000,"abstract":"  The rapid advancement of neural network applications necessitates hardware\nthat not only accelerates computation but also adapts efficiently to dynamic\nprocessing requirements. While processing-in-pixel has emerged as a promising\nsolution to overcome the bottlenecks of traditional architectures at the\nextreme-edge, existing implementations face limitations in reconfigurability\nand scalability due to their static nature and inefficient area usage.\nAddressing these challenges, we present a novel architecture that significantly\nenhances the capabilities of processing-in-pixel for convolutional neural\nnetworks. Our design innovatively integrates non-volatile memory (NVM) with\nnovel unit pixel circuit design, enabling dynamic reconfiguration of synaptic\nweights, kernel size, channel size and stride size. Thus offering unprecedented\nflexibility and adaptability. With using a separate die for pixel circuit and\nstoring synaptic weights, our circuit achieves a substantial reduction in the\nrequired area per pixel thereby increasing the density and scalability of the\npixel array. Simulation results demonstrate dot product operations of the\ncircuit, the non-linearity of its analog output and a novel bucket-select\ncurvefit model is proposed to capture it. This work not only addresses the\nlimitations of current in-pixel computing approaches but also opens new avenues\nfor developing more efficient, flexible, and scalable neural network hardware,\npaving the way for advanced AI applications.\n","subjects":["Computing Research Repository/Hardware Architecture","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X24IuSNB5M5esgBnY8ChL_KZd7mFCg4h4FWtvXtP_4Y","pdfSize":"11881681"}
