{"id":"2408.07875","title":"Incremental Structure Discovery of Classification via Sequential Monte\n  Carlo","authors":"Changze Huang and Di Wang","authorsParsed":[["Huang","Changze",""],["Wang","Di",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 01:23:49 GMT"}],"updateDate":"2024-08-16","timestamp":1723685029000,"abstract":"  Gaussian Processes (GPs) provide a powerful framework for making predictions\nand understanding uncertainty for classification with kernels and Bayesian\nnon-parametric learning. Building such models typically requires strong prior\nknowledge to define preselect kernels, which could be ineffective for online\napplications of classification that sequentially process data because features\nof data may shift during the process. To alleviate the requirement of prior\nknowledge used in GPs and learn new features from data that arrive\nsuccessively, this paper presents a novel method to automatically discover\nmodels of classification on complex data with little prior knowledge. Our\nmethod adapts a recently proposed technique for GP-based time-series structure\ndiscovery, which integrates GPs and Sequential Monte Carlo (SMC). We extend the\ntechnique to handle extra latent variables in GP classification, such that our\nmethod can effectively and adaptively learn a-priori unknown structures of\nclassification from continuous input. In addition, our method adapts new batch\nof data with updated structures of models. Our experiments show that our method\nis able to automatically incorporate various features of kernels on synthesized\ndata and real-world data for classification. In the experiments of real-world\ndata, our method outperforms various classification methods on both online and\noffline setting achieving a 10\\% accuracy improvement on one benchmark.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PRahsiBcuwnlTvmpYW8psKd-fsPF55hAN2OV56kvFTs","pdfSize":"857104"}
