{"id":"2408.13326","title":"Search for Stochastic GW Signal as a Complementary Approach to\n  Multi-Higgs Productions at the Hadron Colliders to Probe Dimension Six\n  Operator","authors":"Dilruba Gazi, Abhi Mukherjee, Saurabh Niyogi and Sujoy Poddar","authorsParsed":[["Gazi","Dilruba",""],["Mukherjee","Abhi",""],["Niyogi","Saurabh",""],["Poddar","Sujoy",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:23:42 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 06:01:23 GMT"}],"updateDate":"2024-09-05","timestamp":1724437422000,"abstract":"  We have considered an effective field theory framework in which the Standard\nModel is extended by a non-renormalizable dimension six operator\n($\\frac{1}{\\Lambda^2}(H^{\\dagger}H)^3$) respecting the symmetries of the\nStandard Model. Such an operator can affect the dynamics of Higgs field and the\nelectroweak phase transition. Presence of such term modifies the triple Higgs\ncoupling which is already under the lens from di-Higgs searches in various\nchannels at the LHC. Constraint on the scale parameter $\\Lambda$ is obtained\nfrom the di-Higgs data at the LHC Run II. Additionally, such dimension six\nterms will give rise to additional couplings which will affect tri-Higgs and\nfour-Higgs productions at future high energy, high luminosity hadron colliders.\nThe shape of the scalar potential also gets modified due to such higher\ndimensional term composed of Higgs field. It is worthwhile to study the impact\nof such higher-dimensional operators at suitable gravitational wave (GW)\ninterferometry experiments since GW astronomy has become a good probe for new\nphysics searches. Bounds obtained on the scale parameter $\\Lambda$ from the\nallowed first-order electroweak phase transition is $450 \\lesssim \\Lambda\n\\lesssim 590$~GeV. On the other hand, di-Higgs results from the LHC Run II put\na lower bound on $\\Lambda \\gtrsim 340$~GeV.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Lhcn8pgugoIH6lBDY2mf37rIrsAbkwl3QOYpNjt9WLk","pdfSize":"924885"}
