{"id":"2408.12407","title":"Adaptive Spiking Neural Networks with Hybrid Coding","authors":"Huaxu He","authorsParsed":[["He","Huaxu",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:58:35 GMT"}],"updateDate":"2024-08-23","timestamp":1724335115000,"abstract":"  The Spiking Neural Network (SNN), due to its unique spiking-driven nature, is\na more energy-efficient and effective neural network compared to Artificial\nNeural Networks (ANNs). The encoding method directly influences the overall\nperformance of the network, and currently, direct encoding is primarily used\nfor directly trained SNNs. When working with static image datasets, direct\nencoding inputs the same feature map at every time step, failing to fully\nexploit the spatiotemporal properties of SNNs. While temporal encoding converts\ninput data into spike trains with spatiotemporal characteristics, traditional\nSNNs utilize the same neurons when processing input data across different time\nsteps, limiting their ability to integrate and utilize spatiotemporal\ninformation effectively.To address this, this paper employs temporal encoding\nand proposes the Adaptive Spiking Neural Network (ASNN), enhancing the\nutilization of temporal encoding in conventional SNNs. Additionally, temporal\nencoding is less frequently used because short time steps can lead to\nsignificant loss of input data information, often necessitating a higher number\nof time steps in practical applications. However, training large SNNs with long\ntime steps is challenging due to hardware constraints. To overcome this, this\npaper introduces a hybrid encoding approach that not only reduces the required\ntime steps for training but also continues to improve the overall network\nperformance.Notably, significant improvements in classification performance are\nobserved on both Spikformer and Spiking ResNet architectures.our code is\navailable at https://github.com/hhx0320/ASNN\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}