{"id":"2408.00816","title":"AI-Enabled sensor fusion of time of flight imaging and mmwave for\n  concealed metal detection","authors":"Chaitanya Kaul, Kevin J. Mitchell, Khaled Kassem, Athanasios Tragakis,\n  Valentin Kapitany, Ilya Starshynov, Federica Villa, Roderick Murray-Smith,\n  Daniele Faccio","authorsParsed":[["Kaul","Chaitanya",""],["Mitchell","Kevin J.",""],["Kassem","Khaled",""],["Tragakis","Athanasios",""],["Kapitany","Valentin",""],["Starshynov","Ilya",""],["Villa","Federica",""],["Murray-Smith","Roderick",""],["Faccio","Daniele",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:38:30 GMT"}],"updateDate":"2024-08-05","timestamp":1722526710000,"abstract":"  In the field of detection and ranging, multiple complementary sensing\nmodalities may be used to enrich the information obtained from a dynamic scene.\nOne application of this sensor fusion is in public security and surveillance,\nwhose efficacy and privacy protection measures must be continually evaluated.\nWe present a novel deployment of sensor fusion for the discrete detection of\nconcealed metal objects on persons whilst preserving their privacy. This is\nachieved by coupling off-the-shelf mmWave radar and depth camera technology\nwith a novel neural network architecture that processes the radar signals using\nconvolutional Long Short-term Memory (LSTM) blocks and the depth signal, using\nconvolutional operations. The combined latent features are then magnified using\na deep feature magnification to learn cross-modality dependencies in the data.\nWe further propose a decoder, based on the feature extraction and embedding\nblock, to learn an efficient upsampling of the latent space to learn the\nlocation of the concealed object in the spatial domain through radar feature\nguidance. We demonstrate the detection of presence and inference of 3D location\nof concealed metal objects with an accuracy of up to 95%, using a technique\nthat is robust to multiple persons. This work provides a demonstration of the\npotential for cost effective and portable sensor fusion, with strong\nopportunities for further development.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}