{"id":"2408.08849","title":"ECG-Chat: A Large ECG-Language Model for Cardiac Disease Diagnosis","authors":"Yubao Zhao, Tian Zhang, Xu Wang, Puyu Han, Tong Chen, Linlin Huang,\n  Youzhu Jin, Jiaju Kang","authorsParsed":[["Zhao","Yubao",""],["Zhang","Tian",""],["Wang","Xu",""],["Han","Puyu",""],["Chen","Tong",""],["Huang","Linlin",""],["Jin","Youzhu",""],["Kang","Jiaju",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:20:45 GMT"}],"updateDate":"2024-08-19","timestamp":1723828845000,"abstract":"  The success of Multimodal Large Language Models (MLLMs) in the medical\nauxiliary field shows great potential, allowing patients to engage in\nconversations using physiological signal data. However, general MLLMs perform\npoorly in cardiac disease diagnosis, particularly in the integration of ECG\ndata analysis and long-text medical report generation, mainly due to the\ncomplexity of ECG data analysis and the gap between text and ECG signal\nmodalities. Additionally, models often exhibit severe stability deficiencies in\nlong-text generation due to the lack of precise knowledge strongly related to\nuser queries. To address these issues, we propose ECG-Chat, the first multitask\nMLLMs focused on ECG medical report generation, providing multimodal\nconversational capabilities based on cardiology knowledge. We propose a\ncontrastive learning approach that integrates ECG waveform data with text\nreports, aligning ECG features with reports in a fine-grained manner. This\nmethod also results in an ECG encoder that excels in zero-shot report retrieval\ntasks. Additionally, expanding existing datasets, we constructed a 19k ECG\ndiagnosis dataset and a 25k multi-turn dialogue dataset for training and\nfine-tuning ECG-Chat, which provides professional diagnostic and conversational\ncapabilities. Furthermore, ECG-Chat can generate comprehensive ECG analysis\nreports through an automated LaTeX generation pipeline. We established a\nbenchmark for the ECG report generation task and tested our model on multiple\nbaselines. ECG-Chat achieved the best performance in classification, retrieval,\nmultimodal dialogue, and medical report generation tasks. Our report template\ndesign has also been widely recognized by medical practitioners.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}