{"id":"2408.17029","title":"Activation of momentum fluctuations in wave packet molecular dynamics:\n  Impacts on momentum distributions of projectilelike fragments","authors":"Lei Shen, Akira Ono, Yu-Gang Ma","authorsParsed":[["Shen","Lei",""],["Ono","Akira",""],["Ma","Yu-Gang",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 06:00:34 GMT"}],"updateDate":"2024-09-02","timestamp":1724997634000,"abstract":"  Molecular dynamics approaches use wave packets as nucleon wave functions to\nsimulate the time evolution of nuclear reactions. It is crucial to activate the\nmomentum fluctuation inherent in each wave packet so that it properly affects\nthe time evolution. In the antisymmetrized molecular dynamics (AMD) model, this\nhas traditionally been done by splitting the wave packets, i.e., by introducing\na random fluctuation to the wave packet center of each particle. The present\nwork proposes an improved approach to activate the fluctuation in both the\none-body mean-field propagation and the two-nucleon collision processes,\nconsistently based on the gradual or sudden change of the degree of isolation,\nwhich is derived from the fragment number function used for the zero-point\nenergy subtraction. This new method is applied to the 12C + 12C and 12C + p\nreactions at about 100 MeV/nucleon, focusing on the momentum distribution of\nthe 11B fragments produced by one-proton removal from the 12C projectile. The\nresults show that, with the momentum fluctuation suitably activated, the method\ncorrectly accounts for the recoil from the removed nucleon to the residue and\nthe 11B momentum distribution is significantly improved, while without\nactivating the fluctuation the distribution is too narrow compared to the\nexperimental data. Furthermore, the AMD results indicate that the momentum\ndistribution consists of two components; one is the high $P_z$ component with a\nsmall shift from the beam velocity, resulting from the simple removal of a\nproton after an energetic collision with a target particle; the other is the\nlow $P_z$ component with a larger peak shift resulting from the decay of an\nexcited 12C nucleus in a longer time scale. The activation of momentum\nfluctuation mainly affects the high $P_z$ component to broaden it. The role of\ncluster correlations in this problem is also investigated.\n","subjects":["Physics/Nuclear Theory","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/"}