{"id":"2408.03634","title":"Two successive EUV waves and a transverse oscillation of a quiescent\n  prominence","authors":"Q. M. Zhang, M. S. Lin, X. L. Yan, J. Dai, Z. Y. Hou, Y. Li, and Y.\n  Qiu","authorsParsed":[["Zhang","Q. M.",""],["Lin","M. S.",""],["Yan","X. L.",""],["Dai","J.",""],["Hou","Z. Y.",""],["Li","Y.",""],["Qiu","Y.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:49:16 GMT"}],"updateDate":"2024-08-08","timestamp":1723020556000,"abstract":"  In this paper, we carry out multiwavelength observations of two successive\nextreme-ultraviolet (EUV) waves originating from active region (AR) NOAA 13575\nand a transverse oscillation of a columnar quiescent prominence on 2024\nFebruary 9. A hot channel eruption generates an X3.4 class flare and the\nassociated full-halo coronal mass ejection (CME), which drives the first EUV\nwave front (WF1) at a speed of $\\sim$835 km s$^{-1}$. WF1 propagates in the\nsoutheast direction and interacts with the prominence, causing an eastward\ndisplacement of the prominence immediately. Then, a second EUV wave front (WF2)\nis driven by a coronal jet at a speed of $\\sim$831 km s$^{-1}$. WF2 follows WF1\nand decelerates from $\\sim$788 km s$^{-1}$ to $\\sim$603 km s$^{-1}$ before\narriving at and touching the prominence. After reaching the maximum\ndisplacement, the prominence turns back and swings for 1$-$3 cycles. The\ntransverse oscillation of horizontal polarization is most evident in 304 {\\AA}.\nThe initial displacement amplitude, velocity in the plane of the sky, period,\nand damping time fall in the ranges of 12$-$34 Mm, 65$-$143 km s$^{-1}$,\n18$-$27 minutes, and 33$-$108 minutes, respectively. There are strong\ncorrelations among the initial amplitude, velocity, period, and height of the\nprominence. Surprisingly, the oscillation is also detected in 1600 {\\AA}, which\nis totally in phase with that in 304 {\\AA}.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}