{"id":"2408.04939","title":"Demystifying and Detecting Cryptographic Defects in Ethereum Smart\n  Contracts","authors":"Jiashuo Zhang, Yiming Shen, Jiachi Chen, Jianzhong Su, Yanlin Wang,\n  Ting Chen, Jianbo Gao, Zhong Chen","authorsParsed":[["Zhang","Jiashuo",""],["Shen","Yiming",""],["Chen","Jiachi",""],["Su","Jianzhong",""],["Wang","Yanlin",""],["Chen","Ting",""],["Gao","Jianbo",""],["Chen","Zhong",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:40:08 GMT"}],"updateDate":"2024-08-12","timestamp":1723192808000,"abstract":"  Ethereum has officially provided a set of system-level cryptographic APIs to\nenhance smart contracts with cryptographic capabilities. These APIs have been\nutilized in over 10% of Ethereum transactions, motivating developers to\nimplement various on-chain cryptographic tasks, such as digital signatures.\nHowever, since developers may not always be cryptographic experts, their ad-hoc\nand potentially defective implementations could compromise the theoretical\nguarantees of cryptography, leading to real-world security issues. To mitigate\nthis threat, we conducted the first study aimed at demystifying and detecting\ncryptographic defects in smart contracts. Through the analysis of 2,406\nreal-world security reports, we defined nine types of cryptographic defects in\nsmart contracts with detailed descriptions and practical detection patterns.\nBased on this categorization, we proposed CrySol, a fuzzing-based tool to\nautomate the detection of cryptographic defects in smart contracts. It combines\ntransaction replaying and dynamic taint analysis to extract fine-grained\ncrypto-related semantics and employs crypto-specific strategies to guide the\ntest case generation process. Furthermore, we collected a large-scale dataset\ncontaining 25,745 real-world crypto-related smart contracts and evaluated\nCrySol's effectiveness on it. The result demonstrated that CrySol achieves an\noverall precision of 95.4% and a recall of 91.2%. Notably, CrySol revealed that\n5,847 (22.7%) out of 25,745 smart contracts contain at least one cryptographic\ndefect, highlighting the prevalence of these defects.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}