{"id":"2408.06413","title":"Perturbation Theory Remixed II: Improved Modeling of Nonlinear\n  Bispectrum","authors":"Zhenyuan Wang, Donghui Jeong, Atsushi Taruya, Takahiro Nishimichi, Ken\n  Osato","authorsParsed":[["Wang","Zhenyuan",""],["Jeong","Donghui",""],["Taruya","Atsushi",""],["Nishimichi","Takahiro",""],["Osato","Ken",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723485602000,"abstract":"  We present the application of the $n$-th order Eulerian Perturbation Theory\n($n$EPT) for modeling the matter bispectrum in real space as an advancement\nover the Standard Perturbation Theory (SPT). The $n$EPT method, detailed in\nWang et al. (2023) \\cite{Wang2023nEPT}, sums up the density perturbations up to\nthe $n$-th order before computing summary statistics such as bispectrum. Taking\nadvantage of grid-based calculation of SPT (GridSPT), we make a\nrealization-based comparison of the analytical nonlinear bispectrum predictions\nfrom $n$EPT and SPT against a suite of $N$-body simulations. Using a\nspherical-bispectrum visualization scheme, we show that $n$EPT bispectrum\nmatches better than SPT bispectrum over a wide range of scales in general\n$w$CDM cosmologies. Like the power spectrum case, we find that $n$EPT\nbispectrum modeling accuracy is controlled by $\\sigma_8(z) \\equiv \\sigma_8\nD(z)$, where $D(z)$ is the linear growth factor at a redshift $z$. Notably, the\n6EPT doubles the bispectrum model's validity range compared to the one-loop SPT\nfor $\\sigma_8(z) < 0.5$, corresponding to redshifts $z\\ge1$ for the\nbest-fitting Planck-2018 cosmology. For $n\\ge5$, however, $n$EPT bispectrum\ndepends sensitively on the cut-off scale or the grid resolution. The\npercent-level modeling accuracy achieved for the spherical bispectrum (where we\naverage over all triangular configurations) becomes much degraded when fixing\nconfigurations. Thus, we show that the validity range of the field-level\ncosmological inferences must be different from that derived from averaged\nsummary statistics such as $n$-point correlation functions.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}