{"id":"2408.04718","title":"Zero-Shot Uncertainty Quantification using Diffusion Probabilistic\n  Models","authors":"Dule Shu and Amir Barati Farimani","authorsParsed":[["Shu","Dule",""],["Farimani","Amir Barati",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:34:52 GMT"}],"updateDate":"2024-08-12","timestamp":1723142092000,"abstract":"  The success of diffusion probabilistic models in generative tasks, such as\ntext-to-image generation, has motivated the exploration of their application to\nregression problems commonly encountered in scientific computing and various\nother domains. In this context, the use of diffusion regression models for\nensemble prediction is becoming a practice with increasing popularity. Under\nsuch background, we conducted a study to quantitatively evaluate the\neffectiveness of ensemble methods on solving different regression problems\nusing diffusion models. We consider the ensemble prediction of a diffusion\nmodel as a means for zero-shot uncertainty quantification, since the diffusion\nmodels in our study are not trained with a loss function containing any\nuncertainty estimation. Through extensive experiments on 1D and 2D data, we\ndemonstrate that ensemble methods consistently improve model prediction\naccuracy across various regression tasks. Notably, we observed a larger\naccuracy gain in auto-regressive prediction compared with point-wise\nprediction, and that enhancements take place in both the mean-square error and\nthe physics-informed loss. Additionally, we reveal a statistical correlation\nbetween ensemble prediction error and ensemble variance, offering insights into\nbalancing computational complexity with prediction accuracy and monitoring\nprediction confidence in practical applications where the ground truth is\nunknown. Our study provides a comprehensive view of the utility of diffusion\nensembles, serving as a useful reference for practitioners employing diffusion\nmodels in regression problem-solving.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-js4sEEM2kKV_FW2Rt1Lg7NwpbiWidwnugfZjxjgRq0","pdfSize":"33449770"}
