{"id":"2408.12631","title":"Gas permeability and mechanical properties of dust grain aggregates at\n  hyper- and zero-gravity","authors":"Holly L. Capelo, Jean-David Bod\\'enan, Martin Jutzi, Jonas K\\\"uhn,\n  Romain Cerubini, Bernhard Jost, Linus St\\\"ockli, Stefano Spadaccia, Clemence\n  Herny, Bastian Gundlach, G\\\"unter Kargl, Cl\\'ement Surville, Lucio Mayer,\n  Maria Sch\\\"onb\\\"achler, Nicolas Thomas, and Antoine Pommerol","authorsParsed":[["Capelo","Holly L.",""],["Bodénan","Jean-David",""],["Jutzi","Martin",""],["Kühn","Jonas",""],["Cerubini","Romain",""],["Jost","Bernhard",""],["Stöckli","Linus",""],["Spadaccia","Stefano",""],["Herny","Clemence",""],["Gundlach","Bastian",""],["Kargl","Günter",""],["Surville","Clément",""],["Mayer","Lucio",""],["Schönbächler","Maria",""],["Thomas","Nicolas",""],["Pommerol","Antoine",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:26:53 GMT"}],"updateDate":"2024-08-26","timestamp":1724318813000,"abstract":"  Particle-particle and particle-gas processes significantly impact planetary\nprecursors such as dust aggregates and planetesimals. We investigate gas\npermeability ($\\kappa$) in 12 granular samples, mimicking planetesimal dust\nregoliths. Using parabolic flights, this study assesses how gravitational\ncompression -- and lack thereof -- influences gas permeation, impacting the\nequilibrium state of low-gravity objects. Transitioning between micro- and\nhyper-gravity induces granular sedimentation dynamics, revealing collective\ndust-grain aerodynamics. Our experiments measure $\\kappa$ across Knudsen number\n(Kn) ranges, reflecting transitional flow. Using mass and momentum\nconservation, we derive $\\kappa$ and calculate pressure gradients within the\ngranular matrix. Key findings: 1. As confinement pressure increases with\ngravitational load and mass flow, $\\kappa$ and average pore space decrease.\nThis implies that a planetesimal's unique dust-compaction history limits\nsub-surface volatile outflows. 2. The derived pressure gradient enables tensile\nstrength determination for asteroid regolith simulants with cohesion. This\noffers a unique approach to studying dust-layer properties when suspended in\nconfinement pressures comparable to the equilibrium state on planetesimals\nsurfaces, which will be valuable for modelling their collisional evolution. 3.\nWe observe a dynamical flow symmetry breaking when granular material moves\nagainst the pressure gradient. This occurs even at low Reynolds numbers,\nsuggesting that Stokes numbers for drifting dust aggregates near the\nStokes-Epstein transition require a drag force modification based on\npermeability.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}