{"id":"2408.02012","title":"Decision Support System to triage of liver trauma","authors":"Ali Jamali (1), Azadeh Nazemi (2), Ashkan Sami (2), Rosemina\n  Bahrololoom (3), Shahram Paydar (3), Alireza Shakibafar (3) ((1) Shiraz\n  University, (2) Edinburgh Napier University, (3) Shiraz University of Medical\n  Sciences)","authorsParsed":[["Jamali","Ali",""],["Nazemi","Azadeh",""],["Sami","Ashkan",""],["Bahrololoom","Rosemina",""],["Paydar","Shahram",""],["Shakibafar","Alireza",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 12:48:20 GMT"}],"updateDate":"2024-08-06","timestamp":1722775700000,"abstract":"  Trauma significantly impacts global health, accounting for over 5 million\ndeaths annually, which is comparable to mortality rates from diseases such as\ntuberculosis, AIDS, and malaria. In Iran, the financial repercussions of road\ntraffic accidents represent approximately 2% of the nation's Gross National\nProduct each year. Bleeding is the leading cause of mortality in trauma\npatients within the first 24 hours following an injury, making rapid diagnosis\nand assessment of severity crucial. Trauma patients require comprehensive scans\nof all organs, generating a large volume of data. Evaluating CT images for the\nentire body is time-consuming and requires significant expertise, underscoring\nthe need for efficient time management in diagnosis. Efficient diagnostic\nprocesses can significantly reduce treatment costs and decrease the likelihood\nof secondary complications. In this context, the development of a reliable\nDecision Support System (DSS) for trauma triage, particularly focused on the\nabdominal area, is vital. This paper presents a novel method for detecting\nliver bleeding and lacerations using CT scans, utilising the GAN Pix2Pix\ntranslation model. The effectiveness of the method is quantified by Dice score\nmetrics, with the model achieving an accuracy of 97% for liver bleeding and 93%\nfor liver laceration detection. These results represent a notable improvement\nover current state-of-the-art technologies. The system's design integrates\nseamlessly with existing medical imaging technologies, making it a practical\naddition to emergency medical services. This research underscores the potential\nof advanced image translation models like GAN Pix2Pix in improving the\nprecision and speed of medical diagnostics in critical care scenarios.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}