{"id":"2408.14912","title":"Numerical modelling of a vortex-based superconducting memory cell:\n  dynamics and geometrical optimization of a fluxonic quantum dot","authors":"Aiste Skog, Razmik A. Hovhannisyan, and Vladimir M. Krasnov","authorsParsed":[["Skog","Aiste",""],["Hovhannisyan","Razmik A.",""],["Krasnov","Vladimir M.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:42:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724751738000,"abstract":"  The lack of dense random-access memory is one of the main obstacles to the\ndevelopment of digital superconducting computers. It has been suggested that\nAVRAM cells, based on the storage of a single Abrikosov vortex, the smallest\nquantized object in superconductors, can enable drastic miniaturization to the\nnanometer scale. In this work, we present numerical modeling of such cells\nusing time-dependent Ginzburg-Landau equations. The cell represents a fluxonic\nquantum dot containing a small superconducting island, an asymmetric notch for\nvortex entrance, a guiding track, and a vortex trap. We determine the optimal\ngeometrical parameters for operation at zero magnetic field and the conditions\nfor controllable vortex manipulation by short current pulses. We report\nultra-fast vortex motion with velocities more than an order of magnitude faster\nthan those expected for macroscopic superconductors. This phenomenon is\nattributed to strong interactions with the edges of a mesoscopic island,\ncombined with the nonlinear reduction of flux-flow viscosity due to\nnonequilibrium effects in the track. Our results show that such cells can be\nscaled down to sizes comparable to the London penetration depth, 100 nm, and\ncan enable ultrafast switching on the picosecond scale with ultra-low energy\nper operation, 0.1 aJ.\n","subjects":["Physics/Applied Physics","Condensed Matter/Superconductivity","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}