{"id":"2408.00964","title":"A Quantal Response Analysis of Defender-Attacker Sequential Security\n  Games","authors":"Md Reya Shad Azim, and Mustafa Abdallah","authorsParsed":[["Azim","Md Reya Shad",""],["Abdallah","Mustafa",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 00:40:48 GMT"}],"updateDate":"2024-08-05","timestamp":1722559248000,"abstract":"  We explore a scenario involving two sites and a sequential game between a\ndefender and an attacker, where the defender is responsible for securing the\nsites while the attacker aims to attack them. Each site holds a loss value for\nthe defender when compromised, along with a probability of successful attack.\nThe defender can reduce these probabilities through security investments at\neach site. The attacker's objective is to target the site that maximizes the\nexpected loss for the defender, taking into account the defender's security\ninvestments. While previous studies have examined security investments in such\nscenarios, our work investigates the impact of bounded rationality exhibited by\nthe defender, as identified in behavioral economics. Specifically, we consider\nquantal behavioral bias, where humans make errors in selecting efficient (pure)\nstrategies. We demonstrate the existence of a quantal response equilibrium in\nour sequential game and analyze how this bias affects the defender's choice of\noptimal security investments. Additionally, we quantify the inefficiency of\nequilibrium investments under quantal decision-making compared to an optimal\nsolution devoid of behavioral biases. We provide numerical simulations to\nvalidate our main findings.\n","subjects":["Computing Research Repository/Computer Science and Game Theory","Computing Research Repository/Cryptography and Security","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"W5kQ73qvuDCzGvyo_G2Ciul1I1dHGBZjzmG5FXjLKG0","pdfSize":"651193","txDigest":"9ft27CEKfHNyWL3wuyDpm9LtcEBtkvrLA2VwkeL4bjNk","endEpoch":"1","status":"CERTIFIED"}
