{"id":"2408.08832","title":"Personalized graph feature-based multi-omics data integration for cancer\n  subtype identification","authors":"Saiful Islam, Md. Nahid Hasan","authorsParsed":[["Islam","Saiful",""],["Hasan","Md. Nahid",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:32:10 GMT"}],"updateDate":"2024-08-19","timestamp":1723825930000,"abstract":"  Cancer is a highly heterogeneous disease with significant variability in\nmolecular features and clinical outcomes, making diagnosis and treatment\nchallenging. In recent years, high-throughput omic technologies have\nfacilitated the discovery of mechanisms underlying various cancer subtypes by\nproviding diverse omics data, such as gene expression, DNA methylation, and\nmiRNA expression. However, the complexity and heterogeneity of multi-omics data\npresent significant challenges for their integration in exploring cancer\nsubtypes. Various methods have been proposed to address these challenges. In\nthis paper, we propose a novel and straightforward approach for identifying\ncancer subtypes by integrating patient-specific subnetworks features from\ndifferent omics data. We construct patient-specific induced subnetwork using a\nrandom walk with restart algorithm from patient similarity networks (PSNs) and\ncompute nine structural properties that capture essential network topology.\nThese features are integrated across the three omic datasets to form\ncomprehensive patient profiles. K-means clustering is then applied for cancer\nsubtype identification. We evaluate our approach on five cancer datasets,\nincluding breast invasive carcinoma, colon adenocarcinoma, glioblastoma\nmultiforme, kidney renal clear cell carcinoma, and lung squamous cell\ncarcinoma, for three different omic data types. The evaluation shows that our\nmethod produces promising and effective results, demonstrating competitive or\nsuperior performance compared to existing methods and underscoring its\npotential for advancing personalized cancer diagnosis and treatment.\n","subjects":["Quantitative Biology/Quantitative Methods","Computing Research Repository/Social and Information Networks","Quantitative Biology/Genomics"],"license":"http://creativecommons.org/licenses/by/4.0/"}