{"id":"2408.03882","title":"Toroidal modified Miller-Turner CME model in EUHFORIA: II. Validation\n  and comparison with flux rope and spheromak","authors":"Anwesha Maharana, Luis Linan, Stefaan Poedts, Jasmina Magdalenic","authorsParsed":[["Maharana","Anwesha",""],["Linan","Luis",""],["Poedts","Stefaan",""],["Magdalenic","Jasmina",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 15:33:27 GMT"}],"updateDate":"2024-08-08","timestamp":1722440007000,"abstract":"  Rising concerns about the impact of space weather-related disruptions demand\nmodelling and reliable forecasting of coronal mass ejection (CME) impacts. In\nthis study, we demonstrate the application of the modified Miller-Turner (mMT)\nmodel implemented in EUropean Heliospheric FORecasting Information Asset\n(EUHFORIA), to forecast the geo-effectiveness of observed coronal mass ejection\n(CME) events in the heliosphere. The goal is to develop a model that not only\nhas a global geometry to improve overall forecasting but is also fast enough\nfor operational space weather forecasting. We test the original full torus\nimplementation and introduce a new three-fourth Torus version called the\nHorseshoe CME model. This new model has a more realistic CME geometry, and it\novercomes the inaccuracies of the full torus geometry. We constrain the torus\ngeometrical and magnetic field parameters using observed signatures of the CMEs\nbefore, during, and after the eruption. The assessment of the model's\ncapability to predict the most important Bz component is performed using the\nadvanced Dynamic Time Warping technique. The Horseshoe model prediction of CME\narrival time and geo-effectiveness for both validation events compare well to\nthe observations and are weighed with the results obtained with the spheromak\nand FRi3D models that were already available in EUHFORIA. The runtime of the\nHorseshoe model simulations is close to that of the spheromak model, which is\nsuitable for operational space weather forecasting. Yet, the capability of the\nmagnetic field prediction at 1~AU of the Horseshoe model is close to that of\nthe FRi3D model. In addition, we demonstrate that the Horseshoe CME model can\nbe used for simulating successive CMEs in EUHFORIA, overcoming a limitation of\nthe FRi3D model.\n","subjects":["Physics/Space Physics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oirlYfCP04oAzXT4XgY3viqrbklXnlLjAGhMI_sE5es","pdfSize":"47365605"}
