{"id":"2408.13905","title":"Circularly polarised electroluminescence from chiral excitons in\n  vacuum-sublimed supramolecular semiconductor thin films","authors":"Rituparno Chowdhury, Marco D. Preuss, Hwan-Hee Cho, Joshua J. P.\n  Thompson, Samarpita Sen, Tomi Baikie, Pratyush Ghosh, Yorrick Boeije,\n  Xian-Wei Chua, Kai-Wei Chang, Erjuan Guo, Joost van der Tol, Bart W. L. van\n  den Bersselaar, Andrea Taddeucci, Nicolas Daub, Daphne M. Dekker, Scott T.\n  Keene, Ghislaine Vantomme, Bruno Ehrler, Stefan C. J. Meskers, Akshay Rao,\n  Bartomeu Monserrat, E. W. Meijer, Richard H. Friend","authorsParsed":[["Chowdhury","Rituparno",""],["Preuss","Marco D.",""],["Cho","Hwan-Hee",""],["Thompson","Joshua J. P.",""],["Sen","Samarpita",""],["Baikie","Tomi",""],["Ghosh","Pratyush",""],["Boeije","Yorrick",""],["Chua","Xian-Wei",""],["Chang","Kai-Wei",""],["Guo","Erjuan",""],["van der Tol","Joost",""],["Bersselaar","Bart W. L. van den",""],["Taddeucci","Andrea",""],["Daub","Nicolas",""],["Dekker","Daphne M.",""],["Keene","Scott T.",""],["Vantomme","Ghislaine",""],["Ehrler","Bruno",""],["Meskers","Stefan C. J.",""],["Rao","Akshay",""],["Monserrat","Bartomeu",""],["Meijer","E. W.",""],["Friend","Richard H.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 18:02:36 GMT"}],"updateDate":"2024-08-27","timestamp":1724608956000,"abstract":"  Materials with chiral electronic structures are of great interest. We report\na triazatruxene, TAT, molecular semiconductor with chiral alkyl side chains\nthat crystallises from solution to form chirally-stacked columns with a helical\npitch of 6 TATs (2.3 nm). These crystals show strong circularly polarised, CP,\ngreen photoluminescence, with dissymmetry of 24%. Electronic structure\ncalculations using the full crystal structure, show that this chiral stacking\nassociates angular momentum to the valence and conduction states and thus gives\nrise to the observed CP luminescence. Free-standing crystals are not useful for\nactive semiconductor devices, but we have discovered that co-sublimation of TAT\nas the guest in a structurally mismatched host enables the fabrication of thin\nfilms where the chiral crystallization is achieved in-situ by\nthermally-triggered nano-phase segregation of dopant and host whilst preserving\nthe integrity of the film. This enables fabrication of bright (green) organic\nlight-emitting diodes with unexpectedly high external quantum efficiencies of\nup to 16% and electroluminescence dissymmetries above 10%. These materials and\nthis process method offer significant application potential in spintronics,\noptical displays and multidimensional optoelectronics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"maKDuf3fUX054wVAi0DjdAsNGBMADFGfcYbSvEsI6ec","pdfSize":"2462345"}
