{"id":"2408.14965","title":"Planetary radio interferometry and Doppler experiment as an operational\n  component of the Jupiter Icy Moons Explorer mission","authors":"Vidhya Pallichadath, Dominic Dirkx, Marie S. Fayolle, Sandor Frey,\n  Leonid I. Gurvits, Paul Boven, Giuseppe Cimo, Judit Fogasy, Guifre Molera\n  Calves, Krisztina Perger, N. Masdiana Md Said, Bert L.A. Vermeersen","authorsParsed":[["Pallichadath","Vidhya",""],["Dirkx","Dominic",""],["Fayolle","Marie S.",""],["Frey","Sandor",""],["Gurvits","Leonid I.",""],["Boven","Paul",""],["Cimo","Giuseppe",""],["Fogasy","Judit",""],["Calves","Guifre Molera",""],["Perger","Krisztina",""],["Said","N. Masdiana Md",""],["Vermeersen","Bert L. A.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 11:12:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724757154000,"abstract":"  We present an overview of the operations and engineering interface for\nPlanetary Radio Interferometry and Doppler Experiment (PRIDE) radio astronomy\nobservations as a scientific component of the ESA s Jupiter Icy Moons Explorer\n(JUICE) mission, as well as other prospective planetary and space science\nmissions. The article discusses advanced scheduling and planning methods that\nmake it possible to create observing schedules for observations of specific\nspacecraft in concurrence with observations of natural radio sources. In order\nto put this into practice and find suitable natural background calibrator\nsources for PRIDE of JUICE mission, we developed planning and scheduling\nsoftware. The conventional scheduling software for natural celestial radio\nsources is not set up to include spacecraft as observation targets in the\nnecessary control files. Therefore, difficulties already arise during\nobservation planning. We report on the development of new and the adaptation of\nexisting routines used in astrophysical and geodetic VLBI for satellite\nscheduling and planning. The analysis of the PRIDE science observations led to\nimproved observational planning, and the mission s scheduling methodologies\nwere studied using a systems engineering approach. In addition, we highlighted\nthe new procedures, like finding charts for selecting calibrator radio sources\nover a range of frequency bands and the outcomes of those strategies for\nscience operation planning. A simulation of the flyby of Venus during the\ncruise phase of the JUICE spacecraft, based on the Tudat software, is also\npresented, resulting in a promising opportunity to test PRIDE techniques and\nevaluate the improvements that PRIDE observables can make to natural bodies\nephemerides.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}