{"id":"2408.00238","title":"Anytime Trust Rating Dynamics in a Human-Robot Interaction Task","authors":"Jason Dekarske, Gregory Bales, Zhaodan Kong, Sanjay Joshi","authorsParsed":[["Dekarske","Jason",""],["Bales","Gregory",""],["Kong","Zhaodan",""],["Joshi","Sanjay",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:23:09 GMT"}],"updateDate":"2024-08-02","timestamp":1722478989000,"abstract":"  Objective We model factors contributing to rating timing for a\nsingle-dimensional, any-time trust in robotics measure.\n  Background Many studies view trust as a slow-changing value after subjects\ncomplete a trial or at regular intervals. Trust is a multifaceted concept that\ncan be measured simultaneously with a human-robot interaction.\n  Method 65 subjects commanded a remote robot arm in a simulated space station.\nThe robot picked and placed stowage commanded by the subject, but the robot's\nperformance varied from trial to trial. Subjects rated their trust on a\nnon-obtrusive trust slider at any time throughout the experiment.\n  Results A Cox Proportional Hazards Model described the time it took subjects\nto rate their trust in the robot. A retrospective survey indicated that\nsubjects based their trust on the robot's performance or outcome of the task.\nStrong covariates representing the task's state reflected this in the model.\n  Conclusion Trust and robot task performance contributed little to the timing\nof the trust rating. The subjects' exit survey responses aligned with the\nassumption that the robot's task progress was the main reason for the timing of\ntheir trust rating.\n  Application Measuring trust in a human-robot interaction task should take as\nlittle attention away from the task as possible. This trust rating technique\nlays the groundwork for single-dimensional trust queries that probe estimated\nhuman action.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}