{"id":"2408.16110","title":"Micro and macro facial expressions by driven animations in realistic\n  Virtual Humans","authors":"Rubens Halbig Montanha, Giovana Nascimento Raupp, Ana Carolina\n  Policarpo Schmitt, Victor Fl\\'avio de Andrade Araujo, Soraia Raupp Musse","authorsParsed":[["Montanha","Rubens Halbig",""],["Raupp","Giovana Nascimento",""],["Schmitt","Ana Carolina Policarpo",""],["Araujo","Victor Flávio de Andrade",""],["Musse","Soraia Raupp",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 19:37:32 GMT"}],"updateDate":"2024-08-30","timestamp":1724873852000,"abstract":"  Computer Graphics (CG) advancements have allowed the creation of more\nrealistic Virtual Humans (VH) through modern techniques for animating the VH\nbody and face, thereby affecting perception. From traditional methods,\nincluding blend shapes, to driven animations using facial and body tracking,\nthese advancements can potentially enhance the perception of comfort and\nrealism in relation to VHs. Previously, Psychology studied facial movements in\nhumans, with some works separating expressions into macro and micro\nexpressions. Also, some previous CG studies have analyzed how macro and micro\nexpressions are perceived, replicating psychology studies in VHs, encompassing\nstudies with realistic and cartoon VHs, and exploring different VH\ntechnologies. However, instead of using facial tracking animation methods,\nthese previous studies animated the VHs using blendshapes interpolation. To\nunderstand how the facial tracking technique alters the perception of VHs, this\npaper extends the study to macro and micro expressions, employing two datasets\nto transfer real facial expressions to VHs and analyze how their expressions\nare perceived. Our findings suggest that transferring facial expressions from\nreal actors to VHs significantly diminishes the accuracy of emotion perception\ncompared to VH facial animations created by artists.\n","subjects":["Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2MD2y8qfyWKl1J04kNKARx-pbp1j8IDicuY66PlyZlo","pdfSize":"5381962"}
