{"id":"2408.00634","title":"Evaluation Metrics and Methods for Generative Models in the Wireless PHY\n  Layer","authors":"Michael Baur, Nurettin Turan, Simon Wallner, Wolfgang Utschick","authorsParsed":[["Baur","Michael",""],["Turan","Nurettin",""],["Wallner","Simon",""],["Utschick","Wolfgang",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:17:55 GMT"}],"updateDate":"2024-08-02","timestamp":1722525475000,"abstract":"  Generative models are typically evaluated by direct inspection of their\ngenerated samples, e.g., by visual inspection in the case of images. Further\nevaluation metrics like the Fr\\'echet inception distance or maximum mean\ndiscrepancy are intricate to interpret and lack physical motivation. These\nobservations make evaluating generative models in the wireless PHY layer\nnon-trivial. This work establishes a framework consisting of evaluation metrics\nand methods for generative models applied to the wireless PHY layer. The\nproposed metrics and methods are motivated by wireless applications,\nfacilitating interpretation and understandability for the wireless community.\nIn particular, we propose a spectral efficiency analysis for validating the\ngenerated channel norms and a codebook fingerprinting method to validate the\ngenerated channel directions. Moreover, we propose an application cross-check\nto evaluate the generative model's samples for training machine learning-based\nmodels in relevant downstream tasks. Our analysis is based on real-world\nmeasurement data and includes the Gaussian mixture model, variational\nautoencoder, diffusion model, and generative adversarial network as generative\nmodels. Our results under a fair comparison in terms of model architecture\nindicate that solely relying on metrics like the maximum mean discrepancy\nproduces insufficient evaluation outcomes. In contrast, the proposed metrics\nand methods exhibit consistent and explainable behavior.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}