{"id":"2408.08250","title":"Computer Vision Model Compression Techniques for Embedded Systems: A\n  Survey","authors":"Alexandre Lopes, Fernando Pereira dos Santos, Diulhio de Oliveira,\n  Mauricio Schiezaro, Helio Pedrini","authorsParsed":[["Lopes","Alexandre",""],["Santos","Fernando Pereira dos",""],["de Oliveira","Diulhio",""],["Schiezaro","Mauricio",""],["Pedrini","Helio",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 16:41:55 GMT"}],"updateDate":"2024-08-16","timestamp":1723740115000,"abstract":"  Deep neural networks have consistently represented the state of the art in\nmost computer vision problems. In these scenarios, larger and more complex\nmodels have demonstrated superior performance to smaller architectures,\nespecially when trained with plenty of representative data. With the recent\nadoption of Vision Transformer (ViT) based architectures and advanced\nConvolutional Neural Networks (CNNs), the total number of parameters of leading\nbackbone architectures increased from 62M parameters in 2012 with AlexNet to 7B\nparameters in 2024 with AIM-7B. Consequently, deploying such deep architectures\nfaces challenges in environments with processing and runtime constraints,\nparticularly in embedded systems. This paper covers the main model compression\ntechniques applied for computer vision tasks, enabling modern models to be used\nin embedded systems. We present the characteristics of compression subareas,\ncompare different approaches, and discuss how to choose the best technique and\nexpected variations when analyzing it on various embedded devices. We also\nshare codes to assist researchers and new practitioners in overcoming initial\nimplementation challenges for each subarea and present trends for Model\nCompression. Case studies for compression models are available at\n\\href{https://github.com/venturusbr/cv-model-compression}{https://github.com/venturusbr/cv-model-compression}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"w3lXC2bv4WT7CV0fxn3Yh8oX86zUauF_ag25ibqtG9U","pdfSize":"1487389"}
