{"id":"2408.09482","title":"First Discovery and Confirmation of PN Candidates Found from AI and Deep\n  Learning Techniques Applied to VPHAS+ Survey Data","authors":"Yushan Li, Quentin Parker, and Peng Jia","authorsParsed":[["Li","Yushan",""],["Parker","Quentin",""],["Jia","Peng",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 13:51:06 GMT"}],"updateDate":"2024-08-20","timestamp":1723989066000,"abstract":"  Context. We have developed deep learning (DL) and AI-based tools to search\nextant narrow-band wide-field H$\\alpha$ surveys of the Galactic Plane for\nelusive planetary nebulae (PNe) which are hidden in dense star fields towards\nthe Galactic center. They are faint, low-surface brightness, usually resolved\nsources, which are not discovered by previous automatic searches that depend on\nphotometric data for point-like sources. These sources are very challenging to\nfind by traditional visual inspection in such crowded fields and many have been\nmissed. We have successfully adopted a novel 'Swin-Transformer' AI algorithm,\nwhich we described in detail in the preceding Techniques paper (Paper I). Aims.\nHere, we present preliminary results from our first spectroscopic follow-up run\nfor 31 top-quality PN candidates found by the algorithm from the\nhigh-resolution H$\\alpha$ survey VPHAS+. This survey has not yet undergone\nextensive manual, systematic searching. Methods. Our candidate PNe were\nobserved with the SpUpNIC spectrograph on the 1.9 m telescope at the South\nAfrican Astronomical Observatory (SAAO) in June 2023. We performed standard\nIRAF spectroscopic reduction and then followed our normal HASH PN\nidentification and classification procedures. Results. Our reduced spectra\nconfirmed that these candidates include 22 true, likely, and possible PNe\n(70.97\\%), 3 emission-line galaxies, 2 emission-line stars, 2 late-type star\ncontaminants, and 2 other H$\\alpha$ sources including a newly identified\ndetached fragment of SNR RCW 84. We present the imaging and spectral data of\nthese candidates and a preliminary analysis of their properties. These data\nprovide strong input to help evaluate and refine the behavior of the AI\nalgorithm when searching for PNe in wide-field H$\\alpha$ surveys.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}