{"id":"2408.05642","title":"Unitary control of partially coherent waves. II. Transmission or\n  reflection","authors":"Cheng Guo, Shanhui Fan","authorsParsed":[["Guo","Cheng",""],["Fan","Shanhui",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 21:57:25 GMT"}],"updateDate":"2024-08-13","timestamp":1723327045000,"abstract":"  Coherent control of wave transmission and reflection is crucial for\napplications in communication, imaging, and sensing. However, many practical\nscenarios involve partially coherent waves rather than fully coherent ones. We\npresent a systematic theory for the unitary control of partially coherent wave\ntransmission and reflection. For a linear time-invariant system with an\nincident partially coherent wave, we derive analytical expressions for the\nrange of attainable total transmittance and reflectance under arbitrary unitary\ntransformations. We also introduce an explicit algorithm to construct a unitary\ncontrol scheme that achieves any desired transmission or reflection within the\nattainable range. As applications of our theory, we establish conditions for\nfour novel phenomena: partially coherent perfect transmission, partially\ncoherent perfect reflection, partially coherent zero transmission, and\npartially coherent zero reflection. We also prove a theorem that relates the\ndegree of coherence of the incident field, quantified by the majorization\norder, to the resulting transmission and reflection intervals. Furthermore, we\ndemonstrate that reciprocity (or energy conservation) imposes direct symmetry\nconstraints on bilateral transmission (or transmission and reflection) of\npartially coherent waves under unitary control. Our results provide fundamental\ninsights and practical guidelines for using unitary control to manipulate the\ntransmission and reflection of partially coherent waves. This theory applies to\nvarious wave systems, including electromagnetic and acoustic waves.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}