{"id":"2408.01459","title":"AgentPeerTalk: Empowering Students through Agentic-AI-Driven Discernment\n  of Bullying and Joking in Peer Interactions in Schools","authors":"Aditya Paul, Chi Lok Yu, Eva Adelina Susanto, Nicholas Wai Long Lau,\n  Gwenyth Isobel Meadows","authorsParsed":[["Paul","Aditya",""],["Yu","Chi Lok",""],["Susanto","Eva Adelina",""],["Lau","Nicholas Wai Long",""],["Meadows","Gwenyth Isobel",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 05:50:02 GMT"}],"updateDate":"2024-08-06","timestamp":1722059402000,"abstract":"  Addressing school bullying effectively and promptly is crucial for the mental\nhealth of students. This study examined the potential of large language models\n(LLMs) to empower students by discerning between bullying and joking in school\npeer interactions. We employed ChatGPT-4, Gemini 1.5 Pro, and Claude 3 Opus,\nevaluating their effectiveness through human review. Our results revealed that\nnot all LLMs were suitable for an agentic approach, with ChatGPT-4 showing the\nmost promise. We observed variations in LLM outputs, possibly influenced by\npolitical overcorrectness, context window limitations, and pre-existing bias in\ntheir training data. ChatGPT-4 excelled in context-specific accuracy after\nimplementing the agentic approach, highlighting its potential to provide\ncontinuous, real-time support to vulnerable students. This study underlines the\nsignificant social impact of using agentic AI in educational settings, offering\na new avenue for reducing the negative consequences of bullying and enhancing\nstudent well-being.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"TBmKKWaQtSjB-V7JPJrWuSh6-WM_H1JZ75tmUtn8HQ8","pdfSize":"258962","txDigest":"Smmssv2t2WHuBLvpPG3gg8kHmKfsg96ufB1uE3cwQNT","endEpoch":"1","status":"CERTIFIED"}
