{"id":"2408.07516","title":"DIffSteISR: Harnessing Diffusion Prior for Superior Real-world Stereo\n  Image Super-Resolution","authors":"Yuanbo Zhou, Xinlin Zhang, Wei Deng, Tao Wang, Tao Tan, Qinquan Gao,\n  Tong Tong","authorsParsed":[["Zhou","Yuanbo",""],["Zhang","Xinlin",""],["Deng","Wei",""],["Wang","Tao",""],["Tan","Tao",""],["Gao","Qinquan",""],["Tong","Tong",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 12:49:50 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 02:14:18 GMT"}],"updateDate":"2024-08-16","timestamp":1723639790000,"abstract":"  We introduce DiffSteISR, a pioneering framework for reconstructing real-world\nstereo images. DiffSteISR utilizes the powerful prior knowledge embedded in\npre-trained text-to-image model to efficiently recover the lost texture details\nin low-resolution stereo images. Specifically, DiffSteISR implements a\ntime-aware stereo cross attention with temperature adapter (TASCATA) to guide\nthe diffusion process, ensuring that the generated left and right views exhibit\nhigh texture consistency thereby reducing disparity error between the\nsuper-resolved images and the ground truth (GT) images. Additionally, a stereo\nomni attention control network (SOA ControlNet) is proposed to enhance the\nconsistency of super-resolved images with GT images in the pixel, perceptual,\nand distribution space. Finally, DiffSteISR incorporates a stereo semantic\nextractor (SSE) to capture unique viewpoint soft semantic information and\nshared hard tag semantic information, thereby effectively improving the\nsemantic accuracy and consistency of the generated left and right images.\nExtensive experimental results demonstrate that DiffSteISR accurately\nreconstructs natural and precise textures from low-resolution stereo images\nwhile maintaining a high consistency of semantic and texture between the left\nand right views.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}