{"id":"2408.11820","title":"Responsible AI Question Bank: A Comprehensive Tool for AI Risk\n  Assessment","authors":"Sung Une Lee, Harsha Perera, Yue Liu, Boming Xia, Qinghua Lu, Liming\n  Zhu","authorsParsed":[["Lee","Sung Une",""],["Perera","Harsha",""],["Liu","Yue",""],["Xia","Boming",""],["Lu","Qinghua",""],["Zhu","Liming",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 22:40:20 GMT"}],"updateDate":"2024-08-23","timestamp":1722638420000,"abstract":"  The rapid growth of Artificial Intelligence (AI) has underscored the urgent\nneed for responsible AI practices. Despite increasing interest, a comprehensive\nAI risk assessment toolkit remains lacking. This study introduces our\nResponsible AI (RAI) Question Bank, a comprehensive framework and tool designed\nto support diverse AI initiatives. By integrating AI ethics principles such as\nfairness, transparency, and accountability into a structured question format,\nthe RAI Question Bank aids in identifying potential risks, aligning with\nemerging regulations like the EU AI Act, and enhancing overall AI governance. A\nkey benefit of the RAI Question Bank is its systematic approach to linking\nlower-level risk questions to higher-level ones and related themes, preventing\nsiloed assessments and ensuring a cohesive evaluation process. Case studies\nillustrate the practical application of the RAI Question Bank in assessing AI\nprojects, from evaluating risk factors to informing decision-making processes.\nThe study also demonstrates how the RAI Question Bank can be used to ensure\ncompliance with standards, mitigate risks, and promote the development of\ntrustworthy AI systems. This work advances RAI by providing organizations with\na valuable tool to navigate the complexities of ethical AI development and\ndeployment while ensuring comprehensive risk management.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}