{"id":"2408.11067","title":"Toward End-to-End Bearing Fault Diagnosis for Industrial Scenarios with\n  Spiking Neural Networks","authors":"Yongqi Ding, Lin Zuo, Mengmeng Jing, Kunshan Yang, Biao Chen, Yunqian\n  Yu","authorsParsed":[["Ding","Yongqi",""],["Zuo","Lin",""],["Jing","Mengmeng",""],["Yang","Kunshan",""],["Chen","Biao",""],["Yu","Yunqian",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 06:41:58 GMT"}],"updateDate":"2024-08-22","timestamp":1723876918000,"abstract":"  Spiking neural networks (SNNs) transmit information via low-power binary\nspikes and have received widespread attention in areas such as computer vision\nand reinforcement learning. However, there have been very few explorations of\nSNNs in more practical industrial scenarios. In this paper, we focus on the\napplication of SNNs in bearing fault diagnosis to facilitate the integration of\nhigh-performance AI algorithms and real-world industries. In particular, we\nidentify two key limitations of existing SNN fault diagnosis methods:\ninadequate encoding capacity that necessitates cumbersome data preprocessing,\nand non-spike-oriented architectures that constrain the performance of SNNs. To\nalleviate these problems, we propose a Multi-scale Residual Attention SNN\n(MRA-SNN) to simultaneously improve the efficiency, performance, and robustness\nof SNN methods. By incorporating a lightweight attention mechanism, we have\ndesigned a multi-scale attention encoding module to extract multiscale fault\nfeatures from vibration signals and encode them as spatio-temporal spikes,\neliminating the need for complicated preprocessing. Then, the spike residual\nattention block extracts high-dimensional fault features and enhances the\nexpressiveness of sparse spikes with the attention mechanism for end-to-end\ndiagnosis. In addition, the performance and robustness of MRA-SNN is further\nenhanced by introducing the lightweight attention mechanism within the spiking\nneurons to simulate the biological dendritic filtering effect. Extensive\nexperiments on MFPT and JNU benchmark datasets demonstrate that MRA-SNN\nsignificantly outperforms existing methods in terms of accuracy, energy\nconsumption and noise robustness, and is more feasible for deployment in\nreal-world industrial scenarios.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}