{"id":"2408.12247","title":"Enhanced Fine-Tuning of Lightweight Domain-Specific Q&A Model Based on\n  Large Language Models","authors":"Shenglin Zhang, Pengtian Zhu, Minghua Ma, Jiagang Wang, Yongqian Sun,\n  Dongwen Li, Jingyu Wang, Qianying Guo, Xiaolei Hua, Lin Zhu and Dan Pei","authorsParsed":[["Zhang","Shenglin",""],["Zhu","Pengtian",""],["Ma","Minghua",""],["Wang","Jiagang",""],["Sun","Yongqian",""],["Li","Dongwen",""],["Wang","Jingyu",""],["Guo","Qianying",""],["Hua","Xiaolei",""],["Zhu","Lin",""],["Pei","Dan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 09:36:15 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 01:25:26 GMT"}],"updateDate":"2024-08-26","timestamp":1724319375000,"abstract":"  Large language models (LLMs) excel at general question-answering (Q&A) but\noften fall short in specialized domains due to a lack of domain-specific\nknowledge. Commercial companies face the dual challenges of privacy protection\nand resource constraints when involving LLMs for fine-tuning. This paper\npropose a novel framework, Self-Evolution, designed to address these issues by\nleveraging lightweight open-source LLMs through multiple iterative fine-tuning\nrounds. To enhance the efficiency of iterative fine-tuning, Self-Evolution\nemploy a strategy that filters and reinforces the knowledge with higher value\nduring the iterative process. We employed Self-Evolution on Qwen1.5-7B-Chat\nusing 4,000 documents containing rich domain knowledge from China Mobile,\nachieving a performance score 174% higher on domain-specific question-answering\nevaluations than Qwen1.5-7B-Chat and even 22% higher than Qwen1.5-72B-Chat.\nSelf-Evolution has been deployed in China Mobile's daily operation and\nmaintenance for 117 days, and it improves the efficiency of locating alarms,\nfixing problems, and finding related reports, with an average efficiency\nimprovement of over 18.6%. In addition, we release Self-Evolution framework\ncode in https://github.com/Zero-Pointer/Self-Evolution.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}