{"id":"2408.04488","title":"Multi-Objective LQR with Linear Scalarization","authors":"Ali Jadbabaie, Devavrat Shah, Sean R. Sinclair","authorsParsed":[["Jadbabaie","Ali",""],["Shah","Devavrat",""],["Sinclair","Sean R.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:35:55 GMT"}],"updateDate":"2024-08-09","timestamp":1723127755000,"abstract":"  The framework of decision-making, modeled as a Markov Decision Process (MDP),\ntypically assumes a single objective. However, most practical scenarios involve\nconsidering tradeoffs between multiple objectives. With that as the motivation,\nwe consider the task of finding the Pareto front of achievable tradeoffs in the\ncontext of Linear Quadratic Regulator (LQR), a canonical example of a\ncontinuous, infinite horizon MDP. As our first contribution, we establish that\nthe Pareto front for LQR is characterized by linear scalarization, wherein a\nlinear combination of the objectives creates a single objective, and by varying\nthe weight of the linear combination one achieves different possible tradeoffs.\nThat is, each tradeoff point on the Pareto front of multi-objective LQR turns\nout to be a single objective LQR where the objective is a convex combination of\nthe multiple objectives. Intellectually, our work provides an important example\nof linear scalarization being sufficient for a non-convex multi-objective\nproblem. As our second contribution, we establish the smoothness of the Pareto\nfront, showing that the optimal control to an $\\epsilon$-perturbation to a\nscalarization parameter yields an $O(\\epsilon)$-approximation to its objective\nperformance. Together these results highlight a simple algorithm to approximate\nthe continuous Pareto front by optimizing over a grid of scalarization\nparameters. Unlike other scalarization methods, each individual optimization\nproblem retains the structure of a single objective LQR problem, making them\ncomputationally feasible. Lastly, we extend the results to consider certainty\nequivalence, where the unknown dynamics are replaced with estimates.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_7ZrqdL9yRoYxjOZo_Bi1lndYNPd-lBVP_FYiXpgXUI","pdfSize":"664397"}
