{"id":"2408.12437","title":"Robotic Eye-in-hand Visual Servo Axially Aligning Nasopharyngeal Swabs\n  with the Nasal Cavity","authors":"Peter Q. Lee, John S. Zelek, Katja Mombaur","authorsParsed":[["Lee","Peter Q.",""],["Zelek","John S.",""],["Mombaur","Katja",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:36:06 GMT"}],"updateDate":"2024-08-23","timestamp":1724337366000,"abstract":"  The nasopharyngeal (NP) swab test is a method for collecting cultures to\ndiagnose for different types of respiratory illnesses, including COVID-19.\nDelegating this task to robots would be beneficial in terms of reducing\ninfection risks and bolstering the healthcare system, but a critical component\nof the NP swab test is having the swab aligned properly with the nasal cavity\nso that it does not cause excessive discomfort or injury by traveling down the\nwrong passage. Existing research towards robotic NP swabbing typically assumes\nthe patient's head is held within a fixture. This simplifies the alignment\nproblem, but is also dissimilar to clinical scenarios where patients are\ntypically free-standing. Consequently, our work creates a vision-guided\npipeline to allow an instrumented robot arm to properly position and orient NP\nswabs with respect to the nostrils of free-standing patients. The first\ncomponent of the pipeline is a precomputed joint lookup table to allow the arm\nto meet the patient's arbitrary position in the designated workspace, while\navoiding joint limits. Our pipeline leverages semantic face models from\ncomputer vision to estimate the Euclidean pose of the face with respect to a\nmonocular RGB-D camera placed on the end-effector. These estimates are passed\ninto an unscented Kalman filter on manifolds state estimator and a pose based\nvisual servo control loop to move the swab to the designated pose in front of\nthe nostril. Our pipeline was validated with human trials, featuring a cohort\nof 25 participants. The system is effective, reaching the nostril for 84% of\nparticipants, and our statistical analysis did not find significant demographic\nbiases within the cohort.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}