{"id":"2408.16747","title":"Post-innermost stable circular orbit ringdown of a rapidly spinning\n  black hole: mass ratio dependence of higher harmonic quasi-normal mode\n  excitation","authors":"Daiki Watarai","authorsParsed":[["Watarai","Daiki",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:40:06 GMT"}],"updateDate":"2024-08-30","timestamp":1724953206000,"abstract":"  In a binary merger with a small mass ratio, as the secondary body approaches\nthe innermost stable circular orbit (ISCO) of the primary black hole, the\nmotion transitions from the adiabatic inspiral to the plunge governed by the\ngeodesic equation. The plunge orbit is expected to excite the ringdown\ngravitational wave, which encodes information about the primary black hole's\ngeometry. The details of the transition regime depend on the binary's mass\nratio through radiation fluxes, which in turn influence the initial conditions\nfor the plunge. As such, the mass ratio affects the post-ISCO ringdown\ngravitational wave excitation. In this study, we numerically investigate the\nmass ratio dependence of higher harmonic quasi-normal mode excitations in the\npost-ISCO gravitational waves of rapidly spinning black holes, based on the\nTeukolsky-Sasaki-Nakamura formalism. We consider the effect of mass ratio on\nthe gravitational waves by accounting for the energy and angular momentum\nlosses during the transition regime following the Ori-Thorne procedure. We\nexamine two mass ratio scenarios: the intermediate mass ratio (IMR) and the\nextreme mass ratio (EMR). Our main finding is that higher harmonic quasi-normal\nmodes are significantly excited in an IMR merger involving a highly spinning\nprimary black hole. This implies that detecting an IMR merger involving such a\nprimary black hole with space-based gravitational wave interferometers can\nprovide valuable opportunities to infer black hole properties or test general\nrelativity with excellent precision.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}