{"id":"2408.15414","title":"Continuum Damage Model for Hydrogen Embrittlement in Ferritic Steels","authors":"Dakshina Murthy Valiveti and T. Neeraj","authorsParsed":[["Valiveti","Dakshina Murthy",""],["Neeraj","T.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:42:23 GMT"}],"updateDate":"2024-08-29","timestamp":1724794943000,"abstract":"  Hydrogen embrittlement of metals and alloys, particularly steels, has been an\nimportant scientific and engineering challenge in the Oil and Gas industry for\nmany years. It impacts the integrity and performance of a wide range of\nstructures and equipment such as downhole tubulars and pipelines in sour\nservice in the Upstream (U/S) and hydro-processing reactors in the Downstream\n(D/S). In addition, the rapidly growing interest in hydrogen as an energy\ncarrier for fuel cells and mobility or as a clean fuel/heat source for hard to\ndecarbonize industrial processes, draws attention to this key challenge of\nmaterials integrity in handling hydrogen. The fundamental understanding of\nfailure mechanism(s) and the capability to model material behavior is important\nfor managing the integrity and for repurposing existing infrastructure for\ntransporting hydrogen as well as for extending the life of structures. To that\nextent, the present work develops a robust mathematical model to estimate the\nstrength degradation and embrittlement due to hydrogen in steels. The model\nincorporates hydrogen affected constitutive response of material, within the\nframework of finite element method. The modified constitutive response is a\nGurson plasticity based continuum damage model and incorporates two vital\naspects of NVC failure theory. These key aspects are (i) hydrogen enhanced\nlocalized dislocation plasticity, and (ii) hydrogen enhanced vacancy\nstabilization forming nano-voids. The deformation and damage in the material is\ncoupled with trap mediated hydrogen diffusion. Calibration of damage model\nparameters is performed for X65 commercial linepipe steel. Finally, capability\nof the damage model is demonstrated with numerical simulation of round bar\ntensile tests on X65 steel under hydrogen exposure. The numerical simulations\nare shown to be in excellent agreement with experimental results.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}