{"id":"2408.13100","title":"Complete Autonomous Robotic Nasopharyngeal Swab System with Evaluation\n  on a Stochastically Moving Phantom Head","authors":"Peter Q. Lee, John S. Zelek, Katja Mombaur","authorsParsed":[["Lee","Peter Q.",""],["Zelek","John S.",""],["Mombaur","Katja",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:22:42 GMT"}],"updateDate":"2024-08-26","timestamp":1724422962000,"abstract":"  The application of autonomous robotics to close-contact healthcare tasks has\na clear role for the future due to its potential to reduce infection risks to\nstaff and improve clinical efficiency. Nasopharyngeal (NP) swab sample\ncollection for diagnosing upper-respiratory illnesses is one type of close\ncontact task that is interesting for robotics due to the dexterity requirements\nand the unobservability of the nasal cavity. We propose a control system that\nperforms the test using a collaborative manipulator arm with an instrumented\nend-effector to take visual and force measurements, under the scenario that the\npatient is unrestrained and the tools are general enough to be applied to other\nclose contact tasks. The system employs a visual servo controller to align the\nswab with the nostrils. A compliant joint velocity controller inserts the swab\nalong a trajectory optimized through a simulation environment, that also reacts\nto measured forces applied to the swab. Additional subsystems include a fuzzy\nlogic system for detecting when the swab reaches the nasopharynx and a method\nfor detaching the swab and aborting the procedure if safety criteria is\nviolated. The system is evaluated using a second robotic arm that holds a nasal\ncavity phantom and simulates the natural head motions that could occur during\nthe procedure. Through extensive experiments, we identify controller\nconfigurations capable of effectively performing the NP swab test even with\nsignificant head motion, which demonstrates the safety and reliability of the\nsystem.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}