{"id":"2408.10109","title":"On the loss of orthogonality in low-synchronization variants of\n  reorthogonalized block classical Gram-Schmidt","authors":"Erin Carson, Kathryn Lund, Yuxin Ma, and Eda Oktay","authorsParsed":[["Carson","Erin",""],["Lund","Kathryn",""],["Ma","Yuxin",""],["Oktay","Eda",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:56:22 GMT"}],"updateDate":"2024-08-20","timestamp":1724082982000,"abstract":"  Interest in communication-avoiding orthogonalization schemes for\nhigh-performance computing has been growing recently. This manuscript addresses\nopen questions about the numerical stability of various block classical\nGram-Schmidt variants that have been proposed in the past few years. An\nabstract framework is employed, the flexibility of which allows for new\nrigorous bounds on the loss of orthogonality in these variants. We first\nanalyze a generalization of (reorthogonalized) block classical Gram-Schmidt and\nshow that a \"strong\" intrablock orthogonalization routine is only needed for\nthe very first block in order to maintain orthogonality on the level of the\nunit roundoff.\n  Then, using this variant, which has four synchronization points per block\ncolumn, we remove the synchronization points one at a time and analyze how each\nalteration affects the stability of the resulting method. Our analysis shows\nthat the variant requiring only one synchronization per block column cannot be\nguaranteed to be stable in practice, as stability begins to degrade with the\nfirst reduction of synchronization points.\n  Our analysis of block methods also provides new theoretical results for the\nsingle-column case. In particular, it is proven that DCGS2 from [Bielich, D. et\nal. Par. Comput. 112 (2022)] and CGS-2 from [\\'{S}wirydowicz, K. et al, Num.\nLin. Alg. Appl. 28 (2021)] are as stable as Householder QR. Numerical examples\nfrom the BlockStab toolbox are included throughout, to help compare variants\nand illustrate the effects of different choices of intraorthogonalization\nsubroutines.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}