{"id":"2408.06915","title":"On the KG-constrained Bekenstein's disformal transformation of the\n  Einstein-Hilbert action","authors":"Allan L. Alinea and Joshwa DJ. Ordonez","authorsParsed":[["Alinea","Allan L.",""],["Ordonez","Joshwa DJ.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:06:56 GMT"}],"updateDate":"2024-08-14","timestamp":1723558016000,"abstract":"  Motivated by an inclination for symmetry and possible extension of the\nGeneral Theory of Relativity within the framework of Scalar Theory, we\ninvestigate the Bekenstein's disformal transformation of the Einstein-Hilbert\naction. Owing to the complicated combinations of second order metric\nderivatives encoded in the Ricci scalar of the action, such a transformation\nyields an unwieldy expression. To `tame' the transformed action, we exploit the\nconformal-disformal (KG) constraint previously discovered in the study of the\ninvariance of the massless Klein-Gordon equation under disformal\ntransformation. The result upon its application is a surprisingly much more\nconcise and simple action in four spacetime dimensions containing three out of\nfour sub-Lagrangians found in the Horndeski action, and three beyond-Horndeski\nterms. The latter group of terms may be attributed to the kinetic dependence of\nthe conformal and disformal factors in the Bekenstein's disformal\ntransformation. This is consistent with a related study on the special\ndisformal transformation of the Einstein-Hilbert action where no such\nbeyond-Horndeski terms are found to exist. Going down to three dimensions, we\nfind a relatively simpler resulting action but the signature of three three\n`extraneous' terms remains. Remarkably, we find in two dimensions the\nEinstein-Hilbert action to be invariant under the KG-constrained Bekenstein's\ndisformal transformation.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"drj9jFct0_8ZzImCQ6GwazWihvrx2W2nqtdUMYDDzus","pdfSize":"221568"}
