{"id":"2408.14223","title":"Hierarchical-type Model Predictive Control and Experimental Evaluation\n  for a Water-Hydraulic Artificial Muscle with Direct Data-Driven Adaptive\n  Model Matching","authors":"Satoshi Tsuruhara, Kazuhisa Ito","authorsParsed":[["Tsuruhara","Satoshi",""],["Ito","Kazuhisa",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:37:29 GMT"}],"updateDate":"2024-08-27","timestamp":1724675849000,"abstract":"  High-precision displacement control for water-hydraulic artificial muscles is\na challenging issue due to its strong hysteresis characteristics that is hard\nto be modelled precisely, and many control methods have been proposed.\nRecently, data-driven control methods have attracted much attention because\nthey do not explicitly use mathematical models, making design much easier. In\nour previous work, we proposed fictitious reference iterative tuning\n(FRIT)-based model predictive control (FMPC), which combines data-driven and\nmodel-based methods for the muscle and showed its effectiveness because it can\nconsider input constraints as well. However, the problem in which control\nperformance strongly depends on prior input-output data remains still unsolved.\nAdaptive FRIT based on directional forgetting has also been proposed; however,\nit is difficult to achieve the desired transient performance because it cannot\nconsider input constraints and there are no design parameters that directly\ndetermine the control performance, such as MPC. In this study, we propose a\nnovel data-driven adaptive model matching-based controller that combines these\nmethods. Experimental results show that the proposed method could significantly\nimprove the control performance and achieve high robustness against\ninappropriate initial experimental data , while considering the input\nconstraints in the design phase.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}