{"id":"2408.01604","title":"Efficient Data-driven Joint-level Calibration of Cable-driven Surgical\n  Robots","authors":"Haonan Peng, Andrew Lewis, Yun-Hsuan Su, Shan Lin, Dun-Tin Chiang,\n  Wenfan Jiang, Helen Lai, Blake Hannaford","authorsParsed":[["Peng","Haonan",""],["Lewis","Andrew",""],["Su","Yun-Hsuan",""],["Lin","Shan",""],["Chiang","Dun-Tin",""],["Jiang","Wenfan",""],["Lai","Helen",""],["Hannaford","Blake",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 23:46:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722642417000,"abstract":"  Knowing accurate joint positions is crucial for safe and precise control of\nlaparoscopic surgical robots, especially for the automation of surgical\nsub-tasks. These robots have often been designed with cable-driven arms and\ntools because cables allow for larger motors to be placed at the base of the\nrobot, further from the operating area where space is at a premium. However, by\nconnecting the joint to its motor with a cable, any stretch in the cable can\nlead to errors in kinematic estimation from encoders at the motor, which can\nresult in difficulties for accurate control of the surgical tool. In this work,\nwe propose an efficient data-driven calibration of positioning joints of such\nrobots, in this case the RAVEN-II surgical robotics research platform. While\nthe calibration takes only 8-21 minutes, the accuracy of the calibrated joints\nremains high during a 6-hour heavily loaded operation, suggesting desirable\nfeasibility in real practice. The calibration models take original robot states\nas input and are trained using zig-zag trajectories within a desired sparsity,\nrequiring no additional sensors after training. Compared to fixed offset\ncompensation, the Deep Neural Network calibration model can further reduce 76\npercent of error and achieve accuracy of 0.104 deg, 0.120 deg, and 0.118 mm in\njoints 1, 2, and 3, respectively. In contrast to end-to-end models, experiments\nsuggest that the DNN model achieves better accuracy and faster convergence when\noutputting the error to correct original inaccurate joint positions.\nFurthermore, a linear regression model is shown to have 160 times faster\ninference speed than DNN models for application within the 1000 Hz servo\ncontrol loop, with slightly compromised accuracy.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}