{"id":"2408.16434","title":"Physical Similarity of Fluid Flow in Bimodal Porous Media: Part 1 --\n  Basic Model and Solution Characteristics","authors":"Yuhe Wang, Yating Wang","authorsParsed":[["Wang","Yuhe",""],["Wang","Yating",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:52:46 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 09:27:42 GMT"},{"version":"v3","created":"Thu, 5 Sep 2024 08:26:42 GMT"}],"updateDate":"2024-09-06","timestamp":1724928766000,"abstract":"  Fluid flow through bimodal porous media, characterized by a distinct\nseparation in pore size distribution, is critical in various scientific and\nengineering applications, including groundwater management, oil and gas\nproduction, and carbon sequestration. This note delves into the physical\nsimilarity of fluid flow within such media, bridging the gap between microscale\nphenomena and macroscale observations. We present a representative mathematical\nmodel that conceptualizes bimodal porous media as a double-continuum system,\ndistinguishing between macroporous and microporous regions. The model captures\nthe complex interactions between these regions, particularly focusing on the\nchallenges of modeling fluid flow when there is significant disparity in pore\nsizes. By employing a heuristic approach grounded in pore-scale tomography, we\nderive governing equations that describe fluid flow and analyze the solution\ncharacteristics. The results reveal unique features of the fluid flow in\nbimodal systems, such as the occurrence of boundary discontinuities and the\ndelayed transient response, which are not observed in conventional porous\nmedia. This work provides ground for further studies in bimodal porous media,\noffering insights that could enhance predictive modeling and optimization in\nvarious applications concerning porous media with similar bimodal pore size\ndistributions.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"onpyPzlHONl5flZVhA6heTNwLaYefQ6dNaLgpGR18k4","pdfSize":"475388"}
