{"id":"2408.17226","title":"Size dependence of biexciton binding energy in strained ZnTe/(Zn,Mg)Te\n  nanowire quantum dots","authors":"P. Baranowski, M. Zielinski, M. Szymura, N. Zawadzka, R. Paslawska, M.\n  Wojcik, S. Kret, S. Chusnutdinow, P. Wojnar","authorsParsed":[["Baranowski","P.",""],["Zielinski","M.",""],["Szymura","M.",""],["Zawadzka","N.",""],["Paslawska","R.",""],["Wojcik","M.",""],["Kret","S.",""],["Chusnutdinow","S.",""],["Wojnar","P.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:10:51 GMT"}],"updateDate":"2024-09-02","timestamp":1725019851000,"abstract":"  Nanowire quantum dots, i.e., heterostructures consisting of an axial\ninsertion of low bandgap semiconductor within large band gap semiconductor\nnanowire, attract interest due to their emerging applications in the field of\nquantum communication technology. Here, we report on the fabrication of\nZnTe/(Zn,Mg)Te nanowire quantum dots by molecular beam epitaxy and on a\ndetailed investigation of the optical emission from individual structures by\nmeans of a combined study involving cathodoluminescence and\nmicro-photoluminescence. A distinct dependence of the biexciton binding energy,\ndefined as the spectral distance between the exciton and biexciton emission\nlines on the length of ZnTe axial insertions, is observed. With increasing dot\nlength, not only does the biexciton binding energy value decrease distinctly,\nbut also its character changes from binding to antibinding. The explanation of\nthis effect relies on the appearance of a piezoelectric field along the\nnanowire axis, leading to a pronounced separation of electrons and holes. The\nchange from a bound to an unbound character of biexciton energy can be well\nreproduced by theoretical calculations, which indicate an important\ncontribution of excited hole states to this effect in the case of relatively\nlarge quantum dots.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4xR1xrCWUtzLLGXnQfebZXkwXcaf-DgW4AA70Qp6I7s","pdfSize":"1973860"}
