{"id":"2408.02831","title":"Towards improved understanding of spontaneous imbibition into dry porous\n  media using pore-scale direct numerical simulations","authors":"Luka Malenica, Zhidong Zhang and Ueli Angst","authorsParsed":[["Malenica","Luka",""],["Zhang","Zhidong",""],["Angst","Ueli",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 21:01:23 GMT"}],"updateDate":"2024-08-07","timestamp":1722891683000,"abstract":"  Traditional approaches to mathematically describe spontaneous imbibition are\nusually based on either macro-scale models, such as Richards equation, or\nsimplified pore-scale models, such as the bundle of capillary tubes (BCTM) or\npore-network modeling (PNM). It is well known that such models cannot provide\nfull microscopic details of the multiphase flow processes and that many\npore-scale mechanisms still lack proper mathematical descriptions. To improve\nthe predictive capabilities of traditional models, a fundamental understanding\nof pore-scale dynamics is needed. The focus of this paper is obtaining detailed\ninsight and consistent explanation of particular processes during\ncapillary-controlled water imbibition into dry porous media. We use\ntwo-dimensional model geometries and perform fully dynamic volume-of-fluid\nbased direct numerical simulations of air-water multiphase flow at the\npore-scale, to study processes that generally are not considered in traditional\nmodels. More specifically, we investigate differences between converging and\ndiverging geometries, dynamic pressure and meniscus reconfiguration during\npore-filling events, and the influence of inertia and pore size on imbibition\ndynamics and the occurrence of capillary barriers. Furthermore, we perform a\ndetailed comparison between non-interacting and interacting BCTM and study the\nimpact of the narrow contractions on imbibition dynamics and the trapping of\nthe non-wetting phase. Obtained knowledge can be used to improve predictive\nmodels, which are broadly relevant considering the importance of spontaneous\nimbibition in many different natural and industrial processes.\n","subjects":["Physics/Fluid Dynamics","Physics/Geophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}