{"id":"2408.13312","title":"The Ultraviolet Slopes of Early Universe Galaxies: The Impact of Bursty\n  Star Formation, Dust, and Nebular Continuum Emission","authors":"Desika Narayanan, Daniel P. Stark, Steven L. Finkelstein, Paul Torrey,\n  Qi Li, Fergus Cullen, Micheal W. Topping, Federico Marinacci, Laura V. Sales,\n  Xuejian Shen, and Mark Vogelsberger","authorsParsed":[["Narayanan","Desika",""],["Stark","Daniel P.",""],["Finkelstein","Steven L.",""],["Torrey","Paul",""],["Li","Qi",""],["Cullen","Fergus",""],["Topping","Micheal W.",""],["Marinacci","Federico",""],["Sales","Laura V.",""],["Shen","Xuejian",""],["Vogelsberger","Mark",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-27","timestamp":1724436006000,"abstract":"  JWST has enabled the detection of the UV continuum of galaxies at z>10,\nevidencing a population of extremely blue, potentially dust-free galaxies.\nInterpreting the UV spectra of galaxies as they redden is complicated by the\nwell-known degeneracy between stellar ages, dust, and nebular continuum. The\nmain goal of this paper is to develop a theoretical model for the relationship\nbetween galaxy UV slopes, bursty star formation histories, dust evolution, and\nthe contribution from nebular regions. We accomplish this via cosmological\nzoom-in simulations, and in specific, build a layered model where we simulate\nthe UV slopes of galaxies with increasingly complex physics. Our main results\nfollow. (i) Unattenuated stellar populations with no nebular emission exhibit a\ndiverse range of intrinsic UV slopes, with values ranging from beta ~ -3 -->\n-2.2 due to long delays between bursts. This is manifested by an inverse\ncorrelation between the intrinsic UV slope and sSFR for early galaxies such\nthat higher sSFR corresponds to bluer UV slopes. (ii) When including dust, our\nmodel galaxies demonstrate a rapid rise in dust obscuration between z ~ 8-10.\nThis increase in dust mass is due to high grain-grain shattering rates, and\nenhanced growth per unit dust mass in very small grains, resulting in\nUV-detected galaxies at z ~ 12 descending into ALMA-detectable galaxies by z ~\n6. The rapid rise in dust content at z ~ 8-10 leads to a systematic reddening\nof the UV slopes during this redshift range. (iii) The inclusion of nebular\ncontinuum reddens the UV slope by a median factor Delta beta ~ 0.2-0.4.\nHowever, when including nebular continuum, our highest redshift galaxies (z~12)\nare insufficiently blue compared to observations; this may imply an evolving\nescape fraction from HII regions with redshift.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6EQV1ZkNUaQ6g1lNqRgE_ikJh8HP_69Z4VMBz1OJ7HA","pdfSize":"2647705"}
