{"id":"2408.06071","title":"A-BDD: Leveraging Data Augmentations for Safe Autonomous Driving in\n  Adverse Weather and Lighting","authors":"Felix Assion, Florens Gressner, Nitin Augustine, Jona Klemenc, Ahmed\n  Hammam, Alexandre Krattinger, Holger Trittenbach, Sascha Riemer","authorsParsed":[["Assion","Felix",""],["Gressner","Florens",""],["Augustine","Nitin",""],["Klemenc","Jona",""],["Hammam","Ahmed",""],["Krattinger","Alexandre",""],["Trittenbach","Holger",""],["Riemer","Sascha",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 11:44:47 GMT"}],"updateDate":"2024-08-13","timestamp":1723463087000,"abstract":"  High-autonomy vehicle functions rely on machine learning (ML) algorithms to\nunderstand the environment. Despite displaying remarkable performance in fair\nweather scenarios, perception algorithms are heavily affected by adverse\nweather and lighting conditions. To overcome these difficulties, ML engineers\nmainly rely on comprehensive real-world datasets. However, the difficulties in\nreal-world data collection for critical areas of the operational design domain\n(ODD) often means synthetic data is required for perception training and safety\nvalidation. Thus, we present A-BDD, a large set of over 60,000 synthetically\naugmented images based on BDD100K that are equipped with semantic segmentation\nand bounding box annotations (inherited from the BDD100K dataset). The dataset\ncontains augmented data for rain, fog, overcast and sunglare/shadow with\nvarying intensity levels. We further introduce novel strategies utilizing\nfeature-based image quality metrics like FID and CMMD, which help identify\nuseful augmented and real-world data for ML training and testing. By conducting\nexperiments on A-BDD, we provide evidence that data augmentations can play a\npivotal role in closing performance gaps in adverse weather and lighting\nconditions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}