{"id":"2408.14354","title":"SWE-bench-java: A GitHub Issue Resolving Benchmark for Java","authors":"Daoguang Zan and Zhirong Huang and Ailun Yu and Shaoxin Lin and Yifan\n  Shi and Wei Liu and Dong Chen and Zongshuai Qi and Hao Yu and Lei Yu and\n  Dezhi Ran and Muhan Zeng and Bo Shen and Pan Bian and Guangtai Liang and Bei\n  Guan and Pengjie Huang and Tao Xie and Yongji Wang and Qianxiang Wang","authorsParsed":[["Zan","Daoguang",""],["Huang","Zhirong",""],["Yu","Ailun",""],["Lin","Shaoxin",""],["Shi","Yifan",""],["Liu","Wei",""],["Chen","Dong",""],["Qi","Zongshuai",""],["Yu","Hao",""],["Yu","Lei",""],["Ran","Dezhi",""],["Zeng","Muhan",""],["Shen","Bo",""],["Bian","Pan",""],["Liang","Guangtai",""],["Guan","Bei",""],["Huang","Pengjie",""],["Xie","Tao",""],["Wang","Yongji",""],["Wang","Qianxiang",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:30:05 GMT"}],"updateDate":"2024-08-27","timestamp":1724686205000,"abstract":"  GitHub issue resolving is a critical task in software engineering, recently\ngaining significant attention in both industry and academia. Within this task,\nSWE-bench has been released to evaluate issue resolving capabilities of large\nlanguage models (LLMs), but has so far only focused on Python version. However,\nsupporting more programming languages is also important, as there is a strong\ndemand in industry. As a first step toward multilingual support, we have\ndeveloped a Java version of SWE-bench, called SWE-bench-java. We have publicly\nreleased the dataset, along with the corresponding Docker-based evaluation\nenvironment and leaderboard, which will be continuously maintained and updated\nin the coming months. To verify the reliability of SWE-bench-java, we implement\na classic method SWE-agent and test several powerful LLMs on it. As is well\nknown, developing a high-quality multi-lingual benchmark is time-consuming and\nlabor-intensive, so we welcome contributions through pull requests or\ncollaboration to accelerate its iteration and refinement, paving the way for\nfully automated programming.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"e4fnVH-2C7bszogSJyitOIFo3l6AB1oJOSDqFz4Zncw","pdfSize":"347939"}
