{"id":"2408.01978","title":"AdvQDet: Detecting Query-Based Adversarial Attacks with Adversarial\n  Contrastive Prompt Tuning","authors":"Xin Wang, Kai Chen, Xingjun Ma, Zhineng Chen, Jingjing Chen, Yu-Gang\n  Jiang","authorsParsed":[["Wang","Xin",""],["Chen","Kai",""],["Ma","Xingjun",""],["Chen","Zhineng",""],["Chen","Jingjing",""],["Jiang","Yu-Gang",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:53:50 GMT"}],"updateDate":"2024-08-06","timestamp":1722765230000,"abstract":"  Deep neural networks (DNNs) are known to be vulnerable to adversarial attacks\neven under a black-box setting where the adversary can only query the model.\nParticularly, query-based black-box adversarial attacks estimate adversarial\ngradients based on the returned probability vectors of the target model for a\nsequence of queries. During this process, the queries made to the target model\nare intermediate adversarial examples crafted at the previous attack step,\nwhich share high similarities in the pixel space. Motivated by this\nobservation, stateful detection methods have been proposed to detect and reject\nquery-based attacks. While demonstrating promising results, these methods\neither have been evaded by more advanced attacks or suffer from low efficiency\nin terms of the number of shots (queries) required to detect different attacks.\nArguably, the key challenge here is to assign high similarity scores for any\ntwo intermediate adversarial examples perturbed from the same clean image. To\naddress this challenge, we propose a novel Adversarial Contrastive Prompt\nTuning (ACPT) method to robustly fine-tune the CLIP image encoder to extract\nsimilar embeddings for any two intermediate adversarial queries. With ACPT, we\nfurther introduce a detection framework AdvQDet that can detect 7\nstate-of-the-art query-based attacks with $>99\\%$ detection rate within 5\nshots. We also show that ACPT is robust to 3 types of adaptive attacks. Code is\navailable at https://github.com/xinwong/AdvQDet.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}