{"id":"2408.13196","title":"Predictability of Performance in Communication Networks Under Markovian\n  Dynamics","authors":"Samie Mostafavi, Simon Egger, Gy\\\"orgy D\\'an, James Gross","authorsParsed":[["Mostafavi","Samie",""],["Egger","Simon",""],["Dán","György",""],["Gross","James",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:27:27 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 08:32:20 GMT"},{"version":"v3","created":"Mon, 16 Sep 2024 12:42:47 GMT"}],"updateDate":"2024-09-17","timestamp":1724430447000,"abstract":"  With the emergence of time-critical applications in modern communication\nnetworks, there is a growing demand for proactive network adaptation and\nquality of service (QoS) prediction. However, a fundamental question remains\nlargely unexplored: how can we quantify and achieve more predictable\ncommunication systems in terms of performance? To address this gap, this paper\nintroduces a theoretical framework for defining and analyzing predictability in\ncommunication systems, with a focus on the impact of observations for\nperformance forecasting. We establish a mathematical definition of\npredictability based on the total variation distance between forecast and\nmarginal performance distributions. A system is deemed unpredictable when the\nforecast distribution, providing the most comprehensive characterization of\nfuture states using all accessible information, is indistinguishable from the\nmarginal distribution, which depicts the system's behavior without any\nobservational input. This framework is applied to multi-hop systems under\nMarkovian conditions, with a detailed analysis of Geo/Geo/1 queuing models in\nboth single-hop and multi-hop scenarios. We derive exact and approximate\nexpressions for predictability in these systems, as well as upper bounds based\non spectral analysis of the underlying Markov chains. Our results have\nimplications for the design of efficient monitoring and prediction mechanisms\nin future communication networks aiming to provide deterministic services.\n","subjects":["Computing Research Repository/Networking and Internet Architecture","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}