{"id":"2408.13975","title":"Cross-sectional imaging of speed-of-sound distribution using\n  photoacoustic reversal beacons","authors":"Yang Wang, Danni Wang, Liting Zhong, Yi Zhou, Qing Wang, Wufan Chen,\n  Li Qi","authorsParsed":[["Wang","Yang",""],["Wang","Danni",""],["Zhong","Liting",""],["Zhou","Yi",""],["Wang","Qing",""],["Chen","Wufan",""],["Qi","Li",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 01:44:12 GMT"}],"updateDate":"2024-08-27","timestamp":1724636652000,"abstract":"  Photoacoustic tomography (PAT) enables non-invasive cross-sectional imaging\nof biological tissues, but it fails to map the spatial variation of\nspeed-of-sound (SOS) within tissues. While SOS is intimately linked to density\nand elastic modulus of tissues, the imaging of SOS distri-bution serves as a\ncomplementary imaging modality to PAT. Moreover, an accurate SOS map can be\nleveraged to correct for PAT image degradation arising from acoustic\nheterogene-ities. Herein, we propose a novel approach for SOS reconstruction\nusing only PAT imaging modality. Our method is based on photoacoustic reversal\nbeacons (PRBs), which are small light-absorbing targets with strong\nphotoacoustic contrast. We excite and scan a number of PRBs positioned at the\nperiphery of the target, and the generated photoacoustic waves prop-agate\nthrough the target from various directions, thereby achieve spatial sampling of\nthe internal SOS. We formulate a linear inverse model for pixel-wise SOS\nreconstruction and solve it with iterative optimization technique. We validate\nthe feasibility of the proposed method through simulations, phantoms, and ex\nvivo biological tissue tests. Experimental results demonstrate that our\napproach can achieve accurate reconstruction of SOS distribu-tion. Leveraging\nthe obtained SOS map, we further demonstrate significantly enhanced PAT image\nreconstruction with acoustic correction.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}