{"id":"2408.03660","title":"An improved Tully-Fisher estimate of $H_0$","authors":"Paula Boubel, Matthew Colless, Khaled Said and Lister Staveley-Smith","authorsParsed":[["Boubel","Paula",""],["Colless","Matthew",""],["Said","Khaled",""],["Staveley-Smith","Lister",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:00:26 GMT"}],"updateDate":"2024-08-09","timestamp":1723024826000,"abstract":"  We propose an improved comprehensive method for determining the Hubble\nconstant ($H_0$) using the Tully-Fisher relation. By fitting a peculiar\nvelocity model in conjunction with the Tully-Fisher relation, all available\ndata can be used to derive self-consistent Tully-Fisher parameters. In\ncomparison to previous approaches, our method offers several improvements: it\ncan be readily generalised to different forms of the Tully-Fisher relation and\nits intrinsic scatter; it uses a peculiar velocity model to predict distances\nmore accurately; it can account for all selection effects; it uses the entire\ndataset to fit the Tully-Fisher relation; and it is fully self-consistent. The\nTully-Fisher relation zero-point is calibrated using the subset of galaxies\nwith distances from absolute distance indicators. We demonstrate this method on\nthe Cosmicflows-4 catalogue $i$-band and $W1$-band Tully-Fisher samples and\nshow that the uncertainties from fitting the Tully-Fisher relation amount to\nonly 0.2 km s$^{-1}$Mpc$^{-1}$. Using all available absolute distance\ncalibrators, we obtain $H_0=73.3$ $\\pm$ 2.1 (stat) $\\pm$ 3.5 (sys) km\ns$^{-1}$Mpc$^{-1}$, where the statistical uncertainty is dominated by the small\nnumber of galaxies with absolute distance estimates. The substantial systematic\nuncertainty reflects inconsistencies between various zero-point calibrations of\nthe Cepheid period-luminosity relation, the tip of the red giant branch\nstandard candle, and the Type Ia supernova standard candle. However, given a\nreliable set of absolute distance calibrators, our method promises enhanced\nprecision in $H_0$ measurements from large new Tully-Fisher samples such as the\nWALLABY survey.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}