{"id":"2408.02432","title":"Bridging the Gap to Next Generation Power System Planning and Operation\n  with Quantum Computation","authors":"Priyanka Arkalgud Ganeshamurthy, Kumar Ghosh, Corey O'Meara, Giorgio\n  Cortiana, Jan Schiefelbein-Lach","authorsParsed":[["Ganeshamurthy","Priyanka Arkalgud",""],["Ghosh","Kumar",""],["O'Meara","Corey",""],["Cortiana","Giorgio",""],["Schiefelbein-Lach","Jan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:41:28 GMT"}],"updateDate":"2024-08-06","timestamp":1722861688000,"abstract":"  Innovative solutions and developments are being inspected to tackle rising\nelectrical power demand to be supplied by clean forms of energy. The\nintegration of renewable energy generations, varying nature loads, importance\nof active role of distribution system and consumer participation in grid\noperation has changed the landscape of classical power grids. Implementation of\nsmarter applications to plan, monitor, operate the grid safely are deemed\nparamount for efficient, secure and reliable functioning of grid. Although\nsophisticated computations to process gigantic volume of data to produce useful\ninformation in a time critical manner is the paradigm of future grid\noperations, it brings along the burden of computational complexity.\nAdvancements in quantum technologies holds promising solution for dealing with\ndemanding computational complexity of power system related applications. In\nthis article, we lay out clear motivations for seeking quantum solutions for\nsolving computational burden challenges associated with power system\napplications. Next we present an overview of quantum solutions for various\npower system related applications available in current literature and suggest\nfuture topics for research. We further highlight challenges with existing\nquantum solutions for exploiting full quantum capabilities. Additionally, this\npaper serves as a bridge for power engineers to the quantum world by outlining\nessential quantum computation fundamentals for enabling smoother transition to\nfuture of power system computations.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pptJFtZ65UAxFIy-iL35ZiI2BHrEJAEdTNMWbM4Xelo","pdfSize":"504727"}
