{"id":"2408.05123","title":"Sportify: Question Answering with Embedded Visualizations and\n  Personified Narratives for Sports Video","authors":"Chunggi Lee, Tica Lin, Hanspeter Pfister, and Chen Zhu-Tian","authorsParsed":[["Lee","Chunggi",""],["Lin","Tica",""],["Pfister","Hanspeter",""],["Zhu-Tian","Chen",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 15:30:10 GMT"}],"updateDate":"2024-08-12","timestamp":1723217410000,"abstract":"  As basketball's popularity surges, fans often find themselves confused and\noverwhelmed by the rapid game pace and complexity. Basketball tactics,\ninvolving a complex series of actions, require substantial knowledge to be\nfully understood. This complexity leads to a need for additional information\nand explanation, which can distract fans from the game. To tackle these\nchallenges, we present Sportify, a Visual Question Answering system that\nintegrates narratives and embedded visualization for demystifying basketball\ntactical questions, aiding fans in understanding various game aspects. We\npropose three novel action visualizations (i.e., Pass, Cut, and Screen) to\ndemonstrate critical action sequences. To explain the reasoning and logic\nbehind players' actions, we leverage a large-language model (LLM) to generate\nnarratives. We adopt a storytelling approach for complex scenarios from both\nfirst and third-person perspectives, integrating action visualizations. We\nevaluated Sportify with basketball fans to investigate its impact on\nunderstanding of tactics, and how different personal perspectives of narratives\nimpact the understanding of complex tactic with action visualizations. Our\nevaluation with basketball fans demonstrates Sportify's capability to deepen\ntactical insights and amplify the viewing experience. Furthermore, third-person\nnarration assists people in getting in-depth game explanations while\nfirst-person narration enhances fans' game engagement\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}