{"id":"2408.01860","title":"Exploring strong locality : Quantum state discrimination regime and\n  beyond","authors":"Subrata Bera, Atanu Bhunia, Indranil Biswas, Indrani Chattopadhyay and\n  Debasis Sarkar","authorsParsed":[["Bera","Subrata",""],["Bhunia","Atanu",""],["Biswas","Indranil",""],["Chattopadhyay","Indrani",""],["Sarkar","Debasis",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 20:11:14 GMT"}],"updateDate":"2024-08-06","timestamp":1722715874000,"abstract":"  Based on the conviction of switching information from locally accessible to\nlocally hidden environs, the concept of hidden nonlocality activation has been\nrecently highlighted by Bandyopadhyay et al. in [Phys. Rev. A 104, L050201\n(2021)]. They demonstrate that a certain locally distinguishable set of pure\nquantum states can be transformed into an indistinguishable set with certainty\nby allowing local operations and classical communication(LOCC). As this\ntransformation makes the set locally inaccessible to every subsystem, it is\ndefined as the activation of genuine hidden nonlocality. In this paper, we\nobserve that one class exhibits the previously mentioned nonlocal\ncharacteristics, harnessing local operation by a single party, while in\ncontrast, another class demands cooperative endeavors among multiple local\nobservers to reveal its nonlocal attributes. From this vantage point, we\ndiscern a stronger manifestation of locality, asserting that the latter class\nis inherently more local than the former. This analysis sheds light on the\nnuanced interplay between local and nonlocal phenomena within the framework of\nquantum state discrimination. Furthermore, we also explore their significant\napplications in the context of locally hiding information. Additionally, we\nintroduce the concept of \\emph{``strong local\"} set and examine its comparison\nwith different activable sets in terms of locality.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}