{"id":"2408.11713","title":"Properties of intermediate- to high-mass stars in the young cluster M17\n  -- Characterizing the (pre-)zero-age main sequence","authors":"Frank Backs, S. A. Brands, M. C. Ram\\'irez-Tannus, A. R. Derkink, A.\n  de Koter, J. Poorta, J. Puls, and Lex Kaper","authorsParsed":[["Backs","Frank",""],["Brands","S. A.",""],["Ramírez-Tannus","M. C.",""],["Derkink","A. R.",""],["de Koter","A.",""],["Poorta","J.",""],["Puls","J.",""],["Kaper","Lex",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:37:18 GMT"}],"updateDate":"2024-08-22","timestamp":1724254638000,"abstract":"  The outcome of the formation of massive stars is an important anchor point in\ntheir evolution. It provides insight into the physics of the assembly process,\nand sets the conditions for stellar evolution. We characterize a population of\n18 highly reddened O4.5 to B9 stars in the very young massive star-forming\nregion M17. Their properties allow us to identify the empirical location of the\nZAMS, and rotation and mass-loss rate of stars there. We performed quantitative\nspectroscopic modeling of VLT/X-shooter spectra using NLTE atmosphere code\nFastwind and fitting approach Kiwi-GA. The observed SEDs were used to determine\nthe line-of-sight extinction. From a comparison of their positions in the HRD\nwith MIST evolutionary tracks, we inferred the stellar masses and ages. We find\nan age of $0.4_{-0.2}^{+0.6}$ Myr for our sample, however we also identify a\nstrong relation between the age and the mass of the stars. The extinction\ntowards the sources ranges from $A_V = 3.6$ to 10.6. Stars more massive than 10\nM$_{\\odot}$ have reached the ZAMS. Their projected ZAMS spin rate distribution\nextends to 0.3 of the critical velocity; their mass-loss rates agree with those\nof other main-sequence OB stars. Stars with a mass in the range $3 <\nM/$M$_{\\odot} < 7$ are still on the pre-main sequence (PMS). Evolving their $v\n\\sin i$ to the ZAMS yields values up to $\\sim 0.6 v_{\\rm crit}$. For PMS stars\nwithout disks, we find tentative mass-loss rates up to\n$10^{-8.5}\\,$M$_{\\odot}$\\,yr$^{-1}$. We constrain the empirical location of the\nZAMS for massive ($10 < M/$M$_{\\odot} < 50$) stars. The ZAMS rotation rates for\nintermediate-mass stars are twice as high as for massive stars, suggesting that\nthe angular momentum gain processes differ between the two groups. The relation\nbetween the age and mass of the stars suggests a lag in the formation of more\nmassive stars relative to lower mass stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}