{"id":"2408.12806","title":"Is Generative AI the Next Tactical Cyber Weapon For Threat Actors?\n  Unforeseen Implications of AI Generated Cyber Attacks","authors":"Yusuf Usman, Aadesh Upadhyay, Prashnna Gyawali, Robin Chataut","authorsParsed":[["Usman","Yusuf",""],["Upadhyay","Aadesh",""],["Gyawali","Prashnna",""],["Chataut","Robin",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 02:56:13 GMT"}],"updateDate":"2024-08-26","timestamp":1724381773000,"abstract":"  In an era where digital threats are increasingly sophisticated, the\nintersection of Artificial Intelligence and cybersecurity presents both\npromising defenses and potent dangers. This paper delves into the escalating\nthreat posed by the misuse of AI, specifically through the use of Large\nLanguage Models (LLMs). This study details various techniques like the switch\nmethod and character play method, which can be exploited by cybercriminals to\ngenerate and automate cyber attacks. Through a series of controlled\nexperiments, the paper demonstrates how these models can be manipulated to\nbypass ethical and privacy safeguards to effectively generate cyber attacks\nsuch as social engineering, malicious code, payload generation, and spyware. By\ntesting these AI generated attacks on live systems, the study assesses their\neffectiveness and the vulnerabilities they exploit, offering a practical\nperspective on the risks AI poses to critical infrastructure. We also introduce\nOccupy AI, a customized, finetuned LLM specifically engineered to automate and\nexecute cyberattacks. This specialized AI driven tool is adept at crafting\nsteps and generating executable code for a variety of cyber threats, including\nphishing, malware injection, and system exploitation. The results underscore\nthe urgency for ethical AI practices, robust cybersecurity measures, and\nregulatory oversight to mitigate AI related threats. This paper aims to elevate\nawareness within the cybersecurity community about the evolving digital threat\nlandscape, advocating for proactive defense strategies and responsible AI\ndevelopment to protect against emerging cyber threats.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mPEU5n6Xu4CwqvMgJ0NZbWVbSIjctMu-YlcR4OxeeIQ","pdfSize":"4484849"}
