{"id":"2408.04064","title":"Are long gamma-ray bursts progenitors to merging binary black holes?","authors":"Tom Y. Wu and Maya Fishbach","authorsParsed":[["Wu","Tom Y.",""],["Fishbach","Maya",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 20:02:09 GMT"}],"updateDate":"2024-08-09","timestamp":1723060929000,"abstract":"  The distribution of delay times between the formation of binary black hole\n(BBH) progenitors and their gravitational-wave (GW) merger provides important\nclues about their unknown formation histories. When inferring the delay time\ndistribution, it is typically assumed that BBH progenitor formation traces the\nstar formation rate (SFR). In this work, we consider the rate of long gamma-ray\nbursts (LGRBs) instead of the SFR. LGRBs are thought to correspond to the\nformation of (possibly spinning) black holes, and may therefore be related to\nthe population of BBH progenitors. By comparing the redshift evolution of the\nLGRB rate as inferred by Ghirlanda & Salvaterra (2022) and the BBH merger rate\ninferred by LIGO-Virgo-KAGRA (LVK) observations, we find that the delay time\ndistribution between LGRBs and BBH mergers is well-described by a power law\nwith minimum delay time $10$ Myr and slope $\\alpha ={-0.96}^{+0.64}_{-0.85}$\n(90\\% credibility). This matches theoretical predictions for the BBH delay time\ndistribution, which in turns lends support to the hypothesis that LGRBs trace\nBBH progenitor formation. However, comparing the absolute rates of these two\npopulations, we find that at most $f = {0.04}^{+0.18}_{-0.03}$ of LGRBs may\nevolve into merging BBH. We also consider the possibility that LGRBs only\nproduce BBH systems with large aligned spins (with effective inspiral spin\n$\\chi_\\mathrm{eff} > 0.2$). In this case, we find $f =\n{0.003}^{+0.011}_{-0.002}$ and the delay time distribution favors the steepest\npower law slopes we consider ($\\alpha = -2$).\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}