{"id":"2408.01672","title":"radarODE: An ODE-Embedded Deep Learning Model for Contactless ECG\n  Reconstruction from Millimeter-Wave Radar","authors":"Yuanyuan Zhang and Runwei Guan and Lingxiao Li and Rui Yang and Yutao\n  Yue and Eng Gee Lim","authorsParsed":[["Zhang","Yuanyuan",""],["Guan","Runwei",""],["Li","Lingxiao",""],["Yang","Rui",""],["Yue","Yutao",""],["Lim","Eng Gee",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 06:07:15 GMT"}],"updateDate":"2024-08-06","timestamp":1722665235000,"abstract":"  Radar-based contactless cardiac monitoring has become a popular research\ndirection recently, but the fine-grained electrocardiogram (ECG) signal is\nstill hard to reconstruct from millimeter-wave radar signal. The key obstacle\nis to decouple the cardiac activities in the electrical domain (i.e., ECG) from\nthat in the mechanical domain (i.e., heartbeat), and most existing research\nonly uses pure data-driven methods to map such domain transformation as a black\nbox. Therefore, this work first proposes a signal model for domain\ntransformation, and then a novel deep learning framework called radarODE is\ndesigned to fuse the temporal and morphological features extracted from radar\nsignals and generate ECG. In addition, ordinary differential equations are\nembedded in radarODE as a decoder to provide morphological prior, helping the\nconvergence of the model training and improving the robustness under body\nmovements. After being validated on the dataset, the proposed radarODE achieves\nbetter performance compared with the benchmark in terms of missed detection\nrate, root mean square error, Pearson correlation coefficient with the\nimprovement of 9%, 16% and 19%, respectively. The validation results imply that\nradarODE is capable of recovering ECG signals from radar signals with high\nfidelity and can be potentially implemented in real-life scenarios.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}