{"id":"2408.17263","title":"Privacy-Preserving Set-Based Estimation Using Differential Privacy and\n  Zonotopes","authors":"Mohammed M. Dawoud, Changxin Liu, Karl H. Johansson, and Amr Alanwar","authorsParsed":[["Dawoud","Mohammed M.",""],["Liu","Changxin",""],["Johansson","Karl H.",""],["Alanwar","Amr",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 13:05:38 GMT"}],"updateDate":"2024-09-02","timestamp":1725023138000,"abstract":"  For large-scale cyber-physical systems, the collaboration of spatially\ndistributed sensors is often needed to perform the state estimation process.\nPrivacy concerns arise from disclosing sensitive measurements to a cloud\nestimator. To solve this issue, we propose a differentially private set-based\nestimation protocol that guarantees true state containment in the estimated set\nand differential privacy for the sensitive measurements throughout the\nset-based state estimation process within the central and local differential\nprivacy models. Zonotopes are employed in the proposed differentially private\nset-based estimator, offering computational advantages in set operations. We\nconsider a plant of a non-linear discrete-time dynamical system with bounded\nmodeling uncertainties, sensors that provide sensitive measurements with\nbounded measurement uncertainties, and a cloud estimator that predicts the\nsystem's state. The privacy-preserving noise perturbs the centers of\nmeasurement zonotopes, thereby concealing the precise position of these\nzonotopes, i.e., ensuring privacy preservation for the sets containing\nsensitive measurements. Compared to existing research, our approach achieves\nless privacy loss and utility loss through the central and local differential\nprivacy models by leveraging a numerically optimized truncated noise\ndistribution. The proposed estimator is perturbed by weaker noise than the\nanalytical approaches in the literature to guarantee the same level of privacy,\ntherefore improving the estimation utility. Numerical and comparison\nexperiments with truncated Laplace noise are presented to support our approach.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}