{"id":"2408.01150","title":"Information transfer by entangled photons without auxiliary non-quantum\n  channel","authors":"Levente Szab\\'o, P\\'al Ma\\'ak","authorsParsed":[["Szabó","Levente",""],["Maák","Pál",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:07:22 GMT"}],"updateDate":"2024-08-05","timestamp":1722593242000,"abstract":"  In this paper we present a theoretical analysis of the faster than light\ncommunication possibility based on entangled photons. We analyze designs that\nmay be capable to solve the problem of direct information transfer between\nmembers of an entangled photon pairs. We consider that experimental\nverifications can confirm or even refute this. Our hypothesis was that most\nproofs of the nocommunication theorem are based on a certain set of conditions,\nand it is possible to provide a broader set of conditions that allow the\nestablishment of entangled states as quantum information channels, without\nusing a classical channel. One basic unit of the proposed design transforms the\npolarization state of one member of an entangled photon pair into a spatial\nsuperposition state. Thus, after the polarization measurement performed on one\nmember, which eliminates the entanglement, the quantum information is\nmaintained in the spatial superposition state of the other member. This can be\nrecovered by a particular measurement based on spatial interference. We have\nshown that solutions with so-called symmetric functions lead to average results\nthat corresponds to the nocommunication theorem. However, using asymmetric\nfunctions the averaged measurement results calculated in a prescribed time\nwindow can distinguish the types of measurements performed on the other member\nof the pair. This can establish a communication code that enables\nfaster-than-light information sharing under specific conditions. There may be\nalso further theoretical consequences: a significant extension of the quantum\nmechanical nonlocality principle.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g5Ux1PGWW1jAu05p3uWkVjYNk7cwkym31NPHKlh-odU","pdfSize":"1935730","txDigest":"3WcUTzxAqAfs1euyboJXU1fZAhHfsmVqDATk597HzJjZ","endEpoch":"1","status":"CERTIFIED"}
