{"id":"2408.01142","title":"Assessment of the near-Sun magnetic field of the 10 March 2022 coronal\n  mass ejection observed by Solar Orbiter","authors":"Shifana Koya, Spiros Patsourakos, Manolis K. Georgoulis, Alexander\n  Nindos","authorsParsed":[["Koya","Shifana",""],["Patsourakos","Spiros",""],["Georgoulis","Manolis K.",""],["Nindos","Alexander",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 09:40:41 GMT"}],"updateDate":"2024-08-05","timestamp":1722591641000,"abstract":"  We estimate the near-Sun axial magnetic field of a coronal mass ejection\n(CME) on 10 March 2022. Solar Orbiter's in situ measurements, 7.8 degrees east\nof the Sun-Earth line at 0.43 AU, provided a unique vantage point, along with\nthe WIND measurements at 0.99 AU. We determine a single power-law index from\nnear-Sun to L1, including in situ measurements from both vantage points. We\ntracked the temporal evolution of the instantaneous relative magnetic helicity\nof the source active region (AR), NOAA AR 12962. By estimating the helicity\nbudget of the pre-and post-eruption AR, we estimated the helicity transported\nto the CME. Assuming a Lundquist flux-rope model and geometrical parameters\nobtained through the graduated cylindrical shell (GCS) CME forward modelling,\nwe determined the CME axial magnetic field at a GCS-fitted height. Assuming a\npower-law variation of the axial magnetic field with heliocentric distance, we\nextrapolated the estimated near-Sun axial magnetic field to in situ\nmeasurements at 0.43 AU and 0.99 AU. The net helicity difference between the\npost-and pre-eruption AR is $(-7.1 \\pm 1.2) \\times 10^{41} \\mathrm{Mx^{2}}$,\nwhich is assumed to be bodily transported to the CME. The estimated CME axial\nmagnetic field at a near-Sun heliocentric distance of 0.03 AU is 2067 $\\pm$ 405\nnT. From 0.03 AU to L1, a single power-law falloff, including both vantage\npoints at 0.43 AU and 0.99 AU, gives an index $-1.23 \\pm 0.18$. We observed a\nsignificant decrease in the pre-eruptive AR helicity budget. Extending previous\nstudies on inner-heliospheric intervals from 0.3 AU to $\\sim$1 AU, referring to\nestimates from 0.03 AU to measurements at $\\sim$1 AU. Our findings indicate a\nless steep decline in the magnetic field strength with distance compared to\nprevious studies, but they align with studies that include near-Sun in situ\nmagnetic field measurements, such as from Parker Solar Probe.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}