{"id":"2408.10434","title":"Insights on Microservice Architecture Through the Eyes of Industry\n  Practitioners","authors":"Vinicius L. Nogueira, Fernando S. Felizardo, Aline M. M. M. Amaral,\n  Wesley K. G. Assuncao, Thelma E. Colanzi","authorsParsed":[["Nogueira","Vinicius L.",""],["Felizardo","Fernando S.",""],["Amaral","Aline M. M. M.",""],["Assuncao","Wesley K. G.",""],["Colanzi","Thelma E.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 21:56:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724104618000,"abstract":"  The adoption of microservice architecture has seen a considerable upswing in\nrecent years, mainly driven by the need to modernize legacy systems and address\ntheir limitations. Legacy systems, typically designed as monolithic\napplications, often struggle with maintenance, scalability, and deployment\ninefficiencies. This study investigates the motivations, activities, and\nchallenges associated with migrating from monolithic legacy systems to\nmicroservices, aiming to shed light on common practices and challenges from a\npractitioner's point of view. We conducted a comprehensive study with 53\nsoftware practitioners who use microservices, expanding upon previous research\nby incorporating diverse international perspectives. Our mixed-methods approach\nincludes quantitative and qualitative analyses, focusing on four main aspects:\n(i) the driving forces behind migration, (ii) the activities to conduct the\nmigration, (iii) strategies for managing data consistency, and (iv) the\nprevalent challenges. Thus, our results reveal diverse practices and challenges\npractitioners face when migrating to microservices. Companies are interested in\ntechnical benefits, enhancing maintenance, scalability, and deployment\nprocesses. Testing in microservice environments remains complex, and extensive\nmonitoring is crucial to managing the dynamic nature of microservices. Database\nmanagement remains challenging. While most participants prefer decentralized\ndatabases for autonomy and scalability, challenges persist in ensuring data\nconsistency. Additionally, many companies leverage modern cloud technologies to\nmitigate network overhead, showcasing the importance of cloud infrastructure in\nfacilitating efficient microservice communication.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}