{"id":"2408.00242","title":"Bringing Data into the Conversation: Adapting Content from Business\n  Intelligence Dashboards for Threaded Collaboration Platforms","authors":"Hyeok Kim, Arjun Srinivasan, Matthew Brehmer","authorsParsed":[["Kim","Hyeok",""],["Srinivasan","Arjun",""],["Brehmer","Matthew",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:46:13 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 15:22:48 GMT"}],"updateDate":"2024-08-05","timestamp":1722480373000,"abstract":"  To enable data-driven decision-making across organizations, data\nprofessionals need to share insights with their colleagues in\ncontext-appropriate communication channels. Many of their colleagues rely on\ndata but are not themselves analysts; furthermore, their colleagues are\nreluctant or unable to use dedicated analytical applications or dashboards, and\nthey expect communication to take place within threaded collaboration platforms\nsuch as Slack or Microsoft Teams. In this paper, we introduce a set of six\nstrategies for adapting content from business intelligence (BI) dashboards into\nappropriate formats for sharing on collaboration platforms, formats that we\nrefer to as dashboard snapshots. Informed by prior studies of enterprise\ncommunication around data, these strategies go beyond redesigning or restyling\nby considering varying levels of data literacy across an organization,\nintroducing affordances for self-service question-answering, and anticipating\nthe post-sharing lifecycle of data artifacts. These strategies involve the use\nof templates that are matched to common communicative intents, serving to\nreduce the workload of data professionals. We contribute a formal\nrepresentation of these strategies and demonstrate their applicability in a\ncomprehensive enterprise communication scenario featuring multiple stakeholders\nthat unfolds over the span of months.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iLmMEXP90U7_6OXht504svBFmpdtogQVrjJXLt79HBM","pdfSize":"11131473"}
