{"id":"2408.10946","title":"Large Language Model Driven Recommendation","authors":"Anton Korikov, Scott Sanner, Yashar Deldjoo, Zhankui He, Julian\n  McAuley, Arnau Ramisa, Rene Vidal, Mahesh Sathiamoorthy, Atoosa Kasrizadeh,\n  Silvia Milano, and Francesco Ricci","authorsParsed":[["Korikov","Anton",""],["Sanner","Scott",""],["Deldjoo","Yashar",""],["He","Zhankui",""],["McAuley","Julian",""],["Ramisa","Arnau",""],["Vidal","Rene",""],["Sathiamoorthy","Mahesh",""],["Kasrizadeh","Atoosa",""],["Milano","Silvia",""],["Ricci","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:36:24 GMT"}],"updateDate":"2024-08-21","timestamp":1724168184000,"abstract":"  While previous chapters focused on recommendation systems (RSs) based on\nstandardized, non-verbal user feedback such as purchases, views, and clicks --\nthe advent of LLMs has unlocked the use of natural language (NL) interactions\nfor recommendation. This chapter discusses how LLMs' abilities for general NL\nreasoning present novel opportunities to build highly personalized RSs -- which\ncan effectively connect nuanced and diverse user preferences to items,\npotentially via interactive dialogues. To begin this discussion, we first\npresent a taxonomy of the key data sources for language-driven recommendation,\ncovering item descriptions, user-system interactions, and user profiles. We\nthen proceed to fundamental techniques for LLM recommendation, reviewing the\nuse of encoder-only and autoregressive LLM recommendation in both tuned and\nuntuned settings. Afterwards, we move to multi-module recommendation\narchitectures in which LLMs interact with components such as retrievers and RSs\nin multi-stage pipelines. This brings us to architectures for conversational\nrecommender systems (CRSs), in which LLMs facilitate multi-turn dialogues where\neach turn presents an opportunity not only to make recommendations, but also to\nengage with the user in interactive preference elicitation, critiquing, and\nquestion-answering.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}