{"id":"2408.02621","title":"A Reverse Non-Equilibrium Molecular Dynamics (RNEMD) Algorithm for\n  Coupled Mass and Heat Transport in Mixtures","authors":"Cody R. Drisko and J. Daniel Gezelter","authorsParsed":[["Drisko","Cody R.",""],["Gezelter","J. Daniel",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:47:06 GMT"}],"updateDate":"2024-08-06","timestamp":1722876426000,"abstract":"  We present a new method for introducing stable non-equilibrium concentration\ngradients in molecular dynamics simulations of mixtures. This method extends\nearlier Reverse Non-Equilibrium Molecular Dynamics (RNEMD) methods which use\nkinetic energy scaling moves to create temperature or velocity gradients. In\nthe new scaled particle flux (SPF-RNEMD) algorithm, energies and forces are\ncomputed simultaneously for a molecule existing in two non-adjacent regions of\na simulation box, and the system evolves under a linear combination of these\ninteractions. A continuously increasing particle scaling variable is\nresponsible for migration of the molecule between the regions as the simulation\nprogresses, allowing for simulations under an applied particle flux. To test\nthe method, we investigate diffusivity in mixtures of identical, but\ndistinguishable particles, and in a simple mixture of multiple Lennard-Jones\nparticles. The resulting concentration gradients provide Fick diffusion\nconstants for mixtures. We also discuss using the new method to obtain coupled\ntransport properties using simultaneous particle and thermal fluxes to compute\nthe temperature dependence of the diffusion coefficient and activation energies\nfor diffusion from a single simulation. Lastly, we demonstrate the use of this\nnew method in interfacial systems by computing the diffusive permeability for a\nmolecular fluid moving through a nanoporous graphene membrane.\n","subjects":["Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-Qa6sT35bZNNKCM1g--12KW8vuihVS285jeJowdu0ns","pdfSize":"10395608","txDigest":"Asm4SKF7Nww2kNAUmx7T4xN51TJXNjd5jynio7X54oq","endEpoch":"1","status":"CERTIFIED"}
