{"id":"2408.14729","title":"Toward Mixed Analog-Digital Quantum Signal Processing: Quantum AD/DA\n  Conversion and the Fourier Transform","authors":"Yuan Liu, John M. Martyn, Jasmine Sinanan-Singh, Kevin C. Smith,\n  Steven M. Girvin, Isaac L. Chuang","authorsParsed":[["Liu","Yuan",""],["Martyn","John M.",""],["Sinanan-Singh","Jasmine",""],["Smith","Kevin C.",""],["Girvin","Steven M.",""],["Chuang","Isaac L.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 01:53:57 GMT"}],"updateDate":"2024-08-28","timestamp":1724723637000,"abstract":"  Signal processing stands as a pillar of classical computation and modern\ninformation technology, applicable to both analog and digital signals.\nRecently, advancements in quantum information science have suggested that\nquantum signal processing (QSP) can enable more powerful signal processing\ncapabilities. However, the developments in QSP have primarily leveraged\n\\emph{digital} quantum resources, such as discrete-variable (DV) systems like\nqubits, rather than \\emph{analog} quantum resources, such as\ncontinuous-variable (CV) systems like quantum oscillators. Consequently, there\nremains a gap in understanding how signal processing can be performed on hybrid\nCV-DV quantum computers. Here we address this gap by developing a new paradigm\nof mixed analog-digital QSP. We demonstrate the utility of this paradigm by\nshowcasing how it naturally enables analog-digital conversion of quantum\nsignals -- specifically, the transfer of states between DV and CV quantum\nsystems. We then show that such quantum analog-digital conversion enables new\nimplementations of quantum algorithms on CV-DV hardware. This is exemplified by\nrealizing the quantum Fourier transform of a state encoded on qubits via the\nfree-evolution of a quantum oscillator, albeit with a runtime exponential in\nthe number of qubits due to information theoretic arguments. Collectively, this\nwork marks a significant step forward in hybrid CV-DV quantum computation,\nproviding a foundation for scalable analog-digital signal processing on quantum\nprocessors.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TC6f7Ko9wXkzIrOpTD2GGYmuJf9C9RSTBi95E22cxXM","pdfSize":"3760898"}
