{"id":"2408.14843","title":"Correntropy-Based Improper Likelihood Model for Robust\n  Electrophysiological Source Imaging","authors":"Yuanhao Li, Badong Chen, Zhongxu Hu, Keita Suzuki, Wenjun Bai,\n  Yasuharu Koike, Okito Yamashita","authorsParsed":[["Li","Yuanhao",""],["Chen","Badong",""],["Hu","Zhongxu",""],["Suzuki","Keita",""],["Bai","Wenjun",""],["Koike","Yasuharu",""],["Yamashita","Okito",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:54:15 GMT"}],"updateDate":"2024-08-28","timestamp":1724745255000,"abstract":"  Bayesian learning provides a unified skeleton to solve the\nelectrophysiological source imaging task. From this perspective, existing\nsource imaging algorithms utilize the Gaussian assumption for the observation\nnoise to build the likelihood function for Bayesian inference. However, the\nelectromagnetic measurements of brain activity are usually affected by\nmiscellaneous artifacts, leading to a potentially non-Gaussian distribution for\nthe observation noise. Hence the conventional Gaussian likelihood model is a\nsuboptimal choice for the real-world source imaging task. In this study, we aim\nto solve this problem by proposing a new likelihood model which is robust with\nrespect to non-Gaussian noises. Motivated by the robust maximum correntropy\ncriterion, we propose a new improper distribution model concerning the noise\nassumption. This new noise distribution is leveraged to structure a robust\nlikelihood function and integrated with hierarchical prior distributions to\nestimate source activities by variational inference. In particular, the score\nmatching is adopted to determine the hyperparameters for the improper\nlikelihood model. A comprehensive performance evaluation is performed to\ncompare the proposed noise assumption to the conventional Gaussian model.\nSimulation results show that, the proposed method can realize more precise\nsource reconstruction by designing known ground-truth. The real-world dataset\nalso demonstrates the superiority of our new method with the visual perception\ntask. This study provides a new backbone for Bayesian source imaging, which\nwould facilitate its application using real-world noisy brain signal.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}