{"id":"2408.16921","title":"Rapid, in-situ neutralization of nitrogen- and silicon-vacancy centers\n  in diamond using above-band-gap optical excitation","authors":"Christian Pederson, Nicholas S. Yama, Lane Beale, Matthew L. Markham,\n  Kai-Mei C. Fu","authorsParsed":[["Pederson","Christian",""],["Yama","Nicholas S.",""],["Beale","Lane",""],["Markham","Matthew L.",""],["Fu","Kai-Mei C.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 21:43:33 GMT"}],"updateDate":"2024-09-02","timestamp":1724967813000,"abstract":"  The charge state of a quantum point defect in a solid state host strongly\ndetermines its optical and spin characteristics. Consequently, techniques for\ncontrolling the charge state are required to realize technologies such as\nquantum networking and sensing. In this work we demonstrate the use of\ndeep-ultraviolet (DUV) radiation to dynamically neutralize nitrogen- (NV) and\nsilicon-vacancy (SiV) centers. We first examine the conversion between the\nneutral and negatively charged NV states by correlating the variation of their\nrespective spectra, indicating that more than 99% of the population of NV\ncenters can be initialized into the neutral charge state. We then examine the\ntime dynamics of bleaching and recharging of negatively charged SiV$^-$ centers\nand observe an 80% reduction in SiV$^-$ photoluminescence within a single\n100-$\\mu$s DUV pulse. Finally we demonstrate that the bleaching of SiV$^-$\ninduced by the DUV is accompanied by a dramatic increase in the neutral SiV$^0$\npopulation; SiV$^0$ remains robust to extended periods of near-infrared\nexcitation despite being a non-equilibrium state. DUV excitation thus presents\na reliable method of generating SiV$^0$, a desirable charge state for quantum\nnetwork applications that is challenging to obtain by equilibrium Fermi\nengineering alone. Our results on two separate color centers at technologically\nrelevant temperatures indicate a potential for above-band-gap excitation as a\nuniversal means of generating the neutral charge states of quantum point\ndefects on demand.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}