{"id":"2408.09566","title":"Efficient spin to charge conversion and spin memory loss mitigation in\n  oriented $\\text{RuO}_2$ films","authors":"Abhisek Mishra, Kshitij Singh Rathore, Swayang Priya Mahanta and\n  Subhankar Bedanta","authorsParsed":[["Mishra","Abhisek",""],["Rathore","Kshitij Singh",""],["Mahanta","Swayang Priya",""],["Bedanta","Subhankar",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 18:34:31 GMT"}],"updateDate":"2024-08-20","timestamp":1724006071000,"abstract":"  $\\text{RuO}_2$, a transition metal oxide, is attracting attention in\nspintronics for its unique altermagnetic properties, which influence spin\ncurrents. Its ability to produce large spin-orbit torques and spin Hall effects\nis key for energy-efficient magnetic memory and logic devices. Additionally,\nthe tunable thickness and crystallinity of $\\text{RuO}_2$ thin films optimize\ntorque efficiency for low-power switching. Spin pumping, a versatile method for\ninvestigating spin dynamics in $\\text{RuO}_2$ thin films, has garnered\nconsiderable interest because of its straightforward, non-invasive and\nuncomplicated approach to addressing impedance mismatch and direct measurement\nof spintronic parameters. Here we present a systematic and detailed analysis on\nthe efficient spin to charge conversion in (110)-oriented $\\text{RuO}_2$ films\nwith amorphous CoFeB as spin source. The spin Hall angle, and spin diffusion\nlength were estimated to be 0.14 $\\pm$ 0.01 and 4.58 $\\pm$ 0.40 nm,\nrespectively. The spin Hall conductivity of 998.89 $\\pm$ 58.23 $\\hbar \\cdot\n\\frac{\\Omega^{-1} \\, \\text{cm}^{-1}}{e}$ has been estimated which is\ntheoretically predicted to be of the similar order. The interfacial spin\ntransparency has been achieved to be 90%. We have shown that the spin memory\nloss at the $\\text{RuO}_2$/CoFeB interface is 15%, which is very small.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}