{"id":"2408.16659","title":"Motion-Driven Neural Optimizer for Prophylactic Braces Made by\n  Distributed Microstructures","authors":"Xingjian Han, Yu Jiang, Weiming Wang, Guoxin Fang, Simeon Gill,\n  Zhiqiang Zhang, Shengfa Wang, Jun Saito, Deepak Kumar, Zhongxuan Luo, Emily\n  Whiting, Charlie C.L. Wang","authorsParsed":[["Han","Xingjian",""],["Jiang","Yu",""],["Wang","Weiming",""],["Fang","Guoxin",""],["Gill","Simeon",""],["Zhang","Zhiqiang",""],["Wang","Shengfa",""],["Saito","Jun",""],["Kumar","Deepak",""],["Luo","Zhongxuan",""],["Whiting","Emily",""],["Wang","Charlie C. L.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 16:03:55 GMT"}],"updateDate":"2024-08-30","timestamp":1724947435000,"abstract":"  Joint injuries, and their long-term consequences, present a substantial\nglobal health burden. Wearable prophylactic braces are an attractive potential\nsolution to reduce the incidence of joint injuries by limiting joint movements\nthat are related to injury risk. Given human motion and ground reaction forces,\nwe present a computational framework that enables the design of personalized\nbraces by optimizing the distribution of microstructures and elasticity. As\nvaried brace designs yield different reaction forces that influence kinematics\nand kinetics analysis outcomes, the optimization process is formulated as a\ndifferentiable end-to-end pipeline in which the design domain of microstructure\ndistribution is parameterized onto a neural network. The optimized distribution\nof microstructures is obtained via a self-learning process to determine the\nnetwork coefficients according to a carefully designed set of losses and the\nintegrated biomechanical and physical analyses. Since knees and ankles are the\nmost commonly injured joints, we demonstrate the effectiveness of our pipeline\nby designing, fabricating, and testing prophylactic braces for the knee and\nankle to prevent potentially harmful joint movements.\n","subjects":["Physics/Medical Physics","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by/4.0/"}