{"id":"2408.01416","title":"The Quest for the Right Mediator: A History, Survey, and Theoretical\n  Grounding of Causal Interpretability","authors":"Aaron Mueller, Jannik Brinkmann, Millicent Li, Samuel Marks, Koyena\n  Pal, Nikhil Prakash, Can Rager, Aruna Sankaranarayanan, Arnab Sen Sharma,\n  Jiuding Sun, Eric Todd, David Bau, Yonatan Belinkov","authorsParsed":[["Mueller","Aaron",""],["Brinkmann","Jannik",""],["Li","Millicent",""],["Marks","Samuel",""],["Pal","Koyena",""],["Prakash","Nikhil",""],["Rager","Can",""],["Sankaranarayanan","Aruna",""],["Sharma","Arnab Sen",""],["Sun","Jiuding",""],["Todd","Eric",""],["Bau","David",""],["Belinkov","Yonatan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:51:42 GMT"}],"updateDate":"2024-08-05","timestamp":1722621102000,"abstract":"  Interpretability provides a toolset for understanding how and why neural\nnetworks behave in certain ways. However, there is little unity in the field:\nmost studies employ ad-hoc evaluations and do not share theoretical\nfoundations, making it difficult to measure progress and compare the pros and\ncons of different techniques. Furthermore, while mechanistic understanding is\nfrequently discussed, the basic causal units underlying these mechanisms are\noften not explicitly defined. In this paper, we propose a perspective on\ninterpretability research grounded in causal mediation analysis. Specifically,\nwe describe the history and current state of interpretability taxonomized\naccording to the types of causal units (mediators) employed, as well as methods\nused to search over mediators. We discuss the pros and cons of each mediator,\nproviding insights as to when particular kinds of mediators and search methods\nare most appropriate depending on the goals of a given study. We argue that\nthis framing yields a more cohesive narrative of the field, as well as\nactionable insights for future work. Specifically, we recommend a focus on\ndiscovering new mediators with better trade-offs between human-interpretability\nand compute-efficiency, and which can uncover more sophisticated abstractions\nfrom neural networks than the primarily linear mediators employed in current\nwork. We also argue for more standardized evaluations that enable principled\ncomparisons across mediator types, such that we can better understand when\nparticular causal units are better suited to particular use cases.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}