{"id":"2408.14592","title":"Massive star cluster formation III. Early mass segregation during\n  cluster assembly","authors":"Brooke Polak, Mordecai-Mark Mac Low, Ralf S. Klessen, Simon Portegies\n  Zwart, Eric P. Andersson, Sabrina M. Appel, Claude Cournoyer Cloutier, Simon\n  C. O. Glover, and Stephen L. W. McMillan","authorsParsed":[["Polak","Brooke",""],["Mac Low","Mordecai-Mark",""],["Klessen","Ralf S.",""],["Zwart","Simon Portegies",""],["Andersson","Eric P.",""],["Appel","Sabrina M.",""],["Cloutier","Claude Cournoyer",""],["Glover","Simon C. O.",""],["McMillan","Stephen L. W.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:25:01 GMT"}],"updateDate":"2024-08-28","timestamp":1724700301000,"abstract":"  Mass segregation is seen in many star clusters, but whether massive stars\nform in the center of a cluster or migrate there dynamically is still debated.\nN-body simulations have shown that early dynamical mass segregation is possible\nwhen sub-clusters merge to form a dense core with a small crossing time.\nHowever, the effect of gas dynamics on both the formation and dynamics of the\nstars could inhibit the formation of the dense core. We aim to study the\ndynamical mass segregation of star cluster models that include gas dynamics and\nself-consistently form stars from the dense substructure in the gas. Our models\nuse the Torch framework, which is based on AMUSE and includes stellar and\nmagnetized gas dynamics, as well as stellar evolution and feedback from\nradiation, stellar winds, and supernovae. Our models consist of three star\nclusters forming from initial turbulent spherical clouds of mass\n$10^{4,5,6}\\rm~M_\\odot$ and radius $11.7\\rm~pc$ that have final stellar masses\nof $3.6\\times10^3\\rm~M_\\odot$, $6.5\\times10^4\\rm~M_\\odot$, and\n$8.9\\times10^5\\rm~M_\\odot$, respectively. There is no primordial mass\nsegregation in the model by construction. All three clusters become dynamically\nmass segregated at early times via collapse confirming that this mechanism\noccurs within sub-clusters forming directly out of the dense substructure in\nthe gas. The dynamics of the embedded gas and stellar feedback do not inhibit\nthe collapse of the cluster. We find that each model cluster becomes mass\nsegregated within $2~$Myr of the onset of star formation, reaching the levels\nobserved in young clusters in the Milky Way. However, we note that the exact\nvalues are highly time-variable during these early phases of evolution. Massive\nstars that segregate to the center during core collapse are likely to be\ndynamically ejected, a process that can decrease the overall level of mass\nsegregation again.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}