{"id":"2408.17428","title":"CLOCR-C: Context Leveraging OCR Correction with Pre-trained Language\n  Models","authors":"Jonathan Bourne","authorsParsed":[["Bourne","Jonathan",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:26:05 GMT"}],"updateDate":"2024-09-02","timestamp":1725038765000,"abstract":"  The digitisation of historical print media archives is crucial for increasing\naccessibility to contemporary records. However, the process of Optical\nCharacter Recognition (OCR) used to convert physical records to digital text is\nprone to errors, particularly in the case of newspapers and periodicals due to\ntheir complex layouts. This paper introduces Context Leveraging OCR Correction\n(CLOCR-C), which utilises the infilling and context-adaptive abilities of\ntransformer-based language models (LMs) to improve OCR quality. The study aims\nto determine if LMs can perform post-OCR correction, improve downstream NLP\ntasks, and the value of providing the socio-cultural context as part of the\ncorrection process. Experiments were conducted using seven LMs on three\ndatasets: the 19th Century Serials Edition (NCSE) and two datasets from the\nOverproof collection. The results demonstrate that some LMs can significantly\nreduce error rates, with the top-performing model achieving over a 60%\nreduction in character error rate on the NCSE dataset. The OCR improvements\nextend to downstream tasks, such as Named Entity Recognition, with increased\nCosine Named Entity Similarity. Furthermore, the study shows that providing\nsocio-cultural context in the prompts improves performance, while misleading\nprompts lower performance. In addition to the findings, this study releases a\ndataset of 91 transcribed articles from the NCSE, containing a total of 40\nthousand words, to support further research in this area. The findings suggest\nthat CLOCR-C is a promising approach for enhancing the quality of existing\ndigital archives by leveraging the socio-cultural information embedded in the\nLMs and the text requiring correction.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Digital Libraries"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"NwBo8ZnXiWnOIOeufKFrYxoOYPc8R3pspUx840m7G-Q","pdfSize":"503189"}
