{"id":"2408.13766","title":"Enhancing Robustness of Human Detection Algorithms in Maritime SAR\n  through Augmented Aerial Images to Simulate Weather Conditions","authors":"Miguel Tjia, Artem Kim, Elaine Wynette Wijaya, Hanna Tefara, and Kevin\n  Zhu","authorsParsed":[["Tjia","Miguel",""],["Kim","Artem",""],["Wijaya","Elaine Wynette",""],["Tefara","Hanna",""],["Zhu","Kevin",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 08:23:06 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 08:07:20 GMT"}],"updateDate":"2024-08-28","timestamp":1724574186000,"abstract":"  7,651 cases of Search and Rescue Missions (SAR) were reported by the United\nStates Coast Guard in 2024, with over 1322 SAR helicopters deployed in the 6\nfirst months alone. Through the utilizations of YOLO, we were able to run\ndifferent weather conditions and lighting from our augmented dataset for\ntraining. YOLO then utilizes CNNs to apply a series of convolutions and pooling\nlayers to the input image, where the convolution layers are able to extract the\nmain features of the image. Through this, our YOLO model is able to learn to\ndifferentiate different objects which may considerably improve its accuracy,\npossibly enhancing the efficiency of SAR operations through enhanced detection\naccuracy. This paper aims to improve the model's accuracy of human detection in\nmaritime SAR by evaluating a robust datasets containing various elevations and\ngeological locations, as well as through data augmentation which simulates\ndifferent weather and lighting. We observed that models trained on augmented\ndatasets outperformed their non-augmented counterparts in which the human\nrecall scores ranged from 0.891 to 0.911 with an improvement rate of 3.4\\% on\nthe YOLOv5l model. Results showed that these models demonstrate greater\nrobustness to real-world conditions in varying of weather, brightness, tint,\nand contrast.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}