{"id":"2408.16802","title":"Auto-resolving atomic structure at van der Waal interfaces using a\n  generative model","authors":"Wenqiang Huang, Yuchen Jin, Zhemin Li, Lin Yao, Yun Chen, Zheng Luo,\n  Shen Zhou, Jinguo Lin, Feng Liu, Zhifeng Gao, Jun Cheng, Linfeng Zhang,\n  Fangping Ouyang, Jin Zhang, Shanshan Wang","authorsParsed":[["Huang","Wenqiang",""],["Jin","Yuchen",""],["Li","Zhemin",""],["Yao","Lin",""],["Chen","Yun",""],["Luo","Zheng",""],["Zhou","Shen",""],["Lin","Jinguo",""],["Liu","Feng",""],["Gao","Zhifeng",""],["Cheng","Jun",""],["Zhang","Linfeng",""],["Ouyang","Fangping",""],["Zhang","Jin",""],["Wang","Shanshan",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:53:09 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 10:58:57 GMT"},{"version":"v3","created":"Wed, 4 Sep 2024 02:57:15 GMT"}],"updateDate":"2024-09-05","timestamp":1724932389000,"abstract":"  Unveiling atomic structures is significant for the relationship construction\nbetween microscopic configurations and macroscopic properties of materials.\nHowever, we still lack a rapid, accurate, and robust approach to automatically\nresolve complex patterns in atomic-resolution microscopy. Here, we present a\nTrident strategy-enhanced disentangled representation learning method (a\ngenerative model), which utilizes a few unlabeled experimental images with\nabundant low-cost simulated images to generate a large corpus of annotated\nsimulation data that closely resembles experimental conditions, realizing\nsimultaneous achievement of high quality and large volumes of the training\ndataset. A structural inference model is then trained via a residual neural\nnetwork which can directly deduce the interlayer slip and rotation of\ndiversified and complicated stacking patterns at van der Waals (vdWs)\ninterfaces with picometer-scale accuracy across various materials (ReS2, ReSe2,\nand MoS2) with different layer numbers (bilayer and trilayers) and demonstrates\nrobustness to defects, imaging quality, and surface contaminations. The\nframework can also identify pattern transition interfaces, quantify subtle\nmotif variations, and discriminate moir\\'e patterns that are undistinguishable\nin frequency domains. The high-throughput processing ability of our method\nhelps discover a novel vdW epitaxy where various thermodynamically favorable\nslip stackings can coexist, demonstrating the machine learning contribution to\nthe new knowledge emergence.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}