{"id":"2408.03601","title":"DRAMA: An Efficient End-to-end Motion Planner for Autonomous Driving\n  with Mamba","authors":"Chengran Yuan, Zhanqi Zhang, Jiawei Sun, Shuo Sun, Zefan Huang,\n  Christina Dao Wen Lee, Dongen Li, Yuhang Han, Anthony Wong, Keng Peng Tee,\n  and Marcelo H. Ang Jr","authorsParsed":[["Yuan","Chengran",""],["Zhang","Zhanqi",""],["Sun","Jiawei",""],["Sun","Shuo",""],["Huang","Zefan",""],["Lee","Christina Dao Wen",""],["Li","Dongen",""],["Han","Yuhang",""],["Wong","Anthony",""],["Tee","Keng Peng",""],["Ang","Marcelo H.","Jr"]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 07:41:01 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 04:31:32 GMT"}],"updateDate":"2024-08-15","timestamp":1723016461000,"abstract":"  Motion planning is a challenging task to generate safe and feasible\ntrajectories in highly dynamic and complex environments, forming a core\ncapability for autonomous vehicles. In this paper, we propose DRAMA, the first\nMamba-based end-to-end motion planner for autonomous vehicles. DRAMA fuses\ncamera, LiDAR Bird's Eye View images in the feature space, as well as ego\nstatus information, to generate a series of future ego trajectories. Unlike\ntraditional transformer-based methods with quadratic attention complexity for\nsequence length, DRAMA is able to achieve a less computationally intensive\nattention complexity, demonstrating potential to deal with increasingly complex\nscenarios. Leveraging our Mamba fusion module, DRAMA efficiently and\neffectively fuses the features of the camera and LiDAR modalities. In addition,\nwe introduce a Mamba-Transformer decoder that enhances the overall planning\nperformance. This module is universally adaptable to any Transformer-based\nmodel, especially for tasks with long sequence inputs. We further introduce a\nnovel feature state dropout which improves the planner's robustness without\nincreasing training and inference times. Extensive experimental results show\nthat DRAMA achieves higher accuracy on the NAVSIM dataset compared to the\nbaseline Transfuser, with fewer parameters and lower computational costs.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}