{"id":"2408.01350","title":"Human foraging strategies flexibly adapt to resource distribution and\n  time constraints","authors":"Valeria Simonelli, Davide Nuzzi, Gian Luca Lancia, Giovanni Pezzulo","authorsParsed":[["Simonelli","Valeria",""],["Nuzzi","Davide",""],["Lancia","Gian Luca",""],["Pezzulo","Giovanni",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:55:26 GMT"}],"updateDate":"2024-08-05","timestamp":1722614126000,"abstract":"  Foraging is a crucial activity, yet the extent to which humans employ\nflexible versus rigid strategies remains unclear. This study investigates how\nindividuals adapt their foraging strategies in response to resource\ndistribution and foraging time constraints. For this, we designed a\nvideo-game-like foraging task that requires participants to navigate a\nfour-areas environment to collect coins from treasure boxes within a limited\ntime. This task engages multiple cognitive abilities, such as navigation,\nlearning, and memorization of treasure box locations. Findings indicate that\nparticipants adjust their foraging strategies -- encompassing both\nstay-or-leave decisions, such as the number of boxes opened in initial areas\nand behavioral aspects, such as the time to navigate from box to box --\ndepending on both resource distribution and foraging time. Additionally, they\nimproved their performance over time as an effect of both enhanced navigation\nskills and adaptation of foraging strategies. Finally, participants'\nperformance was initially distant from the reward-maximizing performance of\noptimal agents due to the learning process humans undergo; however, it\napproximated the optimal agent's performance towards the end of the task,\nwithout fully reaching it. These results highlight the flexibility of human\nforaging behavior and underscore the importance of employing optimality models\nand ecologically rich scenarios to study foraging.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"aysfA07SV8fR0FKWOO8z4UIpkYmZxjWEQIHtO0_T7CI","pdfSize":"5635110"}
