{"id":"2408.15092","title":"A Field Guide to non-Onsager Quantum Oscillations in Metals","authors":"Valentin Leeb, Nico Huber, Christian Pfleiderer, Johannes Knolle, Marc\n  A. Wilde","authorsParsed":[["Leeb","Valentin",""],["Huber","Nico",""],["Pfleiderer","Christian",""],["Knolle","Johannes",""],["Wilde","Marc A.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:22:06 GMT"}],"updateDate":"2024-08-28","timestamp":1724768526000,"abstract":"  Quantum oscillation (QO) measurements constitute a powerful method to measure\nthe Fermi surface (FS) properties of metals. The observation of QOs at specific\nfrequencies is usually taken as strong evidence for the existence of extremal\ncross-sectional areas of the FS that directly correspond to the measured\nfrequency value according to the famous Onsager relation. Here, we review\nmechanisms that generate QO frequencies that defy the Onsager relation and\ndiscuss material candidates. These include magnetic breakdown, magnetic\ninteraction, chemical potential oscillations, and Stark quantum interference,\nmost of which lead to signals occurring at combinations of \"parent\" Onsager\nfrequencies. A special emphasis is put on the recently discovered mechanism of\nquasi-particle lifetime oscillations (QPLOs). We aim to provide a field guide\nthat allows, on the one hand, to distinguish such non-Onsager QOs from\nconventional QOs arising from extremal cross sections and, on the other hand,\nto distinguish the various non-Onsager mechanisms from each other. We give a\npractical classification of non-Onsager QOs in terms of the prerequisites for\ntheir occurrence and their characteristics. We show that, in particular, the\nrecently discovered QPLOs may pose significant challenges for the\ninterpretation of QO spectra, as they may occur quite generically as frequency\ndifferences in multi-orbit systems, without the necessity of visible \"parent\"\nfrequencies in the spectrum, owing to a strongly suppressed temperature\ndephasing of QPLOs. We present an extensive list of material candidates where\nQPLOs may represent an alternative explanation for the observation of\nunexpected QO frequencies.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"JzLbPp8J5zML3z4Y3Iw3g6QnvNxPQ3fdS9BnN1fjguQ","pdfSize":"11185741"}
