{"id":"2408.09887","title":"Beyond Diagonal RIS: Passive Maximum Ratio Transmission and Interference\n  Nulling Enabler","authors":"Hamad Yahya, Hongyu Li, Matteo Nerini, Bruno Clerckx, Merouane Debbah","authorsParsed":[["Yahya","Hamad",""],["Li","Hongyu",""],["Nerini","Matteo",""],["Clerckx","Bruno",""],["Debbah","Merouane",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:04:17 GMT"}],"updateDate":"2024-08-20","timestamp":1724065457000,"abstract":"  Beyond diagonal reconfigurable intelligent surfaces (BD-RIS) generalizes and\ngoes beyond conventional diagonal reconfigurable intelligent surfaces (D-RIS)\nby interconnecting elements to generate beyond diagonal scattering matrices,\nwhich significantly strengthen the wireless channels. In this work, we use\nBD-RIS for passive multiuser beamforming in multiuser\nmultiple-input-single-output (MU-MISO) systems. Specifically, we design the\nscattering matrix of BD-RIS to either maximize the sum received signal power at\nthe users following maximum ratio transmission (MRT), or to nullify the\ninterference at the users following zero forcing (ZF). Furthermore, we\ninvestigate uniform/optimized power allocation and ZF precoding at the base\nstation (BS). Numerical results show that BD-RIS improves the interference\nnulling capability and sum rate with fewer reflecting elements (REs) compared\nto D-RIS. In addition, at moderate to high signal to noise ratios (SNRs),\npassive interference nulling reduces the complexity at the BS by relaxing the\nneed for precoding or water-filling power allocation design. Furthermore, the\npassive MRT with ZF precoding achieves a tight sum rate performance to the\njoint design considering MU-MISO scenarios with many REs while maintaining low\ncomputational complexity and simplifying the channel estimation.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"F2sc-pJRML14rnvymtxyu3rUrUhS7g2poopa2deFFS4","pdfSize":"937459"}
