{"id":"2408.13394","title":"Towards Robust Perception for Assistive Robotics: An RGB-Event-LiDAR\n  Dataset and Multi-Modal Detection Pipeline","authors":"Adam Scicluna, Cedric Le Gentil, Sheila Sutjipto, Gavin Paul","authorsParsed":[["Scicluna","Adam",""],["Gentil","Cedric Le",""],["Sutjipto","Sheila",""],["Paul","Gavin",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 22:10:34 GMT"}],"updateDate":"2024-08-27","timestamp":1724451034000,"abstract":"  The increasing adoption of human-robot interaction presents opportunities for\ntechnology to positively impact lives, particularly those with visual\nimpairments, through applications such as guide-dog-like assistive robotics. We\npresent a pipeline exploring the perception and \"intelligent disobedience\"\nrequired by such a system. A dataset of two people moving in and out of view\nhas been prepared to compare RGB-based and event-based multi-modal dynamic\nobject detection using LiDAR data for 3D position localisation. Our analysis\nhighlights challenges in accurate 3D localisation using 2D image-LiDAR fusion,\nindicating the need for further refinement. Compared to the performance of the\nframe-based detection algorithm utilised (YOLOv4), current cutting-edge\nevent-based detection models appear limited to contextual scenarios, such as\nfor automotive platforms. This is highlighted by weak precision and recall over\nvarying confidence and Intersection over Union (IoU) thresholds when using\nframe-based detections as a ground truth. Therefore, we have publicly released\nthis dataset to the community, containing RGB, event, point cloud and Inertial\nMeasurement Unit (IMU) data along with ground truth poses for the two people in\nthe scene to fill a gap in the current landscape of publicly available datasets\nand provide a means to assist in the development of safer and more robust\nalgorithms in the future: https://uts-ri.github.io/revel/.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}