{"id":"2408.08122","title":"Cluster Formations of Free and Congested Flows in Urban Road Networks","authors":"Yongsung Kwon, Minjin Lee, Mi Jin Lee and Seung-Woo Son","authorsParsed":[["Kwon","Yongsung",""],["Lee","Minjin",""],["Lee","Mi Jin",""],["Son","Seung-Woo",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:49:25 GMT"}],"updateDate":"2024-08-16","timestamp":1723726165000,"abstract":"  Understanding traffic behavior is crucial for enhancing the stable\nfunctioning and safety of transportation systems. Previous percolation-based\ntransportation studies have analyzed transition behaviors from free-flow to\ntraffic-jam states, with a focus on robustness and resilience during\ncongestion. However, relatively less attention is paid to the percolation\nanalysis of the free-flow states, specifically how free-flow clusters form and\ngrow. In this study, we investigate the percolation patterns of two opposing\ntraffic scenarios -- traffic jam state and free-flow state -- within the same\nroad network using Chengdu taxi data and compare their percolating behaviors.\nOur analysis reveals differences between the two scenarios in the growth\npatterns of the giant connected component (GCC), which is captured by a\npersistent gap between the GCC size curves, particularly during peak hours. We\nattribute these disparities to a long-range spatial correlation of traffic\nspeed within a road network. Empirically, we find distinct long-range spatial\ncorrelations in traffic, using rescaled taxi speeds on roads, and we examine\ntheir relationship with each percolation pattern. Our analysis provides an\nintegrated view of traffic dynamics and uncovers intrinsic traffic correlations\nwithin urban areas that drive these intriguing percolation patterns. Our\nfindings also offer valuable metrics for effective traffic management and\naccident prevention strategies, aligning with urban transportation safety and\nreliability goals. These insights are beneficial for assessing and designing\nresilient urban road networks that maintain functionality under stress,\nultimately improving the reliability of traffic assessments and reducing\naccidents.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}