{"id":"2408.01872","title":"Safe Semi-Supervised Contrastive Learning Using In-Distribution Data as\n  Positive Examples","authors":"Min Gu Kwak, Hyungu Kahng, and Seoung Bum Kim","authorsParsed":[["Kwak","Min Gu",""],["Kahng","Hyungu",""],["Kim","Seoung Bum",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 22:33:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722724393000,"abstract":"  Semi-supervised learning methods have shown promising results in solving many\npractical problems when only a few labels are available. The existing methods\nassume that the class distributions of labeled and unlabeled data are equal;\nhowever, their performances are significantly degraded in class distribution\nmismatch scenarios where out-of-distribution (OOD) data exist in the unlabeled\ndata. Previous safe semi-supervised learning studies have addressed this\nproblem by making OOD data less likely to affect training based on labeled\ndata. However, even if the studies effectively filter out the unnecessary OOD\ndata, they can lose the basic information that all data share regardless of\nclass. To this end, we propose to apply a self-supervised contrastive learning\napproach to fully exploit a large amount of unlabeled data. We also propose a\ncontrastive loss function with coefficient schedule to aggregate as an anchor\nthe labeled negative examples of the same class into positive examples. To\nevaluate the performance of the proposed method, we conduct experiments on\nimage classification datasets - CIFAR-10, CIFAR-100, Tiny ImageNet, and\nCIFAR-100+Tiny ImageNet - under various mismatch ratios. The results show that\nself-supervised contrastive learning significantly improves classification\naccuracy. Moreover, aggregating the in-distribution examples produces better\nrepresentation and consequently further improves classification accuracy.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"t8U39V6VOG8wcOu5WkMUNMnWF9_pj89RCYp-F_2HjXM","pdfSize":"10864441"}
