{"id":"2408.16174","title":"Notes on peculiarities of Schwinger--DeWitt technique: one-loop double\n  poles, total-derivative terms and determinant anomalies","authors":"Andrei O. Barvinsky and Alexey E. Kalugin","authorsParsed":[["Barvinsky","Andrei O.",""],["Kalugin","Alexey E.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 23:42:12 GMT"}],"updateDate":"2024-08-30","timestamp":1724888532000,"abstract":"  We discuss peculiarities of the Schwinger--DeWitt technique for quantum\neffective action, associated with the origin of dimensionally regularized\ndouble-pole divergences of the one-loop functional determinant for massive\nProca model in a curved spacetime. These divergences have the form of the\ntotal-derivative term generated by integration by parts in the functional trace\nof the heat kernel for the Proca vector field operator. Because of the\nnonminimal structure of second-order derivatives in this operator, its vector\nfield heat kernel has a nontrivial form, involving the convolution of the\nscalar d'Alembertian Green's function with its heat kernel. Moreover, its\nasymptotic expansion is very different from the universal predictions of\nGilkey-Seeley heat kernel theory because the Proca operator violates one of the\nbasic assumptions of this theory -- the nondegeneracy of the principal symbol\nof an elliptic operator. This modification of the asymptotic expansion explains\nthe origin of double-pole total-derivative terms. Another hypostasis of such\nterms is in the problem of multiplicative determinant anomalies -- lack of\nfactorization of the functional determinant of a product of differential\noperators into the product of their individual determinants. We demonstrate\nthat this anomaly should have the form of total-derivative terms and check this\nstatement by calculating divergent parts of functional determinants for\nproducts of minimal and nonminimal second-order differential operators in\ncurved spacetime.\n","subjects":["Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}