{"id":"2408.02740","title":"Non-symmetric GHZ states; weighted hypergraph and controlled-unitary\n  graph representations","authors":"Hrachya Zakaryan, Konstantinos-Rafail Revis, and Zahra Raissi","authorsParsed":[["Zakaryan","Hrachya",""],["Revis","Konstantinos-Rafail",""],["Raissi","Zahra",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:18 GMT"}],"updateDate":"2024-08-07","timestamp":1722880818000,"abstract":"  Non-symmetric GHZ states ($n$-GHZ$_\\alpha$), characterized by unequal\nsuperpositions of $|00...0>$ and $|11...1>$, represent a significant yet\nunderexplored class of multipartite entangled states with potential\napplications in quantum information. Despite their importance, the lack of a\nwell-defined stabilizer formalism and corresponding graph representation has\nhindered their comprehensive study. In this paper, we address this gap by\nintroducing two novel graph formalisms and stabilizers for non-symmetric GHZ\nstates. First, we provide a weighted hypergraph representation and demonstrate\nthat non-symmetric GHZ states are local unitary (LU) equivalent to fully\nconnected weighted hypergraphs. Although these weighted hypergraphs are not\nstabilizer states, we show that they can be stabilized using local operations,\nand an ancilla. We further extend this framework to qudits, offering a specific\nform for non-symmetric qudit GHZ states and their LU equivalent weighted qudit\nhypergraphs. Second, we propose a graph formalism using controlled-unitary (CU)\noperations, showing that non-symmetric qudit GHZ states can be described using\nstar-shaped CU graphs. Our findings enhance the understanding of non-symmetric\nGHZ states and their potential applications in quantum information science.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IfGF0svWh6MtF5v_y7-RD5IZSnqLOb6lSU5hXdlXEJ8","pdfSize":"537387","txDigest":"7nvfasJtgfMmgp3Cgy1H43S47joL8UP472u1e1YVy4w","endEpoch":"1","status":"CERTIFIED"}
