{"id":"2408.12603","title":"Sleeper Social Bots: a new generation of AI disinformation bots are\n  already a political threat","authors":"Jaiv Doshi, Ines Novacic, Curtis Fletcher, Mats Borges, Elea Zhong,\n  Mark C. Marino, Jason Gan, Sophia Mager, Dane Sprague, and Melinda Xia","authorsParsed":[["Doshi","Jaiv",""],["Novacic","Ines",""],["Fletcher","Curtis",""],["Borges","Mats",""],["Zhong","Elea",""],["Marino","Mark C.",""],["Gan","Jason",""],["Mager","Sophia",""],["Sprague","Dane",""],["Xia","Melinda",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 19:57:10 GMT"}],"updateDate":"2024-08-26","timestamp":1723060630000,"abstract":"  This paper presents a study on the growing threat of \"sleeper social bots,\"\nAI-driven social bots in the political landscape, created to spread\ndisinformation and manipulate public opinion. We based the name sleeper social\nbots on their ability to pass as humans on social platforms, where they're\nembedded like political \"sleeper\" agents, making them harder to detect and more\ndisruptive. To illustrate the threat these bots pose, our research team at the\nUniversity of Southern California constructed a demonstration using a private\nMastodon server, where ChatGPT-driven bots, programmed with distinct\npersonalities and political viewpoints, engaged in discussions with human\nparticipants about a fictional electoral proposition. Our preliminary findings\nsuggest these bots can convincingly pass as human users, actively participate\nin conversations, and effectively disseminate disinformation. Moreover, they\ncan adapt their arguments based on the responses of human interlocutors,\nshowcasing their dynamic and persuasive capabilities. College students\nparticipating in initial experiments failed to identify our bots, underscoring\nthe urgent need for increased awareness and education about the dangers of\nAI-driven disinformation, and in particular, disinformation spread by bots. The\nimplications of our research point to the significant challenges posed by\nsocial bots in the upcoming 2024 U.S. presidential election and beyond.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cyMb2Hj-BBKJ6yI-czrBYiDo9J41u-bkTbw4oXxss1U","pdfSize":"874615"}
