{"id":"2408.06649","title":"Intricate Evaporation Dynamics in Different Multi-Droplet Configurations","authors":"Hari Govindha A., Saravanan Balusamy, Sayak Banerjee, Kirti Chandra\n  Sahu","authorsParsed":[["A.","Hari Govindha",""],["Balusamy","Saravanan",""],["Banerjee","Sayak",""],["Sahu","Kirti Chandra",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 05:39:09 GMT"}],"updateDate":"2024-08-14","timestamp":1723527549000,"abstract":"  We experimentally investigate the evaporation dynamics of an array of sessile\ndroplets arranged in different configurations. Utilizing a customized\ngoniometer, we capture side and top view profiles to monitor the evolution of\nheight, spread, contact angle, and volume of the droplets. Our results reveal\nthat the lifetime of a droplet array surpasses that of an isolated droplet,\nattributed to the shielding effect induced by neighbouring droplets, which\nelevates the local vapour concentration, thereby reducing the evaporation rate.\nWe found that lifetime increases as droplet separation distance decreases at a\nfixed configuration and substrate temperature. It is observed that the\nlifetimes increase with the number of droplets. We observe a decrease in\nlifetimes, following a power law trend with increasing substrate temperature,\nwith the shielding effect diminishing at higher substrate temperatures due to\nnatural convective effects. We also observe a generalised behavior for the\ncentrally placed droplet across various separation distances and substrate\ntemperatures. This arises from different droplet configurations and substrate\ntemperatures, which modify the local vapour concentration around the droplets\nwithout significantly impacting the contact line dynamics. Additionally, the\nexperimental results are compared with a diffusion-based theoretical model that\nincorporates the evaporative cooling effect to predict the lifetime of the\ncentral droplet within the array. We observe that the theoretical model\nsatisfactorily predicts the lifetime of the droplet at room temperature.\nHowever, for high-temperature cases, the model slightly overpredicts the\nevaporative lifetimes.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5ltF3kCQQwYS1wzfLprEB9MNd-HNO0rzdPEPOraom_g","pdfSize":"1522118"}
