{"id":"2408.02139","title":"Extra Throughput versus Days Lost in load-shifting V2G services:\n  Influence of dominant degradation mechanism","authors":"Hamidreza Movahedi, Sravan Pannala, Jason Siegel, Stephen J. Harris,\n  David Howey, Anna Stefanopoulou","authorsParsed":[["Movahedi","Hamidreza",""],["Pannala","Sravan",""],["Siegel","Jason",""],["Harris","Stephen J.",""],["Howey","David",""],["Stefanopoulou","Anna",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 20:38:31 GMT"}],"updateDate":"2024-08-06","timestamp":1722803911000,"abstract":"  Electric vehicle (EV) batteries are often underutilized. Vehicle-to-grid\n(V2G) services can tap into this unused potential, but increased battery usage\nmay lead to more degradation and shorter battery life. This paper substantiates\nthe advantages of providing load-shifting V2G services when the battery is\naging, primarily due to calendar aging mechanisms (active degradation\nmechanisms while the battery is not used). After parameterizing a physics-based\ndigital-twin for three different dominant degradation patterns within the same\nchemistry (NMC), we introduce a novel metric for evaluating the benefit and\nassociated harm of V2G services: \\textit{throughput gained versus days lost\n(TvD)} and show its strong relationship to the ratio of loss of lithium\ninventory (LLI) due to calendar aging to the total LLI\n($\\text{LLI}_\\text{Cal}/\\text{LLI}$). Our results that focus systematically on\ndegradation mechanisms via lifetime simulation of digital-twins significantly\nexpand prior work that was primarily concentrating on quantifying and reducing\nthe degradation of specific cells by probing their usage and charging patterns.\nExamining various cell chemistries and conditions enables us to take a broader\nview and determine whether a particular battery pack is appropriate for\nload-shifting (V2G) services. Our research demonstrates that the decision \"to\nV2G or not to V2G\" can be made by merely estimating the portion of capacity\ndeterioration caused by calendar aging. Specifically, TvD is primarily\ninfluenced by the chemistry of cells and the environmental temperature where\nthe car is parked, while the usage intensity and charging patterns of EVs play\na lesser role.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}