{"id":"2408.15083","title":"Multitone PSK Modulation Design for Simultaneous Wireless Information\n  and Power Transfer","authors":"Prerna Dhull, Graduate Student Member, Dominique Schreurs, Giacomo\n  Paolini, Alessandra Costanzo, Mehran Abolhasan, Negin Shariati","authorsParsed":[["Dhull","Prerna",""],["Member","Graduate Student",""],["Schreurs","Dominique",""],["Paolini","Giacomo",""],["Costanzo","Alessandra",""],["Abolhasan","Mehran",""],["Shariati","Negin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:15:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724768103000,"abstract":"  Far-field wireless power transfer, based on radio frequency (RF) waves, came\ninto the picture to fulfill the power need of large Internet of Things (IoT)\nnetworks, the backbone of the 5G and beyond era. However, RF communication\nsignals carry both information as well as energy. Therefore, recently,\nsimultaneous wireless information and power transfer (SWIPT) has attracted much\nattention in order to wirelessly charge these IoT devices. In this paper, we\npropose a novel N -tone multitone phase shift keying (PSK) modulation scheme,\ntaking advantage of the non-linearity of integrated receiver rectifier\narchitecture. The main advantage of the proposed modulation scheme is the\nreduction in ripple voltage, introduced by the symbol transmission through\nphases. Achievable power conversion efficiency (PCE) and bit error rate (BER)\nat the output are considered to measure the efficacy of the proposed modulation\nscheme. Simulation results are verified by the measurements over the designed\nrectifier circuitry. The effect of symbol phase range, modulation order, and\nthe number of tones are analyzed. In the future, this transmission scheme can\nbe utilized to satisfy the data and power requirements of low-power Internet of\nThings sensor networks.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}