{"id":"2408.12117","title":"Sr4Os3O12- A Layered Osmate (V,VI) that is Magnetic close to Room\n  Temperature","authors":"Gohil S. Thakur, Julia-Maria H\\\"ubner, Kati Finzel, Thomas Doert, and\n  Michael Ruck","authorsParsed":[["Thakur","Gohil S.",""],["Hübner","Julia-Maria",""],["Finzel","Kati",""],["Doert","Thomas",""],["Ruck","Michael",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 04:15:23 GMT"}],"updateDate":"2024-08-23","timestamp":1724300123000,"abstract":"  Black crystals of the mixed-valence osmate(V,VI) Sr4Os3O12 were grown via a\ngas phase reaction in an evacuated silica tube. The material is attracted to a\npermanent magnet at room temperature (295 K) but loses this property when\nheated or cooled. In this temperature interval, soft magnetic behavior with\nvanishing coercivity is observed, but the saturation magnetization is only 0.05\nMuB per formula unit. Resistivity measurements show that Sr4Os3O12 is a\nsemiconductor with a small band gap of about 0.26 eV at room temperature. X-ray\ndiffraction on a single-crystal revealed a rhombohedral structure with the\nspace group R-3m and lattice parameters ar = 554.64(2) pm and cr = 2700.1(1) pm\nat 300(1) K. The compound crystallizes in the La4Ti3O12 structure type and is\nisostructural to Sr4CoRe2O12. The structure is a rhombohedral stack of layered\nblocks, each of which can be considered as a section of three layers of the\ncubic perovskite structure cut perpendicular to one of its threefold axes. The\nOs-O-Os bond angle of about 175{/deg} favors superexchange that leads to\nantiferromagnetic coupling between the osmium atoms with 5d3 and 5d2\nconfigurations. Sr4Os3O12 exhibits strong lattice dynamics. One aspect is the\nantiferro-rotative lattice modes of the corner-sharing [OsO6] octahedra, which\nfreeze upon cooling. At 100 K, an ordered, yet twinned triclinic superstructure\nis formed. Strong spin-orbit coupling and other effects cause deformations of\nthe [OsO6] octahedra that differ significantly at 300 K and 100 K, suggesting a\nchange in the electronic configuration. Competing ground states could also\nexplain the temperature dependent band gap and the magnetic fluctuations\nmanifested in the magnetization peak at room temperature.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/"}