{"id":"2408.01918","title":"Comprehensive characterization of tumor therapeutic response with\n  simultaneous mapping cell size, density, and transcytolemmal water exchange","authors":"Diwei Shi, Sisi Li, Fan Liu, Xiaoyu Jiang, Lei Wu, Li Chen, Quanshui\n  Zheng, Haihua Bao, Hua Guo, Junzhong Xu","authorsParsed":[["Shi","Diwei",""],["Li","Sisi",""],["Liu","Fan",""],["Jiang","Xiaoyu",""],["Wu","Lei",""],["Chen","Li",""],["Zheng","Quanshui",""],["Bao","Haihua",""],["Guo","Hua",""],["Xu","Junzhong",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 03:54:05 GMT"}],"updateDate":"2024-08-06","timestamp":1722743645000,"abstract":"  Early assessment of tumor therapeutic response is an important topic in\nprecision medicine to optimize personalized treatment regimens and reduce\nunnecessary toxicity, cost, and delay. Although diffusion MRI (dMRI) has shown\npotential to address this need, its predictive accuracy is limited, likely due\nto its unspecific sensitivity to overall pathological changes. In this work, we\npropose a new quantitative dMRI-based method dubbed EXCHANGE (MRI of water\nExchange, Confined and Hindered diffusion under Arbitrary Gradient waveform\nEncodings) for simultaneous mapping of cell size, cell density, and\ntranscytolemmal water exchange. Such rich microstructural information\ncomprehensively evaluates tumor pathologies at the cellular level. Validations\nusing numerical simulations and in vitro cell experiments confirmed that the\nEXCHANGE method can accurately estimate mean cell size, density, and water\nexchange rate constants. The results from in vivo animal experiments show the\npotential of EXCHANGE for monitoring tumor treatment response. Finally, the\nEXCHANGE method was implemented in breast cancer patients with neoadjuvant\nchemotherapy, demonstrating its feasibility in assessing tumor therapeutic\nresponse in clinics. In summary, a new, quantitative dMRI-based EXCHANGE method\nwas proposed to comprehensively characterize tumor microstructural properties\nat the cellular level, suggesting a unique means to monitor tumor treatment\nresponse in clinical practice.\n","subjects":["Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}