{"id":"2408.07176","title":"Surrogate-Assisted Search with Competitive Knowledge Transfer for\n  Expensive Optimization","authors":"Xiaoming Xue, Yao Hu, Liang Feng, Kai Zhang, Linqi Song, Kay Chen Tan","authorsParsed":[["Xue","Xiaoming",""],["Hu","Yao",""],["Feng","Liang",""],["Zhang","Kai",""],["Song","Linqi",""],["Tan","Kay Chen",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:38:22 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 07:21:07 GMT"}],"updateDate":"2024-08-21","timestamp":1723577902000,"abstract":"  Expensive optimization problems (EOPs) have attracted increasing research\nattention over the decades due to their ubiquity in a variety of practical\napplications. Despite many sophisticated surrogate-assisted evolutionary\nalgorithms (SAEAs) that have been developed for solving such problems, most of\nthem lack the ability to transfer knowledge from previously-solved tasks and\nalways start their search from scratch, making them troubled by the notorious\ncold-start issue. A few preliminary studies that integrate transfer learning\ninto SAEAs still face some issues, such as defective similarity quantification\nthat is prone to underestimate promising knowledge, surrogate-dependency that\nmakes the transfer methods not coherent with the state-of-the-art in SAEAs,\netc. In light of the above, a plug and play competitive knowledge transfer\nmethod is proposed to boost various SAEAs in this paper. Specifically, both the\noptimized solutions from the source tasks and the promising solutions acquired\nby the target surrogate are treated as task-solving knowledge, enabling them to\ncompete with each other to elect the winner for expensive evaluation, thus\nboosting the search speed on the target task. Moreover, the lower bound of the\nconvergence gain brought by the knowledge competition is mathematically\nanalyzed, which is expected to strengthen the theoretical foundation of\nsequential transfer optimization. Experimental studies conducted on a series of\nbenchmark problems and a practical application from the petroleum industry\nverify the efficacy of the proposed method. The source code of the competitive\nknowledge transfer is available at https://github.com/XmingHsueh/SAS-CKT.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}