{"id":"2408.12063","title":"A Deconfounding Approach to Climate Model Bias Correction","authors":"Wentao Gao, Jiuyong Li, Debo Cheng, Lin Liu, Jixue Liu, Thuc Duy Le,\n  Xiaojing Du, Xiongren Chen, Yanchang Zhao, Yun Chen","authorsParsed":[["Gao","Wentao",""],["Li","Jiuyong",""],["Cheng","Debo",""],["Liu","Lin",""],["Liu","Jixue",""],["Le","Thuc Duy",""],["Du","Xiaojing",""],["Chen","Xiongren",""],["Zhao","Yanchang",""],["Chen","Yun",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 01:53:35 GMT"}],"updateDate":"2024-08-23","timestamp":1724291615000,"abstract":"  Global Climate Models (GCMs) are crucial for predicting future climate\nchanges by simulating the Earth systems. However, GCM outputs exhibit\nsystematic biases due to model uncertainties, parameterization simplifications,\nand inadequate representation of complex climate phenomena. Traditional bias\ncorrection methods, which rely on historical observation data and statistical\ntechniques, often neglect unobserved confounders, leading to biased results.\nThis paper proposes a novel bias correction approach to utilize both GCM and\nobservational data to learn a factor model that captures multi-cause latent\nconfounders. Inspired by recent advances in causality based time series\ndeconfounding, our method first constructs a factor model to learn latent\nconfounders from historical data and then applies them to enhance the bias\ncorrection process using advanced time series forecasting models. The\nexperimental results demonstrate significant improvements in the accuracy of\nprecipitation outputs. By addressing unobserved confounders, our approach\noffers a robust and theoretically grounded solution for climate model bias\ncorrection.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wdycDnVJkmIQdnZjB0mIMjgtoSaWT0bl6Q3hV4rbQ2o","pdfSize":"1438848"}
