{"id":"2408.15435","title":"Globally Optimal Movable Antenna-Enhanced multi-user Communication:\n  Discrete Antenna Positioning, Motion Power Consumption, and Imperfect CSI","authors":"Yifei Wu, Dongfang Xu, Derrick Wing Kwan Ng, Wolfgang Gerstacker, and\n  Robert Schober","authorsParsed":[["Wu","Yifei",""],["Xu","Dongfang",""],["Ng","Derrick Wing Kwan",""],["Gerstacker","Wolfgang",""],["Schober","Robert",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 22:36:20 GMT"}],"updateDate":"2024-08-29","timestamp":1724798180000,"abstract":"  Movable antennas (MAs) represent a promising paradigm to enhance the spatial\ndegrees of freedom of conventional multi-antenna systems by dynamically\nadapting the positions of antenna elements within a designated transmit area.\nIn particular, by employing electro-mechanical MA drivers, the positions of the\nMA elements can be adjusted to shape a favorable spatial correlation for\nimproving system performance. Although preliminary research has explored\nbeamforming designs for MA systems, the intricacies of the power consumption\nand the precise positioning of MA elements are not well understood. Moreover,\nthe assumption of perfect CSI adopted in the literature is impractical due to\nthe significant pilot overhead and the extensive time to acquire perfect CSI.\nTo address these challenges, we model the motion of MA elements through\ndiscrete steps and quantify the associated power consumption as a function of\nthese movements. Furthermore, by leveraging the properties of the MA channel\nmodel, we introduce a novel CSI error model tailored for MA systems that\nfacilitates robust resource allocation design. In particular, we optimize the\nbeamforming and the MA positions at the BS to minimize the total BS power\nconsumption, encompassing both radiated and MA motion power while guaranteeing\na minimum required SINR for each user. To this end, novel algorithms exploiting\nthe branch and bound (BnB) method are developed to obtain the optimal solution\nfor perfect and imperfect CSI. Moreover, to support practical implementation,\nwe propose low-complexity algorithms with guaranteed convergence by leveraging\nsuccessive convex approximation (SCA). Our numerical results validate the\noptimality of the proposed BnB-based algorithms. Furthermore, we unveil that\nboth proposed SCA-based algorithms approach the optimal performance within a\nfew iterations, thus highlighting their practical advantages.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}