{"id":"2408.00011","title":"Impact of opinion dynamics on recurrent pandemic waves: balancing risk\n  aversion and peer pressure","authors":"Sheryl L. Chang, Quang Dang Nguyen, Carl J. E. Suster, Christina M.\n  Jamerlan, Rebecca J. Rockett, Vitali Sintchenko, Tania C. Sorrell, Alexandra\n  Martiniuk, Mikhail Prokopenko","authorsParsed":[["Chang","Sheryl L.",""],["Nguyen","Quang Dang",""],["Suster","Carl J. E.",""],["Jamerlan","Christina M.",""],["Rockett","Rebecca J.",""],["Sintchenko","Vitali",""],["Sorrell","Tania C.",""],["Martiniuk","Alexandra",""],["Prokopenko","Mikhail",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 04:44:31 GMT"}],"updateDate":"2024-08-02","timestamp":1721969071000,"abstract":"  Recurrent waves which are often observed during long pandemics typically form\nas a result of several interrelated dynamics including public health\ninterventions, population mobility and behaviour, varying disease\ntransmissibility due to pathogen mutations, and changes in host immunity due to\nrecency of vaccination or previous infections. Complex nonlinear dependencies\namong these dynamics, including feedback between disease incidence and the\nopinion-driven adoption of social distancing behaviour, remain poorly\nunderstood, particularly in scenarios involving heterogeneous population,\npartial and waning immunity, and rapidly changing public opinions. This study\naddressed this challenge by proposing an opinion dynamics model that accounts\nfor changes in social distancing behaviour (i.e., whether to adopt social\ndistancing) by modelling both individual risk perception and peer pressure. The\nopinion dynamics model was integrated and validated within a large-scale\nagent-based COVID-19 pandemic simulation that modelled the spread of the\nOmicron variant of SARS-CoV-2 between December 2021 and June 2022 in Australia.\nOur study revealed that the fluctuating adoption of social distancing, shaped\nby individual risk aversion and social peer pressure from both household and\nworkplace environments, may explain the observed pattern of recurrent waves of\ninfections.\n","subjects":["Quantitative Biology/Quantitative Methods","Quantitative Biology/Populations and Evolution"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wqcfcpelb9L_G52HgslwM4Rq5hQfM8gpYSWIc6BdUf4","pdfSize":"665991","txDigest":"GSzJzsUJHa9FZaDADMU28bpNDR7rdQZbMwrLkemZQceh","endEpoch":"100","status":"CERTIFIED"}
