{"id":"2408.13204","title":"DOMAINEVAL: An Auto-Constructed Benchmark for Multi-Domain Code\n  Generation","authors":"Qiming Zhu, Jialun Cao, Yaojie Lu, Hongyu Lin, Xianpei Han, Le Sun,\n  Shing-Chi Cheung","authorsParsed":[["Zhu","Qiming",""],["Cao","Jialun",""],["Lu","Yaojie",""],["Lin","Hongyu",""],["Han","Xianpei",""],["Sun","Le",""],["Cheung","Shing-Chi",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:33:58 GMT"}],"updateDate":"2024-08-26","timestamp":1724430838000,"abstract":"  Code benchmarks such as HumanEval are widely adopted to evaluate the\ncapabilities of Large Language Models (LLMs), providing insights into their\nstrengths and weaknesses. However, current benchmarks primarily exercise LLMs'\ncapability on common coding tasks (e.g., bubble sort, greatest common divisor),\nleaving domain-specific coding tasks (e.g., computation, system, cryptography)\nunexplored. To fill this gap, we propose a multi-domain code benchmark,\nDOMAINEVAL, designed to evaluate LLMs' coding capabilities thoroughly. Our\npipeline works in a fully automated manner, enabling a push-bottom construction\nfrom code repositories into formatted subjects under study. Interesting\nfindings are observed by evaluating 12 representative LLMs against DOMAINEVAL.\nWe notice that LLMs are generally good at computation tasks while falling short\non cryptography and system coding tasks. The performance gap can be as much as\n68.94% (80.94% - 12.0%) in some LLMs. We also observe that generating more\nsamples can increase the overall performance of LLMs, while the domain bias may\neven increase. The contributions of this study include a code generation\nbenchmark dataset DOMAINEVAL, encompassing six popular domains, a fully\nautomated pipeline for constructing code benchmarks, and an identification of\nthe limitations of LLMs in code generation tasks based on their performance on\nDOMAINEVAL, providing directions for future research improvements. The\nleaderboard is available at https://domaineval.github.io/.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"CWkIhGk-UR8X3twAsC5yaFuQIIp141pP5GQehAr3Oos","pdfSize":"1410891"}
