{"id":"2408.03584","title":"Constraints on Primordial Magnetic Fields from High Redshift Stellar\n  Mass Density","authors":"Qile Zhang, Shang Li, Xiu-Hui Tan, Jun-Qing Xia","authorsParsed":[["Zhang","Qile",""],["Li","Shang",""],["Tan","Xiu-Hui",""],["Xia","Jun-Qing",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 06:41:13 GMT"}],"updateDate":"2024-09-02","timestamp":1723012873000,"abstract":"  Primordial magnetic fields (PMFs) play a pivotal role in influencing\nsmall-scale fluctuations within the primordial density field, thereby enhancing\nthe matter power spectrum within the context of the $\\Lambda$CDM model at small\nscales. These amplified fluctuations accelerate the early formation of galactic\nhalos and stars, which can be observed through advanced high-redshift\nobservational techniques. Therefore, Stellar Mass Density (SMD) observations,\nwhich provide significant opportunities for detailed studies of galaxies at\nsmall scales and high redshifts, offer a novel perspective on small-scale\ncosmic phenomena and constrain the characteristics of PMFs. In this study, we\ncompile 14 SMD data points at redshifts $z > 6$ and derive stringent\nconstraints on the parameters of PMFs, which include the amplitude of the\nmagnetic field at a characteristic scale of $\\lambda=1\\,{\\rm Mpc}$, denoted as\n$B_0$, and the spectral index of the magnetic field power spectrum, $n_{\\rm\nB}$. At 95\\% confidence level, we establish upper limits of $B_0 < 4.44$ nG and\n$n_{\\rm B} < -2.24$, along with a star formation efficiency of approximately\n$f_*^0 \\sim 0.1$. If we fix $n_{\\rm B}$ at specific values, such as $-2.85$,\n$-2.9$, and $-2.95$, the 95\\% upper limits for the amplitude of the magnetic\nfield can be constrained to 1.33 nG, 2.21 nG, and 3.90 nG, respectively.\nFinally, we attempt to interpret recent early observations provided by James\nWebb Space Telescope (JWST) using the theory of PMFs, and find that by\nselecting appropriate PMF parameters, it is possible to explain these results\nwithout significantly increasing the star formation efficiency.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}