{"id":"2408.15172","title":"X-Reflect: Cross-Reflection Prompting for Multimodal Recommendation","authors":"Hanjia Lyu, Ryan Rossi, Xiang Chen, Md Mehrab Tanjim, Stefano\n  Petrangeli, Somdeb Sarkhel, Jiebo Luo","authorsParsed":[["Lyu","Hanjia",""],["Rossi","Ryan",""],["Chen","Xiang",""],["Tanjim","Md Mehrab",""],["Petrangeli","Stefano",""],["Sarkhel","Somdeb",""],["Luo","Jiebo",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:10:21 GMT"}],"updateDate":"2024-08-28","timestamp":1724775021000,"abstract":"  Large Language Models (LLMs) and Large Multimodal Models (LMMs) have been\nshown to enhance the effectiveness of enriching item descriptions, thereby\nimproving the accuracy of recommendation systems. However, most existing\napproaches either rely on text-only prompting or employ basic multimodal\nstrategies that do not fully exploit the complementary information available\nfrom both textual and visual modalities. This paper introduces a novel\nframework, Cross-Reflection Prompting, termed X-Reflect, designed to address\nthese limitations by prompting LMMs to explicitly identify and reconcile\nsupportive and conflicting information between text and images. By capturing\nnuanced insights from both modalities, this approach generates more\ncomprehensive and contextually richer item representations. Extensive\nexperiments conducted on two widely used benchmarks demonstrate that our method\noutperforms existing prompting baselines in downstream recommendation accuracy.\nAdditionally, we evaluate the generalizability of our framework across\ndifferent LMM backbones and the robustness of the prompting strategies,\noffering insights for optimization. This work underscores the importance of\nintegrating multimodal information and presents a novel solution for improving\nitem understanding in multimodal recommendation systems.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}