{"id":"2408.16734","title":"Galilean fluids from non-relativistic gravity","authors":"Jelle Hartong, Aditya Mehra and J{\\o}rgen Musaeus","authorsParsed":[["Hartong","Jelle",""],["Mehra","Aditya",""],["Musaeus","Jørgen",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:29:32 GMT"}],"updateDate":"2024-08-30","timestamp":1724952572000,"abstract":"  The $1/c$-expansion of general relativity appropriately sourced by matter can\nbe used to derive an action principle for Newtonian gravity. The gravitational\npart of this action is known as non-relativistic gravity (NRG). It is possible\nto source NRG differently and in such a way that one can construct solutions\nthat are not described by Newtonian gravity (as they do not admit a notion of\nabsolute time). It is possible to include a negative cosmological constant such\nthat NRG admits a non-relativistic AdS solution. This non-relativistic AdS\nvacuum has Killing vectors that form the Galilean conformal algebra and a\nboundary that admits a conformal class of Newton-Cartan geometries. This begs\nthe question of whether there exists an analogue of the fluid/gravity\ncorrespondence for NRG. In this paper we derive a non-relativistic AdS brane\nsolution of NRG and confirm that it corresponds to the $1/c^2$-expansion of the\nAdS black brane geometry. We perform a Galilean boost of the non-relativistic\nAdS brane and derive the associated boundary energy-momentum tensor. We then\nshow that this is the energy-momentum tensor of a massless Galilean fluid and\nexplain how this is linked to the conformal isometries of the boundary. Along\nthe way, we also present several new results for the theory of non-relativistic\ngravity itself. In particular we present a rewriting that greatly shortens and\nsimplifies the equations of motion of the NRG action.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}