{"id":"2408.08507","title":"More basis reduction for linear codes: backward reduction, BKZ, slide\n  reduction, and more","authors":"Surendra Ghentiyala and Noah Stephens-Davidowitz","authorsParsed":[["Ghentiyala","Surendra",""],["Stephens-Davidowitz","Noah",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 03:20:01 GMT"}],"updateDate":"2024-08-19","timestamp":1723778401000,"abstract":"  We expand on recent exciting work of Debris-Alazard, Ducas, and van Woerden\n[Transactions on Information Theory, 2022], which introduced the notion of\nbasis reduction for codes, in analogy with the extremely successful paradigm of\nbasis reduction for lattices. We generalize DDvW's LLL algorithm and\nsize-reduction algorithm from codes over $\\mathbb{F}_2$ to codes over\n$\\mathbb{F}_q$, and we further develop the theory of proper bases. We then show\nhow to instantiate for codes the BKZ and slide-reduction algorithms, which are\nthe two most important generalizations of the LLL algorithm for lattices.\n  Perhaps most importantly, we show a new and very efficient basis-reduction\nalgorithm for codes, called full backward reduction. This algorithm is quite\nspecific to codes and seems to have no analogue in the lattice setting. We\nprove that this algorithm finds vectors as short as LLL does in the worst case\n(i.e., within the Griesmer bound) and does so in less time. We also provide\nboth heuristic and empirical evidence that it outperforms LLL in practice, and\nwe give a variant of the algorithm that provably outperforms LLL (in some\nsense) for random codes.\n  Finally, we explore the promise and limitations of basis reduction for codes.\nIn particular, we show upper and lower bounds on how ``good'' of a basis a code\ncan have, and we show two additional illustrative algorithms that demonstrate\nsome of the promise and the limitations of basis reduction for codes.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}