{"id":"2408.04765","title":"Scalable learning of potentials to predict time-dependent Hartree-Fock\n  dynamics","authors":"Harish S. Bhat, Prachi Gupta, Christine M. Isborn","authorsParsed":[["Bhat","Harish S.",""],["Gupta","Prachi",""],["Isborn","Christine M.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 21:41:51 GMT"}],"updateDate":"2024-08-12","timestamp":1723153311000,"abstract":"  We propose a framework to learn the time-dependent Hartree-Fock (TDHF)\ninter-electronic potential of a molecule from its electron density dynamics.\nThough the entire TDHF Hamiltonian, including the inter-electronic potential,\ncan be computed from first principles, we use this problem as a testbed to\ndevelop strategies that can be applied to learn \\emph{a priori} unknown terms\nthat arise in other methods/approaches to quantum dynamics, e.g., emerging\nproblems such as learning exchange-correlation potentials for time-dependent\ndensity functional theory. We develop, train, and test three models of the TDHF\ninter-electronic potential, each parameterized by a four-index tensor of size\nup to $60 \\times 60 \\times 60 \\times 60$. Two of the models preserve Hermitian\nsymmetry, while one model preserves an eight-fold permutation symmetry that\nimplies Hermitian symmetry. Across seven different molecular systems, we find\nthat accounting for the deeper eight-fold symmetry leads to the best-performing\nmodel across three metrics: training efficiency, test set predictive power, and\ndirect comparison of true and learned inter-electronic potentials. All three\nmodels, when trained on ensembles of field-free trajectories, generate accurate\nelectron dynamics predictions even in a field-on regime that lies outside the\ntraining set. To enable our models to scale to large molecular systems, we\nderive expressions for Jacobian-vector products that enable iterative,\nmatrix-free training.\n","subjects":["Physics/Chemical Physics","Physics/Computational Physics","Physics/Data Analysis, Statistics and Probability","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}