{"id":"2408.04936","title":"Hybrid lunar ISRU plant: a comparative analysis with carbothermal\n  reduction and water extraction","authors":"Kosuke Ikeya, Francisco J. Guerrero-Gonzalez, Luca Kiewiet,\n  Michel-Alexandre Cardin, Jan Cilliers, Stanley Starr and Kathryn Hadler","authorsParsed":[["Ikeya","Kosuke",""],["Guerrero-Gonzalez","Francisco J.",""],["Kiewiet","Luca",""],["Cardin","Michel-Alexandre",""],["Cilliers","Jan",""],["Starr","Stanley",""],["Hadler","Kathryn",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:37:22 GMT"}],"updateDate":"2024-08-12","timestamp":1723192642000,"abstract":"  To establish a self-sustained human presence in space and to explore deeper\ninto the solar system, extensive research has been conducted on In-Situ\nResource Utilization (ISRU) systems. Past studies have proposed and researched\nmany technologies to produce oxygen from regolith, such as carbothermal\nreduction and water extraction from icy regolith, to utilize it for astronauts'\nlife support and as the propellant of space systems. However, determining the\nmost promising technology remains challenging due to uncertainties in the lunar\nenvironment and processing methods. To better understand the lunar environment\nand ISRU operations, it is crucial to gather more information. Motivated by\nthis need for information gathering, this paper proposes a new ISRU plant\narchitecture integrating carbothermal reduction of dry regolith and water\nextraction from icy regolith. Two different hybrid plant architectures\nintegrating both technologies (1) in parallel and (2) in series are examined.\nThe former involves mining and processing in both a Permanently Shadowed Region\n(PSR) and a peak of eternal light in parallel, while the latter solely mines in\na PSR. In this series hybrid architecture, the dry regolith tailings from water\nextraction are further processed by carbothermal reduction. This paper conducts\na comparative analysis of the landed mass and required power of each plant\narchitecture utilizing subsystem-level models. Furthermore, based on uncertain\nparameters such as resource content in regolith, the potential performance\nrange of each plant was discovered through Monte Carlo simulations. The result\nindicates the benefit of the series hybrid architecture in terms of regolith\nexcavation rate, while its mass cost seems the highest among the studied\narchitectures.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"PfBPHJVbPWXI1EQ7VN2mYbDb3uIPGX_-MDCn8dIcF3Y","pdfSize":"3787014"}
