{"id":"2408.15191","title":"Relative Equilibria for Scaling Symmetries and Central Configurations","authors":"Giovanni Rastelli, Manuele Santoprete","authorsParsed":[["Rastelli","Giovanni",""],["Santoprete","Manuele",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:51:45 GMT"}],"updateDate":"2024-08-28","timestamp":1724777505000,"abstract":"  In this paper, we explore scaling symmetries within the framework of\nsymplectic geometry. We focus on the action $\\Phi$ of the multiplicative group\n$G = \\mathbb{R}^+$ on exact symplectic manifolds $(M, \\omega,\\theta)$, with\n$\\omega = -d\\theta$, where $ \\theta $ is a given primitive one-form. Extending\nestablished results in symplectic geometry and Hamiltonian dynamics, we\nintroduce conformally symplectic maps, conformally Hamiltonian systems,\nconformally symplectic group actions, and the notion of conformal invariance.\nThis framework allows us to generalize the momentum map to the conformal\nmomentum map, which is crucial for understanding scaling symmetries.\nAdditionally, we provide a generalized Hamiltonian Noether's theorem for these\nsymmetries.\n  We introduce the (conformal) augmented Hamiltonian $H_{\\xi}$ and prove that\nthe relative equilibria of scaling symmetries are solutions to equations\ninvolving $ H _{ \\xi } $ and the primitive one-form $\\theta$. We derive their\nmain properties, emphasizing the differences from relative equilibria in\ntraditional symplectic actions.\n  For cotangent bundles, we define a scaled cotangent lifted action and derive\nexplicit formulas for the conformal momentum map. We also provide a general\ndefinition of central configurations for Hamiltonian systems on cotangent\nbundles that admit scaling symmetries. Applying these results to simple\nmechanical systems, we introduce the augmented potential $U_{\\xi}$ and show\nthat the relative equilibria of scaling symmetries are solutions to an equation\ninvolving $ U _{ \\xi } $ and the Lagrangian one-form $\\theta_L$.\n  Finally, we apply our general theory to the Newtonian $n$-body problem,\nrecovering the classical equations for central configurations.\n","subjects":["Physics/Mathematical Physics","Mathematics/Differential Geometry","Mathematics/Mathematical Physics","Computing Research Repository/Artificial Intelligence","Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}