{"id":"2408.11601","title":"Confidential Computing on Heterogeneous CPU-GPU Systems: Survey and\n  Future Directions","authors":"Qifan Wang and David Oswald","authorsParsed":[["Wang","Qifan",""],["Oswald","David",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:14:45 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 14:49:29 GMT"}],"updateDate":"2024-09-04","timestamp":1724246085000,"abstract":"  In recent years, the widespread informatization and rapid data explosion have\nincreased the demand for high-performance heterogeneous systems that integrate\nmultiple computing cores such as CPUs, Graphics Processing Units (GPUs),\nApplication Specific Integrated Circuits (ASICs), and Field Programmable Gate\nArrays (FPGAs). The combination of CPU and GPU is particularly popular due to\nits versatility. However, these heterogeneous systems face significant security\nand privacy risks. Advances in privacy-preserving techniques, especially\nhardware-based Trusted Execution Environments (TEEs), offer effective\nprotection for GPU applications. Nonetheless, the potential security risks\ninvolved in extending TEEs to GPUs in heterogeneous systems remain uncertain\nand need further investigation. To investigate these risks in depth, we study\nthe existing popular GPU TEE designs and summarize and compare their key\nimplications. Additionally, we review existing powerful attacks on GPUs and\ntraditional TEEs deployed on CPUs, along with the efforts to mitigate these\nthreats. We identify potential attack surfaces introduced by GPU TEEs and\nprovide insights into key considerations for designing secure GPU TEEs. This\nsurvey is timely as new TEEs for heterogeneous systems, particularly GPUs, are\nbeing developed, highlighting the need to understand potential security threats\nand build both efficient and secure systems.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Hardware Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}