{"id":"2408.07250","title":"Spatial Dynamics Behavioral Analysis of Motivational Operations Using\n  Weighted Voronoi Diagrams","authors":"Carlos Alberto Hern\\'andez-Linares, Porfirio Toledo, Brenda Zarah\\'i\n  Medina-P\\'erez, Varsovia Hern\\'andez, Martha Lorena Avenda\\~no Garrido,\n  V\\'ictor Quintero, Alejandro Le\\'on","authorsParsed":[["Hernández-Linares","Carlos Alberto",""],["Toledo","Porfirio",""],["Medina-Pérez","Brenda Zarahí",""],["Hernández","Varsovia",""],["Garrido","Martha Lorena Avendaño",""],["Quintero","Víctor",""],["León","Alejandro",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 01:26:22 GMT"}],"updateDate":"2024-08-15","timestamp":1723598782000,"abstract":"  This paper presents a novel approach to the analysis of spatial behavior\ndistribution, utilizing weighted Voronoi diagrams. The objective is to map and\nunderstand how an experimental subject moves and spends time in various areas\nof a given space, thus identifying the areas of greatest behavioral interest.\nThe technique entails the partitioning of the space into a grid, the\ndesignation of generator points, and the assignment of weights based on the\ntime the subject spends in each region. The data analyzed were derived from\nmultiple experimental sessions in which subjects were exposed to various\nconditions, including food deprivation, water deprivation, and combined\ndeprivation and no deprivation. The aforementioned conditions resulted in the\nformation of clearly delineated spatial patterns. Weighted Voronoi diagrams\nprovided a comprehensive and precise representation of these areas of interest,\nfacilitating an in-depth examination of the evolution of behavioral patterns in\ndiverse contexts, such as under different Motivational Operations. This tool\noffers a valuable perspective for the dynamic study of spatial behaviors in\nvariable experimental settings.\n","subjects":["Quantitative Biology/Quantitative Methods"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}