{"id":"2408.08831","title":"Homogenization of Poisson-Nernst-Planck equations for multiple species\n  in a porous medium","authors":"Apratim Bhattacharya","authorsParsed":[["Bhattacharya","Apratim",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:28:03 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 13:09:19 GMT"}],"updateDate":"2024-09-04","timestamp":1723825683000,"abstract":"  The Poisson-Nernst-Planck (PNP) equations form a coupled parabolic-elliptic\nsystem, which models the transport of charged particles under the influence of\ndiffusion and electric force. In this paper, we rigorously derive a homogenized\nmodel for the PNP equations, for the case of multiple species, defined on a\nperiodic porous medium in spatial dimensions two and three. This extends the\nprevious homogenization results for the PNP equations concerning two species.\nHere, the main difficulty is that the microscopic concentrations remain\nuniformly bounded in a space with relatively weak regularity. Therefore, the\nstandard Aubin-Lions-Simon-type compactness results for porous media, which\ngive strong convergence of the microscopic solutions, become inapplicable in\nour weak setting. We overcome this problem by constructing suitable cut-off\nfunctions. The cut-off function, together with the previously known energy\nfunctional associated with the system, gives us equicontinuity of the\nmicroscopic concentrations on the part of the domain where the values of the\nconcentrations do not exceed the height of the cut-off function. Moreover, it\nturns out that, on the remaining part of the domain where the concentrations\nare larger than the height of the cut-off function, the application of the\nenergy functional is enough in order to obtain equicontinuity. These arguments\neventually yield strong convergence of the microscopic concentrations in $L^1_t\nL^r_x$, for some $r>2$, enabling us to pass to the limit in the nonlinear drift\nterm. Finally, we derive the homogenized equations by means of two-scale\nconvergence in $L^p_t L^q_x$ setting.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by/4.0/"}