{"id":"2408.02498","title":"Flow with FlorDB: Incremental Context Maintenance for the Machine\n  Learning Lifecycle","authors":"Rolando Garcia, Pragya Kallanagoudar, Chithra Anand, Sarah E. Chasins,\n  Joseph M. Hellerstein, Aditya G. Parameswaran","authorsParsed":[["Garcia","Rolando",""],["Kallanagoudar","Pragya",""],["Anand","Chithra",""],["Chasins","Sarah E.",""],["Hellerstein","Joseph M.",""],["Parameswaran","Aditya G.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:21:00 GMT"}],"updateDate":"2024-08-06","timestamp":1722867660000,"abstract":"  The metadata involved in integrating code, data, configuration, and feedback\ninto predictive models is varied and complex. This complexity is further\ncompounded by the agile development practices favored by data scientists and\nmachine learning engineers. These practices emphasize high experimentation\nvelocity and frequent deployments, which can make it challenging to keep track\nof all the relevant metadata. The iterative nature of agile methods means that\nmodels, datasets, and configurations are constantly evolving. Each experiment\nmight involve tweaks to the data preprocessing steps, changes in model\nhyperparameters, or updates to the deployment environment. The need for rapid\niteration can lead to shortcuts or oversights in documentation and metadata\nmanagement. Effective metadata management requires robust yet flexible tools\nand practices that can integrate and organize this information without slowing\ndown the development process. Traditional context management often emphasizes a\n``metadata first'' approach, which can introduce significant friction for\ndevelopers. FlorDB reduces this friction through multiversion hindsight logging\nand incremental context maintenance, allowing developers to add and refine\nmetadata after the fact. This ``metadata later'' approach enables a more\nflexible and incremental development process, allowing data scientists to focus\non model creation and refinement without the burden of documentation upfront.\nAs shown in a demo, FlorDB can be used to build AI/ML applications with\nintegrated train-infer pipelines and managed feedback loops. Ultimately, the\ngoal of FlorDB is to ensure that critical metadata is maintained accurately and\nefficiently, even in fast-paced agile workflows.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}