{"id":"2408.05498","title":"A Laplacian-based Quantum Graph Neural Network for Semi-Supervised\n  Learning","authors":"Hamed Gholipour, Farid Bozorgnia, Kailash Hambarde, Hamzeh\n  Mohammadigheymasi, Javier Mancilla, Andre Sequeira, Joao Neves, and Hugo\n  Proen\\c{c}a","authorsParsed":[["Gholipour","Hamed",""],["Bozorgnia","Farid",""],["Hambarde","Kailash",""],["Mohammadigheymasi","Hamzeh",""],["Mancilla","Javier",""],["Sequeira","Andre",""],["Neves","Joao",""],["Proença","Hugo",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 09:13:42 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 04:04:20 GMT"}],"updateDate":"2024-08-14","timestamp":1723281222000,"abstract":"  Laplacian learning method is a well-established technique in classical\ngraph-based semi-supervised learning, but its potential in the quantum domain\nremains largely unexplored. This study investigates the performance of the\nLaplacian-based Quantum Semi-Supervised Learning (QSSL) method across four\nbenchmark datasets -- Iris, Wine, Breast Cancer Wisconsin, and Heart Disease.\nFurther analysis explores the impact of increasing Qubit counts, revealing that\nadding more Qubits to a quantum system doesn't always improve performance. The\neffectiveness of additional Qubits depends on the quantum algorithm and how\nwell it matches the dataset. Additionally, we examine the effects of varying\nentangling layers on entanglement entropy and test accuracy. The performance of\nLaplacian learning is highly dependent on the number of entangling layers, with\noptimal configurations varying across different datasets. Typically, moderate\nlevels of entanglement offer the best balance between model complexity and\ngeneralization capabilities. These observations highlight the crucial need for\nprecise hyperparameter tuning tailored to each dataset to achieve optimal\nperformance in Laplacian learning methods.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}