{"id":"2408.07496","title":"Emergence of New Systematics for Open Charm Production in High Energy\n  Collisions","authors":"Peter Braun-Munzinger, Krzysztof Redlich, Natasha Sharma and Johanna\n  Stachel","authorsParsed":[["Braun-Munzinger","Peter",""],["Redlich","Krzysztof",""],["Sharma","Natasha",""],["Stachel","Johanna",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 12:21:21 GMT"}],"updateDate":"2024-08-15","timestamp":1723638081000,"abstract":"  We present the production systematics of open charm hadron yields in\nhigh-energy collisions and their description based on the Statistical\nHadronization Model. The rapidity density of $D^0, D^+, D^{*+}, D_s^+$ mesons\nand $\\Lambda_c^+$ baryons in heavy ion and proton-proton collisions is analyzed\nfor different collision energies and centralities. The Statistical\nHadronization Model is extended to open charm production in minimum-bias and\nhigh-multiplicity pp collisions. In this context, we use the link established\nin [1], see also the further development in [2], between the rapidity density\nof open charm hadron yields, $dN_i/dy$, and the rapidity density of\ncharm-anticharm quark pairs, $dN_{c\\bar c}/d\\eta$ to demonstrate that, in pp,\npA and AA collisions, $dN_i/dy$ scales in leading order with $dN_{c\\bar\nc}/d\\eta$ and the slope coefficient is quantified by the appropriate thermal\ndensity ratio calculated at the chiral crossover temperature, $T_c=156.5$ MeV.\nIt is also shown that, in high energy collisions and within uncertainties,\n$dN_i/dy$ exhibits the power-law scaling with the charged-particle\npseudo-rapidity density. Furthermore, presently available data on different\nratios of open charm rapidity densities in high-energy collisions are\nindependent of collision energy and system size, as expected in the Statistical\nHadronization Model.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}