{"id":"2408.07579","title":"TabularBench: Benchmarking Adversarial Robustness for Tabular Deep\n  Learning in Real-world Use-cases","authors":"Thibault Simonetto, Salah Ghamizi, Maxime Cordy","authorsParsed":[["Simonetto","Thibault",""],["Ghamizi","Salah",""],["Cordy","Maxime",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 14:23:12 GMT"}],"updateDate":"2024-08-15","timestamp":1723645392000,"abstract":"  While adversarial robustness in computer vision is a mature research field,\nfewer researchers have tackled the evasion attacks against tabular deep\nlearning, and even fewer investigated robustification mechanisms and reliable\ndefenses. We hypothesize that this lag in the research on tabular adversarial\nattacks is in part due to the lack of standardized benchmarks. To fill this\ngap, we propose TabularBench, the first comprehensive benchmark of robustness\nof tabular deep learning classification models. We evaluated adversarial\nrobustness with CAA, an ensemble of gradient and search attacks which was\nrecently demonstrated as the most effective attack against a tabular model. In\naddition to our open benchmark (https://github.com/serval-uni-lu/tabularbench)\nwhere we welcome submissions of new models and defenses, we implement 7\nrobustification mechanisms inspired by state-of-the-art defenses in computer\nvision and propose the largest benchmark of robust tabular deep learning over\n200 models across five critical scenarios in finance, healthcare and security.\nWe curated real datasets for each use case, augmented with hundreds of\nthousands of realistic synthetic inputs, and trained and assessed our models\nwith and without data augmentations. We open-source our library that provides\nAPI access to all our pre-trained robust tabular models, and the largest\ndatasets of real and synthetic tabular inputs. Finally, we analyze the impact\nof various defenses on the robustness and provide actionable insights to design\nnew defenses and robustification mechanisms.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"X2nldw7DnuxmqrAxZegNZQk6qyncNzp4NZ9GF5lC7LQ","pdfSize":"1043771"}
