{"id":"2408.07722","title":"Investing in the Unrivaled Potential of Wide-Separation Sub-Jupiter\n  Exoplanet Detection and Characterisation with JWST -- Strategic Exoplanet\n  Initiatives with HST and JWST White Paper","authors":"Aarynn L. Carter, Rachel Bowens-Rubin, Per Calissendorff, Jens\n  Kammerer, Yiting Li, Michael R. Meyer, Mark Booth, Samuel M. Factor, Kyle\n  Franson, Eric Gaidos, Jarron M. Leisenring, Ben W.P. Lew, Raquel A. Martinez,\n  Isabel Rebollido, Emily Rickman, Ben J. Sutlieff, Kimberly Ward-Duong,\n  Zhoujian Zhang","authorsParsed":[["Carter","Aarynn L.",""],["Bowens-Rubin","Rachel",""],["Calissendorff","Per",""],["Kammerer","Jens",""],["Li","Yiting",""],["Meyer","Michael R.",""],["Booth","Mark",""],["Factor","Samuel M.",""],["Franson","Kyle",""],["Gaidos","Eric",""],["Leisenring","Jarron M.",""],["Lew","Ben W. P.",""],["Martinez","Raquel A.",""],["Rebollido","Isabel",""],["Rickman","Emily",""],["Sutlieff","Ben J.",""],["Ward-Duong","Kimberly",""],["Zhang","Zhoujian",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:18:26 GMT"}],"updateDate":"2024-08-16","timestamp":1723641506000,"abstract":"  We advocate for a large scale imaging survey of nearby young moving groups\nand star-forming regions to directly detect exoplanets over an unexplored range\nof masses, ages and orbits. Discovered objects will be identified early enough\nin JWST's lifetime to leverage its unparalleled capabilities for long-term\natmospheric characterisation, and will uniquely complement the known population\nof exoplanets and brown dwarfs. Furthermore, this survey will constrain the\noccurrence of the novel wide sub-Jovian exoplanet population, informing\nmultiple theories of planetary formation and evolution. Observations with\nNIRCam F200W+F444W dual-band coronagraphy will readily provide sub-Jupiter mass\nsensitivities beyond ~0.4\" (F444W) and can also be used to rule out some\ncontaminating background sources (F200W). At this large scale, targets can be\nsequenced by spectral type to enable robust self-referencing for PSF\nsubtraction. This eliminates the need for dedicated reference observations\nrequired by GO programs and dramatically increases the overall science\nobserving efficiency. With an exposure of ~30 minutes per target, the\nsub-Jupiter regime can be explored across 250 targets for ~400 hours of\nexposure time including overheads. An additional, pre-allocated, ~100 hours of\nobserving time would enable rapid multi-epoch vetting of the lowest mass\ndetections (which are undetectable in F200W). The total time required for a\nsurvey such as this is not fixed, and could be scaled in conjunction with the\nminimum number of detected exoplanet companions.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}