{"id":"2408.15686","title":"Navigating the Future of Education: Educators' Insights on AI\n  Integration and Challenges in Greece, Hungary, Latvia, Ireland and Armenia","authors":"Evangelia Daskalaki, Katerina Psaroudaki, Paraskevi Fragopoulou","authorsParsed":[["Daskalaki","Evangelia",""],["Psaroudaki","Katerina",""],["Fragopoulou","Paraskevi",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:22:05 GMT"}],"updateDate":"2024-08-29","timestamp":1724840525000,"abstract":"  Understanding teachers' perspectives on AI in Education (AIEd) is crucial for\nits effective integration into the educational framework. This paper aims to\nexplore how teachers currently use AI and how it can enhance the educational\nprocess. We conducted a cross-national study spanning Greece, Hungary, Latvia,\nIreland, and Armenia, surveying 1754 educators through an online questionnaire,\naddressing three research questions. Our first research question examines\neducators' understanding of AIEd, their skepticism, and its integration within\nschools. Most educators report a solid understanding of AI and acknowledge its\npotential risks. AIEd is primarily used for educator support and engaging\nstudents. However, concerns exist about AI's impact on fostering critical\nthinking and exposing students to biased data. The second research question\ninvestigates student engagement with AI tools from educators' perspectives.\nTeachers indicate that students use AI mainly to manage their academic\nworkload, while outside school, AI tools are primarily used for entertainment.\nThe third research question addresses future implications of AI in education.\nEducators are optimistic about AI's potential to enhance educational processes,\nparticularly through personalized learning experiences. Nonetheless, they\nexpress significant concerns about AI's impact on cultivating critical thinking\nand ethical issues related to potential misuse. There is a strong emphasis on\nthe need for professional development through training seminars, workshops, and\nonline courses to integrate AI effectively into teaching practices. Overall,\nthe findings highlight a cautious optimism among educators regarding AI in\neducation, alongside a clear demand for targeted professional development to\naddress concerns and enhance skills in using AI tools.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}