{"id":"2408.04879","title":"On the Element-Wise Representation and Reasoning in Zero-Shot Image\n  Recognition: A Systematic Survey","authors":"Jingcai Guo, Zhijie Rao, Zhi Chen, Song Guo, Jingren Zhou, Dacheng Tao","authorsParsed":[["Guo","Jingcai",""],["Rao","Zhijie",""],["Chen","Zhi",""],["Guo","Song",""],["Zhou","Jingren",""],["Tao","Dacheng",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 05:49:21 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 09:04:29 GMT"}],"updateDate":"2024-08-23","timestamp":1723182561000,"abstract":"  Zero-shot image recognition (ZSIR) aims at empowering models to recognize and\nreason in unseen domains via learning generalized knowledge from limited data\nin the seen domain. The gist for ZSIR is to execute element-wise representation\nand reasoning from the input visual space to the target semantic space, which\nis a bottom-up modeling paradigm inspired by the process by which humans\nobserve the world, i.e., capturing new concepts by learning and combining the\nbasic components or shared characteristics. In recent years, element-wise\nlearning techniques have seen significant progress in ZSIR as well as\nwidespread application. However, to the best of our knowledge, there remains a\nlack of a systematic overview of this topic. To enrich the literature and\nprovide a sound basis for its future development, this paper presents a broad\nreview of recent advances in element-wise ZSIR. Concretely, we first attempt to\nintegrate the three basic ZSIR tasks of object recognition, compositional\nrecognition, and foundation model-based open-world recognition into a unified\nelement-wise perspective and provide a detailed taxonomy and analysis of the\nmain research approaches. Then, we collect and summarize some key information\nand benchmarks, such as detailed technical implementations and common datasets.\nFinally, we sketch out the wide range of its related applications, discuss\nvital challenges, and suggest potential future directions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}