{"id":"2408.10596","title":"Fast Collective Evasion in Self-Localized Swarms of Unmanned Aerial\n  Vehicles","authors":"Filip Nov\\'ak and Viktor Walter and Pavel Petr\\'a\\v{c}ek and\n  Tom\\'a\\v{s} B\\'a\\v{c}a and Martin Saska","authorsParsed":[["Novák","Filip",""],["Walter","Viktor",""],["Petráček","Pavel",""],["Báča","Tomáš",""],["Saska","Martin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 07:11:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724137918000,"abstract":"  A novel approach for achieving fast evasion in self-localized swarms of\nUnmanned Aerial Vehicles (UAVs) threatened by an intruding moving object is\npresented in this paper. Motivated by natural self-organizing systems, the\npresented approach of fast and collective evasion enables the UAV swarm to\navoid dynamic objects (interferers) that are actively approaching the group.\nThe main objective of the proposed technique is the fast and safe escape of the\nswarm from an interferer ~discovered in proximity. This method is inspired by\nthe collective behavior of groups of certain animals, such as schools of fish\nor flocks of birds. These animals use the limited information of their sensing\norgans and decentralized control to achieve reliable and effective group\nmotion. The system presented in this paper is intended to execute the safe\ncoordination of UAV swarms with a large number of agents. Similar to natural\nswarms, this system propagates a fast shock of information about detected\ninterferers throughout the group to achieve dynamic and collective evasion. The\nproposed system is fully decentralized using only onboard sensors to mutually\nlocalize swarm agents and interferers, similar to how animals accomplish this\nbehavior. As a result, the communication structure between swarm agents is not\noverwhelmed by information about the state (position and velocity) of each\nindividual and it is reliable to communication dropouts. The proposed system\nand theory were numerically evaluated and verified in real-world experiments.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"C3eU1VoOxjhkw2QDcGLHdfpYikcV2mVjFWELoPqOU6I","pdfSize":"7450093"}
