{"id":"2408.08949","title":"Demonstration of hybrid foreground removal on CHIME data","authors":"Haochen Wang, Kiyoshi Masui, Kevin Bandura, Arnab Chakraborty, Matt\n  Dobbs, Simon Foreman, Liam Gray, Mark Halpern, Albin Joseph, Joshua\n  MacEachern, Juan Mena-Parra, Kyle Miller, Laura Newburgh, Sourabh Paul, Alex\n  Reda, Pranav Sanghavi, Seth Siegel, and Dallas Wulf","authorsParsed":[["Wang","Haochen",""],["Masui","Kiyoshi",""],["Bandura","Kevin",""],["Chakraborty","Arnab",""],["Dobbs","Matt",""],["Foreman","Simon",""],["Gray","Liam",""],["Halpern","Mark",""],["Joseph","Albin",""],["MacEachern","Joshua",""],["Mena-Parra","Juan",""],["Miller","Kyle",""],["Newburgh","Laura",""],["Paul","Sourabh",""],["Reda","Alex",""],["Sanghavi","Pranav",""],["Siegel","Seth",""],["Wulf","Dallas",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-20","timestamp":1723831201000,"abstract":"  The main challenge of 21 cm cosmology experiments is astrophysical\nforegrounds which are difficult to separate from the signal due to telescope\nsystematics. An earlier study has shown that foreground residuals induced by\nantenna gain errors can be estimated and subtracted using the hybrid foreground\nresidual subtraction (HyFoReS) technique which relies on cross-correlating\nlinearly filtered data. In this paper, we apply a similar technique to the\nCHIME stacking analysis to subtract beam-induced foreground contamination.\nUsing a linear high-pass delay filter for foreground suppression, the CHIME\ncollaboration reported a $11.1\\sigma$ detection in the 21 cm signal stacked on\neBOSS quasar locations, despite foreground residual contamination mostly due to\nthe instrument chromatic transfer function. We cross-correlate the\nforeground-dominated data at low delay with the contaminated signal at high\ndelay to estimate residual foregrounds and subtract them from the signal. We\nfind foreground residual subtraction can improve the signal-to-noise ratio of\nthe stacked 21 cm signal by $ 10 - 20\\%$ after the delay foreground filter,\nalthough some of the improvement can also be achieved with an alternative\nflagging technique. We have shown that it is possible to use HyFoReS to reduce\nbeam-induced foreground contamination, benefiting the analysis of the HI auto\npower spectrum with CHIME and enabling the recovery of large scale modes.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OpvFDMiV3_123XmscefMnnHPoMVHdZ4cJxe3xCxYCwA","pdfSize":"4475323"}
