{"id":"2408.00385","title":"Quantitative Group Testing and Pooled Data in the Linear Regime with\n  Sublinear Tests","authors":"Nelvin Tan, Pablo Pascual Cobo, Ramji Venkataramanan","authorsParsed":[["Tan","Nelvin",""],["Cobo","Pablo Pascual",""],["Venkataramanan","Ramji",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 08:48:26 GMT"}],"updateDate":"2024-08-02","timestamp":1722502106000,"abstract":"  In the pooled data problem, the goal is to identify the categories associated\nwith a large collection of items via a sequence of pooled tests. Each pooled\ntest reveals the number of items in the pool belonging to each category. A\nprominent special case is quantitative group testing (QGT), which is the case\nof pooled data with two categories. We consider these problems in the\nnon-adaptive and linear regime, where the fraction of items in each category is\nof constant order. We propose a scheme with a spatially coupled Bernoulli test\nmatrix and an efficient approximate message passing (AMP) algorithm for\nrecovery. We rigorously characterize its asymptotic performance in both the\nnoiseless and noisy settings, and prove that in the noiseless case, the AMP\nalgorithm achieves almost-exact recovery with a number of tests sublinear in\nthe number of items. For both QGT and pooled data, this is the first efficient\nscheme that provably achieves recovery in the linear regime with a sublinear\nnumber of tests, with performance degrading gracefully in the presence of\nnoise. Numerical simulations illustrate the benefits of the spatially coupled\nscheme at finite dimensions, showing that it outperforms i.i.d. test designs as\nwell as other recovery algorithms based on convex programming.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3uZrqs3Rpbpmeavk49sFA6bPzpSiHt7s6mReRNMTnhM","pdfSize":"1096060","txDigest":"7VaCJp1bL5vtoJbnYACn9G96jMRUqYNfEozuNU9Wg824","endEpoch":"1","status":"CERTIFIED"}
