{"id":"2408.03418","title":"Detecting Quantum and Classical Phase Transitions via Unsupervised\n  Machine Learning of the Fisher Information Metric","authors":"Victor Kasatkin, Evgeny Mozgunov, Nicholas Ezzell, Daniel Lidar","authorsParsed":[["Kasatkin","Victor",""],["Mozgunov","Evgeny",""],["Ezzell","Nicholas",""],["Lidar","Daniel",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 19:34:04 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 17:46:55 GMT"}],"updateDate":"2024-08-27","timestamp":1722972844000,"abstract":"  The detection of quantum and classical phase transitions in the absence of an\norder parameter is possible using the Fisher information metric (FIM), also\nknown as fidelity susceptibility. Here, we propose and investigate an\nunsupervised machine learning (ML) task: estimating the FIM given limited\nsamples from a multivariate probability distribution of measurements made\nthroughout the phase diagram. We utilize an unsupervised ML method called\nClassiFIM (developed in a companion paper) to solve this task and demonstrate\nits empirical effectiveness in detecting both quantum and classical phase\ntransitions using a variety of spin and fermionic models, for which we generate\nseveral publicly available datasets with accompanying ground-truth FIM. We find\nthat ClassiFIM reliably detects both topological (e.g., XXZ chain) and\ndynamical (e.g., metal-insulator transition in Hubbard model) quantum phase\ntransitions. We perform a detailed quantitative comparison with prior\nunsupervised ML methods for detecting quantum phase transitions. We demonstrate\nthat ClassiFIM is competitive with these prior methods in terms of appropriate\naccuracy metrics while requiring significantly less resource-intensive training\ndata compared to the original formulation of the prior methods. In particular,\nClassiFIM only requires classical (single-basis) measurements. As part of our\nmethodology development, we prove several theorems connecting the classical and\nquantum fidelity susceptibilities through equalities or bounds. We also\nsignificantly expand the existence conditions of the fidelity susceptibility,\ne.g., by relaxing standard differentiability conditions. These results may be\nof independent interest to the mathematical physics community.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"oEYpXhHmarCHkop5rRNVi1PY41l2ElAuvErUZEc7pyY","pdfSize":"11932526"}
