{"id":"2408.15113","title":"AnomalousPatchCore: Exploring the Use of Anomalous Samples in Industrial\n  Anomaly Detection","authors":"Mykhailo Koshil, Tilman Wegener, Detlef Mentrup, Simone Frintrop,\n  Christian Wilms","authorsParsed":[["Koshil","Mykhailo",""],["Wegener","Tilman",""],["Mentrup","Detlef",""],["Frintrop","Simone",""],["Wilms","Christian",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:51:34 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 20:31:42 GMT"}],"updateDate":"2024-08-30","timestamp":1724770294000,"abstract":"  Visual inspection, or industrial anomaly detection, is one of the most common\nquality control types in manufacturing. The task is to identify the presence of\nan anomaly given an image, e.g., a missing component on an image of a circuit\nboard, for subsequent manual inspection. While industrial anomaly detection has\nseen a surge in recent years, most anomaly detection methods still utilize\nknowledge only from normal samples, failing to leverage the information from\nthe frequently available anomalous samples. Additionally, they heavily rely on\nvery general feature extractors pre-trained on common image classification\ndatasets. In this paper, we address these shortcomings and propose the new\nanomaly detection system AnomalousPatchCore~(APC) based on a feature extractor\nfine-tuned with normal and anomalous in-domain samples and a subsequent memory\nbank for identifying unusual features. To fine-tune the feature extractor in\nAPC, we propose three auxiliary tasks that address the different aspects of\nanomaly detection~(classification vs. localization) and mitigate the effect of\nthe imbalance between normal and anomalous samples. Our extensive evaluation on\nthe MVTec dataset shows that APC outperforms state-of-the-art systems in\ndetecting anomalies, which is especially important in industrial anomaly\ndetection given the subsequent manual inspection. In detailed ablation studies,\nwe further investigate the properties of our APC.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}