{"id":"2408.04912","title":"AcousAF: Acoustic Sensing-Based Atrial Fibrillation Detection System for\n  Mobile Phones","authors":"Xuanyu Liu, Haoxian Liu, Jiao Li, Zongqi Yang, Yi Huang, Jin Zhang","authorsParsed":[["Liu","Xuanyu",""],["Liu","Haoxian",""],["Li","Jiao",""],["Yang","Zongqi",""],["Huang","Yi",""],["Zhang","Jin",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 07:43:16 GMT"}],"updateDate":"2024-08-12","timestamp":1723189396000,"abstract":"  Atrial fibrillation (AF) is characterized by irregular electrical impulses\noriginating in the atria, which can lead to severe complications and even\ndeath. Due to the intermittent nature of the AF, early and timely monitoring of\nAF is critical for patients to prevent further exacerbation of the condition.\nAlthough ambulatory ECG Holter monitors provide accurate monitoring, the high\ncost of these devices hinders their wider adoption. Current mobile-based AF\ndetection systems offer a portable solution. However, these systems have\nvarious applicability issues, such as being easily affected by environmental\nfactors and requiring significant user effort. To overcome the above\nlimitations, we present AcousAF, a novel AF detection system based on acoustic\nsensors of smartphones. Particularly, we explore the potential of pulse wave\nacquisition from the wrist using smartphone speakers and microphones. In\naddition, we propose a well-designed framework comprised of pulse wave probing,\npulse wave extraction, and AF detection to ensure accurate and reliable AF\ndetection. We collect data from 20 participants utilizing our custom data\ncollection application on the smartphone. Extensive experimental results\ndemonstrate the high performance of our system, with 92.8% accuracy, 86.9%\nprecision, 87.4% recall, and 87.1% F1 Score.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}