{"id":"2408.08779","title":"DAC: Decomposed Automation Correction for Text-to-SQL","authors":"Dingzirui Wang, Longxu Dou, Xuanliang Zhang, Qingfu Zhu, Wanxiang Che","authorsParsed":[["Wang","Dingzirui",""],["Dou","Longxu",""],["Zhang","Xuanliang",""],["Zhu","Qingfu",""],["Che","Wanxiang",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:43:15 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 06:14:54 GMT"}],"updateDate":"2024-08-28","timestamp":1723819395000,"abstract":"  Text-to-SQL is an important task that helps people obtain information from\ndatabases by automatically generating SQL queries. Considering the brilliant\nperformance, approaches based on Large Language Models (LLMs) become the\nmainstream for text-to-SQL. Among these approaches, automated correction is an\neffective approach that further enhances performance by correcting the mistakes\nin the generated results. The existing correction methods require LLMs to\ndirectly correct with generated SQL, while previous research shows that LLMs do\nnot know how to detect mistakes, leading to poor performance. Therefore, in\nthis paper, we propose to employ the decomposed correction to enhance\ntext-to-SQL performance. We first demonstrate that decomposed correction\noutperforms direct correction since detecting and fixing mistakes with the\nresults of the decomposed sub-tasks is easier than with SQL. Based on this\nanalysis, we introduce Decomposed Automation Correction (DAC), which corrects\nSQL by decomposing text-to-SQL into entity linking and skeleton parsing. DAC\nfirst generates the entity and skeleton corresponding to the question and then\ncompares the differences between the initial SQL and the generated entities and\nskeleton as feedback for correction. Experimental results show that our method\nimproves performance by $3.7\\%$ on average of Spider, Bird, and KaggleDBQA\ncompared with the baseline method, demonstrating the effectiveness of DAC.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"7Q01NbH9Y9Cile9-uu_aJJ7ObGvRgK3q3_x1Dcajikk","pdfSize":"690831"}
