{"id":"2408.16801","title":"Hybrid broadband conduction and amplitude-driven topological confinement\n  of sound via syntheticacoustic crystals","authors":"Mathieu Padlewski, Xinxin Guo, Maxime Volery, Romain Fleury, Herv\\'e\n  Lissek","authorsParsed":[["Padlewski","Mathieu",""],["Guo","Xinxin",""],["Volery","Maxime",""],["Fleury","Romain",""],["Lissek","Hervé",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:26:41 GMT"}],"updateDate":"2024-09-02","timestamp":1724930801000,"abstract":"  Precise wave manipulation has undoubtedly forged the technological landscape\nwe thrive in today. Although our understanding of wave phenomena has come a\nlong way since the earliest observations of desert dunes or ocean waves, the\nunimpeded development of mathematics has enabled ever more complex and exotic\nphysical phenomena to be comprehensively described. Here, we take wave\nmanipulation a step further by introducing an unprecedented synthetic acoustic\ncrystal capable of realizing simultaneous linear broadband conduction and\nnonlinear topological insulation, depicting a robust amplitude-dependent mode\nlocalized deep within - i.e. an amplitude-driven topological confinement of\nsound. The latter is achieved by means of an open acoustic waveguide lined with\na chain of nonlocally and nonlinearly coupled active electroacoustic\nresonators. Starting from a comprehensive topological model for classical\nwaves, we demonstrate that different topological regimes can be accessed by\nincreasing driving amplitude and that topological robustness against coupling\ndisorder is a direct consequence of symmetric and simultaneous response between\ncoupled resonators. Theoretical predictions are validated by a fully\nprogrammable experimental apparatus capable of realizing the real-time\nmanipulation of metacrystal properties. In all, our results provide a solid\nfoundation for future research in the design and manipulation of classical\nwaves in artificial materials involving nonlinearity, nonlocality, and\nnon-hermiticity.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}