{"id":"2408.08946","title":"Authorship Attribution in the Era of LLMs: Problems, Methodologies, and\n  Challenges","authors":"Baixiang Huang, Canyu Chen, Kai Shu","authorsParsed":[["Huang","Baixiang",""],["Chen","Canyu",""],["Shu","Kai",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:58:49 GMT"}],"updateDate":"2024-08-20","timestamp":1723831129000,"abstract":"  Accurate attribution of authorship is crucial for maintaining the integrity\nof digital content, improving forensic investigations, and mitigating the risks\nof misinformation and plagiarism. Addressing the imperative need for proper\nauthorship attribution is essential to uphold the credibility and\naccountability of authentic authorship. The rapid advancements of Large\nLanguage Models (LLMs) have blurred the lines between human and machine\nauthorship, posing significant challenges for traditional methods. We presents\na comprehensive literature review that examines the latest research on\nauthorship attribution in the era of LLMs. This survey systematically explores\nthe landscape of this field by categorizing four representative problems: (1)\nHuman-written Text Attribution; (2) LLM-generated Text Detection; (3)\nLLM-generated Text Attribution; and (4) Human-LLM Co-authored Text Attribution.\nWe also discuss the challenges related to ensuring the generalization and\nexplainability of authorship attribution methods. Generalization requires the\nability to generalize across various domains, while explainability emphasizes\nproviding transparent and understandable insights into the decisions made by\nthese models. By evaluating the strengths and limitations of existing methods\nand benchmarks, we identify key open problems and future research directions in\nthis field. This literature review serves a roadmap for researchers and\npractitioners interested in understanding the state of the art in this rapidly\nevolving field. Additional resources and a curated list of papers are available\nand regularly updated at https://llm-authorship.github.io\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}