{"id":"2408.04854","title":"A propensity score weighting approach to integrate aggregated data in\n  random-effect individual-level data meta-analysis","authors":"Tran Trong Khoi Le, Sivem Afach, Tat-Thang Vo","authorsParsed":[["Le","Tran Trong Khoi",""],["Afach","Sivem",""],["Vo","Tat-Thang",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 04:14:43 GMT"}],"updateDate":"2024-08-12","timestamp":1723176883000,"abstract":"  In evidence synthesis, collecting individual participant data (IPD) across\neligible studies is the most reliable way to investigate the treatment effects\nin different subgroups defined by participant characteristics. Nonetheless,\naccess to all IPD from all studies might be very challenging due to privacy\nconcerns. To overcome this, many approaches such as multilevel modeling have\nbeen proposed to incorporate the vast amount of aggregated data from the\nliterature into IPD meta-analysis. These methods, however, often rely on\nspecifying separate models for trial-level versus patient-level data, which\nlikely suffers from ecological bias when there are non-linearities in the\noutcome generating mechanism. In this paper, we introduce a novel method to\ncombine aggregated data and IPD in meta-analysis that is free from ecological\nbias. The proposed approach relies on modeling the study membership given\ncovariates, then using inverse weighting to estimate the trial-specific\ncoefficients in the individual-level outcome model of studies without IPD\naccessible. The weights derived from this approach also shed insights on the\nsimilarity in the case-mix across studies, which is useful to assess whether\neligible trials are sufficiently similar to be meta-analyzed. We evaluate the\nproposed method by synthetic data, then apply it to a real-world meta-analysis\ncomparing the chance of response between guselkumab and adalimumab among\npatients with psoriasis.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}