{"id":"2408.13466","title":"Detection of gamma-ray burst Amati relation based on Hubble data set and\n  Pantheon+ samples","authors":"Yufen Han, Jiaze Gao, Gang Liu, Lixin Xu","authorsParsed":[["Han","Yufen",""],["Gao","Jiaze",""],["Liu","Gang",""],["Xu","Lixin",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 04:55:36 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 07:39:10 GMT"}],"updateDate":"2024-09-04","timestamp":1724475336000,"abstract":"  Using gamma-ray bursts as standard candles for cosmological parameter\nconstraints rely on their empirical luminosity relations and low-redshift\ncalibration. In this paper, we examine the Amati relation and its potential\ncorrections based on the A118 sample of higher-quality gamma-ray bursts, using\nboth Hubble data set and Pantheon+ samples as calibration samples in the\nredshift range of z < 1.965. In calibrating gamma-ray bursts using these two\ndatasets, we employ Gaussian processes to obtain corresponding Hubble diagrams\nto avoid the dependence on cosmological models in the calibration process. We\nfirst divided the low-redshift sample of GRBs into two bins and examined the\nAmati relation and its potential modifications. We found that under both\ncalibrations, the Amati relation did not show evidence of redshift evolution\n(68% confidence level). For the other two Amati relations that include redshift\nevolution terms, the central values of the redshift evolution coefficients\ndeviated from 0, but due to the limitations of the sample size and the increase\nin the number of parameters, most of the redshift evolution coefficients were\nnot able to be excluded from 0 at the 1 sigma level. Therefore, to assess their\nsituation across the entire redshift range, we employed MCMC to globally fit\nthree types of Amati relations. By computing AIC and BIC, we found that for the\nGRB A118 sample, the standard Amati relation remains the most fitting empirical\nluminosity formula, and no potential redshift evolution trend was observed for\ntwo different low-redshift calibrating sources.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}