{"id":"2408.12137","title":"Self-Organization in Computation & Chemistry: Return to AlChemy","authors":"Cole Mathis, Devansh Patel, Westley Weimer, Stephanie Forrest","authorsParsed":[["Mathis","Cole",""],["Patel","Devansh",""],["Weimer","Westley",""],["Forrest","Stephanie",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 05:44:27 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 04:26:16 GMT"}],"updateDate":"2024-08-26","timestamp":1724305467000,"abstract":"  How do complex adaptive systems, such as life, emerge from simple constituent\nparts? In the 1990s Walter Fontana and Leo Buss proposed a novel modeling\napproach to this question, based on a formal model of computation known as\n$\\lambda$ calculus. The model demonstrated how simple rules, embedded in a\ncombinatorially large space of possibilities, could yield complex, dynamically\nstable organizations, reminiscent of biochemical reaction networks. Here, we\nrevisit this classic model, called AlChemy, which has been understudied over\nthe past thirty years. We reproduce the original results and study the\nrobustness of those results using the greater computing resources available\ntoday. Our analysis reveals several unanticipated features of the system,\ndemonstrating a surprising mix of dynamical robustness and fragility.\nSpecifically, we find that complex, stable organizations emerge more frequently\nthan previously expected, that these organizations are robust against collapse\ninto trivial fixed-points, but that these stable organizations cannot be easily\ncombined into higher order entities. We also study the role played by the\nrandom generators used in the model, characterizing the initial distribution of\nobjects produced by two random expression generators, and their consequences on\nthe results. Finally, we provide a constructive proof that shows how an\nextension of the model, based on typed $\\lambda$ calculus, could simulate\ntransitions between arbitrary states in any possible chemical reaction network,\nthus indicating a concrete connection between AlChemy and chemical reaction\nnetworks. We conclude with a discussion of possible applications of AlChemy to\nself-organization in modern programming languages and quantitative approaches\nto the origin of life.\n","subjects":["Nonlinear Sciences/Adaptation and Self-Organizing Systems","Computing Research Repository/Neural and Evolutionary Computing","Quantitative Biology/Populations and Evolution"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}