{"id":"2408.17323","title":"Dark and bright sides of the Broad Line Region clouds as seen in the\n  FeII emission of SDSS RM 102","authors":"Alberto Floris, Ashwani Pandey, Bozena Czerny, Mary Loli Martinez\n  Aldama, Swayamtrupta Panda, Paola Marziani and Raj Prince","authorsParsed":[["Floris","Alberto",""],["Pandey","Ashwani",""],["Czerny","Bozena",""],["Aldama","Mary Loli Martinez",""],["Panda","Swayamtrupta",""],["Marziani","Paola",""],["Prince","Raj",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 14:32:31 GMT"}],"updateDate":"2024-09-02","timestamp":1725028351000,"abstract":"  Contamination from singly ionized iron emission is one of the greatest\nobstacles to determining the intensity of emission lines in the UV and optical\nwavelength ranges. This study presents a comprehensive analysis of the FeII\nemission in the bright quasar RM 102, based on the most recent version of the\nCLOUDY software, with the goal of simultaneously reproducing UV and optical\nFeII emission. We employ a constant pressure model for the emitting clouds,\ninstead of the customary constant density assumption. The allowed parameter\nrange is broad, with metallicity up to 50 times the solar value and turbulent\nvelocity up to 100 km s$^{-1}$ for a subset of models. We also consider\ngeometrical effects that could enhance the visibility of the non-illuminated\nfaces of the clouds, as well as additional mechanical heating. Our\ninvestigation reveals that the broad line region of RM 102 is characterized by\nhighly metallic gas. The observed FeII features provide strong evidence for an\ninflow pattern geometry that favours the dark sides of clouds over isotropic\nemission. This study confirms the presence of chemically enriched gas in the\nbroad line region of bright quasars, represented by RM 102, which is necessary\nto explain the strong FeII emission and its characteristic features.\nAdditionally, we report that CLOUDY currently still lacks certain transitions\nin its atomic databases which prevents it from fully reproducing some observed\nFeII features in quasar spectra.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vxr6B5rBG5Vtmcf9sah2hP_hlzWlNHY0VtdBgZwDDJg","pdfSize":"1796124"}
