{"id":"2408.02896","title":"Chiral kagome superconductivity modulations with residual Fermi arcs in\n  KV3Sb5 and CsV3Sb5","authors":"Hanbin Deng, Hailang Qin, Guowei Liu, Tianyu Yang, Ruiqing Fu, Zhongyi\n  Zhang, Xianxin Wu, Zhiwei Wang, Youguo Shi, Jinjin Liu, Hongxiong Liu,\n  Xiao-Yu Yan, Wei Song, Xitong Xu, Yuanyuan Zhao, Mingsheng Yi, Gang Xu,\n  Hendrik Hohmann, Sofie Castro Holb{\\ae}k, Matteo D\\\"urrnage, Sen Zhou,\n  Guoqing Chang, Yugui Yao, Qianghua Wang, Zurab Guguchia, Titus Neupert, Ronny\n  Thomale, Mark H. Fischer, Jia-Xin Yin","authorsParsed":[["Deng","Hanbin",""],["Qin","Hailang",""],["Liu","Guowei",""],["Yang","Tianyu",""],["Fu","Ruiqing",""],["Zhang","Zhongyi",""],["Wu","Xianxin",""],["Wang","Zhiwei",""],["Shi","Youguo",""],["Liu","Jinjin",""],["Liu","Hongxiong",""],["Yan","Xiao-Yu",""],["Song","Wei",""],["Xu","Xitong",""],["Zhao","Yuanyuan",""],["Yi","Mingsheng",""],["Xu","Gang",""],["Hohmann","Hendrik",""],["Holbæk","Sofie Castro",""],["Dürrnage","Matteo",""],["Zhou","Sen",""],["Chang","Guoqing",""],["Yao","Yugui",""],["Wang","Qianghua",""],["Guguchia","Zurab",""],["Neupert","Titus",""],["Thomale","Ronny",""],["Fischer","Mark H.",""],["Yin","Jia-Xin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 02:00:29 GMT"}],"updateDate":"2024-08-07","timestamp":1722909629000,"abstract":"  Superconductivity involving finite momentum pairing can lead to spatial gap\nand pair density modulations, as well as Bogoliubov Fermi states within the\nsuperconducting gap. However, the experimental realization of their intertwined\nrelations has been challenging. Here, we detect chiral kagome superconductivity\nmodulations with residual Fermi arcs in KV3Sb5 and CsV3Sb5 by normal and\nJosephson scanning tunneling microscopy down to 30mK with resolved electronic\nenergy difference at microelectronvolt level. We observe a U-shaped\nsuperconducting gap with flat residual in-gap states. This gap exhibits chiral\n2 by 2 spatial modulations with magnetic field tunable chirality, which align\nwith the chiral 2 by 2 pair density modulations observed through Josephson\ntunneling. These findings demonstrate a chiral pair density wave (PDW) that\nbreaks time-reversal symmetry. Quasiparticle interference imaging of the in-gap\nzero-energy states reveals segmented arcs, with high-temperature data linking\nthem to parts of the reconstructed V d-orbital states within the charge order.\nThe detected residual Fermi arcs can be explained by the partial suppression of\nthese d-orbital states through an interorbital 2 by 2 PDW and thus serve as\ncandidate Bogoliubov Fermi states. Additionally, we differentiate the observed\nPDW order from impurity-induced gap modulations. Our observations not only\nuncover a chiral PDW order with orbital-selectivity, but also illuminate the\nfundamental space-momentum correspondence inherent in finite momentum paired\nsuperconductivity.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}