{"id":"2408.11341","title":"EHL*: Memory-Budgeted Indexing for Ultrafast Optimal Euclidean\n  Pathfinding","authors":"Jinchun Du, Bojie Shen, Muhammad Aamir Cheema","authorsParsed":[["Du","Jinchun",""],["Shen","Bojie",""],["Cheema","Muhammad Aamir",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 04:55:10 GMT"}],"updateDate":"2024-08-22","timestamp":1724216110000,"abstract":"  The Euclidean Shortest Path Problem (ESPP), which involves finding the\nshortest path in a Euclidean plane with polygonal obstacles, is a classic\nproblem with numerous real-world applications. The current state-of-the-art\nsolution, Euclidean Hub Labeling (EHL), offers ultra-fast query performance,\noutperforming existing techniques by 1-2 orders of magnitude in runtime\nefficiency. However, this performance comes at the cost of significant memory\noverhead, requiring up to tens of gigabytes of storage on large maps, which can\nlimit its applicability in memory-constrained environments like mobile phones\nor smaller devices. Additionally, EHL's memory usage can only be determined\nafter index construction, and while it provides a memory-runtime tradeoff, it\ndoes not fully optimize memory utilization. In this work, we introduce an\nimproved version of EHL, called EHL*, which overcomes these limitations. A key\ncontribution of EHL* is its ability to create an index that adheres to a\nspecified memory budget while optimizing query runtime performance. Moreover,\nEHL* can leverage preknown query distributions, a common scenario in many\nreal-world applications to further enhance runtime efficiency. Our results show\nthat EHL* can reduce memory usage by up to 10-20 times without much impact on\nquery runtime performance compared to EHL, making it a highly effective\nsolution for optimal pathfinding in memory-constrained environments.\n","subjects":["Computing Research Repository/Databases","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}