{"id":"2408.10822","title":"Navigating Spatio-Temporal Heterogeneity: A Graph Transformer Approach\n  for Traffic Forecasting","authors":"Jianxiang Zhou, Erdong Liu, Wei Chen, Siru Zhong, Yuxuan Liang","authorsParsed":[["Zhou","Jianxiang",""],["Liu","Erdong",""],["Chen","Wei",""],["Zhong","Siru",""],["Liang","Yuxuan",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 13:18:21 GMT"},{"version":"v2","created":"Sun, 25 Aug 2024 13:29:28 GMT"}],"updateDate":"2024-08-27","timestamp":1724159901000,"abstract":"  Traffic forecasting has emerged as a crucial research area in the development\nof smart cities. Although various neural networks with intricate architectures\nhave been developed to address this problem, they still face two key\nchallenges: i) Recent advancements in network designs for modeling\nspatio-temporal correlations are starting to see diminishing returns in\nperformance enhancements. ii) Additionally, most models do not account for the\nspatio-temporal heterogeneity inherent in traffic data, i.e., traffic\ndistribution varies significantly across different regions and traffic flow\npatterns fluctuate across various time slots. To tackle these challenges, we\nintroduce the Spatio-Temporal Graph Transformer (STGormer), which effectively\nintegrates attribute and structure information inherent in traffic data for\nlearning spatio-temporal correlations, and a mixture-of-experts module for\ncapturing heterogeneity along spaital and temporal axes. Specifically, we\ndesign two straightforward yet effective spatial encoding methods based on the\ngraph structure and integrate time position encoding into the vanilla\ntransformer to capture spatio-temporal traffic patterns. Additionally, a\nmixture-of-experts enhanced feedforward neural network (FNN) module adaptively\nassigns suitable expert layers to distinct patterns via a spatio-temporal\ngating network, further improving overall prediction accuracy. Experiments on\nreal-world traffic datasets demonstrate that STGormer achieves state-of-the-art\nperformance.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}