{"id":"2408.09738","title":"Room-Temperature Multiferroic Skyrmions in LiNbO3 with enhancement in\n  electric-optical property","authors":"Yalong Yu, Bo Xiong, Siqi Wu, Yekai Ren, Nuo Chen, Qingjiao Mi,\n  Zhaojie Zheng, Kangping Lou, Rui Wang, and Tao Chu","authorsParsed":[["Yu","Yalong",""],["Xiong","Bo",""],["Wu","Siqi",""],["Ren","Yekai",""],["Chen","Nuo",""],["Mi","Qingjiao",""],["Zheng","Zhaojie",""],["Lou","Kangping",""],["Wang","Rui",""],["Chu","Tao",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 07:01:10 GMT"}],"updateDate":"2024-08-20","timestamp":1724050870000,"abstract":"  LiNbO3 (LN) is renowned for its exceptional ferroelectric properties,\nparticularly its notable linear electro-optical (EO) effect, which is highly\nadvantageous for various applications such as high-speed communication, optical\ncomputation, and quantum information processing. Compared to its ferroelectric\nproperties, the magnetism of LN is not attractive enough due to its weak\nferromagnetic nature. Theoretical studies suggest that LN may exhibit a novel\nmagnetoelectric coupling via ferroelectrically-induced ferromagnetism. However,\nthis mechanism has not yet been experimentally validated in any materials,\npresenting significant challenges for research. In this study, we provide the\nfirst experimental evidence supporting the mechanism of\nferroelectrically-induced ferromagnetism in LN, including observations of the\nDzyaloshinskii-Moriya interaction (DMI) and magnetoelectric coupling.\nAdditionally, we have identified various multiferroic skyrmions, within which\nferroelectric polarization signals are detectable. These signals can be\ninfluenced by the magnetic vortex structures, indicating a magnetoelectric\ncoupling nature. Currently, they are the only multiferroic skyrmions that can\nkeep stable at room temperature. Moreover, these magnetic textures\nsignificantly affect the ferroelectric properties, as demonstrated by an\nenhancement of the linear electro-optic effect of LN by over 200%. Given the\nnovel magnetoelectric coupling mechanism, the potential of multiferroic\nskyrmions in spintronics and advanced data storage, and the extensive use of LN\nEO modulators, our research has significant implications for condensed matter\nphysics, multiferroic materials, and optoelectronics.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}