{"id":"2408.13793","title":"Optical Inversion Using Plasmonic Contrast Agents","authors":"Xinlin Cao, Ahcene Ghandriche and Mourad Sini","authorsParsed":[["Cao","Xinlin",""],["Ghandriche","Ahcene",""],["Sini","Mourad",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 09:51:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724579518000,"abstract":"  We describe a new method to reconstruct the permittivity distribution, of an\nobject to image, from the remotely measured electromagnetic field. We propose\nto use the remote fields measured before and after injecting locally in the\nmedium plasmonic nano-particles. Such a technique is known in the framework of\nimaging using contrast agents where, in optical imaging, the nano-particles\nplay the role of these contrast agents. The plasmonic nano-particles are known\nto enjoy resonant effects, as enhancing the applied incident field, while\nexcited at certain particular frequencies called plasmonic resonances. These\nresonant frequencies encode the values of the unknown permittivity at the\nlocation of the injected nano-particles. The imaging methods we propose mainly\nuse this resonant effect. We show that the imaging functional build up from\ncontrasting the fields before and after injecting the nano-particles, measured\nat one single back-scattered direction, and in an explicit band of incident\nfrequencies reaches its maximum values, in terms of the incident frequency,\nprecisely at the mentioned plasmonic resonances. Such a behavior allows us to\nrecover these plasmonic resonances from which we recover the point-wise values\nof the permittivity distribution.\n  In this work, we describe the method and provide the mathematical\njustification of this resonant effect and its use for the optical inversion\nusing plasmonic nano-particles as contrast agents.\n","subjects":["Mathematics/Analysis of PDEs","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xsN6BstQCm5oB1u2lEAIb4hW1N9IyrxEW0VEKvwNY-4","pdfSize":"410198"}
