{"id":"2408.03968","title":"Report on the Advanced Linear Collider Study Group (ALEGRO) Workshop\n  2024","authors":"J. Vieira, B. Cros, P. Muggli and I. A. Andriyash, O. Apsimon, M.\n  Backhouse, C. Benedetti, S. S. Bulanov, A. Caldwell, Min Chen, V. Cilento, S.\n  Corde, R. D'Arcy, S. Diederichs, E. Ericson, E. Esarey, J. Farmer, L. Fedeli,\n  A. Formenti, B. Foster, M. Garten, C.G.R. Geddes, T. Grismayer, M. J. Hogan,\n  S. Hooker, A. Huebl, S. Jalas, M. Kirchen, R. Lehe, W. Leemans, Boyuan Li,\n  C.A. Lindstr\\\"om, R. Losito, C. E. Mitchell, W. B. Mori, P. Piot, D. Terzani,\n  M. Th\\'evenet, M. Turner, J.-L. Vay, J. Vieira, D. V\\\"olker, Jie Zhang, W.\n  Zhang","authorsParsed":[["Vieira","J.",""],["Cros","B.",""],["Muggli","P.",""],["Andriyash","I. A.",""],["Apsimon","O.",""],["Backhouse","M.",""],["Benedetti","C.",""],["Bulanov","S. S.",""],["Caldwell","A.",""],["Chen","Min",""],["Cilento","V.",""],["Corde","S.",""],["D'Arcy","R.",""],["Diederichs","S.",""],["Ericson","E.",""],["Esarey","E.",""],["Farmer","J.",""],["Fedeli","L.",""],["Formenti","A.",""],["Foster","B.",""],["Garten","M.",""],["Geddes","C. G. R.",""],["Grismayer","T.",""],["Hogan","M. J.",""],["Hooker","S.",""],["Huebl","A.",""],["Jalas","S.",""],["Kirchen","M.",""],["Lehe","R.",""],["Leemans","W.",""],["Li","Boyuan",""],["Lindström","C. A.",""],["Losito","R.",""],["Mitchell","C. E.",""],["Mori","W. B.",""],["Piot","P.",""],["Terzani","D.",""],["Thévenet","M.",""],["Turner","M.",""],["Vay","J. -L.",""],["Vieira","J.",""],["Völker","D.",""],["Zhang","Jie",""],["Zhang","W.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 14:55:25 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 14:36:33 GMT"}],"updateDate":"2024-08-16","timestamp":1722956125000,"abstract":"  The workshop focused on the application of ANAs to particle physics keeping\nin mind the ultimate goal of a collider at the energy frontier (10\\,TeV,\ne$^+$/e$^-$, e$^-$/e$^-$, or $\\gamma\\gamma$). The development of ANAs is\nconducted at universities and national laboratories worldwide. The community is\nthematically broad and diverse, in particular since lasers suitable for ANA\nresearch (multi-hundred-terawatt peak power, a few tens of femtosecond-long\npulses) and acceleration of electrons to hundreds of mega electron volts to\nmulti giga electron volts became commercially available. The community spans\nseveral continents (Europe, America, Asia), including more than 62 laboratories\nin more than 20 countries. It is among the missions of the ICFA-ANA panel to\nfeature the amazing progress made with ANAs, to provide international\ncoordination and to foster international collaborations towards a future HEP\ncollider. The scope of this edition of the workshop was to discuss the recent\nprogress and necessary steps towards realizing a linear collider for particle\nphysics based on novel-accelerator technologies (laser or beam driven in plasma\nor structures). Updates on the relevant aspects of the European Strategy for\nParticle Physics (ESPP) Roadmap Process as well as of the P5 (in the US) were\npresented, and ample time was dedicated to discussions. The major outcome of\nthe workshop is the decision for ALEGRO to coordinate efforts in Europe, in the\nUS, and in Asia towards a pre-CDR for an ANA-based, 10\\,TeV CM collider. This\ngoal of this coordination is to lead to a funding proposal to be submitted to\nboth EU and EU/US funding agencies. This document presents a summary of the\nworkshop, as seen by the co-chairs, as well as short 'one-pagers' written by\nthe presenters at the workshop.\n","subjects":["Physics/Accelerator Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}