{"id":"2408.13509","title":"DualAnoDiff: Dual-Interrelated Diffusion Model for Few-Shot Anomaly\n  Image Generation","authors":"Ying Jin, Jinlong Peng, Qingdong He, Teng Hu, Hao Chen, Jiafu Wu,\n  Wenbing Zhu, Mingmin Chi, Jun Liu, Yabiao Wang, Chengjie Wang","authorsParsed":[["Jin","Ying",""],["Peng","Jinlong",""],["He","Qingdong",""],["Hu","Teng",""],["Chen","Hao",""],["Wu","Jiafu",""],["Zhu","Wenbing",""],["Chi","Mingmin",""],["Liu","Jun",""],["Wang","Yabiao",""],["Wang","Chengjie",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 08:09:32 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 06:53:46 GMT"}],"updateDate":"2024-08-29","timestamp":1724486972000,"abstract":"  The performance of anomaly inspection in industrial manufacturing is\nconstrained by the scarcity of anomaly data. To overcome this challenge,\nresearchers have started employing anomaly generation approaches to augment the\nanomaly dataset. However, existing anomaly generation methods suffer from\nlimited diversity in the generated anomalies and struggle to achieve a seamless\nblending of this anomaly with the original image. In this paper, we overcome\nthese challenges from a new perspective, simultaneously generating a pair of\nthe overall image and the corresponding anomaly part. We propose DualAnoDiff, a\nnovel diffusion-based few-shot anomaly image generation model, which can\ngenerate diverse and realistic anomaly images by using a dual-interrelated\ndiffusion model, where one of them is employed to generate the whole image\nwhile the other one generates the anomaly part. Moreover, we extract background\nand shape information to mitigate the distortion and blurriness phenomenon in\nfew-shot image generation. Extensive experiments demonstrate the superiority of\nour proposed model over state-of-the-art methods in terms of both realism and\ndiversity. Overall, our approach significantly improves the performance of\ndownstream anomaly detection tasks, including anomaly detection, anomaly\nlocalization, and anomaly classification tasks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}