{"id":"2408.13978","title":"Histology Virtual Staining with Mask-Guided Adversarial Transfer\n  Learning for Tertiary Lymphoid Structure Detection","authors":"Qiuli Wang, Yongxu Liu, Li Ma, Xianqi Wang, Wei Chen, and Xiaohong Yao","authorsParsed":[["Wang","Qiuli",""],["Liu","Yongxu",""],["Ma","Li",""],["Wang","Xianqi",""],["Chen","Wei",""],["Yao","Xiaohong",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 01:54:37 GMT"}],"updateDate":"2024-08-27","timestamp":1724637277000,"abstract":"  Histological Tertiary Lymphoid Structures (TLSs) are increasingly recognized\nfor their correlation with the efficacy of immunotherapy in various solid\ntumors. Traditionally, the identification and characterization of TLSs rely on\nimmunohistochemistry (IHC) staining techniques, utilizing markers such as CD20\nfor B cells. Despite the specificity of IHC, Hematoxylin-Eosin (H&E) staining\noffers a more accessible and cost-effective choice. Capitalizing on the\nprevalence of H&E staining slides, we introduce a novel Mask-Guided Adversarial\nTransfer Learning method designed for virtual pathological staining. This\nmethod adeptly captures the nuanced color variations across diverse tissue\ntypes under various staining conditions, such as nucleus, red blood cells,\npositive reaction regions, without explicit label information, and adeptly\nsynthesizes realistic IHC-like virtual staining patches, even replicating the\npositive reaction. Further, we propose the Virtual IHC Pathology Analysis\nNetwork (VIPA-Net), an integrated framework encompassing a Mask-Guided Transfer\nModule and an H&E-Based Virtual Staining TLS Detection Module. VIPA-Net\nsynergistically harnesses both H\\&E staining slides and the synthesized virtual\nIHC patches to enhance the detection of TLSs within H&E Whole Slide Images\n(WSIs). We evaluate the network with a comprehensive dataset comprising 1019\nannotated slides from The Cancer Genome Atlas (TCGA). Experimental results\ncompellingly illustrate that the VIPA-Net substantially elevates TLS detection\naccuracy, effectively circumventing the need for actual CD20 staining across\nthe public dataset.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zoQ_ygPb9D0k_rmv-1An64OZPchpwSCcnlF6EGyzxyI","pdfSize":"4480964"}
