{"id":"2408.12091","title":"Unsupervised discovery of the shared and private geometry in multi-view\n  data","authors":"Sai Koukuntla, Joshua B. Julian, Jesse C. Kaminsky, Manuel Schottdorf,\n  David W. Tank, Carlos D. Brody, Adam S. Charles","authorsParsed":[["Koukuntla","Sai",""],["Julian","Joshua B.",""],["Kaminsky","Jesse C.",""],["Schottdorf","Manuel",""],["Tank","David W.",""],["Brody","Carlos D.",""],["Charles","Adam S.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:00:21 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 18:34:24 GMT"}],"updateDate":"2024-08-29","timestamp":1724295621000,"abstract":"  Modern applications often leverage multiple views of a subject of study.\nWithin neuroscience, there is growing interest in large-scale simultaneous\nrecordings across multiple brain regions. Understanding the relationship\nbetween views (e.g., the neural activity in each region recorded) can reveal\nfundamental principles about the characteristics of each representation and\nabout the system. However, existing methods to characterize such relationships\neither lack the expressivity required to capture complex nonlinearities,\ndescribe only sources of variance that are shared between views, or discard\ngeometric information that is crucial to interpreting the data. Here, we\ndevelop a nonlinear neural network-based method that, given paired samples of\nhigh-dimensional views, disentangles low-dimensional shared and private latent\nvariables underlying these views while preserving intrinsic data geometry.\nAcross multiple simulated and real datasets, we demonstrate that our method\noutperforms competing methods. Using simulated populations of lateral\ngeniculate nucleus (LGN) and V1 neurons we demonstrate our model's ability to\ndiscover interpretable shared and private structure across different noise\nconditions. On a dataset of unrotated and corresponding but randomly rotated\nMNIST digits, we recover private latents for the rotated view that encode\nrotation angle regardless of digit class, and places the angle representation\non a 1-d manifold, while shared latents encode digit class but not rotation\nangle. Applying our method to simultaneous Neuropixels recordings of\nhippocampus and prefrontal cortex while mice run on a linear track, we discover\na low-dimensional shared latent space that encodes the animal's position. We\npropose our approach as a general-purpose method for finding succinct and\ninterpretable descriptions of paired data sets in terms of disentangled shared\nand private latent variables.\n","subjects":["Computing Research Repository/Machine Learning","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hpNPUgtqXKG687WJaREEHGu-69UHEH3Z_NMtZfngdlw","pdfSize":"8592268"}
