{"id":"2408.07462","title":"High Strain Rate Compressive Deformation Behavior of Nickel\n  Microparticles","authors":"B\\'arbara Bell\\'on, Lalith Kumar Bhaskar, Tobias Brink, Raquel\n  Aymerich-Armengol, Dipali Sonawane, Dominique Chatain, Gerhard Dehm,\n  Rajaprakash Ramachandramoorthy","authorsParsed":[["Bellón","Bárbara",""],["Bhaskar","Lalith Kumar",""],["Brink","Tobias",""],["Aymerich-Armengol","Raquel",""],["Sonawane","Dipali",""],["Chatain","Dominique",""],["Dehm","Gerhard",""],["Ramachandramoorthy","Rajaprakash",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:10:53 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 12:45:50 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 09:51:38 GMT"}],"updateDate":"2024-08-26","timestamp":1723633853000,"abstract":"  Understanding the mechanical properties of metals at extreme conditions is\nessential for the advancement of miniaturized technologies. As dimensions\ndecrease, materials will experience higher strain rates at the same applied\nvelocities. Moreover, the interplay effects of strain rates and temperatures\nare often overlooked and could have critical effects in applications. In this\nstudy, for the first time, the rate-dependent and temperature-dependent\nmechanical response of nickel microparticles have been investigated. The\nmicroparticles were obtained by solid-state dewetting of nickel thin films\ndeposited on c-sapphire. They exhibit self-similar shapes with identical sets\nof planes, facilitating straightforward comparison between particles. This\nresearch represents the first in-depth analysis of the mechanical properties of\nnickel single crystal dewetted microparticles across six orders of magnitude at\nroom temperature and three orders of magnitude at 128 K. Molecular dynamic\nsimulations (MD) were conducted in parallel on particles with the same\nfaceting. In this work, the gap between experiments and simulations has been\nreduced to over one order of magnitude in size and 3 orders of magnitude in the\nstrain rates. The thermal activation parameter analysis and MD simulations were\nemployed to ascertain whether homogeneous or heterogeneous dislocation\nnucleation was the dominant mechanism controlling deformation in the particles.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"loIYf7zBOD1AXt_NOWkl1rjurKQTl67jZzjnir5Zd88","pdfSize":"44513749"}
