{"id":"2408.11968","title":"Protostellar Outflows at the EarliesT Stages (POETS) V. The launching\n  mechanism of protostellar winds via water masers","authors":"Luca Moscadelli, Andr\\'e Oliva, Alberto Sanna, Gabriele Surcis, Olga\n  Bayandina","authorsParsed":[["Moscadelli","Luca",""],["Oliva","André",""],["Sanna","Alberto",""],["Surcis","Gabriele",""],["Bayandina","Olga",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 19:47:06 GMT"}],"updateDate":"2024-08-23","timestamp":1724269626000,"abstract":"  Understanding the launching mechanism of winds and jets remains one of the\nfundamental challenges in astrophysics. The Protostellar Outflows at the\nEarliesT Stages (POETS) survey has recently mapped the 3D velocity field of the\nprotostellar winds in a sample (37) of luminous young stellar objects (YSOs) at\nscales of 10-100 au via very long baseline interferometry (VLBI) observations\nof the 22 GHz water masers. In most of the targets, the distribution of the 3D\nmaser velocities can be explained in terms of a magnetohydrodynamic (MHD) disk\nwind (DW). We have performed Very Long Baseline Array observations of the 22\nGHz water masers in IRAS 21078+5211, the most promising MHD DW candidate from\nthe POETS survey, to determine the 3D velocities of the gas flowing along\nseveral wind streamlines previously identified at a linear resolution of ~1 au.\nNear the YSO at small separations along ($xl \\le 150$ au) and across ($R \\le\n40$ au) the jet axis, water masers trace three individual DW streamlines. By\nexploiting the 3D kinematic information of the masers, we determined the launch\nradii of these streamlines with an accuracy of $\\sim$1 au, and they lie in the\nrange of 10-50 au. At increasingly greater distances along the jet (110 au $\\le\nxl \\le 220$ au), the outflowing gas speeds up while it collimates close to the\njet axis. Magneto-centrifugal launching in a radially extended MHD DW appears\nto be the only viable process to explain the fast (up to 60 km/s) and\ncollimated (down to 10 degree) velocities of the wind in correspondence with\nlaunch radii ranging between 10 and 50 au. At larger separations from the jet\naxis ($R \\ge 100$ au), the water masers trace a slow ($\\le$20 km/s), radially\nexpanding arched shock-front with kinematics inconsistent with\nmagneto-centrifugal launching. Our resistive-magnetohydrodynamical simulations\nindicate that this shock-front could be driven by magnetic pressure.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zFpf9wEl62q28CWAXi_9E1VEzasLtMzOcHAOLEpChbc","pdfSize":"3658910"}
