{"id":"2408.10104","title":"Multi-Mode Lens for Momentum Microscopy and XPEEM: Theory","authors":"Olena Tkach and Gerd Schoenhense","authorsParsed":[["Tkach","Olena",""],["Schoenhense","Gerd",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:47:17 GMT"}],"updateDate":"2024-08-20","timestamp":1724082437000,"abstract":"  The strong electric field between the sample and the extractor is the core of\ncathode lenses and a pivotal determinant of high resolution. Nevertheless,\nfields in the range of 3-8 kV/mm can be a source of complications. Local field\nenhancement at sharp edges or microscopic protrusions of cleaved samples may\nresult in field emission or flashovers. Moreover, slow background electrons are\ndrawn into the microscope column, where they contribute to space charge\neffects. A novel front lens configuration, optimized through ray-tracing\nsimulations, significantly reduces the field at the sample and allows even for\nzero field or retarding field, which serves to suppress space charge effects.\nOne or several annular electrodes, situated in a concentric position relative\nto the extractor, serve to form an additional lens within the gap between the\nsample and the extractor. The refractory power of this lens, and consequently\nthe field at the sample surface, can be modified by adjusting the potentials of\nthe annular electrodes. The imaging properties and aberrations of this gap lens\nhave been investigated with regard to momentum imaging and XPEEM. The study\nencompasses the energy range from the few-eV level for laser-ARPES to 6 keV,\nfor hard X-ray ARPES. The additional converging lens situated in close\nproximity to the sample exhibits a reduced field curvature of the k-image in\nthe backfocal plane. This allows for the acquisition of larger fields of view\nin both momentum and real-space imaging.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"J0LvDBRZByLqmbLJmEC0ghYhYwfWq5BdFjobZ5TKl-A","pdfSize":"1621051"}
