{"id":"2408.16025","title":"Improving Adversarial Robustness in Android Malware Detection by\n  Reducing the Impact of Spurious Correlations","authors":"Hamid Bostani, Zhengyu Zhao, Veelasha Moonsamy","authorsParsed":[["Bostani","Hamid",""],["Zhao","Zhengyu",""],["Moonsamy","Veelasha",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:01:12 GMT"}],"updateDate":"2024-08-30","timestamp":1724778072000,"abstract":"  Machine learning (ML) has demonstrated significant advancements in Android\nmalware detection (AMD); however, the resilience of ML against realistic\nevasion attacks remains a major obstacle for AMD. One of the primary factors\ncontributing to this challenge is the scarcity of reliable generalizations.\nMalware classifiers with limited generalizability tend to overfit spurious\ncorrelations derived from biased features. Consequently, adversarial examples\n(AEs), generated by evasion attacks, can modify these features to evade\ndetection. In this study, we propose a domain adaptation technique to improve\nthe generalizability of AMD by aligning the distribution of malware samples and\nAEs. Specifically, we utilize meaningful feature dependencies, reflecting\ndomain constraints in the feature space, to establish a robust feature space.\nTraining on the proposed robust feature space enables malware classifiers to\nlearn from predefined patterns associated with app functionality rather than\nfrom individual features. This approach helps mitigate spurious correlations\ninherent in the initial feature space. Our experiments conducted on DREBIN, a\nrenowned Android malware detector, demonstrate that our approach surpasses the\nstate-of-the-art defense, Sec-SVM, when facing realistic evasion attacks. In\nparticular, our defense can improve adversarial robustness by up to 55% against\nrealistic evasion attacks compared to Sec-SVM.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Machine Learning","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}