{"id":"2408.10111","title":"PLUTUS: A Well Pre-trained Large Unified Transformer can Unveil\n  Financial Time Series Regularities","authors":"Yuanjian Xu, Anxian Liu, Jianing Hao, Zhenzhuo Li, Shichang Meng,\n  Guang Zhang","authorsParsed":[["Xu","Yuanjian",""],["Liu","Anxian",""],["Hao","Jianing",""],["Li","Zhenzhuo",""],["Meng","Shichang",""],["Zhang","Guang",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:59:46 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 02:59:16 GMT"}],"updateDate":"2024-08-21","timestamp":1724083186000,"abstract":"  Financial time series modeling is crucial for understanding and predicting\nmarket behaviors but faces challenges such as non-linearity, non-stationarity,\nand high noise levels. Traditional models struggle to capture complex patterns\ndue to these issues, compounded by limitations in computational resources and\nmodel capacity. Inspired by the success of large language models in NLP, we\nintroduce $\\textbf{PLUTUS}$, a $\\textbf{P}$re-trained $\\textbf{L}$arge\n$\\textbf{U}$nified $\\textbf{T}$ransformer-based model that $\\textbf{U}$nveils\nregularities in financial time $\\textbf{S}$eries. PLUTUS uses an invertible\nembedding module with contrastive learning and autoencoder techniques to create\nan approximate one-to-one mapping between raw data and patch embeddings.\nTimeFormer, an attention based architecture, forms the core of PLUTUS,\neffectively modeling high-noise time series. We incorporate a novel attention\nmechanisms to capture features across both variable and temporal dimensions.\nPLUTUS is pre-trained on an unprecedented dataset of 100 billion observations,\ndesigned to thrive in noisy financial environments. To our knowledge, PLUTUS is\nthe first open-source, large-scale, pre-trained financial time series model\nwith over one billion parameters. It achieves state-of-the-art performance in\nvarious tasks, demonstrating strong transferability and establishing a robust\nfoundational model for finance. Our research provides technical guidance for\npre-training financial time series data, setting a new standard in the field.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}