{"id":"2408.01442","title":"VirtualRelativity: An Interactive Simulation of the Special Theory of\n  Relativity in Virtual Reality","authors":"Alberto Boffi, Ezio Puppin, Maurizio Contran","authorsParsed":[["Boffi","Alberto",""],["Puppin","Ezio",""],["Contran","Maurizio",""]],"versions":[{"version":"v1","created":"Sat, 20 Jul 2024 20:08:44 GMT"}],"updateDate":"2024-08-07","timestamp":1721506124000,"abstract":"  The Special Theory of Relativity, introduced by Albert Einstein in the early\n20th century, marked a radical shift in our understanding of space and time.\nNevertheless, the theory's non-intuitive implications continue to pose\nconceptual challenges for novice physicists. In this thesis, we propose a\nvirtual reality solution based on the development of a Unity package capable of\nsimulating the effects of relativity in a digital environment. The current\nimplementation includes the representation of space contraction, time dilation\nand relativistic Doppler effect. The primary focus lies in the accurate\nrepresentation of relativistic laws, as well as in computational efficiency and\nin the modeling of a user interface specifically crafted to enhance\nunderstanding and interactivity. The package significantly reduces developer\nworkload through a streamlined API, enabling maximum freedom in the development\nof virtual scenarios. Design goals are validated by a testing phase conducted\nthrough dedicated probe scenes. To showcase the potential of this work, we also\npresent the deployment of a VR application built on top of the package, that\ntransports users in experiencing relativistic effects in real-life scenarios.\nThe application is scheduled to be used by Master's students in Physical\nEngineering at Politecnico di Milano. In the meanwhile, other educational areas\nof expansion are being considered, suggesting a promising future in the\ndirection of this work.\n","subjects":["Physics/Physics Education","Physics/Popular Physics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"VSOE8FPqmv1o9LXjYLqbchKicMMBG5FOB1tDaXH4jj8","pdfSize":"1026466"}
