{"id":"2408.17385","title":"Comparing Propensity Score-Based Methods in Estimating the Treatment\n  Effects: A Simulation Study","authors":"Sara Poletto, Enrico Longato, Erica Tavazzi and Martina Vettoretti","authorsParsed":[["Poletto","Sara",""],["Longato","Enrico",""],["Tavazzi","Erica",""],["Vettoretti","Martina",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:26:08 GMT"}],"updateDate":"2024-09-02","timestamp":1725035168000,"abstract":"  In observational studies, the recorded treatment assignment is not purely\nrandom, but it is influenced by external factors such as patient\ncharacteristics, reimbursement policies, and existing guidelines. Therefore,\nthe treatment effect can be estimated only after accounting for confounding\nfactors. Propensity score (PS) methods are a family of methods that is widely\nused for this purpose. Although they are all based on the estimation of the a\nposteriori probability of treatment assignment given patient covariates, they\nestimate the treatment effect from different statistical points of view and\nare, thus, relatively hard to compare. In this work, we propose a simulation\nexperiment in which a hypothetical cohort of subjects is simulated in seven\nscenarios of increasing complexity of the associations between covariates and\ntreatment, but where the two main definitions of treatment effect (average\ntreatment effect, ATE, and average effect of the treatment on the treated, ATT)\ncoincide. Our purpose is to compare the performance of a wide array of PS-based\nmethods (matching, stratification, and inverse probability weighting) in\nestimating the treatment effect and their robustness in different scenarios. We\nfind that inverse probability weighting provides estimates of the treatment\neffect that are closer to the expected value by weighting all subjects of the\nstarting population. Conversely, matching and stratification ensure that the\nsubpopulation that generated the final estimate is made up of real instances\ndrawn from the starting population, and, thus, provide a higher degree of\ncontrol on the validity domain of the estimates.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}