{"id":"2408.02396","title":"Unsupervised multi-scale diagnostics","authors":"Karl Lapo, Sara M. Ichinaga, Nathan Kutz","authorsParsed":[["Lapo","Karl",""],["Ichinaga","Sara M.",""],["Kutz","Nathan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:41:18 GMT"}],"updateDate":"2024-08-06","timestamp":1722858078000,"abstract":"  The unsupervised and principled diagnosis of multi-scale data is a\nfundamental obstacle in modern scientific problems from, for instance, weather\nand climate prediction, neurology, epidemiology, and turbulence. Multi-scale\ndata is characterized by a combination of processes acting along multiple\ndimensions simultaneously, spatiotemporal scales across orders of magnitude,\nnon-stationarity, and/or invariances such as translation and rotation. Existing\nmethods are not well-suited to multi-scale data, usually requiring supervised\nstrategies such as human intervention, extensive tuning, or selection of ideal\ntime periods. We present the multi-resolution Coherent Spatio-Temporal Scale\nSeparation (mrCOSTS), a hierarchical and automated algorithm for the diagnosis\nof coherent patterns or modes in multi-scale data. mrCOSTS is a variant of\nDynamic Mode Decomposition which decomposes data into bands of spatial patterns\nwith shared time dynamics, thereby providing a robust method for analyzing\nmulti-scale data. It requires no training but instead takes advantage of the\nhierarchical nature of multi-scale systems. We demonstrate mrCOSTS using\ncomplex multi-scale data sets that are canonically difficult to analyze: 1)\nclimate patterns of sea surface temperature, 2) electrophysiological\nobservations of neural signals of the motor cortex, and 3) horizontal wind in\nthe mountain boundary layer. With mrCOSTS, we trivially retrieve complex\ndynamics that were previously difficult to resolve while additionally\nextracting hitherto unknown patterns of activity embedded in the dynamics,\nallowing for advancing the understanding of these fields of study. This method\nis an important advancement for addressing the multi-scale data which\ncharacterize many of the grand challenges in science and engineering.\n","subjects":["Mathematics/Dynamical Systems","Physics/Atmospheric and Oceanic Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}