{"id":"2408.11069","title":"Phase-Based Approaches for Rapid Construction of Magnetic Fields in NV\n  Magnetometry","authors":"Prabhat Anand, Ankit Khandelwal, Achanna Anil Kumar, M Girish Chandra,\n  Pavan K Reddy, Anuj Bathla, Dasika Shishir, Kasturi Saha","authorsParsed":[["Anand","Prabhat",""],["Khandelwal","Ankit",""],["Kumar","Achanna Anil",""],["Chandra","M Girish",""],["Reddy","Pavan K",""],["Bathla","Anuj",""],["Shishir","Dasika",""],["Saha","Kasturi",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 08:58:27 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 07:21:10 GMT"}],"updateDate":"2024-08-23","timestamp":1723885107000,"abstract":"  With the second quantum revolution underway, quantum-enhanced sensors are\nmoving from laboratory demonstrations to field deployments, providing enhanced\nand even new capabilities. Signal processing and operational software is\nbecoming integral parts of these emerging sensing systems to reap the benefits\nof this progress. This paper looks into widefield Nitrogen Vacancy Center-based\nmagnetometry and focuses on estimating the magnetic field from the Optically\nDetected Magnetic Resonances (ODMR) signal, a crucial output for various\napplications. Mapping the shifts of ODMR signals to phase estimation, a\ncomputationally efficient approaches are proposed. Involving Fourier Transform\nand Filtering as pre-processing steps, the suggested approaches involve linear\ncurve fit or complex frequency estimation based on well-known super-resolution\ntechnique Estimation of Signal Parameters via Rotational Invariant Techniques\n(ESPRIT). The existing methods in the quantum sensing literature take different\nroutes based on Lorentzian fitting for determining magnetic field maps. To\nshowcase the functionality and effectiveness of the suggested techniques,\nrelevant results, based on experimental data are provided, which shows a\nsignificant reduction in computational time with the proposed method over\nexisting methods\n","subjects":["Physics/Instrumentation and Detectors","Computing Research Repository/Emerging Technologies","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}