{"id":"2408.04153","title":"Asymmetry of imploding detonations in thin channels","authors":"Sebastian Rodriguez Rosero, Jason Loiseau, Andrew J. Higgins","authorsParsed":[["Rosero","Sebastian Rodriguez",""],["Loiseau","Jason",""],["Higgins","Andrew J.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 01:41:34 GMT"}],"updateDate":"2024-08-09","timestamp":1723081294000,"abstract":"  The factors that influence the symmetry of an imploding detonation are\ninvestigated experimentally and theoretically. Detonations in sub-atmospheric\nacetylene-oxygen were initiated and made to converge in an apparatus that\nfollowed that of Lee and Lee (Phys Fluids 8:2148-2152, 1965). The width of the\ntest section was controlled with a wave-shaping insert, which formed the test\nsection against the viewing window, creating an effectively two-dimensional\nproblem with a channel width comparable to the detonation cell size. The\nconvergence of the detonation was observed via self-luminous open-shutter\nphotography and high-speed videography. The resulting videos were analyzed to\nquantify the wave speed, degree of asymmetry, and direction and magnitude of\nthe offset in the center of convergence. To determine the experimental\nparameters that influence the symmetry of the imploding wave, the wave-shaping\ninsert was intentionally canted by 0.3{\\deg}-0.6{\\deg}, accentuating the\nasymmetry of the imploding detonation. The experiment was modeled using a\nHuygens construction wherein the detonation is treated as a collection of\nwavelets, each assumed to propagate locally at a velocity determined by the\nchannel width. The results of the model reproduced the observed offsets in\ndetonation convergence from the center of the apparatus, confirming that\nvelocity deficits resulting from the narrow channel width control the observed\nasymmetry.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zDykqLZWcuQIRtsR54OVz612fLeY6NTzHY0DWtXGyp0","pdfSize":"17538173"}
