{"id":"2408.14205","title":"From catch-up to frontier: The utility model as a learning device to\n  escape the middle-income trap","authors":"Su Jung Jee, Kerstin H\\\"otte","authorsParsed":[["Jee","Su Jung",""],["Hötte","Kerstin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:03:11 GMT"}],"updateDate":"2024-08-27","timestamp":1724673791000,"abstract":"  Escaping the middle-income trap requires a country to develop indigenous\ntechnological capabilities for high value-added innovation. This study examines\nthe role of second-tier patent systems, known as utility models (UMs), in\npromoting such capability acquisition in less developed countries. UMs are\ndesigned to incentivize incremental and adaptive innovation through lower\nnovelty standards than patents, but their long-term impact on the capability\nacquisition process remains underexplored. Using South Korea as a case study\nand drawing on the characteristics of technological regimes in catching-up\neconomies, we present three key findings: First, the country's post-catch-up\nfrontier technologies (U.S. patents) are more impactful (highly cited) when\nthey build on Korean domestic UMs. This suggests that UM-based imitative and\nadaptive learning laid the foundation for the country's globally competitive\ncapabilities. Second, the impact of UM-based learning diminishes as the\ncountry's economy develops. Third, frontier technologies rooted in UMs\ncontribute more to the country's own specialization than to follow-on\ninnovations by foreign actors, compared to technologies without UM linkages. We\ndiscuss how technological regimes and industrial policies in catching-up\neconomies interact with the UM system to bridge the catching-up (imitation- and\nadaptation-based) and post-catching-up (specialization- and creativity-based)\nphases.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"dSglEPASv5pyGqOtR2eMQsWbx1OnwceVc6jUYJdZoNc","pdfSize":"693804"}
