{"id":"2408.08992","title":"SpreadLine: Visualizing Egocentric Dynamic Influence","authors":"Yun-Hsin Kuo, Dongyu Liu, Kwan-Liu Ma","authorsParsed":[["Kuo","Yun-Hsin",""],["Liu","Dongyu",""],["Ma","Kwan-Liu",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 19:49:19 GMT"}],"updateDate":"2024-08-20","timestamp":1723837759000,"abstract":"  Egocentric networks, often visualized as node-link diagrams, portray the\ncomplex relationship (link) dynamics between an entity (node) and others.\nHowever, common analytics tasks are multifaceted, encompassing interactions\namong four key aspects: strength, function, structure, and content. Current\nnode-link visualization designs may fall short, focusing narrowly on certain\naspects and neglecting the holistic, dynamic nature of egocentric networks. To\nbridge this gap, we introduce SpreadLine, a novel visualization framework\ndesigned to enable the visual exploration of egocentric networks from these\nfour aspects at the microscopic level. Leveraging the intuitive appeal of\nstoryline visualizations, SpreadLine adopts a storyline-based design to\nrepresent entities and their evolving relationships. We further encode\nessential topological information in the layout and condense the contextual\ninformation in a metro map metaphor, allowing for a more engaging and effective\nway to explore temporal and attribute-based information. To guide our work,\nwith a thorough review of pertinent literature, we have distilled a task\ntaxonomy that addresses the analytical needs specific to egocentric network\nexploration. Acknowledging the diverse analytical requirements of users,\nSpreadLine offers customizable encodings to enable users to tailor the\nframework for their tasks. We demonstrate the efficacy and general\napplicability of SpreadLine through three diverse real-world case studies\n(disease surveillance, social media trends, and academic career evolution) and\na usability study.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-6szoyNJI1LQY_IUOeLGx7wwi5tMzWC01e7znCbVTv0","pdfSize":"14530776"}
