{"id":"2408.02472","title":"A stochastic and analytical model of hierarchical fragmentation: The\n  fragmentation of gas structures into young stellar objects in the\n  interstellar medium","authors":"Benjamin Thomasson and Isabelle Joncour and Estelle Moraux and\n  F\\'ed\\'erique Motte and Fabien Louvet and Marta Gonz\\'alez and Thomas Nony","authorsParsed":[["Thomasson","Benjamin",""],["Joncour","Isabelle",""],["Moraux","Estelle",""],["Motte","Fédérique",""],["Louvet","Fabien",""],["González","Marta",""],["Nony","Thomas",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:55:09 GMT"}],"updateDate":"2024-09-11","timestamp":1722866109000,"abstract":"  Molecular clouds are the most important incubators of young stars clustered\nin various stellar structures whose spatial extension can vary from a few AU to\nseveral thousand AU. Although the reality of these stellar systems has been\nestablished, the physical origin of their multiplicity remains an open\nquestion. Our aim was to characterise these stellar groups at the onset of\ntheir formation by quantifying both the number of stars they contain and their\nmass using a hierarchical fragmentation model of the natal molecular cloud. We\ndeveloped a stochastic and predictive model that reconciles the continuous\nmulti-scale structure of a fragmenting molecular cloud with the discrete nature\nof the stars that are the products of this fragmentation. This model was\nimplemented within a gravo-turbulent fragmentation framework to analytically\nfollow the fragmentation properties along spatial scales using an isothermal\nand adiabatic equations of state (EOSs). Using an adiabatic EOS we determined a\ncharacteristic spatial scale where further fragmentation is prevented, around a\nfew tens of AU. We show that fragmentation is a self-regulated process as\nfragments tend to become marginally unstable following a $M \\propto R$\nBonnor-Ebert-like mass-size profile. Supersonic turbulent fragmentation\nstructures the cloud down to $R \\approx 0.1$ pc, and gradually turns into a\nless productive Jeans-type fragmentation under subsonic conditions so\nhierarchical fragmentation is a scale dependant process. Our work suggests that\npre-stellar objects resulting from gas fragmentation, have to progressively\nincrease their accretion rate in order to form stars. A hierarchical\nfragmentation scenario is compatible with both the multiplicity of stellar\nsystems identified in Taurus and the multi-scale structure extracted within NGC\n2264 molecular cloud.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}