{"id":"2408.04427","title":"AcrosticSleuth: Probabilistic Identification and Ranking of Acrostics in\n  Multilingual Corpora","authors":"Aleksandr Fedchin, Isabel Cooperman, Pramit Chaudhuri, Joseph P.\n  Dexter","authorsParsed":[["Fedchin","Aleksandr",""],["Cooperman","Isabel",""],["Chaudhuri","Pramit",""],["Dexter","Joseph P.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 12:53:26 GMT"}],"updateDate":"2024-08-09","timestamp":1723121606000,"abstract":"  For centuries, writers have hidden messages in their texts as acrostics,\nwhere initial letters of consecutive lines or paragraphs form meaningful words\nor phrases. Scholars searching for acrostics manually can only focus on a few\nauthors at a time and often favor qualitative arguments in discussing\nintentionally. We aim to put the study of acrostics on firmer statistical\nfooting by presenting AcrosticSleuth, a first-of-its-kind tool that\nautomatically identifies acrostics and ranks them by the probability that the\nsequence of characters does not occur by chance (and therefore may have been\ninserted intentionally). Acrostics are rare, so we formalize the problem as a\nbinary classification task in the presence of extreme class imbalance. To\nevaluate AcrosticSleuth, we present the Acrostic Identification Dataset\n(AcrostID), a collection of acrostics from the WikiSource online database.\nDespite the class imbalance, AcrosticSleuth achieves F1 scores of 0.39, 0.59,\nand 0.66 on French, English, and Russian subdomains of WikiSource,\nrespectively. We further demonstrate that AcrosticSleuth can identify\npreviously unknown high-profile instances of wordplay, such as the acrostic\nspelling ARSPOETICA (``art of poetry\") by Italian Humanist Albertino Mussato\nand English philosopher Thomas Hobbes' signature in the opening paragraphs of\nThe Elements of Law.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GejzXJ9rFkdS32F-tCYTdDr6oML0MHFXG8fbeyEpH8k","pdfSize":"1705774"}
