{"id":"2408.00859","title":"LICM: Effective and Efficient Long Interest Chain Modeling for News\n  Recommendation","authors":"Zhen Yang, Wenhui Wang, Tao Qi, Peng Zhang, Tianyun Zhang, Ru Zhang,\n  Jianyi Liu, Yongfeng Huang","authorsParsed":[["Yang","Zhen",""],["Wang","Wenhui",""],["Qi","Tao",""],["Zhang","Peng",""],["Zhang","Tianyun",""],["Zhang","Ru",""],["Liu","Jianyi",""],["Huang","Yongfeng",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 18:17:25 GMT"}],"updateDate":"2024-08-05","timestamp":1722536245000,"abstract":"  Accurately recommending personalized candidate news articles to users has\nalways been the core challenge of news recommendation system. News\nrecommendations often require modeling of user interests to match candidate\nnews. Recent efforts have primarily focused on extract local subgraph\ninformation, the lack of a comprehensive global news graph extraction has\nhindered the ability to utilize global news information collaboratively among\nsimilar users. To overcome these limitations, we propose an effective and\nefficient Long Interest Chain Modeling for News Recommendation(LICM), which\ncombines neighbor interest with long-chain interest distilled from a global\nnews click graph based on the collaborative of similar users to enhance news\nrecommendation. For a global news graph based on the click history of all\nusers, long chain interest generated from it can better utilize the\nhigh-dimensional information within it, enhancing the effectiveness of\ncollaborative recommendations. We therefore design a comprehensive selection\nmechanism and interest encoder to obtain long-chain interest from the global\ngraph. Finally, we use a gated network to integrate long-chain information with\nneighbor information to achieve the final user representation. Experiment\nresults on real-world datasets validate the effectiveness and efficiency of our\nmodel to improve the performance of news recommendation.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}