{"id":"2408.04604","title":"Towards High-resolution 3D Anomaly Detection via Group-Level Feature\n  Contrastive Learning","authors":"Hongze Zhu, Guoyang Xie, Chengbin Hou, Tao Dai, Can Gao, Jinbao Wang,\n  Linlin Shen","authorsParsed":[["Zhu","Hongze",""],["Xie","Guoyang",""],["Hou","Chengbin",""],["Dai","Tao",""],["Gao","Can",""],["Wang","Jinbao",""],["Shen","Linlin",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 17:24:03 GMT"}],"updateDate":"2024-08-09","timestamp":1723137843000,"abstract":"  High-resolution point clouds~(HRPCD) anomaly detection~(AD) plays a critical\nrole in precision machining and high-end equipment manufacturing. Despite\nconsiderable 3D-AD methods that have been proposed recently, they still cannot\nmeet the requirements of the HRPCD-AD task. There are several challenges: i) It\nis difficult to directly capture HRPCD information due to large amounts of\npoints at the sample level; ii) The advanced transformer-based methods usually\nobtain anisotropic features, leading to degradation of the representation; iii)\nThe proportion of abnormal areas is very small, which makes it difficult to\ncharacterize. To address these challenges, we propose a novel group-level\nfeature-based network, called Group3AD, which has a significantly efficient\nrepresentation ability. First, we design an Intercluster Uniformity\nNetwork~(IUN) to present the mapping of different groups in the feature space\nas several clusters, and obtain a more uniform distribution between clusters\nrepresenting different parts of the point clouds in the feature space. Then, an\nIntracluster Alignment Network~(IAN) is designed to encourage groups within the\ncluster to be distributed tightly in the feature space. In addition, we propose\nan Adaptive Group-Center Selection~(AGCS) based on geometric information to\nimprove the pixel density of potential anomalous regions during inference. The\nexperimental results verify the effectiveness of our proposed Group3AD, which\nsurpasses Reg3D-AD by the margin of 5\\% in terms of object-level AUROC on\nReal3D-AD. We provide the code and supplementary information on our website:\nhttps://github.com/M-3LAB/Group3AD.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}