{"id":"2408.06529","title":"Generalized incompressible fluid dynamical system interpolating between\n  the Navier-Stokes and Burgers equations in two dimensions","authors":"Koji Ohkitani","authorsParsed":[["Ohkitani","Koji",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 23:21:16 GMT"}],"updateDate":"2024-08-14","timestamp":1723504876000,"abstract":"  We propose a set of generalized incompressible fluid dynamical equations,\nwhich interpolates between the Burgers and Navier-Stokes equations in two\ndimensions and study their properties theoretically and numerically. It is\nwell-known that under the assumption of potential flows the multi-dimensional\nBurgers equations are integrable in the sense they can be reduced to the heat\nequation, via the so-called Cole-Hopf linearization. On the other hand, it is\nbelieved that the Navier-Stokes equations do not possess such a nice property.\nTake, for example, the 2D Navier-Stokes equations and rotate the velocity\ngradient by 90 degrees, we then obtain a system which is equivalent to the\nBurgers equations. Based on this observation, we introduce a system of\ngeneralized incompressible fluid dynamical equations by rotating velocity\ngradient through a continuous angle parameter. That way we can compare\nproperties of an integrable system with those of non-integrable ones by\nrelating them through a continuous parameter. Using direct numerical\nexperiments we show how the flow properties change (actually, deteriorate) when\nwe increase the angle parameter $\\alpha$ from 0 to $\\pi/2$. It should be noted\nthat the case associated with least regularity, namely the Burgers equations\n($\\alpha=\\pi/2$), is integrable via the heat kernel. We also formalize a\nperturbative treatment of the problem, which in principle yields the solution\nof the Navier-Stokes equations on the basis of that of the Burgers equations.\nThe principal variations around the Burgers equations are computed numerically\nand are shown to agree well with the results of direct numerical simulations\nfor some time.\n","subjects":["Physics/Fluid Dynamics","Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}