{"id":"2408.03988","title":"Cold fronts in galaxy clusters I: A case for the large-scale global\n  eigen modes in unmagnetized and weakly magnetized cluster core","authors":"Prakriti Pal Choudhury and Christopher S. Reynolds","authorsParsed":[["Choudhury","Prakriti Pal",""],["Reynolds","Christopher S.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-09","timestamp":1723053600000,"abstract":"  Galaxy clusters show large-scale azimuthal X-ray surface brightness\nfluctuations known as cold fronts. These are overdense (average density jumps\n$\\sim 30\\%$ or post-jump density $\\sim 130\\%$) and have milder discontinuity in\npressure. Cold fronts are argued to originate due to sloshing driven by\nsub-halo passage at close proximity to the cluster center. While this is a\nviable source of large-scale perturbations, the physical mechanisms that can\nsustain such density structures (of specific geometry) are not clear. In this\nwork, we explore whether long wavelength thermal instability is an explanation\nfor cold front formation in a cluster core which is perturbed by sub-halos or\nAGN activity. Using global linear perturbation analysis, we show that internal\ngravity waves (thermally unstable) can form large-scale three-dimensional\nspiral structures, akin to observed cold fronts. We explore if the presence of\nmagnetic field (along spherical $\\hat{\\phi}$) may support such structures (by\nsuppressing small scale Kelvin-Helmholtz modes) or disrupt them (by promoting\nadditional thermal instability). We find that latter happens at shorter\nwavelengths and only at frequencies above the characteristic buoyancy or Brunt\nV\\\"ais\\\"al\\\"a frequency ($>N_{\\rm BV}$). Our work implies, firstly, that\nlarge-scale spirals may be formed and sustained over a long timescale\n($>N^{-1}_{\\rm BV}$) even in presence of aligned magnetic fields that is\notherwise supportive against mixing at the interface. Secondly,\nshort-wavelength (but relatively longer along the field) unstable compressive\nmodes may form within or in the vicinity of such spirals. The instability is an\noverstable slow wave, and grows in 2D at timescales $\\gtrsim 2-3$ times longer\nthan the spiral growth timescale (via thermal instability). Thus we claim that\nthis instability cannot destroy the large scale coherence.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}