{"id":"2408.05584","title":"Dynamical causality under invisible confounders","authors":"Jinling Yan, Shao-Wu Zhang, Chihao Zhang, Weitian Huang, Jifan Shi,\n  Luonan Chen","authorsParsed":[["Yan","Jinling",""],["Zhang","Shao-Wu",""],["Zhang","Chihao",""],["Huang","Weitian",""],["Shi","Jifan",""],["Chen","Luonan",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 15:32:12 GMT"}],"updateDate":"2024-08-13","timestamp":1723303932000,"abstract":"  Causality inference is prone to spurious causal interactions, due to the\nsubstantial confounders in a complex system. While many existing methods based\non the statistical methods or dynamical methods attempt to address\nmisidentification challenges, there remains a notable lack of effective methods\nto infer causality, in particular in the presence of invisible/unobservable\nconfounders. As a result, accurately inferring causation with invisible\nconfounders remains a largely unexplored and outstanding issue in data science\nand AI fields. In this work, we propose a method to overcome such challenges to\ninfer dynamical causality under invisible confounders (CIC method) and further\nreconstruct the invisible confounders from time-series data by developing an\northogonal decomposition theorem in a delay embedding space. The core of our\nCIC method lies in its ability to decompose the observed variables not in their\noriginal space but in their delay embedding space into the common and private\nsubspaces respectively, thereby quantifying causality between those variables\nboth theoretically and computationally. This theoretical foundation ensures the\ncausal detection for any high-dimensional system even with only two observed\nvariables under many invisible confounders, which is actually a long-standing\nproblem in the field. In addition to the invisible confounder problem, such a\ndecomposition actually makes the intertwined variables separable in the\nembedding space, thus also solving the non-separability problem of causal\ninference. Extensive validation of the CIC method is carried out using various\nreal datasets, and the experimental results demonstrates its effectiveness to\nreconstruct real biological networks even with unobserved confounders.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"vC6OCjDAc6xQpnXAyJrNQx0nJJCbwc9OqyiSCUdWtc8","pdfSize":"31115988"}
