{"id":"2408.09909","title":"Early Validation of High-level System Requirements with Event Calculus\n  and Answer Set Programming","authors":"Ond\\v{r}ej Va\\v{s}\\'i\\v{c}ek, Joaquin Arias, Jan Fiedor, Gopal Gupta,\n  Brendan Hall, Bohuslav K\\v{r}ena, Brian Larson, Sarat Chandra Varanasi,\n  Tom\\'a\\v{s} Vojnar","authorsParsed":[["Vašíček","Ondřej",""],["Arias","Joaquin",""],["Fiedor","Jan",""],["Gupta","Gopal",""],["Hall","Brendan",""],["Křena","Bohuslav",""],["Larson","Brian",""],["Varanasi","Sarat Chandra",""],["Vojnar","Tomáš",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:31:17 GMT"}],"updateDate":"2024-08-20","timestamp":1724067077000,"abstract":"  This paper proposes a new methodology for early validation of high-level\nrequirements on cyber-physical systems with the aim of improving their quality\nand, thus, lowering chances of specification errors propagating into later\nstages of development where it is much more expensive to fix them. The paper\npresents a transformation of a real-world requirements specification of a\nmedical device$-$a PCA pump$-$into an Event Calculus model that is then\nevaluated using answer set programming and the s(CASP) system. The evaluation\nunder s(CASP) allowed deductive as well as abductive reasoning about the\nspecified functionality of the PCA pump on the conceptual level with minimal\nimplementation or design dependent influences, and led to fully-automatically\ndetected nuanced violations of critical safety properties. Further, the paper\ndiscusses scalability and non-termination challenges that had to be faced in\nthe evaluation and techniques proposed to (partially) solve them. Finally,\nideas for improving s(CASP) to overcome its evaluation limitations that still\npersist as well as to increase its expressiveness are presented.\n","subjects":["Computing Research Repository/Logic in Computer Science","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FdS1C666ybOp5Il9JjEpATb4hQ0DT8Wk24ROpgXXhKM","pdfSize":"352703"}
