{"id":"2408.08536","title":"Blockchain-Enabled Accountability in Data Supply Chain: A Data Bill of\n  Materials Approach","authors":"Yue Liu, Dawen Zhang, Boming Xia, Julia Anticev, Tunde Adebayo,\n  Zhenchang Xing, Moses Machao","authorsParsed":[["Liu","Yue",""],["Zhang","Dawen",""],["Xia","Boming",""],["Anticev","Julia",""],["Adebayo","Tunde",""],["Xing","Zhenchang",""],["Machao","Moses",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 05:34:50 GMT"}],"updateDate":"2024-08-19","timestamp":1723786490000,"abstract":"  In the era of advanced artificial intelligence, highlighted by large-scale\ngenerative models like GPT-4, ensuring the traceability, verifiability, and\nreproducibility of datasets throughout their lifecycle is paramount for\nresearch institutions and technology companies. These organisations\nincreasingly rely on vast corpora to train and fine-tune advanced AI models,\nresulting in intricate data supply chains that demand effective data governance\nmechanisms. In addition, the challenge intensifies as diverse stakeholders may\nuse assorted tools, often without adequate measures to ensure the\naccountability of data and the reliability of outcomes. In this study, we adapt\nthe concept of ``Software Bill of Materials\" into the field of data governance\nand management to address the above challenges, and introduce ``Data Bill of\nMaterials\" (DataBOM) to capture the dependency relationship between different\ndatasets and stakeholders by storing specific metadata. We demonstrate a\nplatform architecture for providing blockchain-based DataBOM services, present\nthe interaction protocol for stakeholders, and discuss the minimal requirements\nfor DataBOM metadata. The proposed solution is evaluated in terms of\nfeasibility and performance via case study and quantitative analysis\nrespectively.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}