{"id":"2408.14753","title":"CoopASD: Cooperative Machine Anomalous Sound Detection with Privacy\n  Concerns","authors":"Anbai Jiang, Yuchen Shi, Pingyi Fan, Wei-Qiang Zhang and Jia Liu","authorsParsed":[["Jiang","Anbai",""],["Shi","Yuchen",""],["Fan","Pingyi",""],["Zhang","Wei-Qiang",""],["Liu","Jia",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 03:07:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724728023000,"abstract":"  Machine anomalous sound detection (ASD) has emerged as one of the most\npromising applications in the Industrial Internet of Things (IIoT) due to its\nunprecedented efficacy in mitigating risks of malfunctions and promoting\nproduction efficiency. Previous works mainly investigated the machine ASD task\nunder centralized settings. However, developing the ASD system under\ndecentralized settings is crucial in practice, since the machine data are\ndispersed in various factories and the data should not be explicitly shared due\nto privacy concerns. To enable these factories to cooperatively develop a\nscalable ASD model while preserving their privacy, we propose a novel framework\nnamed CoopASD, where each factory trains an ASD model on its local dataset, and\na central server aggregates these local models periodically. We employ a\npre-trained model as the backbone of the ASD model to improve its robustness\nand develop specialized techniques to stabilize the model under a completely\nnon-iid and domain shift setting. Compared with previous state-of-the-art\n(SOTA) models trained in centralized settings, CoopASD showcases competitive\nresults with negligible degradation of 0.08%. We also conduct extensive\nablation studies to demonstrate the effectiveness of CoopASD.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}