{"id":"2408.02730","title":"Disk Turbulence and Star Formation Regulation in High$-z$ Main Sequence\n  Analogue Galaxies","authors":"Laura Lenki\\'c, Deanne B. Fisher, Alberto D. Bolatto, Peter J. Teuben,\n  Rebecca C. Levy, Jiayi Sun, Rodrigo Herrera-Camus, Karl Glazebrook, Danail\n  Obreschkow, Roberto Abraham","authorsParsed":[["Lenkić","Laura",""],["Fisher","Deanne B.",""],["Bolatto","Alberto D.",""],["Teuben","Peter J.",""],["Levy","Rebecca C.",""],["Sun","Jiayi",""],["Herrera-Camus","Rodrigo",""],["Glazebrook","Karl",""],["Obreschkow","Danail",""],["Abraham","Roberto",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-07","timestamp":1722880802000,"abstract":"  The gas-phase velocity dispersions in disk galaxies, which trace turbulence\nin the interstellar medium, are observed to increase with lookback time.\nHowever, the mechanisms that set this rise in turbulence are observationally\npoorly constrained. To address this, we combine kiloparsec-scale ALMA\nobservations of CO(3-2) and CO(4-3) with HST observations of H$\\alpha$ to\ncharacterize the molecular gas and star formation properties of seven local\nanalogues of main sequence galaxies at $z \\sim 1-2$, drawn from the DYNAMO\nsample. Investigating the ''molecular gas main sequence'' on kpc-scales, we\nfind that galaxies in our sample are more gas-rich than local star-forming\ngalaxies at all disk positions. We measure beam smearing corrected molecular\ngas velocity dispersions and relate them to the molecular gas and star\nformation rate surface densities. Despite being relatively nearby ($z \\sim\n0.1$), DYNAMO galaxies exhibit high velocity dispersions and gas and star\nformation rate surface densities throughout their disks, when compared to local\nstar forming samples. Comparing these measurements to predictions from star\nformation theory, we find very good agreements with the latest\nfeedback-regulated star formation models. However, we find that theories which\ncombine gravitational energy dissipation from radial gas transport with\nfeedback over-estimate the observed molecular gas velocity dispersions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pvN3xymd05-mLA95hNUnes0vU_542A74mdS92-e1g5o","pdfSize":"8063626"}
