{"id":"2408.02578","title":"Probing the Effective Quantum Gravity via Quasinormal Modes and Shadows\n  of Black Holes","authors":"R. A. Konoplya, O. S. Stashko","authorsParsed":[["Konoplya","R. A.",""],["Stashko","O. S.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:55:47 GMT"},{"version":"v2","created":"Sun, 25 Aug 2024 21:06:50 GMT"}],"updateDate":"2024-08-27","timestamp":1722873347000,"abstract":"  Two quantum-corrected black hole models have recently been proposed within\nthe Hamiltonian constraints approach to quantum gravity, maintaining general\ncovariance \\cite{Zhang:2024khj}. We have studied the quasinormal spectra of\nthese black holes using four methods: the higher-order WKB approach with Pad\\'e\napproximants, time-domain integration, Frobenius, and pseudospectral methods.\nThe Frobenius method, in particular, allows us to determine precise values of\nthe frequencies, including the overtones. The two models differ in their choice\nof quantum parameter $\\xi$, and we can distinguish them by their quasinormal\nspectra. In the first model, increasing the quantum parameter results in higher\nreal oscillation frequencies and damping rates of the fundamental mode. In\ncontrast, the second model shows a decrease in the oscillation frequency of the\nleast-damped mode when the quantum parameter is introduced. We have shown that,\nwhile the fundamental mode changes relatively gradually with the quantum\nparameter, the first few overtones deviate from their Schwarzschild limits at\nan increasing rate. This results in a qualitatively new behavior: the real\nparts of the frequencies of the first and higher overtones tend to zero as the\nquantum parameter increases. In addition to the branch of modes that are\nperturbative in the quantum parameter, we observe some non-perturbative modes\nat moderate values of the quantum parameter.\n  Additionally, we have calculated the radii of the shadows cast by these black\nholes and discussed possible constraints based on observations of Sgt $A^*$.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/"}