{"id":"2408.14170","title":"Image Provenance Analysis via Graph Encoding with Vision Transformer","authors":"Keyang Zhang, Chenqi Kong, Shiqi Wang, Anderson Rocha, Haoliang Li","authorsParsed":[["Zhang","Keyang",""],["Kong","Chenqi",""],["Wang","Shiqi",""],["Rocha","Anderson",""],["Li","Haoliang",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:36:03 GMT"}],"updateDate":"2024-08-27","timestamp":1724668563000,"abstract":"  Recent advances in AI-powered image editing tools have significantly lowered\nthe barrier to image modification, raising pressing security concerns those\nrelated to spreading misinformation and disinformation on social platforms.\nImage provenance analysis is crucial in this context, as it identifies relevant\nimages within a database and constructs a relationship graph by mining hidden\nmanipulation and transformation cues, thereby providing concrete evidence\nchains. This paper introduces a novel end-to-end deep learning framework\ndesigned to explore the structural information of provenance graphs. Our\nproposed method distinguishes from previous approaches in two main ways. First,\nunlike earlier methods that rely on prior knowledge and have limited\ngeneralizability, our framework relies upon a patch attention mechanism to\ncapture image provenance clues for local manipulations and global\ntransformations, thereby enhancing graph construction performance. Second,\nwhile previous methods primarily focus on identifying tampering traces only\nbetween image pairs, they often overlook the hidden information embedded in the\ntopology of the provenance graph. Our approach aligns the model training\nobjectives with the final graph construction task, incorporating the overall\nstructural information of the graph into the training process. We integrate\ngraph structure information with the attention mechanism, enabling precise\ndetermination of the direction of transformation. Experimental results show the\nsuperiority of the proposed method over previous approaches, underscoring its\neffectiveness in addressing the challenges of image provenance analysis.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}