{"id":"2408.04565","title":"Modelling shallow confinement in tuneable quantum dots","authors":"Austris Akmentinsh, Niels Ubbelohde, Vyacheslavs Kashcheyevs","authorsParsed":[["Akmentinsh","Austris",""],["Ubbelohde","Niels",""],["Kashcheyevs","Vyacheslavs",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 16:22:51 GMT"}],"updateDate":"2024-08-09","timestamp":1723134171000,"abstract":"  This paper proposes a universal microscopic model for the shallow confinement\nregime of single-electron tunneling devices. We consider particle escape from a\nquantum well generically emerging as a bifurcation in a smooth electrostatic\npotential and develop a set of analytic and numerical approximations for the\nground-state tunneling and thermally activated escape rates. These\napproximations are applied to the problem of electron capture by a closing\ntunnel barrier where the competition between the closing speed and the escape\nrate defines a scaling relation for the capture fidelity. Effective\none-dimensional cubic potential approximation leads to a universal form of this\nscaling relation in terms of device-independent dimensionless depth and speed\nparameters. Using predictions for temperature and magnetic-field dependence we\nshow how to infer the energy scales of cubic longitudinal and quadratic\ntransverse confinement. Finally, we derive an intrinsic quantum speed bound for\nadiabatic protection of the ground state tunneling and show that the latter can\npotentially be exploited up to the break down of confinement with a practical\nspeed limit set by reaching the quantum uncertainty of the barrier height\nbefore the onset of non-adiabatic excitation. These results contribute to\nmapping out the physical limits of single-electron quantum technologies for\nelectrical metrology and sensing.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"1ld4maBdhVyj55LpBQHpEzPUbY7a1sMiAW4L2fUNsUY","pdfSize":"1672466"}
