{"id":"2408.00633","title":"DisTrack: a new Tool for Semi-automatic Misinformation Tracking in\n  Online Social Networks","authors":"Guillermo Villar-Rodr\\'iguez,\\'Alvaro Huertas-Garc\\'ia,Alejandro\n  Mart\\'in,Javier Huertas-Tato,David Camacho","authorsParsed":[["Villar-Rodríguez","Guillermo",""],["Huertas-García","Álvaro",""],["Martín","Alejandro",""],["Huertas-Tato","Javier",""],["Camacho","David",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 15:17:33 GMT"}],"updateDate":"2024-08-02","timestamp":1722525453000,"abstract":"  Introduction: This article introduces DisTrack, a methodology and a tool\ndeveloped for tracking and analyzing misinformation within Online Social\nNetworks (OSNs). DisTrack is designed to combat the spread of misinformation\nthrough a combination of Natural Language Processing (NLP) Social Network\nAnalysis (SNA) and graph visualization. The primary goal is to detect\nmisinformation, track its propagation, identify its sources, and assess the\ninfluence of various actors within the network.\n  Methods: DisTrack's architecture incorporates a variety of methodologies\nincluding keyword search, semantic similarity assessments, and graph generation\ntechniques. These methods collectively facilitate the monitoring of\nmisinformation, the categorization of content based on alignment with known\nfalse claims, and the visualization of dissemination cascades through detailed\ngraphs. The tool is tailored to capture and analyze the dynamic nature of\nmisinformation spread in digital environments.\n  Results: The effectiveness of DisTrack is demonstrated through three case\nstudies focused on different themes: discredit/hate speech, anti-vaccine\nmisinformation, and false narratives about the Russia-Ukraine conflict. These\nstudies show DisTrack's capabilities in distinguishing posts that propagate\nfalsehoods from those that counteract them, and tracing the evolution of\nmisinformation from its inception.\n  Conclusions: The research confirms that DisTrack is a valuable tool in the\nfield of misinformation analysis. It effectively distinguishes between\ndifferent types of misinformation and traces their development over time. By\nproviding a comprehensive approach to understanding and combating\nmisinformation in digital spaces, DisTrack proves to be an essential asset for\nresearchers and practitioners working to mitigate the impact of false\ninformation in online social environments.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}