{"id":"2408.13902","title":"TraIL-Det: Transformation-Invariant Local Feature Networks for 3D LiDAR\n  Object Detection with Unsupervised Pre-Training","authors":"Li Li, Tanqiu Qiao, Hubert P. H. Shum, Toby P. Breckon","authorsParsed":[["Li","Li",""],["Qiao","Tanqiu",""],["Shum","Hubert P. H.",""],["Breckon","Toby P.",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 17:59:17 GMT"}],"updateDate":"2024-08-27","timestamp":1724608757000,"abstract":"  3D point clouds are essential for perceiving outdoor scenes, especially\nwithin the realm of autonomous driving. Recent advances in 3D LiDAR Object\nDetection focus primarily on the spatial positioning and distribution of points\nto ensure accurate detection. However, despite their robust performance in\nvariable conditions, these methods are hindered by their sole reliance on\ncoordinates and point intensity, resulting in inadequate isometric invariance\nand suboptimal detection outcomes. To tackle this challenge, our work\nintroduces Transformation-Invariant Local (TraIL) features and the associated\nTraIL-Det architecture. Our TraIL features exhibit rigid transformation\ninvariance and effectively adapt to variations in point density, with a design\nfocus on capturing the localized geometry of neighboring structures. They\nutilize the inherent isotropic radiation of LiDAR to enhance local\nrepresentation, improve computational efficiency, and boost detection\nperformance. To effectively process the geometric relations among points within\neach proposal, we propose a Multi-head self-Attention Encoder (MAE) with\nasymmetric geometric features to encode high-dimensional TraIL features into\nmanageable representations. Our method outperforms contemporary self-supervised\n3D object detection approaches in terms of mAP on KITTI (67.8, 20% label,\nmoderate) and Waymo (68.9, 20% label, moderate) datasets under various label\nratios (20%, 50%, and 100%).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"w6ejGPomyheX8H_oVXsh8DZegPnvzVNjurRNhFyOBWo","pdfSize":"646889"}
