{"id":"2408.04504","title":"Investigating the effect of hadronic models on IACT images","authors":"Benedetta Bruno, Rodrigo Guedes Lang, Luan Bonneau Arbeletche, Vitor\n  de Souza, Stefan Funk","authorsParsed":[["Bruno","Benedetta",""],["Lang","Rodrigo Guedes",""],["Arbeletche","Luan Bonneau",""],["de Souza","Vitor",""],["Funk","Stefan",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 15:02:21 GMT"}],"updateDate":"2024-08-09","timestamp":1723129341000,"abstract":"  The predictions of hadronic interaction models for cosmic-ray induced air\nshowers contain inherent uncertainties due to limitations of available\naccelerator data. This leads to differences in shower simulations using each of\nthose models. Many studies have been carried out to track those differences by\ninvestigating the shower development or the particle content. In this work, we\npropose a new approach to search for discrepancies and similarities between the\nmodels, via the IACT images resulting from the observations of hadronic air\nshowers. We use simulations of H.E.S.S. as a show-case scenario and, by\ninvestigating variables of the camera images, we find potential indicators to\nhighlight differences between models. Number of pixels, Hillas image size, and\ndensity showed the largest difference between the models. We then further\nexplore the (in)compatibility of the models by combining all the variables and\nusing Boosted Decision Trees. For protons, a significant difference in the\nclassifier output is found for EPOS-LHC when compared to both QGSJET-II04 and\nSybill 2.3d. For helium and nitrogen, QGSJET-II04 is shown to be the outlier\ncase. No significant differences are found for silicon and iron. The\ndistribution of (in)compatibility between the models in the phase space of\nshower parameters shows that a targeted search can be fruitful, with showers\nwith energies of a few TeV and core closer to the large telescope presenting\nthe largest power of separation.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"stxb5wzlH9BPJbsLuLuZo54aPeJLw84UzDIRAYXKwl0","pdfSize":"1580109"}
