{"id":"2408.02854","title":"Wiping out the limitations of Large Language Models -- A Taxonomy for\n  Retrieval Augmented Generation","authors":"Mahei Manhai Li, Irina Nikishina, \\\"Ozge Sevgili, Martin Semmann","authorsParsed":[["Li","Mahei Manhai",""],["Nikishina","Irina",""],["Sevgili","Özge",""],["Semmann","Martin",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 22:34:28 GMT"},{"version":"v2","created":"Wed, 7 Aug 2024 04:55:45 GMT"},{"version":"v3","created":"Mon, 12 Aug 2024 16:44:05 GMT"}],"updateDate":"2024-08-13","timestamp":1722897268000,"abstract":"  Current research on RAGs is distributed across various disciplines, and since\nthe technology is evolving very quickly, its unit of analysis is mostly on\ntechnological innovations, rather than applications in business contexts. Thus,\nin this research, we aim to create a taxonomy to conceptualize a comprehensive\noverview of the constituting characteristics that define RAG applications,\nfacilitating the adoption of this technology in the IS community. To the best\nof our knowledge, no RAG application taxonomies have been developed so far. We\ndescribe our methodology for developing the taxonomy, which includes the\ncriteria for selecting papers, an explanation of our rationale for employing a\nLarge Language Model (LLM)-supported approach to extract and identify initial\ncharacteristics, and a concise overview of our systematic process for\nconceptualizing the taxonomy. Our systematic taxonomy development process\nincludes four iterative phases designed to refine and enhance our understanding\nand presentation of RAG's core dimensions. We have developed a total of five\nmeta-dimensions and sixteen dimensions to comprehensively capture the concept\nof Retrieval-Augmented Generation (RAG) applications. When discussing our\nfindings, we also detail the specific research areas and pose key research\nquestions to guide future information system researchers as they explore the\nemerging topics of RAG systems.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}