{"id":"2408.02405","title":"Towards atom counting from first moment STEM images: methodology and\n  possibilities","authors":"Yansong Hao, Annick De Backer, Scott David Findlay, Sandra Van Aert","authorsParsed":[["Hao","Yansong",""],["De Backer","Annick",""],["Findlay","Scott David",""],["Van Aert","Sandra",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 12:01:19 GMT"}],"updateDate":"2024-08-06","timestamp":1722859279000,"abstract":"  Through a simulation-based study we develop a statistical model-based\nquantification method for atomic resolution first moment scanning transmission\nelectron microscopy (STEM) images. This method uses the uniformly weighted\nleast squares estimator to determine the unknown structure parameters of the\nimages and to isolate contributions from individual atomic columns. In this\nway, a quantification of the projected potential per atomic column is achieved.\nSince the integrated projected potential of an atomic column scales linearly\nwith the number of atoms it contains, it can serve as a basis for atom\ncounting. The performance of atom counting from first moment STEM imaging is\ncompared to that from traditional HAADF STEM in the presence of noise. Through\nthis comparison, we demonstrate the advantage of first moment STEM images to\nattain more precise atom counts. Finally, we compare the integrated intensities\nextracted from first-moment images of a wedge-shaped sample to those values\nfrom the bulk crystal. The excellent agreement found between these values\nproves the robustness of using bulk crystal simulations as a reference library.\nThis enables atom counting for samples with different shapes by comparison with\nthese library values.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8m3JlsJRYcyR1KVfsXqwLLeR0hAsZ5orhnftYRjgmTw","pdfSize":"2543985","txDigest":"Gz7S8NFWBpW4cjHyC7XHQfmKmmYF2L4Re5tSGmq5aifJ","endEpoch":"1","status":"CERTIFIED"}
