{"id":"2408.11831","title":"Web-based Visualization and Analytics of Petascale data: Equity as a\n  Tide that Lifts All Boats","authors":"Aashish Panta, Xuan Huang, Nina McCurdy, David Ellsworth, Amy Gooch,\n  Giorgio Scorzelli, Hector Torres, Patrice Klein, Gustavo Ovando-Montejo,\n  Valerio Pascucci","authorsParsed":[["Panta","Aashish",""],["Huang","Xuan",""],["McCurdy","Nina",""],["Ellsworth","David",""],["Gooch","Amy",""],["Scorzelli","Giorgio",""],["Torres","Hector",""],["Klein","Patrice",""],["Ovando-Montejo","Gustavo",""],["Pascucci","Valerio",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:33:47 GMT"}],"updateDate":"2024-08-23","timestamp":1722951227000,"abstract":"  Scientists generate petabytes of data daily to help uncover environmental\ntrends or behaviors that are hard to predict. For example, understanding\nclimate simulations based on the long-term average of temperature,\nprecipitation, and other environmental variables is essential to predicting and\nestablishing root causes of future undesirable scenarios and assessing possible\nmitigation strategies. While supercomputer centers provide a powerful\ninfrastructure for generating petabytes of simulation output, accessing and\nanalyzing these datasets interactively remains challenging on multiple fronts.\nThis paper presents an approach to managing, visualizing, and analyzing\npetabytes of data within a browser on equipment ranging from the top NASA\nsupercomputer to commodity hardware like a laptop. Our novel data fabric\nabstraction layer allows user-friendly querying of scientific information while\nhiding the complexities of dealing with file systems or cloud services. We also\noptimize network utilization while streaming from petascale repositories\nthrough state-of-the-art progressive compression algorithms. Based on this\nabstraction, we provide customizable dashboards that can be accessed from any\ndevice with any internet connection, enabling interactive visual analysis of\nvast amounts of data to a wide range of users - from top scientists with access\nto leadership-class computing environments to undergraduate students of\ndisadvantaged backgrounds from minority-serving institutions. We focus on\nNASA's use of petascale climate datasets as an example of particular societal\nimpact and, therefore, a case where achieving equity in science participation\nis critical. We further validate our approach by deploying the dashboards and\nsimplified training materials in the classroom at a minority-serving\ninstitution.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"25DXl-nkl3EOqrMDT1Yw0CgTqCNMaJnsMKyX4YfBLXQ","pdfSize":"1095679"}
