{"id":"2408.16805","title":"Near-Real Time Thermospheric Density Retrieval from Precise Low Earth\n  Orbit Spacecraft Ephemerides During Geomagnetic Storms","authors":"Charles Constant, Santosh Bhattarai, Indigo Brownhall, Anasuya\n  Aruliah, Marek Ziebart","authorsParsed":[["Constant","Charles",""],["Bhattarai","Santosh",""],["Brownhall","Indigo",""],["Aruliah","Anasuya",""],["Ziebart","Marek",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:14:40 GMT"}],"updateDate":"2024-09-02","timestamp":1724944480000,"abstract":"  We present a methodology to generate low-latency, high spatio-temporal\nresolution thermospheric density estimates using publicly available Low Earth\nOrbit (LEO) spacecraft ephemerides. This provides a means of generating density\nestimates that can be used in a data-assimilative context by the satellite\noperations and thermosphere communities. It also contributes to the data base\nof high-resolution density estimates during geomagnetic storms -- which remains\none of the major gaps for the development and benchmarking of density models.\nUsing accelerometer-derived densities from the Gravity Recovery And Climate\nExperiment Follow-On (GRACE-FO) spacecraft as truth, our method surpasses\nEnergy Dissipation Rate-Type density retrieval techniques and three widely used\noperational density models in terms of accuracy: EDR (103.37%), JB2008\n(85.43%), DTM2000 (52.73%), and NRLMSISE-00 (12.31%). We demonstrate the\nrobustness of our methodology during a critical time for spacecraft operators\n-- attempting to operate in the presence of geomagnetic storms, by\nreconstructing density profiles along the orbits of three LEO satellites during\n80 geomagnetic storms. These profiles exhibit high spatial and temporal\nresolution compared to three operational thermospheric models, highlighting the\noperational applicability and potential for their use in model validation. Our\nfindings suggest that the increasing availability of precise orbit\ndetermination data offers a valuable, yet underutilized, resource that could\nprovide a significant improvement to data assimilative thermospheric models,\nultimately enhancing both spacecraft operations and thermospheric modeling\nefforts.\n","subjects":["Physics/Space Physics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}