{"id":"2408.03060","title":"MGFs: Masked Gaussian Fields for Meshing Building based on Multi-View\n  Images","authors":"Tengfei Wang, Zongqian Zhan, Rui Xia, Linxia Ji, Xin Wang","authorsParsed":[["Wang","Tengfei",""],["Zhan","Zongqian",""],["Xia","Rui",""],["Ji","Linxia",""],["Wang","Xin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:23:24 GMT"}],"updateDate":"2024-08-07","timestamp":1722936204000,"abstract":"  Over the last few decades, image-based building surface reconstruction has\ngarnered substantial research interest and has been applied across various\nfields, such as heritage preservation, architectural planning, etc. Compared to\nthe traditional photogrammetric and NeRF-based solutions, recently, Gaussian\nfields-based methods have exhibited significant potential in generating surface\nmeshes due to their time-efficient training and detailed 3D information\npreservation. However, most gaussian fields-based methods are trained with all\nimage pixels, encompassing building and nonbuilding areas, which results in a\nsignificant noise for building meshes and degeneration in time efficiency. This\npaper proposes a novel framework, Masked Gaussian Fields (MGFs), designed to\ngenerate accurate surface reconstruction for building in a time-efficient way.\nThe framework first applies EfficientSAM and COLMAP to generate multi-level\nmasks of building and the corresponding masked point clouds. Subsequently, the\nmasked gaussian fields are trained by integrating two innovative losses: a\nmulti-level perceptual masked loss focused on constructing building regions and\na boundary loss aimed at enhancing the details of the boundaries between\ndifferent masks. Finally, we improve the tetrahedral surface mesh extraction\nmethod based on the masked gaussian spheres. Comprehensive experiments on UAV\nimages demonstrate that, compared to the traditional method and several\nNeRF-based and Gaussian-based SOTA solutions, our approach significantly\nimproves both the accuracy and efficiency of building surface reconstruction.\nNotably, as a byproduct, there is an additional gain in the novel view\nsynthesis of building.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}