{"id":"2408.08663","title":"Substrate-aware computational design of two-dimensional materials","authors":"Arslan Mazitov, Ivan Kruglov, Alexey V. Yanilkin, Aleksey V. Arsenin,\n  Valentyn S. Volkov, Dmitry G. Kvashnin, Artem R. Oganov, Kostya S. Novoselov","authorsParsed":[["Mazitov","Arslan",""],["Kruglov","Ivan",""],["Yanilkin","Alexey V.",""],["Arsenin","Aleksey V.",""],["Volkov","Valentyn S.",""],["Kvashnin","Dmitry G.",""],["Oganov","Artem R.",""],["Novoselov","Kostya S.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:11:24 GMT"}],"updateDate":"2024-08-19","timestamp":1723806684000,"abstract":"  Two-dimensional materials have attracted considerable attention due to their\nremarkable electronic, mechanical and optical properties, making them prime\ncandidates for next-generation electronic and optoelectronic applications.\nDespite their widespread use in combination with substrates in practical\napplications, including the fabrication process and final device assembly,\ncomputational studies often neglect the effects of substrate interactions for\nsimplicity. This study presents a novel method for predicting the atomic\nstructure of 2D materials on arbitrary substrates by combining an evolutionary\nalgorithm, a lattice-matching technique, an automated machine learning\ninteratomic potentials training protocol, and the ab initio thermodynamics\napproach for predicting the possible conditions of experimental synthesis of\nthe predicted 2D structures. Using the Mo-S system on a c-cut sapphire\nsubstrate as a case study, we reveal several new stable and metastable\nstructures, including previously known 1H-MoS2 and newly found Pmma Mo3S2, P-1\nMo2S, P21m Mo5S3, and P4mm Mo4S, where the Mo4S structure is specifically\nstabilized by interaction with the substrate. Electronic band structure\ncalculations of Mo3S2, Mo2S, Mo5S3, and Mo4S showed their metallic behavior,\nwhile phonon properties calculations indicated their dynamic stability and\nsubstrate-induced modulation of the phonon density of states. Finally, we use\nthe ab initio thermodynamics approach to predict the synthesis conditions of\nthe discovered structures in the parameter space of the commonly used CVD\ntechnique. These results provide insights into computational substrate\nengineering, allowing one to study the substrate effect on the thermodynamic\nand dynamical stability of 2D materials and to modulate their electronic and\nphonon properties for their future applications, as well as to provide guide\nmaps for their experimental synthesis.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}