{"id":"2408.00055","title":"When Audits and Recounts Distract from Election Integrity: The 2020 U.S.\n  Presidential Election in Georgia","authors":"Philip B. Stark","authorsParsed":[["Stark","Philip B.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 17:09:36 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 16:46:15 GMT"}],"updateDate":"2024-09-06","timestamp":1722445776000,"abstract":"  Georgia was central to efforts to overturn the 2020 Presidential election,\nincluding a call from then-president Trump to Georgia Secretary of State\nRaffensperger asking Raffensperger to `find' 11,780 votes. Raffensperger has\nmaintained that a `100% full-count risk-limiting audit' and a machine recount\nagreed with the initial machine-count results, which proved that the reported\nelection results were accurate and that `no votes were flipped.' There is no\nindication of widespread fraud, but there is reason to distrust the election\noutcome: the two machine counts and the manual `audit' tallies disagree\nsubstantially, even about the number of ballots cast. Some ballots in Fulton\nCounty were included in the original count at least twice; some were included\nin the machine recount at least thrice. Audit results for some tally batches\nwere omitted from the reported audit totals. The two machine counts and the\naudit were not probative of who won because of poor processes and controls: a\nlack of secure physical chain of custody, ballot accounting, pollbook\nreconciliation, and accounting for other election materials such as memory\ncards. Moreover, most voters voted with demonstrably untrustworthy\nballot-marking devices, so even a perfect handcount or audit would not\nnecessarily reveal who really won. True risk-limiting audits (RLAs) and\nrigorous recounts can limit the risk that an incorrect electoral outcome will\nbe certified rather than being corrected. But no procedure can limit that risk\nwithout a trustworthy record of the vote. And even a properly conducted RLA of\nsome contests in an election does not show that any other contests in that\nelection were decided correctly. The 2020 U.S. Presidential election in Georgia\nillustrates unrecoverable errors that can render recounts and audits `security\ntheater' that distract from the more serious problems rather than justifying\ntrust.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"-Ff5XpeF2Yn9GlkpwILMFKaf3PWAKSGUPV6INcwTMCE","pdfSize":"233157"}
