{"id":"2408.03140","title":"Integration vs segregation: evidence from measuring and comparing\n  interdisciplinarity in funded and unfunded research using a network approach","authors":"Anbang Du, Michael Head, Markus Brede","authorsParsed":[["Du","Anbang",""],["Head","Michael",""],["Brede","Markus",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 12:30:04 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 09:13:02 GMT"}],"updateDate":"2024-09-10","timestamp":1722947404000,"abstract":"  Interdisciplinary research fuels innovation. However, research investment has\nbeen found to have become more conservative and highly interdisciplinary ideas\ntend to be punished during research evaluation. How does this affect the\ninterdisciplinarity of research output? To answer this question, our study\npresents a novel network approach by comparing the evolution of\ninterdisciplinarity in funded research against unfunded research. Considering\nthe field of infectious disease research, the analysis of temporal networks\nreveals (i) the growing compartmentalisation of funded research, i.e., it\nbecomes more conservative and focuses on the groups of knowledge with readily\nestablished connections, and (ii) the growth in global integration in unfunded\nresearch, i.e., it tends to be more widely exploratory and links distant\nknowledge. In addition, we find that in general funded research is less\ninterdisciplinary than unfunded research but this effect decreases through\ntime. Moreover, we observe that interdisciplinary research on prominent\ninfectious diseases like HIV tends to have strong bridging effects facilitating\nglobal knowledge integration in the network. In terms of the coronavirus\nresearch, despite the surge in publications since COVID-19, we find its\nsystematic impact on knowledge integration remains relatively low. Overall,\nthis research provides detailed insights into the impact of conservatism in\nfunding interdisciplinary research, allows for the identification of\nunder/over-funded interdisciplinary research areas, and offers valuable\nimplications for policymakers aiming to foster interdisciplinary research.\n","subjects":["Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/"}