{"id":"2408.12383","title":"Exploring van der Waals cuprate superconductors using a hybrid microwave\n  circuit","authors":"Haolin Jin and Giuseppe Serpico and Yejin Lee and Tommaso Confalone\n  and Christian N. Saggau and Flavia Lo Sardo and Genda Gu and Berit H. Goodge\n  and Edouard Lesne and Domenico Montemurro and Kornelius Nielsch and Nicola\n  Poccia and Uri Vool","authorsParsed":[["Jin","Haolin",""],["Serpico","Giuseppe",""],["Lee","Yejin",""],["Confalone","Tommaso",""],["Saggau","Christian N.",""],["Sardo","Flavia Lo",""],["Gu","Genda",""],["Goodge","Berit H.",""],["Lesne","Edouard",""],["Montemurro","Domenico",""],["Nielsch","Kornelius",""],["Poccia","Nicola",""],["Vool","Uri",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:22:01 GMT"}],"updateDate":"2024-08-23","timestamp":1724332921000,"abstract":"  The advent of two-dimensional van der Waals materials is a frontier of\ncondensed matter physics and quantum devices. However, characterizing such\nmaterials remains challenging due to the limitations of bulk material\ntechniques, necessitating the development of specialized methods. In this\nstudy, we investigate the superconducting properties of Bi2Sr2CaCu2O8+x flakes\nby integrating them with a hybrid superconducting microwave resonator. The\nhybrid resonator is significantly modified by the interaction with the flake\nwhile maintaining a high quality factor. We also observe a significant upshift\nof the resonator frequency with increasing temperature, as well as a positive\nnonlinearity. These effects originate from a presently unknown microscopic\nmechanism within the flake, and can be modeled as a two-level system bath\ninteracting with resonant mode. Our findings open a path for high quality\nhybrid circuits with van der Waals flakes for exploring novel materials and\ndeveloping new devices for quantum technology.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}