{"id":"2408.11538","title":"Structure and dynamics of the magnetite(001)/water interface from\n  molecular dynamics simulations based on a neural network potential","authors":"Salvatore Romano, Pablo Montero de Hijes, Matthias Meier, Georg\n  Kresse, Cesare Franchini, Christoph Dellago","authorsParsed":[["Romano","Salvatore",""],["de Hijes","Pablo Montero",""],["Meier","Matthias",""],["Kresse","Georg",""],["Franchini","Cesare",""],["Dellago","Christoph",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 11:33:24 GMT"},{"version":"v2","created":"Fri, 6 Sep 2024 09:22:33 GMT"}],"updateDate":"2024-09-09","timestamp":1724240004000,"abstract":"  The magnetite/water interface is commonly found in nature and plays a crucial\nrole in various technological applications. However, our understanding of its\nstructural and dynamical properties at the molecular scale remains still\nlimited. In this study, we develop an efficient Behler-Parrinello neural\nnetwork potential (NNP) for the magnetite/water system, paying particular\nattention to the accurate generation of reference data with density functional\ntheory. Using this NNP, we performed extensive molecular dynamics simulations\nof the magnetite (001) surface across a wide range of water coverages, from the\nsingle molecule to bulk water. Our simulations revealed several new ground\nstates of low coverage water on the Subsurface Cation Vacancy (SCV) model and\nyielded a density profile of water at the surface that exhibits marked\nlayering. By calculating mean square displacements, we obtained quantitative\ninformation on the diffusion of water molecules on the SCV for different\ncoverages, revealing significant anisotropy. Additionally, our simulations\nprovided qualitative insights into the dissociation mechanisms of water\nmolecules at the surface.\n","subjects":["Physics/Computational Physics","Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}