{"id":"2408.13027","title":"A parametric version of the Hilbert Nullstellensatz","authors":"Rida Ait El Manssour, Nikhil Balaji, Klara Nosan, Mahsa Shirmohammadi,\n  James Worrell","authorsParsed":[["Manssour","Rida Ait El",""],["Balaji","Nikhil",""],["Nosan","Klara",""],["Shirmohammadi","Mahsa",""],["Worrell","James",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:30:01 GMT"}],"updateDate":"2024-08-26","timestamp":1724416201000,"abstract":"  Hilbert's Nullstellensatz is a fundamental result in algebraic geometry that\ngives a necessary and sufficient condition for a finite collection of\nmultivariate polynomials to have a common zero in an algebraically closed\nfield. Associated with this result, there is the computational problem HN of\ndetermining whether a system of polynomials with coefficients in the field of\nrational numbers has a common zero over the field of algebraic numbers.\n  In an influential paper, Koiran showed that HN can be determined in the\npolynomial hierarchy assuming the Generalised Riemann Hypothesis (GRH). More\nprecisely, he showed that HN lies in the complexity class AM under GRH. In a\nlater work he generalised this result by showing that the problem DIM, which\nasks to determine the dimension of the set of solutions of a given polynomial\nsystem, also lies in AM subject to GRH.\n  In this paper we study the solvability of polynomial equations over arbitrary\nalgebraically closed fields of characteristic zero. Up to isomorphism, every\nsuch field is the algebraic closure of a field of rational functions. We thus\nformulate a parametric version of HN, called HNP, in which the input is a\nsystem of polynomials with coefficients in a function field\n$\\mathbb{Q}(\\mathbf{x})$ and the task is to determine whether the polynomials\nhave a common zero in the algebraic closure\n$\\overline{\\mathbb{Q}(\\mathbf{x})}$.\n  We observe that Koiran's proof that DIM lies in AM can be interpreted as a\nrandomised polynomial-time reduction of DIM to HNP, followed by an argument\nthat HNP lies in AM. Our main contribution is a self-contained proof that HNP\nlies in AM that follows the same basic idea as Koiran's argument -- namely\nrandom instantiation of the parameters -- but whose justification is purely\nalgebraic, relying on a parametric version of Hilbert's Nullstellensatz, and\navoiding recourse to semi-algebraic geometry.\n","subjects":["Computing Research Repository/Computational Complexity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PlpjcM1hgHwJ0YUOSh0PzPHFoUFu8XGEmdxe3zDU-8c","pdfSize":"458201"}
