{"id":"2408.10879","title":"Proton Radiography Inversions with Source Extraction and Comparison to\n  Mesh Methods","authors":"J. Griff-McMahon, V. Valenzuela-Villaseca, S. Malko, G. Fiksel, M. J.\n  Rosenberg, D. B. Schaeffer, W. Fox","authorsParsed":[["Griff-McMahon","J.",""],["Valenzuela-Villaseca","V.",""],["Malko","S.",""],["Fiksel","G.",""],["Rosenberg","M. J.",""],["Schaeffer","D. B.",""],["Fox","W.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:09:50 GMT"}],"updateDate":"2024-08-21","timestamp":1724162990000,"abstract":"  Proton radiography is a central diagnostic technique for measuring\nelectromagnetic (EM) fields in high-energy-density, laser-produced plasmas. In\nthis technique, protons traverse the plasma where they accumulate small EM\ndeflections which lead to variations in the proton fluence pattern on a\ndetector. Path-integrated EM fields can then be extracted from the fluence\nimage through an inversion process. In this work, experiments of laser-driven\nfoils were conducted on the OMEGA laser and magnetic field reconstructions were\nperformed using both \"fluence-based\" techniques and high-fidelity \"mesh-based\"\nmethods. We implement nonzero boundary conditions into the inversion and show\ntheir importance by comparing against mesh measurements. Good agreement between\nthe methods is found only when nonzero boundary conditions are used. We also\nintroduce an approach to determine the unperturbed proton source profile, which\nis a required input in fluence reconstruction algorithms. In this approach, a\nfluence inversion is embedded inside of a mesh region, which provides\noverconstrained magnetic boundary conditions. A source profile is then\niteratively optimized to satisfy the boundary information. This method\nsubstantially enhances the accuracy in recovering EM fields. Lastly, we propose\na scheme to quantify uncertainty in the final inversion that is introduced\nthrough errors in the source retrieval.\n","subjects":["Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}