{"id":"2408.01784","title":"Graph Stochastic Neural Process for Inductive Few-shot Knowledge Graph\n  Completion","authors":"Zicheng Zhao, Linhao Luo, Shirui Pan, Chengqi Zhang, and Chen Gong","authorsParsed":[["Zhao","Zicheng",""],["Luo","Linhao",""],["Pan","Shirui",""],["Zhang","Chengqi",""],["Gong","Chen",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 13:37:40 GMT"}],"updateDate":"2024-08-06","timestamp":1722692260000,"abstract":"  Knowledge graphs (KGs) store enormous facts as relationships between\nentities. Due to the long-tailed distribution of relations and the\nincompleteness of KGs, there is growing interest in few-shot knowledge graph\ncompletion (FKGC). Existing FKGC methods often assume the existence of all\nentities in KGs, which may not be practical since new relations and entities\ncan emerge over time. Therefore, we focus on a more challenging task called\ninductive few-shot knowledge graph completion (I-FKGC), where both relations\nand entities during the test phase are unknown before. Inspired by the idea of\ninductive reasoning, we cast I-FKGC as an inductive reasoning problem.\nSpecifically, we propose a novel Graph Stochastic Neural Process approach\n(GS-NP), which consists of two major modules. In the first module, to obtain a\ngeneralized hypothesis (e.g., shared subgraph), we present a neural\nprocess-based hypothesis extractor that models the joint distribution of\nhypothesis, from which we can sample a hypothesis for predictions. In the\nsecond module, based on the hypothesis, we propose a graph stochastic\nattention-based predictor to test if the triple in the query set aligns with\nthe extracted hypothesis. Meanwhile, the predictor can generate an explanatory\nsubgraph identified by the hypothesis. Finally, the training of these two\nmodules is seamlessly combined into a unified objective function, of which the\neffectiveness is verified by theoretical analyses as well as empirical studies.\nExtensive experiments on three public datasets demonstrate that our method\noutperforms existing methods and derives new state-of-the-art performance.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}