{"id":"2408.10653","title":"UIE-UnFold: Deep Unfolding Network with Color Priors and Vision\n  Transformer for Underwater Image Enhancement","authors":"Yingtie Lei, Jia Yu, Yihang Dong, Changwei Gong, Ziyang Zhou, Chi-Man\n  Pun","authorsParsed":[["Lei","Yingtie",""],["Yu","Jia",""],["Dong","Yihang",""],["Gong","Changwei",""],["Zhou","Ziyang",""],["Pun","Chi-Man",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:48:33 GMT"}],"updateDate":"2024-08-21","timestamp":1724143713000,"abstract":"  Underwater image enhancement (UIE) plays a crucial role in various marine\napplications, but it remains challenging due to the complex underwater\nenvironment. Current learning-based approaches frequently lack explicit\nincorporation of prior knowledge about the physical processes involved in\nunderwater image formation, resulting in limited optimization despite their\nimpressive enhancement results. This paper proposes a novel deep unfolding\nnetwork (DUN) for UIE that integrates color priors and inter-stage feature\ntransformation to improve enhancement performance. The proposed DUN model\ncombines the iterative optimization and reliability of model-based methods with\nthe flexibility and representational power of deep learning, offering a more\nexplainable and stable solution compared to existing learning-based UIE\napproaches. The proposed model consists of three key components: a Color Prior\nGuidance Block (CPGB) that establishes a mapping between color channels of\ndegraded and original images, a Nonlinear Activation Gradient Descent Module\n(NAGDM) that simulates the underwater image degradation process, and an Inter\nStage Feature Transformer (ISF-Former) that facilitates feature exchange\nbetween different network stages. By explicitly incorporating color priors and\nmodeling the physical characteristics of underwater image formation, the\nproposed DUN model achieves more accurate and reliable enhancement results.\nExtensive experiments on multiple underwater image datasets demonstrate the\nsuperiority of the proposed model over state-of-the-art methods in both\nquantitative and qualitative evaluations. The proposed DUN-based approach\noffers a promising solution for UIE, enabling more accurate and reliable\nscientific analysis in marine research. The code is available at\nhttps://github.com/CXH-Research/UIE-UnFold.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}