{"id":"2408.15122","title":"Machine Learning for Methane Detection and Quantification from Space - A\n  survey","authors":"Enno Tiemann, Shanyu Zhou, Alexander Kl\\\"aser, Konrad Heidler,\n  Rochelle Schneider, Xiao Xiang Zhu","authorsParsed":[["Tiemann","Enno",""],["Zhou","Shanyu",""],["Kläser","Alexander",""],["Heidler","Konrad",""],["Schneider","Rochelle",""],["Zhu","Xiao Xiang",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 15:03:20 GMT"}],"updateDate":"2024-08-28","timestamp":1724771000000,"abstract":"  Methane ($CH_4$) is a potent anthropogenic greenhouse gas, contributing 86\ntimes more to global warming than Carbon Dioxide ($CO_2$) over 20 years, and it\nalso acts as an air pollutant. Given its high radiative forcing potential and\nrelatively short atmospheric lifetime (9$\\pm$1 years), methane has important\nimplications for climate change, therefore, cutting methane emissions is\ncrucial for effective climate change mitigation. This work expands existing\ninformation on operational methane point source detection sensors in the\nShort-Wave Infrared (SWIR) bands. It reviews the state-of-the-art for\ntraditional as well as Machine Learning (ML) approaches. The architecture and\ndata used in such ML models will be discussed separately for methane plume\nsegmentation and emission rate estimation. Traditionally, experts rely on\nlabor-intensive manually adjusted methods for methane detection. However, ML\napproaches offer greater scalability. Our analysis reveals that ML models\noutperform traditional methods, particularly those based on convolutional\nneural networks (CNN), which are based on the U-net and transformer\narchitectures. These ML models extract valuable information from\nmethane-sensitive spectral data, enabling a more accurate detection. Challenges\narise when comparing these methods due to variations in data, sensor\nspecifications, and evaluation metrics. To address this, we discuss existing\ndatasets and metrics, providing an overview of available resources and\nidentifying open research problems. Finally, we explore potential future\nadvances in ML, emphasizing approaches for model comparability, large dataset\ncreation, and the European Union's forthcoming methane strategy.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Mmij0wWdwg0JTXvzLAGOJHmYsihKhO_6XfERBAVzAco","pdfSize":"9802754"}
