{"id":"2408.15481","title":"Joint Offloading and Beamforming Design in Integrating Sensing,\n  Communication, and Computing Systems: A Distributed Approach","authors":"Peng Liu and Zesong Fei and Xinyi Wang and Jingxuan Huang and Jie Hu\n  and J. Andrew Zhang","authorsParsed":[["Liu","Peng",""],["Fei","Zesong",""],["Wang","Xinyi",""],["Huang","Jingxuan",""],["Hu","Jie",""],["Zhang","J. Andrew",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 02:02:17 GMT"}],"updateDate":"2024-08-29","timestamp":1724810537000,"abstract":"  When applying integrated sensing and communications (ISAC) in future mobile\nnetworks, many sensing tasks have low latency requirements, preferably being\nimplemented at terminals. However, terminals often have limited computing\ncapabilities and energy supply. In this paper, we investigate the effectiveness\nof leveraging the advanced computing capabilities of mobile edge computing\n(MEC) servers and the cloud server to address the sensing tasks of ISAC\nterminals. Specifically, we propose a novel three-tier integrated sensing,\ncommunication, and computing (ISCC) framework composed of one cloud server,\nmultiple MEC servers, and multiple terminals, where the terminals can\noptionally offload sensing data to the MEC server or the cloud server. The\noffload message is sent via the ISAC waveform, whose echo is used for sensing.\nWe jointly optimize the computation offloading and beamforming strategies to\nminimize the average execution latency while satisfying sensing requirements.\nIn particular, we propose a low-complexity distributed algorithm to solve the\nproblem. Firstly, we use the alternating direction method of multipliers (ADMM)\nand derive the closed-form solution for offloading decision variables.\nSubsequently, we convert the beamforming optimization sub-problem into a\nweighted minimum mean-square error (WMMSE) problem and propose a fractional\nprogramming based algorithm. Numerical results demonstrate that the proposed\nISCC framework and distributed algorithm significantly reduce the execution\nlatency and the energy consumption of sensing tasks at a lower computational\ncomplexity compared to existing schemes.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}