{"id":"2408.05012","title":"Complete Dynamic Logic of Communicating Hybrid Programs","authors":"Marvin Brieger, Stefan Mitsch, Andr\\'e Platzer","authorsParsed":[["Brieger","Marvin",""],["Mitsch","Stefan",""],["Platzer","André",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 11:47:07 GMT"}],"updateDate":"2024-08-12","timestamp":1723204027000,"abstract":"  This article presents a relatively complete proof calculus for the dynamic\nlogic of communicating hybrid programs dLCHP. Beyond traditional hybrid systems\nmixing discrete and continuous dynamics, communicating hybrid programs feature\nparallel interactions of hybrid systems. This not only compounds the subtleties\nof hybrid and parallel systems but adds the truly simultaneous synchronized\nevolution of parallel hybrid dynamics as a new challenge. To enable\ncompositional reasoning about communicating hybrid programs nevertheless, dLCHP\ncombines differential dynamic logic dL and assumption-commitment reasoning. To\nmaintain the logical essence of dynamic logic axiomatizations, dLCHP's proof\ncalculus presents a new modal logic view onto ac-reasoning. This modal view\ndrives a decomposition of classical monolithic proof rules for parallel systems\nreasoning into new modular axioms, which yields better flexibility and\nsimplifies soundness arguments. Adequacy of the proof calculus is shown by two\ncompleteness results: First, dLCHP is complete relative to the logic of\ncommunication traces and differential equation properties. This result proves\nthe new modular modal view sufficient for reasoning about parallel hybrid\nsystems, and captures modular strategies for reasoning about concrete parallel\nhybrid systems. The second result proof-theoretically aligns dLCHP and dL by\nproving that reasoning about parallel hybrid systems is exactly as hard as\nreasoning about hybrid systems, continuous systems, or discrete systems. This\ncompleteness result reveals the possibility of representational succinctness in\nparallel hybrid systems proofs.\n","subjects":["Computing Research Repository/Logic in Computer Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}