{"id":"2408.07297","title":"Estimate collective cooperativeness of driving agents in mixed traffic\n  flow","authors":"Di Chen, Jia Li, H. Michael Zhang","authorsParsed":[["Chen","Di",""],["Li","Jia",""],["Zhang","H. Michael",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 00:15:54 GMT"}],"updateDate":"2024-08-15","timestamp":1722384954000,"abstract":"  Cooperation is a ubiquitous phenomenon in many natural, social, and\nengineered systems that contain multiple agents. Characterizing and quantifying\ncooperativeness of driving agents is of interest and significance for two\nreasons. Theoretically, it will enhance the understanding of micro-macro\nconnections and emergence of cooperation in mixed traffic. Pragmatically, this\nunderstanding will benefit the design and operations of automated and\nmixed-autonomy transportation systems. However, it remains unclear how the\ncooperativeness can be accurately defined and quantified from empirical data,\nand it remains open when and to what extent collective cooperativeness exists.\nThis paper is intended to fill the gap. We propose a unified conceptual\nframework to estimate collective cooperativeness of driving agents leveraging a\nrecent behavioral equilibrium model of mixed autonomy traffic (Li et al.\n2022a). This framework is interpretable, theoretically consistent, and enables\nquantifying collective cooperativeness of traffic agents from trajectory data.\nWe apply the framework to multilane freeway traffic employing NGSIM I-80\ntrajectory data set and careful data selection. Our case study indicates the\nexistence of collective cooperativeness between human-driven passenger cars and\ntrucks in real-world traffic and reveals its other properties that are\notherwise unknown.\n","subjects":["Physics/Physics and Society","Computing Research Repository/Machine Learning","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hLkyidg3Nu5_ZaogV2Jh02DPMaX7KS_CNkS3elz0Kjs","pdfSize":"3067261"}
