{"id":"2408.02693","title":"Diff-PIC: Revolutionizing Particle-In-Cell Simulation for Advancing\n  Nuclear Fusion with Diffusion Models","authors":"Chuan Liu, Chunshu Wu, Shihui Cao, Mingkai Chen, James Chenhao Liang,\n  Ang Li, Michael Huang, Chuang Ren, Dongfang Liu, Ying Nian Wu, Tong Geng","authorsParsed":[["Liu","Chuan",""],["Wu","Chunshu",""],["Cao","Shihui",""],["Chen","Mingkai",""],["Liang","James Chenhao",""],["Li","Ang",""],["Huang","Michael",""],["Ren","Chuang",""],["Liu","Dongfang",""],["Wu","Ying Nian",""],["Geng","Tong",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 19:42:31 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 21:55:55 GMT"}],"updateDate":"2024-08-21","timestamp":1722714151000,"abstract":"  Sustainable energy is a crucial global challenge, and recent breakthroughs in\nnuclear fusion ignition underscore the potential of harnessing energy extracted\nfrom nuclear fusion in everyday life, thereby drawing significant attention to\nfusion ignition research, especially Laser-Plasma Interaction (LPI).\nUnfortunately, the complexity of LPI at ignition scale renders theory-based\nanalysis nearly impossible -- instead, it has to rely heavily on\nParticle-in-Cell (PIC) simulations, which is extremely computationally\nintensive, making it a major bottleneck in advancing fusion ignition. In\nresponse, this work introduces Diff-PIC, a novel paradigm that leverages\nconditional diffusion models as a computationally efficient alternative to PIC\nsimulations for generating high-fidelity scientific data. Specifically, we\ndesign a distillation paradigm to distill the physical patterns captured by PIC\nsimulations into diffusion models, demonstrating both theoretical and practical\nfeasibility. Moreover, to ensure practical effectiveness, we provide solutions\nfor two critical challenges: (1) We develop a physically-informed conditional\ndiffusion model that can learn and generate meaningful embeddings for\nmathematically continuous physical conditions. This model offers algorithmic\ngeneralization and adaptable transferability, effectively capturing the complex\nrelationships between physical conditions and simulation outcomes; and (2) We\nemploy the rectified flow technique to make our model a one-step conditional\ndiffusion model, enhancing its efficiency further while maintaining high\nfidelity and physical validity. Diff-PIC establishes a new paradigm for using\ndiffusion models to overcome the computational barriers in nuclear fusion\nresearch, setting a benchmark for future innovations and advancements in this\nfield.\n","subjects":["Physics/Computational Physics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"iVTqcmFpwY36Aqx_Ofm5MZ9FZ8a34vRPzww3ujmaBgI","pdfSize":"6932561"}
