{"id":"2408.15229","title":"Why are optical coronal lines faint in active galactic nuclei?","authors":"Jeffrey D. McKaig, Shobita Satyapal, Ari Laor, Nicholas P. Abel, Sara\n  M. Doan, Claudio Ricci, Jenna M. Cann","authorsParsed":[["McKaig","Jeffrey D.",""],["Satyapal","Shobita",""],["Laor","Ari",""],["Abel","Nicholas P.",""],["Doan","Sara M.",""],["Ricci","Claudio",""],["Cann","Jenna M.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:48:06 GMT"}],"updateDate":"2024-08-28","timestamp":1724780886000,"abstract":"  Forbidden collisionally excited optical atomic transitions from high\nionization potential (IP$\\geq$54.8\\,eV) ions, such as Ca$^{\\mathrm{4+}}$,\nNe$^{\\mathrm{4+}}$, Fe$^{\\mathrm{6+}}$, Fe$^{\\mathrm{10+}}$,\nFe$^{\\mathrm{13+}}$, Ar$^{\\mathrm{9+}}$, and S$^{\\mathrm{11+}}$, are known as\noptical coronal lines (CLs). The spectral energy distribution (SED) of active\ngalactic nuclei (AGN) typically extends to hundreds of electron volts and\nabove, which should be able to produce such highly ionized gas. However,\noptical CLs are often not detected in AGN. Here we use photoionization\ncalculations with the \\textsc{Cloudy} spectral synthesis code to determine\npossible reasons for the rarity of these optical CLs. We calculate CL\nluminosities and equivalent widths from radiation pressure confined\nphotoionized gas slabs exposed to an AGN continuum. We consider the role of\ndust, metallicity, and ionizing SED in the formation of optical CLs. We find\nthat (1) dust reduces the strength of most CLs by $\\sim$three orders of\nmagnitude, primarily as a result of depletion of metals onto the dust grains.\n(2) In contrast to the CLs, the more widely observed lower IP optical lines\nsuch as [O\\, III] 5007\\,\\AA, are less affected by depletion and some are\nactually enhanced in dusty gas. (3) In dustless gas many optical CLs become\ndetectable, and are particularly strong for a hard ionizing SED. This implies\nthat prominent CL emission likely originate in dustless gas. Our calculations\nalso suggest optical CL emission is enhanced in galaxies with low mass black\nholes characterized by a harder radiation field and a low dust to metal ratio.\nThe fact that optical CLs are not widely observed in the early universe with\nJWST may point to rapid dust formation at high redshift.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}