{"id":"2408.13190","title":"Near-field orthogonality and cosine beams for near-field space division\n  multiple access in 6G communications and beyond","authors":"Sotiris Droulias, Giorgos Stratidakis, Angeliki Alexiou","authorsParsed":[["Droulias","Sotiris",""],["Stratidakis","Giorgos",""],["Alexiou","Angeliki",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:19:20 GMT"}],"updateDate":"2024-08-26","timestamp":1724429960000,"abstract":"  Spatial division multiple access (SDMA), a powerful method routinely applied\nin multi-user multiple-input multiple-output (MIMO) communications, relies on\nthe angular orthogonality of beams in the far field, to distinguish multiple\nusers at different angles. Yet, with the gradual shift of wireless connectivity\nto the near-field of large radiating apertures, the applicability of classical\nSDMA becomes questionable. Therefore, to enable near-field multiple access, it\nis necessary to design beams that have the desired orthogonality in the\nnear-field. In this work, we propose the concept of near-field space division\nmultiple access (NF-SDMA), to enable SDMA in the near-field. We demonstrate\nanalytically that the orthogonality of beams is preserved at any location of\nthe receiver, from the near-field to the far-field of the transmitter. By\njudicious design, we select the family of cosine beams and we prove that they\nsatisfy the orthogonality condition, offering a multitude of communication\nmodes in the near-field. We demonstrate how the correlation of beams generated\nwith uniform linear arrays (ULAs) is extended to uniform planar arrays (UPAs)\nin a straightforward and insightful manner. To test our analytical findings, we\npropagate the designed beams numerically, and we measure their orthogonality\nboth at the transmitter and the receiver. We verify that the orthogonality of\nthe proposed beams is successfully retrieved at a receiver that resides in the\nnear-field of the transmitter, and is also robust to displacements of the\nreceiver. Based on our findings, we propose codebook designs for NF-SDMA that\nare applicable for receivers with many elements and even with single antennas.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}