{"id":"2408.10957","title":"Satellite monitoring of annual US landfill methane emissions and trends","authors":"Nicholas Balasus, Daniel J. Jacob, Gabriel Maxemin, Carrie Jenks,\n  Hannah Nesser, Joannes D. Maasakkers, Daniel H. Cusworth, Tia R. Scarpelli,\n  Daniel J. Varon, Xiaolin Wang","authorsParsed":[["Balasus","Nicholas",""],["Jacob","Daniel J.",""],["Maxemin","Gabriel",""],["Jenks","Carrie",""],["Nesser","Hannah",""],["Maasakkers","Joannes D.",""],["Cusworth","Daniel H.",""],["Scarpelli","Tia R.",""],["Varon","Daniel J.",""],["Wang","Xiaolin",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:52:27 GMT"}],"updateDate":"2024-08-21","timestamp":1724169147000,"abstract":"  We use satellite observations of atmospheric methane from the TROPOMI\ninstrument to estimate total annual methane emissions for 2019-2023 from four\nlarge Southeast US landfills with gas collection and control systems. The\nemissions are on average 6$\\times$ higher than the values reported by the\nlandfills to the US Greenhouse Gas Reporting Program (GHGRP) which are used by\nthe US Environmental Protection Agency (EPA) for its national Greenhouse Gas\nInventory (GHGI). We find increasing emissions over the 2019-2023 period\nwhereas the GHGRP reports a decrease. The GHGRP requires gas-collecting\nlandfills to estimate their annual emissions either with a recovery-first model\n(estimating emissions as a function of methane recovered) or a generation-first\nmodel (estimating emissions from a first-order-decay applied to\nwaste-in-place). All four landfills choose to use the recovery-first model,\nwhich yields emissions that are one-quarter of those from the generation-first\nmodel and decreasing over 2019-2023, in contrast with the TROPOMI observations.\nOur TROPOMI estimates for two of the landfills agree with the generation-first\nmodel, with increasing emissions over 2019-2023 due to increasing\nwaste-in-place or decreasing methane recovery, and are still higher than the\ngeneration-first model for the other two landfills. Further examination of the\nGHGRP emissions from all reporting landfills in the US shows that the 19%\ndecrease in landfill emissions reported by the GHGI over 2005-2022 reflects an\nincreasing preference for the recovery-first model by the reporting landfills,\nrather than an actual emission decrease. The generation-first model would imply\nan increase in landfill emissions over 2013-2022, and this is more consistent\nwith atmospheric observations.\n","subjects":["Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"BrUKPB0wP4fbeKH-nmuMc3THfAALF3wicNgP16ZyNs8","pdfSize":"3639680"}
