{"id":"2408.07999","title":"Co-Fix3D: Enhancing 3D Object Detection with Collaborative Refinement","authors":"Wenxuan Li, Qin Zou, Chi Chen, Bo Du, Long Chen","authorsParsed":[["Li","Wenxuan",""],["Zou","Qin",""],["Chen","Chi",""],["Du","Bo",""],["Chen","Long",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:56:02 GMT"}],"updateDate":"2024-08-16","timestamp":1723708562000,"abstract":"  In the realm of autonomous driving,accurately detecting occluded or distant\nobjects,referred to as weak positive sample ,presents significant challenges.\nThese challenges predominantly arise during query initialization, where an\nover-reliance on heatmap confidence often results in a high rate of false\npositives, consequently masking weaker detections and impairing system\nperformance. To alleviate this issue, we propose a novel approach, Co-Fix3D,\nwhich employs a collaborative hybrid multi-stage parallel query generation\nmechanism for BEV representations. Our method incorporates the Local-Global\nFeature Enhancement (LGE) module, which refines BEV features to more\neffectively highlight weak positive samples. It uniquely leverages the Discrete\nWavelet Transform (DWT) for accurate noise reduction and features refinement in\nlocalized areas, and incorporates an attention mechanism to more\ncomprehensively optimize global BEV features. Moreover, our method increases\nthe volume of BEV queries through a multi-stage parallel processing of the LGE,\nsignificantly enhancing the probability of selecting weak positive samples.\nThis enhancement not only improves training efficiency within the decoder\nframework but also boosts overall system performance. Notably, Co-Fix3D\nachieves superior results on the stringent nuScenes benchmark, outperforming\nall previous models with a 69.1% mAP and 72.9% NDS on the LiDAR-based\nbenchmark, and 72.3% mAP and 74.1% NDS on the multi-modality benchmark, without\nrelying on test-time augmentation or additional datasets. The source code will\nbe made publicly available upon acceptance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}