{"id":"2408.17104","title":"Transit time of black holes on generalized free energy landscape","authors":"Tianqi Yue, Jin Wang","authorsParsed":[["Yue","Tianqi",""],["Wang","Jin",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:43:07 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 10:53:23 GMT"}],"updateDate":"2024-09-06","timestamp":1725007387000,"abstract":"  Recently, the thermodynamics and kinetics of black hole phase transitions\nhave garnered attention, particularly with the black hole radius being utilized\nas an order parameter within a generalized free energy landscape. In this\nframework, the local minima and maxima of the free energy correspond to stable\nand unstable states, respectively, while other states on the free energy\nlandscape represent fluctuating black holes. Thermal fluctuations enable\ntransitions between these stable states, and this stochastic kinetic behavior\ncan be effectively described by the probabilistic Fokker-Planck equation.The\ntransit time, defined as the time required for transitions or jumps between\nstates, is a crucial physical quantity in phase transition kinetics, as it\nhelps characterize the switching dynamics. By employing a harmonic transition\nstate approximation, we examine the Hawking-Page phase transition and the\nReissner-Nordstr\\\"om-Anti-de Sitter (RNAdS) black hole phase transition within\nthe context of the generalized free energy landscape. We analytically quantify\nthe transit time and its probability distribution for actual transition events,\nrevealing the relationship between the mean transit time and the prefactor of\nthe classical mean first passage time (MFPT). As the mean transit time\ndecreases, the probability distribution narrows, indicating reduced\nfluctuations in transit time. These phenomena are connected to the topological\nstructure of the generalized free energy landscape, the curvature of the free\nenergy in both stable and unstable states, and the height of the energy\nbarrier. We conclude that, for black hole phase transitions, the transit time\nserves as a characteristic timescale that reflects the actual jump time between\nstates or to a transition state. Moreover, its relationship with the prefactor\nallows for a more precise quantification of the MFPT.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}