{"id":"2408.00015","title":"A generalized phase-field cohesive zone model ($\\mu$PF-CZM) for fracture","authors":"Jian-Ying Wu","authorsParsed":[["Wu","Jian-Ying",""]],"versions":[{"version":"v1","created":"Sun, 28 Jul 2024 11:00:15 GMT"}],"updateDate":"2024-09-04","timestamp":1722164415000,"abstract":"  In this work a generalized phase-field cohesive zone model ($\\mu$PF-CZM) is\nproposed within the framework of the unified phase-field theory for brittle and\ncohesive fracture. With the introduction of an extra dissipation function for\nthe crack driving force, in addition to the geometric function for the\nphase-field regularization and the degradation function for the constitutive\nrelation, theoretical and application scopes of the original PF-CZM are\nbroadened greatly. These characteristic functions are analytically determined\nfrom the conditions for the length scale insensitivity and a non-shrinking\ncrack band in a universal, optimal and rationalized manner, for almost any\nspecific traction-separation law. In particular, with an optimal geometric\nfunction, the crack irreversibility can be considered without affecting the\ntarget traction-separation softening law. Not only concave softening behavior\nbut also high-order cohesive traction, both being limitations of the previous\nworks, can be properly dealt with. The global fracture responses are\ninsensitive not only to the phase-field length scale but also to the traction\norder parameter, though the crack bandwidth might be affected by both. Despite\nthe loss of variational consistency in general cases, the resulting $\\mu$PF-CZM\nis still thermodynamically consistent. Moreover, the existing numerical\nimplementation can be adopted straightforwardly with minor modifications.\nRepresentative numerical examples are presented to validate the proposed\n$\\mu$PF-CZM and to demonstrate its capabilities in capturing brittle and\ncohesive fracture with general softening behavior. The insensitivity to both\nthe phase-field length scale and the traction order parameter is also\nsufficiently verified.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"_u8EssSkPK0vqu1UyK_GqZdQ9haIB62Ph5D8euqekdI","pdfSize":"3570918"}
