{"id":"2408.01606","title":"Gravitational collapse at low to moderate Mach numbers: The relationship\n  between star formation efficiency and the fraction of mass in the massive\n  object","authors":"Jorge Saavedra-Bastidas and Dominik R.G. Schleicher and Ralf S.\n  Klessen and Sunmyon Chon and Kazuyuki Omukai and Thomas Peters and Lewis R.\n  Prole and Basti\\'an Reinoso and Rafeel Riaz and Paulo Solar","authorsParsed":[["Saavedra-Bastidas","Jorge",""],["Schleicher","Dominik R. G.",""],["Klessen","Ralf S.",""],["Chon","Sunmyon",""],["Omukai","Kazuyuki",""],["Peters","Thomas",""],["Prole","Lewis R.",""],["Reinoso","Bastián",""],["Riaz","Rafeel",""],["Solar","Paulo",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 23:48:27 GMT"}],"updateDate":"2024-08-06","timestamp":1722642507000,"abstract":"  The formation of massive objects via gravitational collapse is relevant both\nfor explaining the origin of the first supermassive black holes and in the\ncontext of massive star formation. Here, we analyze simulations of the\nformation of massive objects pursued by different groups and in various\nenvironments, concerning the formation of supermassive black holes, primordial\nstars, as well as present-day massive stars. We focus particularly on the\nregime of small virial parameters, i.e., low ratios of the initial kinetic to\ngravitational energy, low to moderate Mach numbers, and the phase before\nfeedback is very efficient. We compare the outcomes of collapse under different\nconditions using dimensionless parameters, particularly the star formation\nefficiency \\epsilon_*, the fraction f_* of mass in the most massive object\nrelative to the total stellar mass, and the fraction f_{\\rm tot} of mass of the\nmost massive object as a function of the total mass. We find that in all\nsimulations analyzed here, f_{\\rm tot} increases as a function of \\epsilon_*,\nalthough the steepness of the increase depends on the environment. The relation\nbetween f_* and \\epsilon_* is found to be more complex and also strongly\ndepends on the number of protostars present at the beginning of the\nsimulations. We show that a collision parameter, estimated as the ratio of the\nsystem size divided by the typical collision length, allows us to approximately\ncharacterize whether collisions will be important. We analyze the statistical\ncorrelation between the dimensionless quantities using the Spearman coefficient\nand confirm via a machine learning analysis that good predictions of f_* can be\nobtained from \\epsilon_* together with a rough estimate of the collision\nparameter. This suggests that a good estimate of the mass of the most massive\nobject can be obtained once the maximum efficiency for a given environment is\nknown.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}