{"id":"2408.08148","title":"Early Detection of Performance Regressions by Bridging Local Performance\n  Data and Architectural Models","authors":"Lizhi Liao, Simon Eismann, Heng Li, Cor-Paul Bezemer, Diego Elias\n  Costa, Andre van Hoorn, Weiyi Shang","authorsParsed":[["Liao","Lizhi",""],["Eismann","Simon",""],["Li","Heng",""],["Bezemer","Cor-Paul",""],["Costa","Diego Elias",""],["van Hoorn","Andre",""],["Shang","Weiyi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 13:33:20 GMT"}],"updateDate":"2024-08-16","timestamp":1723728800000,"abstract":"  During software development, developers often make numerous modifications to\nthe software to address existing issues or implement new features. However,\ncertain changes may inadvertently have a detrimental impact on the overall\nsystem performance. To ensure that the performance of new software releases\ndoes not degrade, existing practices rely on system-level performance testing,\nsuch as load testing, or component-level performance testing to detect\nperformance regressions. However, performance testing for the entire system is\noften expensive and time-consuming, posing challenges to adapting to the rapid\nrelease cycles common in modern DevOps practices. System-level performance\ntesting cannot be conducted until the system is fully built and deployed. On\nthe other hand, component-level testing focuses on isolated components,\nneglecting overall system performance and the impact of system workloads.\n  In this paper, we propose a novel approach to early detection of performance\nregressions by bridging the local performance data generated by component-level\ntesting and the system-level architectural models. Our approach uses local\nperformance data to identify deviations at the component level, and then\npropagate these deviations to the architectural model. We then use the\narchitectural model to predict regressions in the performance of the overall\nsystem. We evaluate our approach on two open-source benchmark systems and show\nthat it can effectively detect end-to-end system performance regressions from\nlocal performance deviations with different intensities and under various\nsystem workloads. More importantly, our approach can detect regressions as\nearly as in the development phase, in contrast to existing approaches that\nrequire the system to be fully built and deployed. Our approach is lightweight\nand can complement traditional system performance testing when testing\nresources are scarce.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}