{"id":"2408.07037","title":"PathInsight: Instruction Tuning of Multimodal Datasets and Models for\n  Intelligence Assisted Diagnosis in Histopathology","authors":"Xiaomin Wu, Rui Xu, Pengchen Wei, Wenkang Qin, Peixiang Huang, Ziheng\n  Li, Lin Luo","authorsParsed":[["Wu","Xiaomin",""],["Xu","Rui",""],["Wei","Pengchen",""],["Qin","Wenkang",""],["Huang","Peixiang",""],["Li","Ziheng",""],["Luo","Lin",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:05:06 GMT"}],"updateDate":"2024-08-14","timestamp":1723568706000,"abstract":"  Pathological diagnosis remains the definitive standard for identifying\ntumors. The rise of multimodal large models has simplified the process of\nintegrating image analysis with textual descriptions. Despite this advancement,\nthe substantial costs associated with training and deploying these complex\nmultimodal models, together with a scarcity of high-quality training datasets,\ncreate a significant divide between cutting-edge technology and its application\nin the clinical setting. We had meticulously compiled a dataset of\napproximately 45,000 cases, covering over 6 different tasks, including the\nclassification of organ tissues, generating pathology report descriptions, and\naddressing pathology-related questions and answers. We have fine-tuned\nmultimodal large models, specifically LLaVA, Qwen-VL, InternLM, with this\ndataset to enhance instruction-based performance. We conducted a qualitative\nassessment of the capabilities of the base model and the fine-tuned model in\nperforming image captioning and classification tasks on the specific dataset.\nThe evaluation results demonstrate that the fine-tuned model exhibits\nproficiency in addressing typical pathological questions. We hope that by\nmaking both our models and datasets publicly available, they can be valuable to\nthe medical and research communities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}