{"id":"2408.07197","title":"Hybrid Magnonics with Localized Spoof Surface Plasmon Polaritons","authors":"Yuzan Xiong, Andrew Christy, Zixin Yan, Amin Pishehvar, Muntasir\n  Mahdi, Junming Wu, James F. Cahoon, Binbin Yang, Michael C. Hamilton, Xufeng\n  Zhang, Wei Zhang","authorsParsed":[["Xiong","Yuzan",""],["Christy","Andrew",""],["Yan","Zixin",""],["Pishehvar","Amin",""],["Mahdi","Muntasir",""],["Wu","Junming",""],["Cahoon","James F.",""],["Yang","Binbin",""],["Hamilton","Michael C.",""],["Zhang","Xufeng",""],["Zhang","Wei",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 20:33:56 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 18:35:58 GMT"}],"updateDate":"2024-09-04","timestamp":1723581236000,"abstract":"  Hybrid magnonic systems have emerged as a promising direction for information\npropagation with preserved coherence. Due to high tunability of magnons, their\ninteractions with microwave photons can be engineered to probe novel phenomena\nbased on strong photon-magnon coupling. Improving the photon-magnon coupling\nstrength can be done by tuning the structure of microwave resonators to better\ninteract with the magnon counterpart. Planar resonators have been explored due\nto their potential for on-chip integration, but only common modes from\nstripline-based resonators have been used. Here, we present a microwave spiral\nresonator supporting the spoof localized surface plasmons (LSPs) and implement\nit to the investigation of photon-magnon coupling for hybrid magnonic\napplications. We showcase strong magnon-LSP photon coupling using a\nferrimagnetic yttrium iron garnet sphere. We discuss the dependence of the\nspiral resonator design to the engineering capacity of the photon mode\nfrequency and spatial field distributions, via both experiment and simulation.\nBy the localized photon mode profiles, the resulting magnetic field\nconcentrates near the surface dielectrics, giving rise to an enhanced magnetic\nfilling factor. The strong coupling and large engineering space render the\nspoof LSPs an interesting contender in developing novel hybrid magnonic systems\nand functionalities.\n","subjects":["Condensed Matter/Materials Science","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}