{"id":"2408.07539","title":"Cross-aware Early Fusion with Stage-divided Vision and Language\n  Transformer Encoders for Referring Image Segmentation","authors":"Yubin Cho, Hyunwoo Yu, Suk-ju Kang","authorsParsed":[["Cho","Yubin",""],["Yu","Hyunwoo",""],["Kang","Suk-ju",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:17:41 GMT"}],"updateDate":"2024-08-15","timestamp":1723641461000,"abstract":"  Referring segmentation aims to segment a target object related to a natural\nlanguage expression. Key challenges of this task are understanding the meaning\nof complex and ambiguous language expressions and determining the relevant\nregions in the image with multiple objects by referring to the expression.\nRecent models have focused on the early fusion with the language features at\nthe intermediate stage of the vision encoder, but these approaches have a\nlimitation that the language features cannot refer to the visual information.\nTo address this issue, this paper proposes a novel architecture, Cross-aware\nearly fusion with stage-divided Vision and Language Transformer encoders\n(CrossVLT), which allows both language and vision encoders to perform the early\nfusion for improving the ability of the cross-modal context modeling. Unlike\nprevious methods, our method enables the vision and language features to refer\nto each other's information at each stage to mutually enhance the robustness of\nboth encoders. Furthermore, unlike the conventional scheme that relies solely\non the high-level features for the cross-modal alignment, we introduce a\nfeature-based alignment scheme that enables the low-level to high-level\nfeatures of the vision and language encoders to engage in the cross-modal\nalignment. By aligning the intermediate cross-modal features in all encoder\nstages, this scheme leads to effective cross-modal fusion. In this way, the\nproposed approach is simple but effective for referring image segmentation, and\nit outperforms the previous state-of-the-art methods on three public\nbenchmarks.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LBIJY7TfMmdc1c7Q4QkWoRLJ4nbRE7rEUUr3Umv-unU","pdfSize":"30308797"}
