{"id":"2408.00341","title":"MAARS: Multi-Rate Attack-Aware Randomized Scheduling for Securing\n  Real-time Systems","authors":"Arkaprava Sain, Sunandan Adhikary, Ipsita Koley, Soumyajit Dey","authorsParsed":[["Sain","Arkaprava",""],["Adhikary","Sunandan",""],["Koley","Ipsita",""],["Dey","Soumyajit",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:25:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722497115000,"abstract":"  Modern Cyber-Physical Systems (CPSs) consist of numerous control units\ninterconnected by communication networks. Each control unit executes multiple\nsafety-critical and non-critical tasks in real-time. Most of the\nsafety-critical tasks are executed with a fixed sampling period to ensure\ndeterministic timing behaviour that helps in its safety and performance\nanalysis. However, adversaries can exploit this deterministic behaviour of\nsafety-critical tasks to launch inference-based-based attacks on them. This\npaper aims to prevent and minimize the possibility of such timing inference or\nschedule-based attacks to compromise the control units. This is done by\nswitching between strategically chosen execution rates of the safety-critical\ncontrol tasks such that their performance remains unhampered. Thereafter, we\npresent a novel schedule vulnerability analysis methodology to switch between\nvalid schedules generated for these multiple periodicities of the control tasks\nin run time. Utilizing these strategies, we introduce a novel Multi-Rate\nAttack-Aware Randomized Scheduling (MAARS) framework for preemptive\nfixed-priority schedulers that minimize the success rate of\ntiming-inference-based attacks on safety-critical real-time systems. To our\nknowledge, this is the first work to propose a schedule randomization method\nwith attack awareness that preserves both the control and scheduling aspects.\nThe efficacy of the framework in terms of attack prevention is finally\nevaluated on several automotive benchmarks in a Hardware-in-loop (HiL)\nenvironment.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Cryptography and Security","Computing Research Repository/Operating Systems","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}