{"id":"2408.04691","title":"Improving Relational Database Interactions with Large Language Models:\n  Column Descriptions and Their Impact on Text-to-SQL Performance","authors":"Niklas Wretblad, Oskar Holmstr\\\"om, Erik Larsson, Axel Wiks\\\"ater,\n  Oscar S\\\"oderlund, Hjalmar \\\"Ohman, Ture Pont\\'en, Martin Forsberg, Martin\n  S\\\"orme, Fredrik Heintz","authorsParsed":[["Wretblad","Niklas",""],["Holmström","Oskar",""],["Larsson","Erik",""],["Wiksäter","Axel",""],["Söderlund","Oscar",""],["Öhman","Hjalmar",""],["Pontén","Ture",""],["Forsberg","Martin",""],["Sörme","Martin",""],["Heintz","Fredrik",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 13:10:51 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 23:09:46 GMT"}],"updateDate":"2024-09-04","timestamp":1723122651000,"abstract":"  Relational databases often suffer from uninformative descriptors of table\ncontents, such as ambiguous columns and hard-to-interpret values, impacting\nboth human users and Text-to-SQL models. This paper explores the use of large\nlanguage models (LLMs) to generate informative column descriptions as a\nsemantic layer for relational databases. Using the BIRD-Bench development set,\nwe created ColSQL, a dataset with gold-standard column descriptions generated\nand refined by LLMs and human annotators. We evaluated several\ninstruction-tuned models, finding that GPT-4o and Command R+ excelled in\ngenerating high-quality descriptions. Additionally, we applied an\nLLM-as-a-judge to evaluate model performance. Although this method does not\nalign well with human evaluations, we included it to explore its potential and\nto identify areas for improvement. More work is needed to improve the\nreliability of automatic evaluations for this task. We also find that detailed\ncolumn descriptions significantly improve Text-to-SQL execution accuracy,\nespecially when columns are uninformative. This study establishes LLMs as\neffective tools for generating detailed metadata, enhancing the usability of\nrelational databases.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases"],"license":"http://creativecommons.org/licenses/by/4.0/"}