{"id":"2408.16347","title":"Desynchronization Index: a New Approach for Exploring Complex\n  Epileptogenic Networks in Stereoelectroencephalography","authors":"Federico Mason, Lorenzo Ferri, Lidia Di Vito, Lara Alvisi, Luca\n  Zanuttini, Matteo Martinoni, Roberto Mai, Francesco Cardinale, Paolo Tinuper,\n  Roberto Michelucci, Elena Pasini, Francesca Bisulli","authorsParsed":[["Mason","Federico",""],["Ferri","Lorenzo",""],["Di Vito","Lidia",""],["Alvisi","Lara",""],["Zanuttini","Luca",""],["Martinoni","Matteo",""],["Mai","Roberto",""],["Cardinale","Francesco",""],["Tinuper","Paolo",""],["Michelucci","Roberto",""],["Pasini","Elena",""],["Bisulli","Francesca",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 08:32:22 GMT"}],"updateDate":"2024-08-30","timestamp":1724920342000,"abstract":"  Stereoelectroencephalography (SEEG) is an invasive surgical procedure to\nrecord the electrical activities in cortical brain regions, aiming at\nidentifying the Epileptogenic Zone (EZ) in patients with drug-resistant\nepilepsy. To improve the accuracy of the EZ definition, SEEG analysis can be\nsupported by computational tools, among which the Epileptogenic Index (EI)\nrepresents the most common solution. However, the scientific community has\nstill not found an agreement on which quantitative biomarkers can characterize\nthe cortical sites within the EZ. In this work, we design a new algorithm,\nnamed Desynchronization Index (DI), to assist neurophysiologists in SEEG\ninterpretation. Our algorithm estimates the effective connectivity between\ncortical sites and hypothesizes that the EZ is identified by those sites\ngetting abnormally desynchronized from the network during the seizure\ngeneration. We test the proposed method over a SEEG dataset of 10 seizures,\ncomparing its accuracy in terms of EZ definition against the EI algorithm and\nclinical ground truth. Our results indicate that the DI algorithm underscores\nspecific connectivity dynamics that can hardly be identified with a pure visual\nanalysis, increasing sensitivity in detecting epileptogenic cortical sites.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SfHxpgPSwzpEcThp00qFlGaA8Yl-LkTvSF4h4sOmZbQ","pdfSize":"3325841"}
