{"id":"2408.11920","title":"Modular Hypernetworks for Scalable and Adaptive Deep MIMO Receivers","authors":"Tomer Raviv and Nir Shlezinger","authorsParsed":[["Raviv","Tomer",""],["Shlezinger","Nir",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 18:12:54 GMT"}],"updateDate":"2024-08-23","timestamp":1724263974000,"abstract":"  Deep neural networks (DNNs) were shown to facilitate the operation of uplink\nmultiple-input multiple-output (MIMO) receivers, with emerging architectures\naugmenting modules of classic receiver processing. Current designs consider\nstatic DNNs, whose architecture is fixed and weights are pre-trained. This\ninduces a notable challenge, as the resulting MIMO receiver is suitable for a\ngiven configuration, i.e., channel distribution and number of users, while in\npractice these parameters change frequently with network variations and users\nleaving and joining the network. In this work, we tackle this core challenge of\nDNN-aided MIMO receivers. We build upon the concept of hypernetworks,\naugmenting the receiver with a pre-trained deep model whose purpose is to\nupdate the weights of the DNN-aided receiver upon instantaneous channel\nvariations. We design our hypernetwork to augment modular deep receivers,\nleveraging their modularity to have the hypernetwork adapt not only the\nweights, but also the architecture. Our modular hypernetwork leads to a\nDNN-aided receiver whose architecture and resulting complexity adapts to the\nnumber of users, in addition to channel variations, without retraining. Our\nnumerical studies demonstrate superior error-rate performance of modular\nhypernetworks in time-varying channels compared to static pre-trained\nreceivers, while providing rapid adaptivity and scalability to network\nvariations.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}