{"id":"2408.10519","title":"Almost Optimal Algorithms for Token Collision in Anonymous Networks","authors":"Sirui Bai, Xinyu Fu, Xudong Wu, Penghui Yao, Chaodong Zheng","authorsParsed":[["Bai","Sirui",""],["Fu","Xinyu",""],["Wu","Xudong",""],["Yao","Penghui",""],["Zheng","Chaodong",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:37:47 GMT"}],"updateDate":"2024-08-21","timestamp":1724125067000,"abstract":"  In distributed systems, situations often arise where some nodes each holds a\ncollection of tokens, and all nodes collectively need to determine whether all\ntokens are distinct. For example, if each token represents a logged-in user,\nthe problem corresponds to checking whether there are duplicate logins.\nSimilarly, if each token represents a data object or a timestamp, the problem\ncorresponds to checking whether there are conflicting operations in distributed\ndatabases. In distributed computing theory, unique identifiers generation is\nalso related to this problem: each node generates one token, which is its\nidentifier, then a verification phase is needed to ensure all identifiers are\nunique.\n  In this paper, we formalize and initiate the study of token collision. In\nthis problem, a collection of $k$ tokens, each represented by some length-$L$\nbit string, are distributed to $n$ nodes of an anonymous CONGEST network in an\narbitrary manner. The nodes need to determine whether there are tokens with an\nidentical value. We present near optimal deterministic algorithms for the token\ncollision problem with $\\tilde{O}(D+k\\cdot L/\\log{n})$ round complexity, where\n$D$ denotes the network diameter. Besides high efficiency, the prior knowledge\nrequired by our algorithms is also limited. For completeness, we further\npresent a near optimal randomized algorithm for token collision.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"P_hX9COkFuorJjMFM3N2_nOYXOeufJmV8mOTvbnJiqQ","pdfSize":"793713"}
