{"id":"2408.12509","title":"Commensurate and Incommensurate Chern Insulators in Magic-angle Bilayer\n  Graphene","authors":"Zaizhe Zhang, Jingxin Yang, Bo Xie, Zuo Feng, Shu Zhang, Kenji\n  Watanabe, Takashi Taniguchi, Xiaoxia Yang, Qing Dai, Tao Liu, Donghua Liu,\n  Kaihui Liu, Zhida Song, Jianpeng Liu and Xiaobo Lu","authorsParsed":[["Zhang","Zaizhe",""],["Yang","Jingxin",""],["Xie","Bo",""],["Feng","Zuo",""],["Zhang","Shu",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Yang","Xiaoxia",""],["Dai","Qing",""],["Liu","Tao",""],["Liu","Donghua",""],["Liu","Kaihui",""],["Song","Zhida",""],["Liu","Jianpeng",""],["Lu","Xiaobo",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:07:46 GMT"}],"updateDate":"2024-08-23","timestamp":1724342866000,"abstract":"  The interplay between strong electron-electron interaction and symmetry\nbreaking can have profound influence on the topological properties of\nmaterials. In magic angle twisted bilayer graphene (MATBG), the flat band with\na single SU(4) flavor associated with the spin and valley degrees of freedom\ngains non-zero Chern number when C2z symmetry or C2zT symmetry is broken.\nElectron-electron interaction can further lift the SU(4) degeneracy, leading to\nthe Chern insulator states. Here we report a complete sequence of zero-field\nChern insulators at all odd integer fillings (v = +-1, +-3) with different\nchirality (C = 1 or -1) in hBN aligned MATBG which structurally breaks C2z\nsymmetry. The Chern states at hole fillings (v = -1, -3), which are firstly\nobserved in this work, host an opposite chirality compared with the electron\nfilling scenario. By slightly doping the v = +-3 states, we have observed new\ncorrelated insulating states at incommensurate moir\\'e fillings which is highly\nsuggested to be intrinsic Wigner crystals according to our theoretical\ncalculations. Remarkably, we have observed prominent Streda-formula violation\naround v = -3 state. By doping the Chern gap at v = -3 with notable number of\nelectrons at finite magnetic field, the Hall resistance Ryx robustly quantizes\nto ~ h/e2 whereas longitudinal resistance Rxx vanishes, indicating that the\nchemical potential is pinned within a Chern gap, forming an incommensurate\nChern insulator. By providing the first experimental observation of zero-field\nChern insulators in the flat valence band, our work fills up the overall\ntopological framework of MATBG with broken C2z symmetry. Our findings also\ndemonstrate that doped topological flat band is an ideal platform to\ninvestigate exotic incommensurate correlated topological states.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}