{"id":"2408.13087","title":"Turbulent convection in emulsions: the Rayleigh-B\\'enard configuration","authors":"Abbas Moradi Bilondi, Nicol\\`o Scapin, Luca Brandt, Parisa Mirbod","authorsParsed":[["Bilondi","Abbas Moradi",""],["Scapin","Nicolò",""],["Brandt","Luca",""],["Mirbod","Parisa",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:14:02 GMT"}],"updateDate":"2024-08-26","timestamp":1724422442000,"abstract":"  This study explores heat and turbulent modulation in three-dimensional\nmultiphase Rayleigh-B\\'enard convection using direct numerical simulations. Two\nimmiscible fluids with identical reference density undergo systematic\nvariations in dispersed-phase volume fractions, $0.0 \\leq \\Upphi \\leq 0.5$, and\nratios of dynamic viscosity, $\\lambda_{\\mu}$, and thermal diffusivity,\n$\\lambda_{\\alpha}$, within the range $[0.1-10]$. The Rayleigh, Prandtl, Weber,\nand Froude numbers are held constant at $10^8$, $4$, $6000$, and $1$,\nrespectively. Initially, when both fluids share the same properties, a 10\\%\nNusselt number increase is observed at the highest volume fractions. In this\ncase, despite a reduction in turbulent kinetic energy, droplets enhance energy\ntransfer to smaller scales, smaller than those of single-phase flow, promoting\nlocal mixing. By varying viscosity ratios, while maintaining a constant\nRayleigh number based on the average mixture properties, the global heat\ntransfer rises by approximately 25\\% at $\\Upphi=0.2$ and $\\lambda_{\\mu}=10$.\nThis is attributed to increased small-scale mixing and turbulence in the less\nviscous carrier phase. In addition, a dispersed phase with higher thermal\ndiffusivity results in a 50\\% reduction in the Nusselt number compared to the\nsingle-phase counterpart, owing to faster heat conduction and reduced droplet\npresence near walls. The study also addresses droplet-size distributions,\nconfirming two distinct ranges dominated by coalescence and breakup with\ndifferent scaling laws.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}