{"id":"2408.13007","title":"A weakly-modeled search for compact binary coalescences in Einstein\n  Telescope","authors":"Adrian Macquet, Tito Dal Canton, Tania Regimbau","authorsParsed":[["Macquet","Adrian",""],["Canton","Tito Dal",""],["Regimbau","Tania",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:50:58 GMT"}],"updateDate":"2024-08-26","timestamp":1724413858000,"abstract":"  Einstein Telescope (ET) is a project of third generation gravitational wave\n(GW) detector with a planned sensitivity 10 times better than current detectors\nsuch as Advanced LIGO and Advanced Virgo. The high rate of GW signals expected\nin the data will pose several data analysis challenges, like the ability to\ndisentangle overlapping signals or the need to dimension the computational\nresources required to treat all the candidate events. We explore the behaviour\nand the performances of a data analysis pipeline designed to search for\nunmodelled GW signals with duration 1 to 1000 s on a mock dataset that consists\nof 1 month of data following ET design sensitivity on top of which is added a\nrealistic distribution of compact binary coalescence (CBC) signals. Unmodelled\nsearches are intrinsically less sensitive to CBC signals than template-based\nsearches, but are computationally cheaper and more robust to uncertainties in\nthe waveforms. This search recovers 38% of the total number of injected binary\nblack hole (BBH) signals, including 89% of the systems with a total mass above\n100 solar masses, as well as the majority of binary neutron star (BNS) signals\ncloser than 850 Mpc (z = 0.17). It is also able to estimate the chirp mass of\nthe recovered BNS with an average precision of 1.3%. Therefore, we show that\nthis unmodelled search is able to detect a substantial amount of CBC events at\na relatively low computational cost, which makes it interesting for low latency\nanalyses and independent validation of detections made by matched filtering\npipelines. We also find that the presence of many CBC signals only marginally\nimpacts the sensitivity of the search to other kinds of unmodelled long\nduration transient signals, by 3% in average.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"r-_Ch5PlywbjlcoQV3Nb75bSiOvqZXGP_RUBWvrZBzU","pdfSize":"760407"}
