{"id":"2408.00257","title":"RoCo:Robust Collaborative Perception By Iterative Object Matching and\n  Pose Adjustment","authors":"Zhe Huang, Shuo Wang, Yongcai Wang, Wanting Li, Deying Li, Lei Wang","authorsParsed":[["Huang","Zhe",""],["Wang","Shuo",""],["Wang","Yongcai",""],["Li","Wanting",""],["Li","Deying",""],["Wang","Lei",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 03:29:33 GMT"}],"updateDate":"2024-08-02","timestamp":1722482973000,"abstract":"  Collaborative autonomous driving with multiple vehicles usually requires the\ndata fusion from multiple modalities. To ensure effective fusion, the data from\neach individual modality shall maintain a reasonably high quality. However, in\ncollaborative perception, the quality of object detection based on a modality\nis highly sensitive to the relative pose errors among the agents. It leads to\nfeature misalignment and significantly reduces collaborative performance. To\naddress this issue, we propose RoCo, a novel unsupervised framework to conduct\niterative object matching and agent pose adjustment. To the best of our\nknowledge, our work is the first to model the pose correction problem in\ncollaborative perception as an object matching task, which reliably associates\ncommon objects detected by different agents. On top of this, we propose a graph\noptimization process to adjust the agent poses by minimizing the alignment\nerrors of the associated objects, and the object matching is re-done based on\nthe adjusted agent poses. This process is carried out iteratively until\nconvergence. Experimental study on both simulated and real-world datasets\ndemonstrates that the proposed framework RoCo consistently outperforms existing\nrelevant methods in terms of the collaborative object detection performance,\nand exhibits highly desired robustness when the pose information of agents is\nwith high-level noise. Ablation studies are also provided to show the impact of\nits key parameters and components. The code is released at\nhttps://github.com/HuangZhe885/RoCo.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"IrFhJ4RnZb6OJP-y-Ln7YSYMiH3jCS-GHQ0ePOLVP68","pdfSize":"13703589"}
