{"id":"2408.10775","title":"Generative AI in Industrial Machine Vision -- A Review","authors":"Hans Aoyang Zhou, Dominik Wolfschl\\\"ager, Constantinos Florides, Jonas\n  Werheid, Hannes Behnen, Jan-Henrick Woltersmann, Tiago C. Pinto, Marco\n  Kemmerling, Anas Abdelrazeq, Robert H. Schmitt","authorsParsed":[["Zhou","Hans Aoyang",""],["Wolfschläger","Dominik",""],["Florides","Constantinos",""],["Werheid","Jonas",""],["Behnen","Hannes",""],["Woltersmann","Jan-Henrick",""],["Pinto","Tiago C.",""],["Kemmerling","Marco",""],["Abdelrazeq","Anas",""],["Schmitt","Robert H.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 12:14:18 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 12:28:21 GMT"}],"updateDate":"2024-08-22","timestamp":1724156058000,"abstract":"  Machine vision enhances automation, quality control, and operational\nefficiency in industrial applications by enabling machines to interpret and act\non visual data. While traditional computer vision algorithms and approaches\nremain widely utilized, machine learning has become pivotal in current research\nactivities. In particular, generative AI demonstrates promising potential by\nimproving pattern recognition capabilities, through data augmentation,\nincreasing image resolution, and identifying anomalies for quality control.\nHowever, the application of generative AI in machine vision is still in its\nearly stages due to challenges in data diversity, computational requirements,\nand the necessity for robust validation methods. A comprehensive literature\nreview is essential to understand the current state of generative AI in\nindustrial machine vision, focusing on recent advancements, applications, and\nresearch trends. Thus, a literature review based on the PRISMA guidelines was\nconducted, analyzing over 1,200 papers on generative AI in industrial machine\nvision. Our findings reveal various patterns in current research, with the\nprimary use of generative AI being data augmentation, for machine vision tasks\nsuch as classification and object detection. Furthermore, we gather a\ncollection of application challenges together with data requirements to enable\na successful application of generative AI in industrial machine vision. This\noverview aims to provide researchers with insights into the different areas and\napplications within current research, highlighting significant advancements and\nidentifying opportunities for future work.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}