{"id":"2408.15772","title":"220 GHz Urban Microcell Channel Measurement and Characterization on a\n  University Campus","authors":"Yuanbo Li, Yiqin Wang, Yejian Lyu, Ziming Yu, Chong Han","authorsParsed":[["Li","Yuanbo",""],["Wang","Yiqin",""],["Lyu","Yejian",""],["Yu","Ziming",""],["Han","Chong",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:09:29 GMT"}],"updateDate":"2024-08-29","timestamp":1724850569000,"abstract":"  Owning abundant bandwidth resources, the Terahertz (THz) band (0.1-10~THz) is\nenvisioned as a key technology to realize ultra-high-speed communications in 6G\nand beyond wireless networks. To realize reliable THz communications in urban\nmicrocell (UMi) environments, propagation analysis and channel characterization\nare still insufficient. In this paper, channel measurement campaigns are\nconducted in a UMi scenario at 220~GHz, using a correlation-based time domain\nchannel sounder. 24 positions are measured along a road on the university\ncampus, with distances ranging from 34~m to 410~m. Based on the measurement\nresults, the spatial consistency and interaction of THz waves to the\nsurrounding environments are analyzed. Moreover, the additional loss due to\nfoliage blockage is calculated and an average value of 16.7~dB is observed.\nFurthermore, a full portrait of channel characteristics, including path loss,\nshadow fading, K-factor, delay and angular spreads, as well as cluster\nparameters, is calculated and analyzed. Specifically, an average K-factor value\nof 17.5 dB is measured in the line-of-sight (LoS) case, which is nearly two\ntimes larger than the extrapolated values from the 3GPP standard, revealing\nweak multipath effects in the THz band. Additionally, 2.5 clusters on average\nare observed in the LoS case, around one fifth of what is defined in the 3GPP\nmodel, which uncovers the strong sparsity in THz UMi. The results and analysis\nin this work can offer guidance for system design for future THz UMi networks.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}