{"id":"2408.01103","title":"Inverse Raman scattering and the diffuse interstellar bands: an\n  exploration of the systemic interconnections between spontaneous and inverse\n  Raman scattering and extended red emission, Red Rectangle bands, and diffuse\n  interstellar bands","authors":"Frederic Zagury","authorsParsed":[["Zagury","Frederic",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 08:28:49 GMT"}],"updateDate":"2024-08-05","timestamp":1722587329000,"abstract":"  First identified in 1964, inverse Raman scattering (IRS) is a nonlinear\nstimulated phenomenon that induces Raman scattered absorptions where Raman\nemissions would be expected. While IRS is less well-known than stimulated Raman\nscattering (SRS) and coherent anti-Stokes Raman scattering (CARS), this study\nhighlights its significance in analyzing the spectra of stars located in the\ndistant background of HI interstellar clouds. Specifically, ultraviolet\nemission lines Raman scattered by atomic hydrogen, typically observed in\nemission at wide scattering angles in the optical spectra of symbiotic stars\nand nebulae, should appear as IRS absorption features in the optical spectra of\nthe background stars. I show that all known interstellar Raman scattered\nemission lines in the H-alpha wavelength region are detected in absorption as\ndiffuse interstellar bands (DIBs) in the spectra of reddened stars, and\nconclude that IRS by atomic hydrogen resolves the longstanding puzzle of the\nprocesses involved in producing these bands, and perhaps also explains the\nequally mysterious 2200A bump of ultraviolet extinction curves. This\nidentification of DIBs as IRS HI absorptions sheds new light on the perplexing\nrelationship between DIBs and the Red Rectangle nebula emission bands (RRBs).\n  The conditions under which DIBs are detected highlight the importance of\nconsidering the physical relationship between the observer, the HI medium, and\nthe direction of the illuminating radiation field (i.e., the geometry of the\nobservation) in observations of HI interstellar matter. Observing in the\ndirection of the radiation field or on its side determines whether IRS,\nyielding DIBs and the 2200A bump, or spontaneous Raman scattering at wide\nscattering angles, resulting in ERE, Raman scattered emission lines (including\nRRBs), and the unidentified infrared bands, will be observed.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8d_ibQZ8HVcT-yCdJqYlBb5p42SYKhWe2120ExEXNoY","pdfSize":"625910"}
