{"id":"2408.14886","title":"The VoxCeleb Speaker Recognition Challenge: A Retrospective","authors":"Jaesung Huh, Joon Son Chung, Arsha Nagrani, Andrew Brown, Jee-weon\n  Jung, Daniel Garcia-Romero and Andrew Zisserman","authorsParsed":[["Huh","Jaesung",""],["Chung","Joon Son",""],["Nagrani","Arsha",""],["Brown","Andrew",""],["Jung","Jee-weon",""],["Garcia-Romero","Daniel",""],["Zisserman","Andrew",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:57:31 GMT"}],"updateDate":"2024-08-28","timestamp":1724749051000,"abstract":"  The VoxCeleb Speaker Recognition Challenges (VoxSRC) were a series of\nchallenges and workshops that ran annually from 2019 to 2023. The challenges\nprimarily evaluated the tasks of speaker recognition and diarisation under\nvarious settings including: closed and open training data; as well as\nsupervised, self-supervised, and semi-supervised training for domain\nadaptation. The challenges also provided publicly available training and\nevaluation datasets for each task and setting, with new test sets released each\nyear. In this paper, we provide a review of these challenges that covers: what\nthey explored; the methods developed by the challenge participants and how\nthese evolved; and also the current state of the field for speaker verification\nand diarisation. We chart the progress in performance over the five\ninstallments of the challenge on a common evaluation dataset and provide a\ndetailed analysis of how each year's special focus affected participants'\nperformance. This paper is aimed both at researchers who want an overview of\nthe speaker recognition and diarisation field, and also at challenge organisers\nwho want to benefit from the successes and avoid the mistakes of the VoxSRC\nchallenges. We end with a discussion of the current strengths of the field and\nopen challenges. Project page :\nhttps://mm.kaist.ac.kr/datasets/voxceleb/voxsrc/workshop.html\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}