{"id":"2408.12200","title":"An image-based blind search for Fast Radio Bursts in 88 hours of data\n  from the EoR0 Field, with the Murchison Widefield Array","authors":"Ian Kemp, Steven Tingay, Stuart Midgley and Daniel Mitchell","authorsParsed":[["Kemp","Ian",""],["Tingay","Steven",""],["Midgley","Stuart",""],["Mitchell","Daniel",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:22:06 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 04:18:40 GMT"}],"updateDate":"2024-09-06","timestamp":1724314926000,"abstract":"  This work is part of ongoing efforts to detect Fast Radio Bursts (FRBs) using\nthe Murchison Widefield Array (MWA) in a spectral window below 300 MHz. We used\nan image-based method based on the pilot study of Tingay et al. 2015, scaled up\nvia massively parallel processing using a commercial supercomputer. We searched\n87.6 hours of 2-second snapshot images, each covering 1165 square degrees of\nthe EoR0 field, over a dispersion measure range of 170 to 1035 pc cm$^{-3}$.\nThe large amount of data necessitated the construction of a series of filters\nto classify and reject the large number of false positives. Our search was more\nsensitive than any previous blind search using the MWA telescope, but we report\nno FRB detections, a result which is consistent with the extrapolation into the\nlow-frequency domain of the results of Sokolowski et al. (2024). We obtain\nupper bounds on the event rate ranging from <1783 sky$^{-1}$day$^{-1}$ at a\nfluence of 392 Jy ms, to <31 sky$^{-1}$day$^{-1}$ at 8400 Jy ms, for our\nspectral window of 167-198 MHz. Our method was shown to be computationally\nefficient and scalable by the two or three orders of magnitude required to\nseriously test the model of Sokolowski et al. Our process is especially\nsensitive to detections of satellites and meteor trails and may find\napplications in the identification of these transients. We comment on future\nsurveys using this method, with both the MWA and the SKA.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-s_-BGhnZM-eoVZzXnKulvxpTLqdHTiQbGm5icWeris","pdfSize":"1116850"}
