{"id":"2408.08076","title":"Low Thermal Resistance of Diamond-AlGaN Interfaces Achieved Using\n  Carbide Interlayers","authors":"Henry T. Aller, Thomas W. Pfeifer, Abdullah Mamun, Kenny Huynh, Marko\n  Tadjer, Tatyana Feygelson, Karl Hobart, Travis Anderson, Bradford Pate, Alan\n  Jacobs, James Spencer Lundh, Mark Goorsky, Asif Khan, Patrick Hopkins, Samuel\n  Graham","authorsParsed":[["Aller","Henry T.",""],["Pfeifer","Thomas W.",""],["Mamun","Abdullah",""],["Huynh","Kenny",""],["Tadjer","Marko",""],["Feygelson","Tatyana",""],["Hobart","Karl",""],["Anderson","Travis",""],["Pate","Bradford",""],["Jacobs","Alan",""],["Lundh","James Spencer",""],["Goorsky","Mark",""],["Khan","Asif",""],["Hopkins","Patrick",""],["Graham","Samuel",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:03:03 GMT"}],"updateDate":"2024-08-16","timestamp":1723719783000,"abstract":"  This study investigates thermal transport across nanocrystalline\ndiamond/AlGaN interfaces, crucial for enhancing thermal management in\nAlGaN/AlGaN-based devices. Chemical vapor deposition growth of diamond directly\non AlGaN resulted in a disordered interface with a high thermal boundary\nresistance (TBR) of 20.6 m^2-K/GW. We employed sputtered carbide interlayers\n(e.g., $B_4C$, $SiC$, $B_4C/SiC$) to reduce thermal boundary resistance in\ndiamond/AlGaN interfaces. The carbide interlayers resulted in record-low\nthermal boundary resistance values of 3.4 and 3.7 m^2-K/GW for\nAl$_{0.65}$Ga$_{0.35}$N samples with $B_4C$ and $SiC$ interlayers,\nrespectively. STEM imaging of the interface reveals interlayer thicknesses\nbetween 1.7-2.5 nm, with an amorphous structure. Additionally, Fast-Fourier\nTransform (FFT) characterization of sections of the STEM images displayed sharp\ncrystalline fringes in the AlGaN layer, confirming it was properly protected\nfrom damage from hydrogen plasma during the diamond growth. In order to\naccurately measure the thermal boundary resistance we develop a hybrid\ntechnique, combining time-domain thermoreflectance and steady-state\nthermoreflectance fitting, offering superior sensitivity to buried thermal\nresistances. Our findings underscore the efficacy of interlayer engineering in\nenhancing thermal transport and demonstrate the importance of innovative\nmeasurement techniques in accurately characterizing complex thermal interfaces.\nThis study provides a foundation for future research in improving thermal\nproperties of semiconductor devices through interface engineering and advanced\nmeasurement methodologies.\n","subjects":["Condensed Matter/Materials Science","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}