{"id":"2408.06096","title":"Rota-Baxter operators, differential operators, pre- and Novikov\n  structures on groups and Lie algebras","authors":"Xing Gao, Li Guo, Zongjian Han and Yi Zhang","authorsParsed":[["Gao","Xing",""],["Guo","Li",""],["Han","Zongjian",""],["Zhang","Yi",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 12:29:37 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 12:13:57 GMT"}],"updateDate":"2024-08-15","timestamp":1723465777000,"abstract":"  Rota-Baxter operators on various structures have found important applications\nin diverse areas, from renormalization of quantum field theory to Yang-Baxter\nequations. Relative Rota-Baxter operators on Lie algebras are closely related\nto pre-Lie algebras and post-Lie algebras. Some of their group counterparts\nhave been introduced to study post-groups, skew left braces and set-theoretic\nsolutions of Yang-Baxter equations, but searching suitable notions of relative\nRota-Baxter operators on groups with weight zero and pre-groups has been\nchallenging and has been the focus of recent studies, by provisionally imposing\nan abelian condition.\n  Arising from the works of Balinsky-Novikov and Gelfand-Dorfman, Novikov\nalgebras and their constructions from differential commutative algebras have\nled to broad applications. Finding their suitable counterparts for groups and\nLie algebras has also attracted quite much recent attention.\n  This paper uses one-sided-inverse pairs of maps to give a perturbative\napproach to a general notion of relative Rota-Baxter operators and differential\noperators on a group and a Lie algebra with limit-weight. With the extra\ncondition of limit-abelianess on the group or Lie algebra, we give an\ninterpretation of relative Rota-Baxter and differential operators with weight\nzero. These operators motivate us to define pre-groups and Novikov groups\nrespectively as the induced structures. The tangent maps of these operators are\nshown to give Rota-Baxter and differential operators with weight zero on Lie\nalgebras. The tangent spaces of the pre-Lie and Novikov Lie groups are pre-Lie\nalgebras and Novikov Lie algebras, fulfilling the expected property.\nFurthermore, limit-weight relative Rota-Baxter operators on groups give rise to\nskew left braces and then set-theoretic solutions of the Yang-Baxter equation.\n","subjects":["Mathematics/Quantum Algebra","Mathematics/Group Theory","Mathematics/Rings and Algebras"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}