{"id":"2408.08080","title":"Assessing the properties of the prediction interval in random-effects\n  meta-analysis","authors":"Peter Matrai, Tamas Koi, Zoltan Sipos, Nelli Farkas","authorsParsed":[["Matrai","Peter",""],["Koi","Tamas",""],["Sipos","Zoltan",""],["Farkas","Nelli",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 11:12:53 GMT"}],"updateDate":"2024-08-16","timestamp":1723720373000,"abstract":"  Random effects meta-analysis is a widely applied methodology to synthetize\nresearch findings of studies in a specific scientific question. Besides\nestimating the mean effect, an important aim of the meta-analysis is to\nsummarize the heterogeneity, i.e. the variation in the underlying effects\ncaused by the differences in study circumstances. The prediction interval is\nfrequently used for this purpose: a 95% prediction interval contains the true\neffect of a similar new study in 95% of the cases when it is constructed, or in\nother words, it covers 95% of the true effects distribution on average. In this\narticle, after providing a clear mathematical background, we present an\nextensive simulation investigating the performance of all frequentist\nprediction interval methods published to date. The work focuses on the\ndistribution of the coverage probabilities and how these distributions change\ndepending on the amount of heterogeneity and the number of involved studies.\nAlthough the single requirement that a prediction interval has to fulfill is to\nkeep a nominal coverage probability on average, we demonstrate why the\ndistribution of coverages cannot be disregarded, and that for small number of\nstudies no reliable conclusion can be drawn from the prediction interval. We\nargue that assessing only the mean coverage can easily lead to misunderstanding\nand misinterpretation. The length of the intervals and the robustness of the\nmethods concerning non-normality of the true effects are also investigated.\n","subjects":["Statistics/Applications","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"lL13-1Yysy-VvTaveqLl9dW3E1YmVFFNxeddZs4lStM","pdfSize":"2297598"}
