{"id":"2408.16562","title":"Beyond MR Image Harmonization: Resolution Matters Too","authors":"Savannah P. Hays, Samuel W. Remedios, Lianrui Zuo, Ellen M. Mowry,\n  Scott D. Newsome, Peter A. Calabresi, Aaron Carass, Blake E. Dewey, Jerry L.\n  Prince","authorsParsed":[["Hays","Savannah P.",""],["Remedios","Samuel W.",""],["Zuo","Lianrui",""],["Mowry","Ellen M.",""],["Newsome","Scott D.",""],["Calabresi","Peter A.",""],["Carass","Aaron",""],["Dewey","Blake E.",""],["Prince","Jerry L.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 14:30:17 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 13:19:57 GMT"}],"updateDate":"2024-09-02","timestamp":1724941817000,"abstract":"  Magnetic resonance (MR) imaging is commonly used in the clinical setting to\nnon-invasively monitor the body. There exists a large variability in MR imaging\ndue to differences in scanner hardware, software, and protocol design. Ideally,\na processing algorithm should perform robustly to this variability, but that is\nnot always the case in reality. This introduces a need for image harmonization\nto overcome issues of domain shift when performing downstream analysis such as\nsegmentation. Most image harmonization models focus on acquisition parameters\nsuch as inversion time or repetition time, but they ignore an important aspect\nin MR imaging -- resolution. In this paper, we evaluate the impact of image\nresolution on harmonization using a pretrained harmonization algorithm. We\nsimulate 2D acquisitions of various slice thicknesses and gaps from 3D\nacquired, 1mm3 isotropic MR images and demonstrate how the performance of a\nstate-of-the-art image harmonization algorithm varies as resolution changes. We\ndiscuss the most ideal scenarios for image resolution including acquisition\norientation when 3D imaging is not available, which is common for many clinical\nscanners. Our results show that harmonization on low-resolution images does not\naccount for acquisition resolution and orientation variations. Super-resolution\ncan be used to alleviate resolution variations but it is not always used. Our\nmethodology can generalize to help evaluate the impact of image acquisition\nresolution for multiple tasks. Determining the limits of a pretrained algorithm\nis important when considering preprocessing steps and trust in the results.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}