{"id":"2408.16286","title":"Near-Optimal Policy Identification in Robust Constrained Markov Decision\n  Processes via Epigraph Form","authors":"Toshinori Kitamura, Tadashi Kozuno, Wataru Kumagai, Kenta Hoshino,\n  Yohei Hosoe, Kazumi Kasaura, Masashi Hamaya, Paavo Parmas, Yutaka Matsuo","authorsParsed":[["Kitamura","Toshinori",""],["Kozuno","Tadashi",""],["Kumagai","Wataru",""],["Hoshino","Kenta",""],["Hosoe","Yohei",""],["Kasaura","Kazumi",""],["Hamaya","Masashi",""],["Parmas","Paavo",""],["Matsuo","Yutaka",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:37:16 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 10:56:20 GMT"}],"updateDate":"2024-09-04","timestamp":1724913436000,"abstract":"  Designing a safe policy for uncertain environments is crucial in real-world\ncontrol applications. However, this challenge remains inadequately addressed\nwithin the Markov decision process (MDP) framework. This paper presents the\nfirst algorithm capable of identifying a near-optimal policy in a robust\nconstrained MDP (RCMDP), where an optimal policy minimizes cumulative cost\nwhile satisfying constraints in the worst-case scenario across a set of\nenvironments. We first prove that the conventional Lagrangian max-min\nformulation with policy gradient methods can become trapped in suboptimal\nsolutions by encountering a sum of conflicting gradients from the objective and\nconstraint functions during its inner minimization problem. To address this, we\nleverage the epigraph form of the RCMDP problem, which resolves the conflict by\nselecting a single gradient from either the objective or the constraints.\nBuilding on the epigraph form, we propose a binary search algorithm with a\npolicy gradient subroutine and prove that it identifies an\n$\\varepsilon$-optimal policy in an RCMDP with\n$\\tilde{\\mathcal{O}}(\\varepsilon^{-4})$ policy evaluations.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}