{"id":"2408.11865","title":"How Susceptible are LLMs to Influence in Prompts?","authors":"Sotiris Anagnostidis, Jannis Bulian","authorsParsed":[["Anagnostidis","Sotiris",""],["Bulian","Jannis",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 17:40:52 GMT"}],"updateDate":"2024-08-23","timestamp":1723916452000,"abstract":"  Large Language Models (LLMs) are highly sensitive to prompts, including\nadditional context provided therein. As LLMs grow in capability, understanding\ntheir prompt-sensitivity becomes increasingly crucial for ensuring reliable and\nrobust performance, particularly since evaluating these models becomes more\nchallenging. In this work, we investigate how current models (Llama, Mixtral,\nFalcon) respond when presented with additional input from another model,\nmimicking a scenario where a more capable model -- or a system with access to\nmore external information -- provides supplementary information to the target\nmodel. Across a diverse spectrum of question-answering tasks, we study how an\nLLM's response to multiple-choice questions changes when the prompt includes a\nprediction and explanation from another model. Specifically, we explore the\ninfluence of the presence of an explanation, the stated authoritativeness of\nthe source, and the stated confidence of the supplementary input. Our findings\nreveal that models are strongly influenced, and when explanations are provided\nthey are swayed irrespective of the quality of the explanation. The models are\nmore likely to be swayed if the input is presented as being authoritative or\nconfident, but the effect is small in size. This study underscores the\nsignificant prompt-sensitivity of LLMs and highlights the potential risks of\nincorporating outputs from external sources without thorough scrutiny and\nfurther validation. As LLMs continue to advance, understanding and mitigating\nsuch sensitivities will be crucial for their reliable and trustworthy\ndeployment.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}