{"id":"2408.15921","title":"Structural transitions of a Semi-Flexible Polyampholyte","authors":"Rakesh Palariya and Sunil P. Singh","authorsParsed":[["Palariya","Rakesh",""],["Singh","Sunil P.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:35:55 GMT"}],"updateDate":"2024-08-29","timestamp":1724862955000,"abstract":"  Polyampholytes (PA) are charged polymers composed of positively and\nnegatively charged monomers along their backbone. The sequence of the charged\nmonomers and the bending of the chain significantly influence the conformation\nand dynamical behavior of the PA. Using coarse-grained molecular dynamics\nsimulations, we comprehensively study the structural and dynamical properties\nof flexible and semi-flexible polyampholytes'. The simulation results\ndemonstrate a flexible polyampholyte (PA) chain, displaying a transition from a\ncoil to a globule in the parameter space of the charge sequence. Additionally,\nthe behavior of the mean-square displacement (MSD), denoted as $<(\\Delta\nr(t))^2>$, reveals distinct dynamics, specifically for the alternating and\ncharge-segregated sequences. The MSD follows a power-law behavior, where\n$<(\\Delta r(t))^2> \\sim t^\\beta$, with $\\beta \\approx 3/5$ and $\\beta \\approx\n1/2$ for the alternating sequence and charge-segregated sequence in the absence\nof hydrodynamic interactions, respectively. However, when hydrodynamic\ninteractions are incorporated, the exponent $\\beta$ shifts to approximately 3/5\nfor the charge-segregated sequence and 2/3 for the well-mixed alternating\nsequence. For a semi-flexible PA chain, varying the bending rigidity and\nelectrostatic interaction strength ($\\Gamma_e$) leads to distinct, fascinating\nconformational states, including globule, bundle, and torus-like conformations.\nWe show that PA acquires circular and hairpin-like conformations in the\nintermediate bending regime. The transition between various conformations is\nidentified in terms of the shape factor estimated from the ratios of\neigenvalues of the gyration tensor.\n","subjects":["Condensed Matter/Soft Condensed Matter"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}