{"id":"2408.08981","title":"From Lazy to Prolific: Tackling Missing Labels in Open Vocabulary\n  Extreme Classification by Positive-Unlabeled Sequence Learning","authors":"Ranran Haoran Zhang, Bensu U\\c{c}ar, Soumik Dey, Hansi Wu, Binbin Li,\n  Rui Zhang","authorsParsed":[["Zhang","Ranran Haoran",""],["Uçar","Bensu",""],["Dey","Soumik",""],["Wu","Hansi",""],["Li","Binbin",""],["Zhang","Rui",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 19:10:48 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 17:20:27 GMT"}],"updateDate":"2024-08-23","timestamp":1723835448000,"abstract":"  Open-vocabulary Extreme Multi-label Classification (OXMC) extends traditional\nXMC by allowing prediction beyond an extremely large, predefined label set\n(typically $10^3$ to $10^{12}$ labels), addressing the dynamic nature of\nreal-world labeling tasks. However, self-selection bias in data annotation\nleads to significant missing labels in both training and test data,\nparticularly for less popular inputs. This creates two critical challenges:\ngeneration models learn to be \"lazy'\" by under-generating labels, and\nevaluation becomes unreliable due to insufficient annotation in the test set.\nIn this work, we introduce Positive-Unlabeled Sequence Learning (PUSL), which\nreframes OXMC as an infinite keyphrase generation task, addressing the\ngeneration model's laziness. Additionally, we propose to adopt a suite of\nevaluation metrics, F1@$\\mathcal{O}$ and newly proposed B@$k$, to reliably\nassess OXMC models with incomplete ground truths. In a highly imbalanced\ne-commerce dataset with substantial missing labels, PUSL generates 30% more\nunique labels, and 72% of its predictions align with actual user queries. On\nthe less skewed EURLex-4.3k dataset, PUSL demonstrates superior F1 scores,\nespecially as label counts increase from 15 to 30. Our approach effectively\ntackles both the modeling and evaluation challenges in OXMC with missing\nlabels.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/"}