{"id":"2408.05486","title":"Topological Blind Spots: Understanding and Extending Topological Deep\n  Learning Through the Lens of Expressivity","authors":"Yam Eitan, Yoav Gelberg, Guy Bar-Shalom, Fabrizio Frasca, Michael\n  Bronstein, Haggai Maron","authorsParsed":[["Eitan","Yam",""],["Gelberg","Yoav",""],["Bar-Shalom","Guy",""],["Frasca","Fabrizio",""],["Bronstein","Michael",""],["Maron","Haggai",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 08:27:58 GMT"}],"updateDate":"2024-08-13","timestamp":1723278478000,"abstract":"  Topological deep learning (TDL) facilitates learning from data represented by\ntopological structures. The primary model utilized in this setting is\nhigher-order message-passing (HOMP), which extends traditional graph\nmessage-passing neural networks (MPNN) to diverse topological domains. Given\nthe significant expressivity limitations of MPNNs, our paper aims to explore\nboth the strengths and weaknesses of HOMP's expressive power and subsequently\ndesign novel architectures to address these limitations. We approach this from\nseveral perspectives: First, we demonstrate HOMP's inability to distinguish\nbetween topological objects based on fundamental topological and metric\nproperties such as diameter, orientability, planarity, and homology. Second, we\nshow HOMP's limitations in fully leveraging the topological structure of\nobjects constructed using common lifting and pooling operators on graphs.\nFinally, we compare HOMP's expressive power to hypergraph networks, which are\nthe most extensively studied TDL methods. We then develop two new classes of\nTDL models: multi-cellular networks (MCN) and scalable multi-cellular networks\n(SMCN). These models draw inspiration from expressive graph architectures.\nWhile MCN can reach full expressivity but is highly unscalable, SMCN offers a\nmore scalable alternative that still mitigates many of HOMP's expressivity\nlimitations. Finally, we construct a synthetic dataset, where TDL models are\ntasked with separating pairs of topological objects based on basic topological\nproperties. We demonstrate that while HOMP is unable to distinguish between any\nof the pairs in the dataset, SMCN successfully distinguishes all pairs,\nempirically validating our theoretical findings. Our work opens a new design\nspace and new opportunities for TDL, paving the way for more expressive and\nversatile models.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Algebraic Topology","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}