{"id":"2408.08459","title":"JPEG-LM: LLMs as Image Generators with Canonical Codec Representations","authors":"Xiaochuang Han, Marjan Ghazvininejad, Pang Wei Koh, Yulia Tsvetkov","authorsParsed":[["Han","Xiaochuang",""],["Ghazvininejad","Marjan",""],["Koh","Pang Wei",""],["Tsvetkov","Yulia",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 23:57:02 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 00:24:53 GMT"}],"updateDate":"2024-08-22","timestamp":1723766222000,"abstract":"  Recent work in image and video generation has been adopting the\nautoregressive LLM architecture due to its generality and potentially easy\nintegration into multi-modal systems. The crux of applying autoregressive\ntraining in language generation to visual generation is discretization --\nrepresenting continuous data like images and videos as discrete tokens. Common\nmethods of discretizing images and videos include modeling raw pixel values,\nwhich are prohibitively lengthy, or vector quantization, which requires\nconvoluted pre-hoc training. In this work, we propose to directly model images\nand videos as compressed files saved on computers via canonical codecs (e.g.,\nJPEG, AVC/H.264). Using the default Llama architecture without any\nvision-specific modifications, we pretrain JPEG-LM from scratch to generate\nimages (and AVC-LM to generate videos as a proof of concept), by directly\noutputting compressed file bytes in JPEG and AVC formats. Evaluation of image\ngeneration shows that this simple and straightforward approach is more\neffective than pixel-based modeling and sophisticated vector quantization\nbaselines (on which our method yields a 31% reduction in FID). Our analysis\nshows that JPEG-LM has an especial advantage over vector quantization models in\ngenerating long-tail visual elements. Overall, we show that using canonical\ncodec representations can help lower the barriers between language generation\nand visual generation, facilitating future research on multi-modal\nlanguage/image/video LLMs.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"q7hKW2LK809xHNC-pkC9MTYbKhUIiDfbY2CrFtmIvhQ","pdfSize":"6994269"}
