{"id":"2408.16929","title":"AI-driven Reverse Engineering of QML Models","authors":"Archisman Ghosh and Swaroop Ghosh","authorsParsed":[["Ghosh","Archisman",""],["Ghosh","Swaroop",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 22:08:07 GMT"}],"updateDate":"2024-09-02","timestamp":1724969287000,"abstract":"  Quantum machine learning (QML) is a rapidly emerging area of research, driven\nby the capabilities of Noisy Intermediate-Scale Quantum (NISQ) devices. With\nthe progress in the research of QML models, there is a rise in third-party\nquantum cloud services to cater to the increasing demand for resources. New\nsecurity concerns surface, specifically regarding the protection of\nintellectual property (IP) from untrustworthy service providers. One of the\nmost pressing risks is the potential for reverse engineering (RE) by malicious\nactors who may steal proprietary quantum IPs such as trained parameters and QML\narchitecture, modify them to remove additional watermarks or signatures and\nre-transpile them for other quantum hardware. Prior work presents a brute force\napproach to RE the QML parameters which takes exponential time overhead. In\nthis paper, we introduce an autoencoder-based approach to extract the\nparameters from transpiled QML models deployed on untrusted third-party\nvendors. We experiment on multi-qubit classifiers and note that they can be\nreverse-engineered under restricted conditions with a mean error of order\n10^-1. The amount of time taken to prepare the dataset and train the model to\nreverse engineer the QML circuit being of the order 10^3 seconds (which is\n10^2x better than the previously reported value for 4-layered 4-qubit\nclassifiers) makes the threat of RE highly potent, underscoring the need for\ncontinued development of effective defenses.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SAfMzUV7x6uikshWay5dDuOjNiGqRzJzza2VlGGi1-0","pdfSize":"497881"}
