{"id":"2408.00814","title":"Adaptive traffic signal safety and efficiency improvement by multi\n  objective deep reinforcement learning approach","authors":"Shahin Mirbakhsh, Mahdi Azizi","authorsParsed":[["Mirbakhsh","Shahin",""],["Azizi","Mahdi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:10:41 GMT"}],"updateDate":"2024-08-05","timestamp":1722517841000,"abstract":"  This research introduces an innovative method for adaptive traffic signal\ncontrol (ATSC) through the utilization of multi-objective deep reinforcement\nlearning (DRL) techniques. The proposed approach aims to enhance control\nstrategies at intersections while simultaneously addressing safety, efficiency,\nand decarbonization objectives. Traditional ATSC methods typically prioritize\ntraffic efficiency and often struggle to adapt to real-time dynamic traffic\nconditions. To address these challenges, the study suggests a DRL-based ATSC\nalgorithm that incorporates the Dueling Double Deep Q Network (D3QN) framework.\nThe performance of this algorithm is assessed using a simulated intersection in\nChangsha, China. Notably, the proposed ATSC algorithm surpasses both\ntraditional ATSC and ATSC algorithms focused solely on efficiency optimization\nby achieving over a 16% reduction in traffic conflicts and a 4% decrease in\ncarbon emissions. Regarding traffic efficiency, waiting time is reduced by 18%\ncompared to traditional ATSC, albeit showing a slight increase (0.64%) compared\nto the DRL-based ATSC algorithm integrating the D3QN framework. This marginal\nincrease suggests a trade-off between efficiency and other objectives like\nsafety and decarbonization. Additionally, the proposed approach demonstrates\nsuperior performance, particularly in scenarios with high traffic demand,\nacross all three objectives. These findings contribute to advancing traffic\ncontrol systems by offering a practical and effective solution for optimizing\nsignal control strategies in real-world traffic situations.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"FyK3LY5iOyadUbo-iM-f3nZYJ3yFryrLobpO82E4rxk","pdfSize":"871699"}
