{"id":"2408.14685","title":"Model-Based Reinforcement Learning for Control of Strongly-Disturbed\n  Unsteady Aerodynamic Flows","authors":"Zhecheng Liu (1), Diederik Beckers (2), Jeff D. Eldredge (1) ((1)\n  University of California, Los Angeles, (2) California Institute of\n  Technology)","authorsParsed":[["Liu","Zhecheng",""],["Beckers","Diederik",""],["Eldredge","Jeff D.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 23:21:44 GMT"}],"updateDate":"2024-08-28","timestamp":1724714504000,"abstract":"  The intrinsic high dimension of fluid dynamics is an inherent challenge to\ncontrol of aerodynamic flows, and this is further complicated by a flow's\nnonlinear response to strong disturbances. Deep reinforcement learning, which\ntakes advantage of the exploratory aspects of reinforcement learning (RL) and\nthe rich nonlinearity of a deep neural network, provides a promising approach\nto discover feasible control strategies. However, the typical model-free\napproach to reinforcement learning requires a significant amount of interaction\nbetween the flow environment and the RL agent during training, and this high\ntraining cost impedes its development and application. In this work, we propose\na model-based reinforcement learning (MBRL) approach by incorporating a novel\nreduced-order model as a surrogate for the full environment. The model consists\nof a physics-augmented autoencoder, which compresses high-dimensional CFD flow\nfield snaphsots into a three-dimensional latent space, and a latent dynamics\nmodel that is trained to accurately predict the long-time dynamics of\ntrajectories in the latent space in response to action sequences. The\nrobustness and generalizability of the model is demonstrated in two distinct\nflow environments, a pitching airfoil in a highly disturbed environment and a\nvertical-axis wind turbine in a disturbance-free environment. Based on the\ntrained model in the first problem, we realize an MBRL strategy to mitigate\nlift variation during gust-airfoil encounters. We demonstrate that the policy\nlearned in the reduced-order environment translates to an effective control\nstrategy in the full CFD environment.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}