{"id":"2408.01940","title":"High ground state overlap via quantum embedding methods","authors":"Mihael Erakovic, Freek Witteveen, Dylan Harley, Jakob G\\\"unther,\n  Moritz Bensberg, Oinam Romesh Meitei, Minsik Cho, Troy Van Voorhis, Markus\n  Reiher, Matthias Christandl","authorsParsed":[["Erakovic","Mihael",""],["Witteveen","Freek",""],["Harley","Dylan",""],["Günther","Jakob",""],["Bensberg","Moritz",""],["Meitei","Oinam Romesh",""],["Cho","Minsik",""],["Van Voorhis","Troy",""],["Reiher","Markus",""],["Christandl","Matthias",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 06:29:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722752961000,"abstract":"  Quantum computers can accurately compute ground state energies using phase\nestimation, but this requires a guiding state which has significant overlap\nwith the true ground state.For large molecules and extended materials, it\nbecomes difficult to find guiding states with good ground state overlap for\ngrowing molecule sizes. Additionally, the required number of qubits and quantum\ngates may become prohibitively large. One approach for dealing with these\nchallenges is to use a quantum embedding method, which allows a reduction to\none or multiple smaller quantum cores embedded in a larger quantum region. In\nsuch situations it is unclear how the embedding method affects the hardness of\nconstructing good guiding states. In this work, we therefore investigate the\npreparation of guiding states in the context of quantum embedding methods. We\nextend previous work on quantum impurity problems, a framework in which we can\nrigorously analyze the embedding of a subset of orbitals. While there exist\nresults for optimal active orbital space selection in terms of energy\nminimization, we rigorously demonstrate how the same principles can be used to\ndefine selected orbital spaces for state preparation in terms of the overlap\nwith the ground state. Moreover, we perform numerical studies of molecular\nsystems relevant to biochemistry, one field in which quantum embedding methods\nare required due to the large size of biomacromolecules such as proteins and\nnucleic acids. We investigate two different embedding strategies which can\nexhibit qualitatively different orbital entanglement. In all cases we\ndemonstrate that the easy-to-obtain mean-field state will have a sufficiently\nhigh overlap with the target state to perform quantum phase estimation.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}