{"id":"2408.06022","title":"Controlling Surprisal in Music Generation via Information Content Curve\n  Matching","authors":"Mathias Rose Bjare, Stefan Lattner and Gerhard Widmer","authorsParsed":[["Bjare","Mathias Rose",""],["Lattner","Stefan",""],["Widmer","Gerhard",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:21:41 GMT"}],"updateDate":"2024-08-13","timestamp":1723454501000,"abstract":"  In recent years, the quality and public interest in music generation systems\nhave grown, encouraging research into various ways to control these systems. We\npropose a novel method for controlling surprisal in music generation using\nsequence models. To achieve this goal, we define a metric called Instantaneous\nInformation Content (IIC). The IIC serves as a proxy function for the perceived\nmusical surprisal (as estimated from a probabilistic model) and can be\ncalculated at any point within a music piece. This enables the comparison of\nsurprisal across different musical content even if the musical events occur in\nirregular time intervals. We use beam search to generate musical material whose\nIIC curve closely approximates a given target IIC. We experimentally show that\nthe IIC correlates with harmonic and rhythmic complexity and note density. The\ncorrelation decreases with the length of the musical context used for\nestimating the IIC. Finally, we conduct a qualitative user study to test if\nhuman listeners can identify the IIC curves that have been used as targets when\ngenerating the respective musical material. We provide code for creating IIC\ninterpolations and IIC visualizations on https://github.com/muthissar/iic.\n","subjects":["Computing Research Repository/Sound","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wGVbZqV1_TL8oJisd0bD5pngSt6l47n1AMonuKlnHs4","pdfSize":"1120952"}
