{"id":"2408.10762","title":"Sparse Regression for Discovery of Constitutive Models from Oscillatory\n  Shear Measurements","authors":"Sachin Shanbhag and Gordon Erlebacher","authorsParsed":[["Shanbhag","Sachin",""],["Erlebacher","Gordon",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 11:52:21 GMT"}],"updateDate":"2024-08-21","timestamp":1724154741000,"abstract":"  We propose sparse regression as an alternative to neural networks for the\ndiscovery of parsimonious constitutive models (CMs) from oscillatory shear\nexperiments. Symmetry and frame-invariance are strictly imposed by using tensor\nbasis functions to isolate and describe unknown nonlinear terms in the CMs. We\ngenerate synthetic experimental data using the Giesekus and Phan-Thien Tanner\nCMs, and consider two different scenarios. In the complete information\nscenario, we assume that the shear stress, along with the first and second\nnormal stress differences, is measured. This leads to a sparse linear\nregression problem that can be solved efficiently using $l_1$ regularization.\nIn the partial information scenario, we assume that only shear stress data is\navailable. This leads to a more challenging sparse nonlinear regression\nproblem, for which we propose a greedy two-stage algorithm. In both scenarios,\nthe proposed methods fit and interpolate the training data remarkably well.\nPredictions of the inferred CMs extrapolate satisfactorily beyond the range of\ntraining data for oscillatory shear. They also extrapolate reasonably well to\nflow conditions like startup of steady and uniaxial extension that are not used\nin the identification of CMs. We discuss ramifications for experimental design,\npotential algorithmic improvements, and implications of the non-uniqueness of\nCMs inferred from partial information.\n","subjects":["Condensed Matter/Soft Condensed Matter","Statistics/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rBEsPu3XsDiIVLcygjS6AYizqHSDMBJ89fJ8ASxWe2E","pdfSize":"926661"}
