{"id":"2408.08002","title":"Practical Privacy-Preserving Identity Verification using Third-Party\n  Cloud Services and FHE (Role of Data Encoding in Circuit Depth Management)","authors":"Deep Inder Mohan and Srinivas Vivek","authorsParsed":[["Mohan","Deep Inder",""],["Vivek","Srinivas",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:12:07 GMT"}],"updateDate":"2024-08-16","timestamp":1723709527000,"abstract":"  National digital identity verification systems have played a critical role in\nthe effective distribution of goods and services, particularly, in developing\ncountries. Due to the cost involved in deploying and maintaining such systems,\ncombined with a lack of in-house technical expertise, governments seek to\noutsource this service to third-party cloud service providers to the extent\npossible. This leads to increased concerns regarding the privacy of users'\npersonal data. In this work, we propose a practical privacy-preserving digital\nidentity (ID) verification protocol where the third-party cloud services\nprocess the identity data encrypted using a (single-key) Fully Homomorphic\nEncryption (FHE) scheme such as BFV. Though the role of a trusted entity such\nas government is not completely eliminated, our protocol does significantly\nreduces the computation load on such parties.\n  A challenge in implementing a privacy-preserving ID verification protocol\nusing FHE is to support various types of queries such as exact and/or fuzzy\ndemographic and biometric matches including secure age comparisons. From a\ncryptographic engineering perspective, our main technical contribution is a\nuser data encoding scheme that encodes demographic and biometric user data in\nonly two BFV ciphertexts and yet facilitates us to outsource various types of\nID verification queries to a third-party cloud. Our encoding scheme also\nensures that the only computation done by the trusted entity is a\nquery-agnostic \"extended\" decryption. This is in stark contrast with recent\nworks that outsource all the non-arithmetic operations to a trusted server. We\nimplement our protocol using the Microsoft SEAL FHE library and demonstrate its\npracticality.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TSFe_t_AEjqYeXX7ZgeFonA9qXk7xix0ejK2Ad6xJsA","pdfSize":"361065"}
