{"id":"2408.04095","title":"A Metastable Pentagonal 2D Material Synthesized by Symmetry-Driven\n  Epitaxy","authors":"Lina Liu, Yujin Ji, Marco Bianchi, Saban M. Hus, Zheshen Li, Richard\n  Balog, Jill A. Miwa, Philip Hofmann, An-ping Li, Dmitry Y. Zemlyanov, Youyong\n  Li, Yong P. Chen","authorsParsed":[["Liu","Lina",""],["Ji","Yujin",""],["Bianchi","Marco",""],["Hus","Saban M.",""],["Li","Zheshen",""],["Balog","Richard",""],["Miwa","Jill A.",""],["Hofmann","Philip",""],["Li","An-ping",""],["Zemlyanov","Dmitry Y.",""],["Li","Youyong",""],["Chen","Yong P.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 21:25:20 GMT"}],"updateDate":"2024-08-09","timestamp":1723065920000,"abstract":"  Most two-dimensional (2D) materials experimentally studied so far have\nhexagons as their building blocks. Only a few exceptions, such as PdSe2, are\nlower in energy in pentagonal phases and exhibit pentagons as building blocks.\nWhile theory has predicted a large number of pentagonal 2D materials, many of\nthem are metastable and their experimental realization is difficult. Here we\nreport the successful synthesis of a metastable pentagonal 2D material, the\nmonolayer pentagonal PdTe2, by symmetry-driven epitaxy. Scanning tunneling\nmicroscopy and complementary spectroscopy measurements are used to characterize\nthe monolayer pentagonal PdTe2, which demonstrates well-ordered low-symmetry\natomic arrangements and is stabilized by lattice matching with the underlying\nPd(100) substrate. Theoretical calculations, along with angle-resolved\nphotoemission spectroscopy, reveal monolayer pentagonal PdTe2 is a\nsemiconductor with an indirect bandgap of 1.05 eV. Our work opens an avenue for\nthe synthesis of pentagon-based 2D materials and gives opportunities to explore\ntheir applications such as multifunctional nanoelectronics.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}