{"id":"2408.12352","title":"GarmentAligner: Text-to-Garment Generation via Retrieval-augmented\n  Multi-level Corrections","authors":"Shiyue Zhang, Zheng Chong, Xujie Zhang, Hanhui Li, Yuhao Cheng,\n  Yiqiang Yan, and Xiaodan Liang","authorsParsed":[["Zhang","Shiyue",""],["Chong","Zheng",""],["Zhang","Xujie",""],["Li","Hanhui",""],["Cheng","Yuhao",""],["Yan","Yiqiang",""],["Liang","Xiaodan",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:50:45 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 05:01:35 GMT"}],"updateDate":"2024-08-26","timestamp":1724331045000,"abstract":"  General text-to-image models bring revolutionary innovation to the fields of\narts, design, and media. However, when applied to garment generation, even the\nstate-of-the-art text-to-image models suffer from fine-grained semantic\nmisalignment, particularly concerning the quantity, position, and\ninterrelations of garment components. Addressing this, we propose\nGarmentAligner, a text-to-garment diffusion model trained with\nretrieval-augmented multi-level corrections. To achieve semantic alignment at\nthe component level, we introduce an automatic component extraction pipeline to\nobtain spatial and quantitative information of garment components from\ncorresponding images and captions. Subsequently, to exploit component\nrelationships within the garment images, we construct retrieval subsets for\neach garment by retrieval augmentation based on component-level similarity\nranking and conduct contrastive learning to enhance the model perception of\ncomponents from positive and negative samples. To further enhance the alignment\nof components across semantic, spatial, and quantitative granularities, we\npropose the utilization of multi-level correction losses that leverage detailed\ncomponent information. The experimental findings demonstrate that\nGarmentAligner achieves superior fidelity and fine-grained semantic alignment\nwhen compared to existing competitors.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}