{"id":"2408.13266","title":"Impact of Climate transition on Credit portfolio's loss with stochastic\n  collateral","authors":"Lionel Sopgoui","authorsParsed":[["Sopgoui","Lionel",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 10:27:32 GMT"}],"updateDate":"2024-08-27","timestamp":1723458452000,"abstract":"  We propose models to quantify the distortion the credit portfolio (expected\nand unexpected) losses, when the obligor companies as well as their guarantees\nbelong to an economy subject to the climate transition. The economy's\nproductivity is modeled as a multidimensional Ornstein-Uhlenbeck (O.-U.)\nprocess while the climate transition is represented by a continuous\ndeterministic carbon price process. We define each loan's loss at default as\nthe difference between Exposure at Default (EAD) and the liquidated collateral,\nwhich will help us to define the Loss Given Default (LGD). We consider two\ntypes of collateral: financial asset (such as invoices, cash, or investments)\nor physical asset (such as real estate, business equipment, or inventory). For\nfinancial assets, we model them by the continuous time version of the\ndiscounted cash flows methodology, where the cash flows SDE is driven by the\ninstantaneous output growth, the instantaneous growth of a carbon price\nfunction, and an arithmetic Brownian motion. For physical assets, we focus on\nproperty in the housing market. We define, as Sopgoui (2024), their value as\nthe difference between the price of an equivalent efficient building following\nan exponential O.-U. as well as the actualized renovation costs and the\nactualized sum of the future additional energy costs due to the inefficiency of\nthe building, before an optimal renovation date which depends on the carbon\nprice process. Finally, we obtain how the loss' risk measures of a credit\nportfolio are skewed in the context of climate transition through carbon price\nand/or energy performance of buildings when both the obligors and their\nguarantees are affected. This work provides a methodology to calculate the\n(statistics of the) loss of a portfolio of secured loans, starting from a given\nclimate transition scenario described by a carbon price.\n","subjects":["Quantitative Finance/Risk Management","Quantitative Finance/Mathematical Finance"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"42wgAUl3zzhriKwojJF8EuEe5y2HkFzTvzJJgVy9oYA","pdfSize":"1354935"}
