{"id":"2408.12621","title":"StringNET: Neural Network based Variational Method for Transition\n  Pathways","authors":"Jiayue Han, Shuting Gu, Xiang Zhou","authorsParsed":[["Han","Jiayue",""],["Gu","Shuting",""],["Zhou","Xiang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:09:05 GMT"}],"updateDate":"2024-08-26","timestamp":1723493345000,"abstract":"  Rare transition events in meta-stable systems under noisy fluctuations are\ncrucial for many non-equilibrium physical and chemical processes. In these\nprocesses, the primary contributions to reactive flux are predominantly near\nthe transition pathways that connect two meta-stable states. Efficient\ncomputation of these paths is essential in computational chemistry. In this\nwork, we examine the temperature-dependent maximum flux path, the minimum\nenergy path, and the minimum action path at zero temperature. We propose the\nStringNET method for training these paths using variational formulations and\ndeep learning techniques. Unlike traditional chain-of-state methods, StringNET\ndirectly parametrizes the paths through neural network functions, utilizing the\narc-length parameter as the main input. The tasks of gradient descent and\nre-parametrization in the string method are unified into a single framework\nusing loss functions to train deep neural networks. More importantly, the loss\nfunction for the maximum flux path is interpreted as a softmax approximation to\nthe numerically challenging minimax problem of the minimum energy path. To\ncompute the minimum energy path efficiently and robustly, we developed a\npre-training strategy that includes the maximum flux path loss in the early\ntraining stage, significantly accelerating the computation of minimum energy\nand action paths. We demonstrate the superior performance of this method\nthrough various analytical and chemical examples, as well as the two- and\nfour-dimensional Ginzburg-Landau functional energy.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}