{"id":"2408.09026","title":"A versatile multilayer liquid-liquid encapsulation technique","authors":"Utsab Banerjee, Sirshendu Misra, Sushanta K. Mitra","authorsParsed":[["Banerjee","Utsab",""],["Misra","Sirshendu",""],["Mitra","Sushanta K.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 21:41:20 GMT"}],"updateDate":"2024-08-20","timestamp":1723844480000,"abstract":"  Hypothesis: Generating multi-layer cargo using conventional methods is\nchallenging. We hypothesize that incorporating a Y-junction compound droplet\ngenerator to encase a target core inside a second liquid can circumvent the\nkinetic energy dependence of the impact-driven liquid-liquid encapsulation\ntechnique, enabling minimally restrictive multi-layer encapsulation.\n  Experiments: Stable wrapping is obtained by impinging a compound droplet\n(generated using Y-junction) on an interfacial layer of another shell-forming\nliquid floating on a host liquid bath, leading to double-layered encapsulation.\nThe underlying dynamics of the liquid-liquid interfaces are captured using\nhigh-speed imaging. To demonstrate the versatility of the technique, we used\nvarious liquids as interfacial layers, including magnetoresponsive oil-based\nferrofluids. Moreover, we extended the technique to triple-layered\nencapsulation by overlaying a second interfacial layer atop the first floating\ninterfacial layer.\n  Findings: The encapsulating layer(s) effectively protects the water-soluble\ninner core (ethylene glycol) inside the water bath. A non-dimensional\nexperimental regime is established for successful encapsulation in terms of the\nimpact kinetic energy, interfacial layer thickness, and the viscosity ratio of\nthe interfacial layer and the outer core liquid. Using selective fluorescent\ntagging, we confirm the presence of individual shell layers wrapped around the\ncore, which presents a promising pathway to visualize the internal morphology\nof final encapsulated droplets.\n","subjects":["Physics/Fluid Dynamics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}