{"id":"2408.02381","title":"Dissecting the Planetary Nebula NGC 4361 with MUSE","authors":"J. R. Walsh (ESO), A. Monreal Ibero (Leiden Observatory), J. Laging\n  (Leiden Observatory) and M. Romeijnders (Leiden Observatory, Utrecht\n  University)","authorsParsed":[["Walsh","J. R.","","ESO"],["Ibero","A. Monreal","","Leiden Observatory"],["Laging","J.","","Leiden Observatory"],["Romeijnders","M.","","Leiden Observatory, Utrecht\n  University"]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 11:12:57 GMT"}],"updateDate":"2024-08-06","timestamp":1722856377000,"abstract":"  The optical line and continuum emission in the very high ionization Galactic\nplanetary nebula (PN) NGC 4361 (PN G294.1 +43.6), has been mapped with VLT MUSE\nWide Field normal mode (4750-9300A) commissioning observations. The PN is\nlarger than a single MUSE field and only the central 1 arcmin square was\nobserved in good conditions. Images in recombination and collisionally excited\nemission lines were extracted and line ratios provide dust extinction, electron\ndensity and temperature and ionic abundances. The nebula is confirmed as\noptically thin in the H-ionizing continuum based on its very low He I emission,\neven to the edges of the field, but is not completely optically thin. The\nelectron temperature Te is shown to have large-scale spatially coherent\nstructure, as indicated from previous spectra. Prior to this study, no low\nionization emission had been positively detected; MUSE revealed both weak\nextended [N II] and [O II] and $>$100 spatially unresolved low ionization knots\n(dubbed 'Freckles'). There are several linear associations of the Freckles but\nnone point back convincingly to the central star. The Freckle spectra show\nlow-moderate ionization with Te $\\sim$11000 K, Ne $\\sim$1500 cm$^{-3}$ and\nhigher extinction than the highly ionized medium, but do not clearly differ in\n(He, N, O, S) abundance with respect to the extended gas. The spatial\ndistribution and radial velocities suggest that the Freckles belong to a thick\ndisk oriented perpendicular to the large-scale nebula, perhaps remnants of an\nearlier structure. Within the MUSE field, a low redshift emission line galaxy\nwas serendipitously found hiding behind NGC 4361. The spectrum of this dwarf\ngalaxy was extracted from the bright foreground nebular emission: it is a low\nluminosity disk galaxy at $\\sim$87 Mpc with bright H II regions (12+log(O/H)\n$\\sim$ 8.4), probably a Magellanic irregular or low-mass spiral. (Abridged)\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}