{"id":"2408.01192","title":"Is quasar variability regulated by the close environment of accretion?","authors":"Liang Wu, Jun-Xian Wang, Wen-Ke Ren, Wen-Yong Kang","authorsParsed":[["Wu","Liang",""],["Wang","Jun-Xian",""],["Ren","Wen-Ke",""],["Kang","Wen-Yong",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:21:37 GMT"}],"updateDate":"2024-08-05","timestamp":1722597697000,"abstract":"  UV/optical variability in quasars is a well-observed phenomenon, yet its\nprimeval origins remain unclear. This study investigates whether the accretion\ndisk turbulence, which is responsible for UV/optical variability, is influenced\nby the close environment of the accretion by analyzing the correlation between\nvariability and infrared emission for two luminous SDSS quasar samples. The\nfirst sample includes light curves from SDSS, Pan-STARRS, and ZTF $g$ band\nphotometry, while the second sample utilizes SDSS Stripe 82 $g$ band light\ncurves. We explore the correlation between the $g$ band excess variance\n($\\sigma_{rms}$) and the wavelength-dependent infrared covering factor ($L_{\\rm\nIR}(\\lambda)/L_{\\rm bol}$), controlling for the effects of redshift,\nluminosity, and black hole mass. An anti-correlation between two variables is\nobserved in both samples, which is strongest at wavelengths of 2-3$\\mu$m but\ngradually weakens towards longer wavelength. This suggests the equatorial dusty\ntorus (which dominates near-infrared emission) plays a significant role in\ninfluencing the UV/optical variability, while the cooler polar dust (which\ncontributes significantly to mid-infrared emission) does not. The findings\nindicate that quasar variability may be connected to the physical conditions\nwithin the dusty torus which feeds the accretion, and support the notion that\nthe close environment of the accretion plays an important role in regulating\nthe accretion disk turbulence.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}