{"id":"2408.08157","title":"A novel axiomatic approach to L-valued rough sets within an L-universe\n  via inner product and outer product of L-subsets","authors":"Lingqiang Li, Qiu Jin","authorsParsed":[["Li","Lingqiang",""],["Jin","Qiu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 13:46:39 GMT"}],"updateDate":"2024-08-16","timestamp":1723729599000,"abstract":"  The fuzzy rough approximation operator serves as the cornerstone of fuzzy\nrough set theory and its practical applications. Axiomatization is a crucial\napproach in the exploration of fuzzy rough sets, aiming to offer a clear and\ndirect characterization of fuzzy rough approximation operators. Among the\nfundamental tools employed in this process, the inner product and outer product\nof fuzzy sets stand out as essential components in the axiomatization of fuzzy\nrough sets. In this paper, we will develop the axiomatization of a\ncomprehensive fuzzy rough set theory, that is, the so-called L-valued rough\nsets with an L-set serving as the foundational universe (referred to as the\nL-universe) for defining L-valued rough approximation operators, where L\ntypically denotes a GL-quantale. Firstly, we give the notions of inner product\nand outer product of two L-subsets within an L-universe and examine their basic\nproperties. It is shown that these notions are extensions of the corresponding\nnotion of fuzzy sets within a classical universe. Secondly, leveraging the\ninner product and outer product of L-subsets, we respectively characterize\nL-valued upper and lower rough approximation operators generated by general,\nreflexive, transitive, symmetric, Euclidean, and median L-value relations on\nL-universe as well as their compositions. Finally, utilizing the provided\naxiomatic characterizations, we present the precise examples for the least and\nlargest equivalent L-valued upper and lower rough approximation operators.\nNotably, many existing axiom characterizations of fuzzy rough sets within\nclassical universe can be viewed as direct consequences of our findings.\n","subjects":["Mathematics/Logic"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}