{"id":"2408.15370","title":"Infrared properties of the quark-gluon vertex in general kinematics","authors":"A. C. Aguilar, M. N. Ferreira, G. T. Linhares, B. M. Oliveira, J.\n  Papavassiliou","authorsParsed":[["Aguilar","A. C.",""],["Ferreira","M. N.",""],["Linhares","G. T.",""],["Oliveira","B. M.",""],["Papavassiliou","J.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 19:06:46 GMT"}],"updateDate":"2024-08-29","timestamp":1724785606000,"abstract":"  In the present work we determine the eight form factors of the\ntransversely-projected quark-gluon vertex in general kinematics, in the context\nof Landau-gauge QCD with two degenerate light dynamical quarks. The study is\nbased on the set of Schwinger-Dyson equations that govern the vertex form\nfactors, derived within the formalism of the three-particle-irreducible (3PI)\neffective action. The analysis is performed by employing lattice data for the\nmain ingredients, such as gluon and quark propagators, and three-gluon vertex.\nThe numerical treatment is simplified by decoupling the system of integral\nequations: the classical form factor is determined from a single non-linear\nequation involving only itself, while the remaining ones are subsequently\ncomputed through simple integrations. The form factors are obtained for\narbitrary values of space-like momenta, and their angular dependence is\nexamined in detail. A clear hierarchy is established at the level of the\ncorresponding dimensionless effective couplings, in agreement with results of\nearlier studies. Furthermore, the classical form factor is found to be in\nexcellent agreement with recent unquenched lattice data in the soft-gluon\nconfiguration, while the two non-classical dressings depart substantially from\nthe lattice results. Finally, the accurate implementation of multiplicative\nrenormalizability is confirmed, and the transition from Minkoswski to Euclidean\nspace is elucidated.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Lattice","Physics/High Energy Physics - Theory","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"L_jnW_Fq1axSubv5wChmeYcCmSXNAKrHxAaeKZJllP8","pdfSize":"6577498"}
