{"id":"2408.13063","title":"Experimental practical quantum tokens with transaction time advantage","authors":"Yang-Fan Jiang, Adrian Kent, Dami\\'an Pital\\'ua-Garc\\'ia, Xiaochen\n  Yao, Xiaohan Chen, Jia Huang, George Cowperthwaite, Qibin Zheng, Hao Li,\n  Lixing You, Yang Liu, Qiang Zhang and Jian-Wei Pan","authorsParsed":[["Jiang","Yang-Fan",""],["Kent","Adrian",""],["Pitalúa-García","Damián",""],["Yao","Xiaochen",""],["Chen","Xiaohan",""],["Huang","Jia",""],["Cowperthwaite","George",""],["Zheng","Qibin",""],["Li","Hao",""],["You","Lixing",""],["Liu","Yang",""],["Zhang","Qiang",""],["Pan","Jian-Wei",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:42:00 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 09:10:55 GMT"}],"updateDate":"2024-09-20","timestamp":1724420520000,"abstract":"  Quantum money is the first invention in quantum information science,\npromising advantages over classical money by simultaneously achieving\nunforgeability, user privacy, and instant validation. However, standard quantum\nmoney relies on quantum memories and long-distance quantum communication, which\nare technologically extremely challenging. Quantum \"S-money\" tokens eliminate\nthese technological requirements while preserving unforgeability, user privacy,\nand instant validation. Here, we report the first full experimental\ndemonstration of quantum S-tokens, proven secure despite errors, losses and\nexperimental imperfections. The heralded single-photon source with a high\nsystem efficiency of 88.24% protects against arbitrary multi-photon attacks\narising from losses in the quantum token generation. Following short-range\nquantum communication, the token is stored, transacted, and verified using\nclassical bits. We demonstrate a transaction time advantage over intra-city\n2.77 km and inter-city 60.54 km optical fibre networks, compared with optimal\nclassical cross-checking schemes. Our implementation demonstrates the\npracticality of quantum S-tokens for applications requiring high security,\nprivacy and minimal transaction times, like financial trading and network\ncontrol. It is also the first demonstration of a quantitative quantum time\nadvantage in relativistic cryptography, showing the enhanced cryptographic\npower of simultaneously considering quantum and relativistic physics.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}