{"id":"2408.16629","title":"LLMs generate structurally realistic social networks but overestimate\n  political homophily","authors":"Serina Chang, Alicja Chaszczewicz, Emma Wang, Maya Josifovska, Emma\n  Pierson, Jure Leskovec","authorsParsed":[["Chang","Serina",""],["Chaszczewicz","Alicja",""],["Wang","Emma",""],["Josifovska","Maya",""],["Pierson","Emma",""],["Leskovec","Jure",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:36:52 GMT"}],"updateDate":"2024-08-30","timestamp":1724945812000,"abstract":"  Generating social networks is essential for many applications, such as\nepidemic modeling and social simulations. Prior approaches either involve deep\nlearning models, which require many observed networks for training, or stylized\nmodels, which are limited in their realism and flexibility. In contrast, LLMs\noffer the potential for zero-shot and flexible network generation. However, two\nkey questions are: (1) are LLM's generated networks realistic, and (2) what are\nrisks of bias, given the importance of demographics in forming social ties? To\nanswer these questions, we develop three prompting methods for network\ngeneration and compare the generated networks to real social networks. We find\nthat more realistic networks are generated with \"local\" methods, where the LLM\nconstructs relations for one persona at a time, compared to \"global\" methods\nthat construct the entire network at once. We also find that the generated\nnetworks match real networks on many characteristics, including density,\nclustering, community structure, and degree. However, we find that LLMs\nemphasize political homophily over all other types of homophily and\noverestimate political homophily relative to real-world measures.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xGxeqvLUlCTh0NmWftYaN26cB_QOCuq4W7rVdwA0trE","pdfSize":"1312559"}
