{"id":"2408.13985","title":"TF-Attack: Transferable and Fast Adversarial Attacks on Large Language\n  Models","authors":"Zelin Li, Kehai Chen, Lemao Liu, Xuefeng Bai, Mingming Yang, Yang\n  Xiang and Min Zhang","authorsParsed":[["Li","Zelin",""],["Chen","Kehai",""],["Liu","Lemao",""],["Bai","Xuefeng",""],["Yang","Mingming",""],["Xiang","Yang",""],["Zhang","Min",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 02:35:37 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 02:40:12 GMT"},{"version":"v3","created":"Sun, 8 Sep 2024 07:44:45 GMT"}],"updateDate":"2024-09-10","timestamp":1724639737000,"abstract":"  With the great advancements in large language models (LLMs), adversarial\nattacks against LLMs have recently attracted increasing attention. We found\nthat pre-existing adversarial attack methodologies exhibit limited\ntransferability and are notably inefficient, particularly when applied to LLMs.\nIn this paper, we analyze the core mechanisms of previous predominant\nadversarial attack methods, revealing that 1) the distributions of importance\nscore differ markedly among victim models, restricting the transferability; 2)\nthe sequential attack processes induces substantial time overheads. Based on\nthe above two insights, we introduce a new scheme, named TF-Attack, for\nTransferable and Fast adversarial attacks on LLMs. TF-Attack employs an\nexternal LLM as a third-party overseer rather than the victim model to identify\ncritical units within sentences. Moreover, TF-Attack introduces the concept of\nImportance Level, which allows for parallel substitutions of attacks. We\nconduct extensive experiments on 6 widely adopted benchmarks, evaluating the\nproposed method through both automatic and human metrics. Results show that our\nmethod consistently surpasses previous methods in transferability and delivers\nsignificant speed improvements, up to 20 times faster than earlier attack\nstrategies.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}