{"id":"2408.10888","title":"Giant Hall Waves Launched by Superconducting Phase Transition in Pulsars","authors":"Ashley Bransgrove, Yuri Levin, Andrei M. Beloborodov","authorsParsed":[["Bransgrove","Ashley",""],["Levin","Yuri",""],["Beloborodov","Andrei M.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:18:46 GMT"}],"updateDate":"2024-08-21","timestamp":1724163526000,"abstract":"  The cores of pulsars are expected to become superconducting soon after birth.\nThe transition to type-II superconductivity is associated with the bunching of\nmagnetic field lines into discrete superconducting flux tubes which possess\nenormous tension. The coupling of the crust to the flux tubes implies the\nexistence of huge tangential magnetic fields at the crust-core interface. We\nshow that the transition to superconductivity triggers a highly non-linear\nresponse in the Hall drift of the crustal magnetic field, an effect which was\nneglected in previous numerical modelling. We argue that at the time of the\nphase transition giant Hall waves are launched from the crust-core interface\ntoward the surface. Our models show that if the crust contains a multipolar\nmagnetic field $\\sim 10^{13}$ G, the amplitude of the Hall waves is $\\sim\n10^{15}$ G. The elastic deformation of the lattice is included in our models,\nwhich allows us to track the time-dependent shear stresses everywhere in the\ncrust. The simulations indicate that the Hall waves may be strong enough to\nbreak the crust, and could cause star quakes which trigger rotation glitches\nand changes in the radio pulse profile. The Hall waves also couple to slow\nmagnetospheric changes which cause anomalous braking indices. The emission of\nthe giant Hall waves from the crust-core interface facilitates fast flux\nexpulsion from the superconducting core, provided that the flux tubes in the\ncore are themselves sufficiently mobile. For all of the flux tube mobility\nprescriptions implemented in this work, the core approaches the Meissner state\nwith B=0 at late times.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}