{"id":"2408.02283","title":"Enhanced Equilibria-Solving via Private Information Pre-Branch Structure\n  in Adversarial Team Games","authors":"Chen Qiu, Haobo Fu, Kai Li, Weixin Huang, Jiajia Zhang, Xuan Wang","authorsParsed":[["Qiu","Chen",""],["Fu","Haobo",""],["Li","Kai",""],["Huang","Weixin",""],["Zhang","Jiajia",""],["Wang","Xuan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 07:33:07 GMT"}],"updateDate":"2024-08-06","timestamp":1722843187000,"abstract":"  In ex ante coordinated adversarial team games (ATGs), a team competes against\nan adversary, and the team members are only allowed to coordinate their\nstrategies before the game starts. The team-maxmin equilibrium with correlation\n(TMECor) is a suitable solution concept for ATGs. One class of TMECor-solving\nmethods transforms the problem into solving NE in two-player zero-sum games,\nleveraging well-established tools for the latter. However, existing methods are\nfundamentally action-based, resulting in poor generalizability and low solving\nefficiency due to the exponential growth in the size of the transformed game.\nTo address the above issues, we propose an efficient game transformation method\nbased on private information, where all team members are represented by a\nsingle coordinator. We designed a structure called private information\npre-branch, which makes decisions considering all possible private information\nfrom teammates. We prove that the size of the game transformed by our method is\nexponentially reduced compared to the current state-of-the-art. Moreover, we\ndemonstrate equilibria equivalence. Experimentally, our method achieves a\nsignificant speedup of 182.89$\\times$ to 694.44$\\times$ in scenarios where the\ncurrent state-of-the-art method can work, such as small-scale Kuhn poker and\nLeduc poker. Furthermore, our method is applicable to larger games and those\nwith dynamically changing private information, such as Goofspiel.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}