{"id":"2408.04990","title":"Stochastic Geometry Analysis of RIS-Assisted Cellular Networks with\n  Reflective Intelligent Surfaces on Roads","authors":"Chang-Sik Choi, Junhyeong Kim, and Junil Choi","authorsParsed":[["Choi","Chang-Sik",""],["Kim","Junhyeong",""],["Choi","Junil",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 10:42:44 GMT"}],"updateDate":"2024-08-12","timestamp":1723200164000,"abstract":"  Reconfigurable intelligent surfaces (RISs) provide alternative routes for\nreflected signals to network users, offering numerous applications. This paper\nexplores an innovative approach of strategically deploying RISs along road\nareas to leverage various propagation and blockage conditions present in\ncellular networks with roads. To address the local network geometries shown by\nsuch networks, we use a stochastic geometry framework, specifically the Cox\npoint processes, to model the locations of RISs and vehicle users. Then, we\ndefine the coverage probability as the chance that either a base station or an\nRIS is in line of sight (LOS) of the typical user and that the LOS signal has a\nsignal-to-noise ratio (SNR) greater than a threshold. We derive the coverage\nprobability as a function of key parameters such as RIS density and path loss\nexponent. We observe that the network geometry highly affects the coverage and\nthat the proposed RIS deployment effectively leverages the underlying\ndifference of attenuation and blockage, significantly increasing the coverage\nof vehicle users in the network. With experimental results addressing the\nimpact of key variables to network performance, this work serves as a versatile\ntool for designing, analyzing, and optimizing RIS-assisted cellular networks\nwith many vehicles.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"txggTox_aTmzeC4EAFxnrYbxvJFeSs73eGvkEYvk824","pdfSize":"678863"}
