{"id":"2408.12402","title":"A Stable Polygamy Approach to Spectrum Access with Channel Reuse","authors":"Dan Ben Ami, Kobi Cohen","authorsParsed":[["Ami","Dan Ben",""],["Cohen","Kobi",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 13:48:05 GMT"}],"updateDate":"2024-08-23","timestamp":1724334485000,"abstract":"  We introduce a new and broader formulation of the stable marriage problem\n(SMP), called the stable polygamy problem (SPP), where multiple individuals\nfrom a larger group $L$ of $|L|$ individuals can be matched with a single\nindividual from a smaller group $S$ of $|S|$ individuals. Each individual $\\ell\n\\in L$ possesses a social constraint set $C_{\\ell}$ that contains a subset of\n$L$ with whom they cannot coexist harmoniously. We define a generalized concept\nof stability based on the preference and constraints of the individuals. We\nexplore two common settings: common utility, where the utility of a match is\nthe same for individuals from both sets, and preference ranking, where each\nindividual has a preference ranking for every other individual in the opposite\nset. Our analysis is conducted using a novel graph-theoretical framework.\n  The classic SMP has been investigated in recent years for spectrum access to\nmatch cells or users to channels, where only one-to-one matching is allowed. By\ncontrast, the new SPP formulation allows us to solve more general models with\nchannel reuse, where multiple users may access the same channel simultaneously.\nInterestingly, we show that classic algorithms, such as propose and reject\n(P&R), and Hungarian method are no longer efficient in the polygamy setting.\n  We develop efficient algorithms to solve the SPP in polynomial time, tailored\nfor implementations in spectrum access with channel reuse. We analytically show\nthat our algorithm always solves the SPP with common utility. While the SPP\nwith preference ranking cannot be solved by any algorithm in all cases, we\nprove that our algorithm effectively solves it in specific graph structures\nrepresenting strong and weak interference regimes. Simulation results\ndemonstrate the efficiency of our algorithms across various spectrum access\nscenarios.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}