{"id":"2408.13645","title":"Modeling and Statistical Characterization of Large-Scale Automotive\n  Radar Networks","authors":"Mohammad Taha Shah, Gourab Ghatak, Ankit Kumar, and Shobha Sundar Ram","authorsParsed":[["Shah","Mohammad Taha",""],["Ghatak","Gourab",""],["Kumar","Ankit",""],["Ram","Shobha Sundar",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 18:15:06 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 12:29:29 GMT"}],"updateDate":"2024-08-29","timestamp":1724523306000,"abstract":"  The impact of discrete clutter and co-channel interference on the performance\nof automotive radar networks has been studied using stochastic geometry, in\nparticular, by leveraging two-dimensional Poisson point processes (PPPs).\nHowever, such characterization does not take into account the impact of street\ngeometry and the fact that the location of the automotive radars are restricted\nto the streets as their domain rather than the entire Euclidean plane. In\naddition, the structure of the streets may change drastically as a vehicle\nmoves out of a city center towards the outskirts. Consequently, not only the\nradar performance change but also the radar parameters and protocols must be\nadapted for optimum performance. In this paper, we propose and characterize\nline and Cox process-based street and point models to analyze large-scale\nautomotive radar networks. We consider the classical Poisson line process (PLP)\nand the newly introduced Binomial line process (BLP) model to emulate the\nstreets and the corresponding PPP-based Cox process to emulate the vehicular\nnodes. In particular, the BLP model effectively considers the spatial variation\nof street geometry across different parts of the city. We derive the effective\ninterference set experienced by an automotive radar, the statistics of distance\nto interferers, and characterize the detection probability of the ego radar as\na function of street and vehicle density. Finally, leveraging the real-world\ndata on urban streets and vehicle density across different cities of the world,\nwe present how the radar performance varies in different parts of the city as\nwell as across different times of the day. Thus, our study equips network\noperators and automotive manufacturers with essential system design insights to\nplan and optimize automotive radar networks.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}