{"id":"2408.10989","title":"Observation of Asymmetric Sideband Generation in Strongly-driven Rydberg\n  Atoms","authors":"Dangka Shylla, Nikunjkumar Prajapati, Andrew P. Rotunno, Noah\n  Schlossberger, Dixith Manchaiah, William J. Watterson, Alexandra\n  Artusio-Glimpse, Samuel Berweger, Matthew T. Simons and Christopher L.\n  Holloway","authorsParsed":[["Shylla","Dangka",""],["Prajapati","Nikunjkumar",""],["Rotunno","Andrew P.",""],["Schlossberger","Noah",""],["Manchaiah","Dixith",""],["Watterson","William J.",""],["Artusio-Glimpse","Alexandra",""],["Berweger","Samuel",""],["Simons","Matthew T.",""],["Holloway","Christopher L.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 16:34:10 GMT"}],"updateDate":"2024-08-21","timestamp":1724171650000,"abstract":"  Improving the bandwidth of Rydberg atom-based receivers is an ongoing\nchallenge owing to the long-lived Rydberg state lifetimes that limit the\nrefresh rate of ground state atoms. In particular, the LO-based Rydberg mixer\napproach allows for bandwidths into the few-MHz range. Here, we use heterodyne\ndetection of the Rydberg atom receiver probe laser to separate the negative and\npositive sidebands that originate from distinct six wave mixing processes, in\norder to investigate their individual bandwidths. We experimentally confirm the\nprediction that the negative sideband exhibits a higher bandwidth than the\npositive sideband. We further explore the effect of coupling and probe laser\nRabi frequency on the bandwidth, which we find to be in good agreement with our\nmodel. We achieved a maximum experimental (and theoretical) bandwidth of about\n11 (11) MHz and 3.5 (5) MHz for the negative and positive sidebands,\nrespectively, from the -3dB roll-off point for optimized field parameters. This\nwork provides insight into the bandwidth-limiting features of Rydberg atom\nreceivers and points the way towards further optimization of their response.\n","subjects":["Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QYGXIsvCsoKP9YdrCIi3KRnHtWun42fReCZGBarLfV4","pdfSize":"8550567"}
