{"id":"2408.13247","title":"Data Exposure from LLM Apps: An In-depth Investigation of OpenAI's GPTs","authors":"Evin Jaff, Yuhao Wu, Ning Zhang, Umar Iqbal","authorsParsed":[["Jaff","Evin",""],["Wu","Yuhao",""],["Zhang","Ning",""],["Iqbal","Umar",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:42:06 GMT"}],"updateDate":"2024-08-26","timestamp":1724434926000,"abstract":"  LLM app ecosystems are quickly maturing and supporting a wide range of use\ncases, which requires them to collect excessive user data. Given that the LLM\napps are developed by third-parties and that anecdotal evidence suggests LLM\nplatforms currently do not strictly enforce their policies, user data shared\nwith arbitrary third-parties poses a significant privacy risk. In this paper we\naim to bring transparency in data practices of LLM apps. As a case study, we\nstudy OpenAI's GPT app ecosystem. We develop an LLM-based framework to conduct\nthe static analysis of natural language-based source code of GPTs and their\nActions (external services) to characterize their data collection practices.\nOur findings indicate that Actions collect expansive data about users,\nincluding sensitive information prohibited by OpenAI, such as passwords. We\nfind that some Actions, including related to advertising and analytics, are\nembedded in multiple GPTs, which allow them to track user activities across\nGPTs. Additionally, co-occurrence of Actions exposes as much as 9.5x more data\nto them, than it is exposed to individual Actions. Lastly, we develop an\nLLM-based privacy policy analysis framework to automatically check the\nconsistency of data collection by Actions with disclosures in their privacy\npolicies. Our measurements indicate that the disclosures for most of the\ncollected data types are omitted in privacy policies, with only 5.8% of Actions\nclearly disclosing their data collection practices.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"nLMTVXBRUB8buNPq5TW6gCO4muaTqm937Axm6DWPPus","pdfSize":"890482"}
