{"id":"2408.12516","title":"Do we need wavelets in the late Universe?","authors":"Luis A. Escamilla, Emre \\\"Oz\\\"ulker, \\\"Ozg\\\"ur Akarsu, Eleonora Di\n  Valentino, J. A. V\\'azquez","authorsParsed":[["Escamilla","Luis A.",""],["Özülker","Emre",""],["Akarsu","Özgür",""],["Di Valentino","Eleonora",""],["Vázquez","J. A.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 16:14:07 GMT"}],"updateDate":"2024-08-23","timestamp":1724343247000,"abstract":"  We parameterize the Hubble function by adding Hermitian wavelets to the\nHubble radius of $\\Lambda$CDM. This allows us to build Hubble functions that\noscillate around $\\Lambda$CDM at late times without modifying its angular\ndiameter distance to last scattering. We perform parameter inference and model\nselection procedures on these new Hubble functions at the background level. In\nour analyses consisting of a wide variety of cosmological observations, we find\nthat baryon acoustic oscillations (BAO) data play a crucial role in determining\nthe constraints on the wavelet parameters. In particular, we focus on the\ndifferences between SDSS- and DESI-BAO datasets and find that wavelets provide\na better fit to the data when either of the BAO datasets is present. However,\nDESI-BAO has a preference for the center of the wavelets to be around $z \\sim\n0.7$, while SDSS-BAO prefers higher redshifts of $z > 1$. This difference\nappears to be driven by the discrepancies between these two datasets in their\n$D_H / r_{\\rm d}$ measurements at $z = 0.51$ and $z \\sim 2.3$. Finally, we also\nderive the consequences of the wavelets on a dark energy component. We find\nthat the dark energy density oscillates by construction and also attains\nnegative values at large redshifts ($z\\gtrsim2$) as a consequence of the\nSDSS-BAO data. We conclude that while the early universe and the constraints on\nthe matter density and the Hubble constant remain unchanged, wavelets are\nfavored in the late universe by the BAO data. Specifically, there is a\nsignificant improvement at more than $3\\sigma$ in the fit when new DESI-BAO\ndata are included in the analysis.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}