{"id":"2408.09497","title":"Measurement-based Resource Allocation and Control in Data Centers: A\n  Survey","authors":"Diana Andreea Popescu","authorsParsed":[["Popescu","Diana Andreea",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 14:29:50 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 07:58:08 GMT"},{"version":"v3","created":"Fri, 23 Aug 2024 07:46:47 GMT"}],"updateDate":"2024-08-26","timestamp":1723991390000,"abstract":"  Data centers have become ubiquitous for today's businesses. From banks to\nstartups, they rely on cloud infrastructure to deploy user applications. In\nthis context, it is vital to provide users with application performance\nguarantees. Network interference is one of the causes of unpredictable\napplication performance, and many solutions have been proposed over the years.\nThe main objective of this survey is to familiarize the reader with research\ninto network measurement-based resource allocation and control in data centers,\nfocusing on network resources in order to provide cloud performance guarantees.\nWe start with a primer on general network measurement techniques and data\ncenter network and applications to give the reader context. We then summarize\nthe characteristics of network traffic and cluster workloads in data centers,\nwhich are pivotal for measurement-based allocation and control. We study and\ncompare network monitoring in data centers, giving an overview on their\nevolution from Software-Defined Networking (SDN) to programmable\ndataplanes-based. The network monitoring information can serve as input to\ncluster allocation and scheduling decisions. We next categorize cluster\nscheduling frameworks, and perform an analysis of those that provide network\nguarantees in data centers, and we also look at emergent Machine\nLearning-driven resource allocation and control. We conclude with a discussion\nabout future research directions.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}