{"id":"2408.04241","title":"Strong-to-weak symmetry breaking states in stochastic dephasing\n  stabilizer circuits","authors":"Yoshihito Kuno, Takahiro Orito, Ikuo Ichinose","authorsParsed":[["Kuno","Yoshihito",""],["Orito","Takahiro",""],["Ichinose","Ikuo",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 06:03:23 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 03:44:27 GMT"}],"updateDate":"2024-09-20","timestamp":1723097003000,"abstract":"  Discovering mixed state quantum orders is an on-going issue. Recently, it has\nbeen recognized that there are (at least) two kinds of symmetries in the mixed\nstate; strong and weak symmetries. Under symmetry-respective decoherence,\nspontaneous strong-to-weak symmetry breaking (SSSB) can occur. This work\nprovides a scheme to describe SSSB and other decoherence phenomena in the mixed\nstate by employing the stabilizer formalism and the efficient numerical\nalgorithm of Clifford circuits. We present two systematic numerical studies.In\na two-dimensional (2D) circuit with a stochastic Ising type decoherence, an\nSSSB phase transition is clearly observed and its criticality is elucidated by\nthe numerical methods. In particular, we calculate R\\'{e}nyi-2 correlations and\nestimate critical exponents of the SSSB transition. For the second system, we\nintroduce an idea of subgroup SSSB. As an example, we study a system with\nsymmetry-protected-topological (SPT) order provided by both one-form and\nzero-form symmetries, and observe how the system evolves under decoherence.\nAfter displaying numerical results, we show that viewpoint of percolation is\nquite useful to understand the SSSB transition, which is applicable for a wide\nrange of decohered states. Finally, we comment on SSSB of one-form-symmetry\nexemplifying toric code.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/"}