{"id":"2408.15510","title":"Measuring the Reliability of Causal Probing Methods: Tradeoffs,\n  Limitations, and the Plight of Nullifying Interventions","authors":"Marc Canby, Adam Davies, Chirag Rastogi, Julia Hockenmaier","authorsParsed":[["Canby","Marc",""],["Davies","Adam",""],["Rastogi","Chirag",""],["Hockenmaier","Julia",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 03:45:49 GMT"}],"updateDate":"2024-08-29","timestamp":1724816749000,"abstract":"  Causal probing is an approach to interpreting foundation models, such as\nlarge language models, by training probes to recognize latent properties of\ninterest from embeddings, intervening on probes to modify this representation,\nand analyzing the resulting changes in the model's behavior. While some recent\nworks have cast doubt on the theoretical basis of several leading causal\nprobing intervention methods, it has been unclear how to systematically and\nempirically evaluate their effectiveness in practice. To address this problem,\nwe propose a general empirical analysis framework to evaluate the reliability\nof causal probing interventions, formally defining and quantifying two key\ncausal probing desiderata: completeness (fully transforming the representation\nof the target property) and selectivity (minimally impacting other properties).\nOur formalism allows us to make the first direct comparisons between different\nfamilies of causal probing methods (e.g., linear vs. nonlinear or\ncounterfactual vs. nullifying interventions). We conduct extensive experiments\nacross several leading methods, finding that (1) there is an inherent tradeoff\nbetween these criteria, and no method is able to consistently satisfy both at\nonce; and (2) across the board, nullifying interventions are always far less\ncomplete than counterfactual interventions, indicating that nullifying methods\nmay not be an effective approach to causal probing.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}