{"id":"2408.11825","title":"Strategic AI adoption in SMEs: A Prescriptive Framework","authors":"Atif Hussain, Rana Rizwan","authorsParsed":[["Hussain","Atif",""],["Rizwan","Rana",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 09:49:37 GMT"}],"updateDate":"2024-08-23","timestamp":1722851377000,"abstract":"  Artificial Intelligence (AI) is increasingly acknowledged as a vital\ncomponent for the advancement and competitiveness of modern organizations,\nincluding small and medium enterprises (SMEs). However, the adoption of AI\ntechnologies in SMEs faces significant barriers, primarily related to cost,\nlack of technical skills, and employee acceptance. This study proposes a\ncomprehensive, phased framework designed to facilitate the effective adoption\nof AI in SMEs by systematically addressing these barriers. The framework begins\nwith raising awareness and securing commitment from leadership, followed by the\nadoption of low-cost, general-purpose AI tools to build technical competence\nand foster a positive attitude towards AI. As familiarity with AI technologies\nincreases, the framework advocates for the integration of task-specific AI\ntools to enhance efficiency and productivity. Subsequently, it guides\norganizations towards the in-house development of generative AI tools,\nproviding greater customization and control. Finally, the framework addresses\nthe development of discriminative AI models to meet highly specific and\nprecision-oriented tasks. By providing a structured and incremental approach,\nthis framework ensures that SMEs can navigate the complexities of AI\nintegration effectively, driving innovation, efficiency, and competitive\nadvantage. This study contributes to the field by offering a practical,\nprescriptive framework tailored to the unique needs of SMEs, facilitating the\nsuccessful adoption of AI technologies and positioning these organizations for\nsustained growth in a competitive landscape.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"_FZFXdbZwjLjNsNF60PmoVsZjzCDIpMW_ci0DJ1vK40","pdfSize":"249398"}
