{"id":"2408.03910","title":"CodexGraph: Bridging Large Language Models and Code Repositories via\n  Code Graph Databases","authors":"Xiangyan Liu, Bo Lan, Zhiyuan Hu, Yang Liu, Zhicheng Zhang, Fei Wang,\n  Michael Shieh, Wenmeng Zhou","authorsParsed":[["Liu","Xiangyan",""],["Lan","Bo",""],["Hu","Zhiyuan",""],["Liu","Yang",""],["Zhang","Zhicheng",""],["Wang","Fei",""],["Shieh","Michael",""],["Zhou","Wenmeng",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:13:59 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 16:23:57 GMT"}],"updateDate":"2024-08-13","timestamp":1723050839000,"abstract":"  Large Language Models (LLMs) excel in stand-alone code tasks like HumanEval\nand MBPP, but struggle with handling entire code repositories. This challenge\nhas prompted research on enhancing LLM-codebase interaction at a repository\nscale. Current solutions rely on similarity-based retrieval or manual tools and\nAPIs, each with notable drawbacks. Similarity-based retrieval often has low\nrecall in complex tasks, while manual tools and APIs are typically\ntask-specific and require expert knowledge, reducing their generalizability\nacross diverse code tasks and real-world applications. To mitigate these\nlimitations, we introduce CodexGraph, a system that integrates LLM agents with\ngraph database interfaces extracted from code repositories. By leveraging the\nstructural properties of graph databases and the flexibility of the graph query\nlanguage, CodexGraph enables the LLM agent to construct and execute queries,\nallowing for precise, code structure-aware context retrieval and code\nnavigation. We assess CodexGraph using three benchmarks: CrossCodeEval,\nSWE-bench, and EvoCodeBench. Additionally, we develop five real-world coding\napplications. With a unified graph database schema, CodexGraph demonstrates\ncompetitive performance and potential in both academic and real-world\nenvironments, showcasing its versatility and efficacy in software engineering.\nOur application demo:\nhttps://github.com/modelscope/modelscope-agent/tree/master/apps/codexgraph_agent.\n","subjects":["Computing Research Repository/Software Engineering","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}