{"id":"2408.02181","title":"AssemAI: Interpretable Image-Based Anomaly Detection for Manufacturing\n  Pipelines","authors":"Renjith Prasad, Chathurangi Shyalika, Ramtin Zand, Fadi El Kalach,\n  Revathy Venkataramanan, Ramy Harik, Amit Sheth","authorsParsed":[["Prasad","Renjith",""],["Shyalika","Chathurangi",""],["Zand","Ramtin",""],["Kalach","Fadi El",""],["Venkataramanan","Revathy",""],["Harik","Ramy",""],["Sheth","Amit",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 01:50:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722822609000,"abstract":"  Anomaly detection in manufacturing pipelines remains a critical challenge,\nintensified by the complexity and variability of industrial environments. This\npaper introduces AssemAI, an interpretable image-based anomaly detection system\ntailored for smart manufacturing pipelines. Our primary contributions include\nthe creation of a tailored image dataset and the development of a custom object\ndetection model, YOLO-FF, designed explicitly for anomaly detection in\nmanufacturing assembly environments. Utilizing the preprocessed image dataset\nderived from an industry-focused rocket assembly pipeline, we address the\nchallenge of imbalanced image data and demonstrate the importance of\nimage-based methods in anomaly detection. The proposed approach leverages\ndomain knowledge in data preparation, model development and reasoning. We\ncompare our method against several baselines, including simple CNN and custom\nVisual Transformer (ViT) models, showcasing the effectiveness of our custom\ndata preparation and pretrained CNN integration. Additionally, we incorporate\nexplainability techniques at both user and model levels, utilizing ontology for\nuser-friendly explanations and SCORE-CAM for in-depth feature and model\nanalysis. Finally, the model was also deployed in a real-time setting. Our\nresults include ablation studies on the baselines, providing a comprehensive\nevaluation of the proposed system. This work highlights the broader impact of\nadvanced image-based anomaly detection in enhancing the reliability and\nefficiency of smart manufacturing processes.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}