{"id":"2408.05774","title":"Modified Trento initial condition and its impact on collective flows and\n  global polarization in Cu+Au collisions","authors":"Ze-Fang Jiang, Shanshan Cao and Ben-Wei Zhang","authorsParsed":[["Jiang","Ze-Fang",""],["Cao","Shanshan",""],["Zhang","Ben-Wei",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 13:52:15 GMT"}],"updateDate":"2024-08-13","timestamp":1723384335000,"abstract":"  Collective flow coefficients and spin polarization are valuable probes of the\ngeometry and flow velocity field of the quark-gluon plasma (QGP) produced in\nrelativistic heavy-ion collisions. Using a modified TRENTo initial condition\ncoupled to a (3+1)-dimensional (D) viscous hydrodynamic model CLVisc, we study\nthe directed flow and elliptic flow coefficients of hadrons, together with the\nglobal polarization of $\\Lambda$ and $\\bar{\\Lambda}$ hyperons in asymmetric\nCu+Au collisions. We extend the 2D TRENTo model to the 3D space, and find that\nthe initial tilted geometry of the QGP fireball with respect to the\nlongitudinal direction leads to a decrease of directed flow from positive to\nnegative values with increasing pseudorapidity, an enhancement of elliptic flow\nat forward and backward pseudorapidities, and a non-monotonic dependence of\nglobal polarization on the transverse momentum of hyperons. The initial\nlongitudinal flow velocity gradient further enhances the values of directed\nflow and global polarization. Our model calculation provides a satisfactory\ndescription of the rapidity, transverse momentum, and centrality dependences of\nthe directed flow of charged hadrons in Cu+Au collisions for the first time,\nand proposes that such asymmetric heavy-ion collisions create a better\nenvironment for studying the initial tilted geometry and longitudinal flow\nfield of the QGP than symmetric Au+Au collisions do.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Phenomenology","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"S0K8Gzz_XsDjFLY55n1P1xMOVQii1WUJe6lO8PYgeNE","pdfSize":"1631310"}
