{"id":"2408.11460","title":"Impact of changing the wet deposition schemes in ldx on 137-cs\n  atmosperic deposits after the fukushima accident","authors":"Arnaud Qu\\'erel (IRSN, IRSN/PSE-SANTE/SESUC/BMCA), Denis Qu\\'elo\n  (IRSN/PSE-SANTE/SESUC/BMCA, IRSN), Yelva Roustan (CEREA), Anne Mathieu (IRSN,\n  IRSN/PSE-SANTE/SESUC/BMCA), Mizuo Kajino (MRI), Thomas Sekiyama (MRI), Kouji\n  Adachi (MRI), Damien Didier (IRSN, IRSN/PSE-SANTE/SESUC/BMCA), Yasuhito\n  Igarashi (MRI), Takashi Maki (MRI)","authorsParsed":[["Quérel","Arnaud","","IRSN, IRSN/PSE-SANTE/SESUC/BMCA"],["Quélo","Denis","","IRSN/PSE-SANTE/SESUC/BMCA, IRSN"],["Roustan","Yelva","","CEREA"],["Mathieu","Anne","","IRSN,\n  IRSN/PSE-SANTE/SESUC/BMCA"],["Kajino","Mizuo","","MRI"],["Sekiyama","Thomas","","MRI"],["Adachi","Kouji","","MRI"],["Didier","Damien","","IRSN, IRSN/PSE-SANTE/SESUC/BMCA"],["Igarashi","Yasuhito","","MRI"],["Maki","Takashi","","MRI"]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:26:08 GMT"}],"updateDate":"2024-08-22","timestamp":1724232368000,"abstract":"  The Fukushima-Daiichi release of radioactivity is a relevant event to study\nthe atmospheric dispersion modelling of radionuclides. Actually, the\natmospheric deposition onto the ground may be studied through the map of\nmeasured Cs-137 established consecutively to the accident. The limits of\ndetection were low enough to make the measurements possible as far as 250km\nfrom the nuclear power plant. This large scale deposition has been modelled\nwith the Eulerian model ldX. However, several weeks of emissions in multiple\nweather conditions make it a real challenge. Besides, these measurements are\naccumulated deposition of Cs-137 over the whole period and do not inform of\ndeposition mechanisms involved: in-cloud, below-cloud, dry deposition. In a\nprevious study (Qu{\\'e}rel et al., 2016), a comprehensive sensitivity analysis\nwas performed in order to understand wet deposition mechanisms. It has been\nshown that the choice of the wet deposition scheme has a strong impact on\nassessment of deposition patterns. Nevertheless, a ``best'' scheme could not be\nhighlighted as it depends on the selected criteria: the ranking differs\naccording to the statistical indicators considered (correlation, figure of\nmerit in space and factor 2). A possibility to explain the difficulty to\ndiscriminate between several schemes was the uncertainties in the modelling,\nresulting from the meteorological data for instance. Since the move of the\nplume is not properly modelled, the deposition processes are applied with an\ninaccurate activity concentration in the air. In the framework of the SAKURA\nproject, an MRI-IRSN collaboration, new meteorological fields at higher\nresolution (Sekiyama et al., 2013) were provided and allow to reconsider the\nprevious study. An update including these new meteorology data is presented. In\naddition, the focus is put on the deposition schemes commonly used in nuclear\nemergency context.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}