{"id":"2408.12106","title":"RIS-Vis: A Novel Visualization Platform for Seismic, Geodetic, and\n  Weather Data Relevant to Antarctic Cryosphere Science","authors":"Aishwarya Chakravarthy, Dhiman Mondal, John Barrett, Chet Ruszczyk,\n  Pedro Elosegui","authorsParsed":[["Chakravarthy","Aishwarya",""],["Mondal","Dhiman",""],["Barrett","John",""],["Ruszczyk","Chet",""],["Elosegui","Pedro",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:42:32 GMT"}],"updateDate":"2024-08-23","timestamp":1724298152000,"abstract":"  Antarctic ice shelves play a vital role in preserving the physical conditions\nof the Antarctic cryosphere and the Southern Ocean, and beyond. By serving as a\nbuttressing force, ice shelves prevent sea-level rise by restraining the flow\nof continental ice and glaciers to the sea. Sea-level rise impacts the global\nenvironment in multiple ways, including flooding habitats, eroding coastlines,\nand contaminating soil and groundwater. It is therefore essential to monitor\nthe stability of Antarctic ice shelves, for which a variety of complementary\ndata sources is required. We have developed RIS-Vis, a novel data visualization\nplatform to monitor Antarctic ice shelves. Although focused on the Ross Ice\nShelf (RIS), RIS-Vis could be readily scaled to monitor other ice shelves\naround Antarctica, and elsewhere. Currently, RIS-Vis is capable of analyzing\nand visualizing seismic, geodetic, and weather data to provide meaningful\ninformation for Antarctic cryosphere research. RIS-Vis was built using Python\nlibraries including Obspy, APScheduler, and the Plotly Dash framework, and uses\nSQLite as the backing database. Visualizations developed on RIS-Vis include\nfiltered seismic waveforms, spectrograms, and power spectral densities,\ngeodetic-based ice-shelf flow, and meteorological variables such as atmospheric\ntemperature and pressure. The dashboard visualization platform abstracts away\nthe time-intensive analysis process of raw data and allows scientists to better\nconcentrate on RIS science.\n","subjects":["Physics/Atmospheric and Oceanic Physics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}