{"id":"2408.16142","title":"Classifying acoustic cavitation with machine learning trained on\n  multiple physical models","authors":"Trinidad Gatica, Elwin van 't Wout, Reza Haqshenas","authorsParsed":[["Gatica","Trinidad",""],["Wout","Elwin van 't",""],["Haqshenas","Reza",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 21:07:48 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 20:39:31 GMT"}],"updateDate":"2024-09-09","timestamp":1724879268000,"abstract":"  Acoustic cavitation refers to the formation and oscillation of microbubbles\nin a liquid exposed to acoustic waves. Depending on the properties of the\nliquid and the parameters of the acoustic waves, bubbles behave differently.\nThe two main regimes of bubble dynamics are transient cavitation, where a\nbubble collapses violently, and stable cavitation, where a bubble undergoes\nperiodic oscillations. Predicting these regimes under specific sonication\nconditions is important in biomedical ultrasound and sonochemistry. For these\npredictions to be helpful in practical settings, they must be precise and\ncomputationally efficient. In this study, we have used machine learning\ntechniques to predict the cavitation regimes of air bubble nuclei in a liquid.\nThe supervised machine learning was trained by solving three differential\nequations for bubble dynamics, namely the Rayleigh-Plesset, Keller-Miksis, and\nGilmore equations. These equations were solved for a range of initial\nparameters, including temperature, bubble radius, acoustic pressure, and\nfrequency. Four different classifiers were developed to label each simulation\nas either stable or transient cavitation. Subsequently, four different\nmachine-learning strategies were designed to analyze the likelihood of\ntransient or stable cavitation for a given set of acoustic and material\nparameters. Cross-validation on held-out test data shows a high accuracy of the\nmachine learning predictions. The results indicate that machine learning models\ntrained on physics-based simulations can reliably predict cavitation behavior\nacross a wide range of conditions relevant to real-world applications. This\napproach can be employed to optimize device settings and protocols used in\nimaging, therapeutic ultrasound, and sonochemistry.\n","subjects":["Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}