{"id":"2408.03993","title":"Circumstellar Interaction in the Ultraviolet Spectra of SN 2023ixf 14-66\n  Days After Explosion","authors":"K. Azalee Bostroem, David J. Sand, Luc Dessart, Nathan Smith, Saurabh\n  W. Jha, Stefano Valenti, Jennifer E. Andrews, Yize Dong, Alexei V.\n  Filippenko, Sebastian Gomez, Daichi Hiramatsu, Emily T. Hoang, Griffin\n  Hosseinzadeh, D. Andrew Howell, Jacob E. Jencson, Michael Lundquist, Curtis\n  McCully, Darshana Mehta, Nicolas E. Meza Retamal, Jeniveve Pearson, Aravind\n  P. Ravi, Manisha Shrestha, Samuel Wyatt","authorsParsed":[["Bostroem","K. Azalee",""],["Sand","David J.",""],["Dessart","Luc",""],["Smith","Nathan",""],["Jha","Saurabh W.",""],["Valenti","Stefano",""],["Andrews","Jennifer E.",""],["Dong","Yize",""],["Filippenko","Alexei V.",""],["Gomez","Sebastian",""],["Hiramatsu","Daichi",""],["Hoang","Emily T.",""],["Hosseinzadeh","Griffin",""],["Howell","D. Andrew",""],["Jencson","Jacob E.",""],["Lundquist","Michael",""],["McCully","Curtis",""],["Mehta","Darshana",""],["Retamal","Nicolas E. Meza",""],["Pearson","Jeniveve",""],["Ravi","Aravind P.",""],["Shrestha","Manisha",""],["Wyatt","Samuel",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:00:01 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 03:45:49 GMT"}],"updateDate":"2024-09-20","timestamp":1723053601000,"abstract":"  SN 2023ixf was discovered in M101 within a day of explosion and rapidly\nclassified as a Type II supernova with flash features. Here we present\nultraviolet (UV) spectra obtained with the Hubble Space Telescope 14, 19, 24,\nand 66 days after explosion. Interaction between the supernova ejecta and\ncircumstellar material (CSM) is seen in the UV throughout our observations in\nthe flux of the first three epochs and asymmetric Mg II emission on day 66. We\ncompare our observations to CMFGEN supernova models that include CSM\ninteraction ($\\dot{M}<10^{-3}$ M$_{\\odot}$ yr$^{-1}$) and find that the power\nfrom CSM interaction is decreasing with time, from $L_{\\rm\nsh}\\approx5\\times10^{42}$ erg s$^{-1}$ to $L_{\\rm sh}\\approx1\\times10^{40}$ erg\ns$^{-1}$ between days 14 and 66. We examine the contribution of individual\natomic species to the spectra on days 14 and 19, showing that the majority of\nthe features are dominated by iron, nickel, magnesium, and chromium absorption\nin the ejecta. The UV spectral energy distribution of SN 2023ixf sits between\nthat of supernovae which show no definitive signs of CSM interaction and those\nwith persistent signatures assuming the same progenitor radius and metallicity.\nFinally, we show that the evolution and asymmetric shape of the Mg II\n$\\lambda\\lambda$ 2796, 2802 emission are not unique to SN 2023ixf. These\nobservations add to the early measurements of dense, confined CSM interaction,\ntracing the mass-loss history of SN 2023ixf to $\\sim33$ yr prior to the\nexplosion and the density profile to a radius of $\\sim5.7\\times10^{15}$ cm.\nThey show the relatively short evolution from a quiescent red supergiant wind\nto high mass loss.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}