{"id":"2408.09383","title":"Interplay of phonon directionality and emission polarization in\n  two-dimensional layered metal halide perovskites","authors":"Roman Krahne, Miao-Ling Lin, and Ping-Heng Tan","authorsParsed":[["Krahne","Roman",""],["Lin","Miao-Ling",""],["Tan","Ping-Heng",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 06:56:25 GMT"}],"updateDate":"2024-08-20","timestamp":1723964185000,"abstract":"  With polarized and angle-resolved Raman spectroscopy studies on single\ntwo-dimensional layered perovskites (2DLP) flakes with different ammonium\nmolecules as organic cations, in 2020 we revealed the very rich phonon spectra\nin the low-frequency regime. Although the phonon bands at low frequency can\ngenerally be attributed to the vibrations of the inorganic lattice, we found\nvery different phonon spectra for the same lead-bromide octahedra composition\nby only changing the type of the organic cations. In addition, the intensity of\nthe different phonon modes depended strongly on the angle of the linearly\npolarized excitation beam with respect to the in-plane axes of the octahedra\nlattice. In 2022, we mapped this angular dependence of the phonon modes, which\nenabled to identify the directionality of the different lattice vibrations. By\ncorrelating the phonon spectra with the temperature-dependent emission for a\nset of 2DLPs that featured very different STE emission, we demonstrated that\nthe exciton relaxation cannot be related to coupling with a single\n(longitudinal optical) phonon band, and that several phonon bands should be\ninvolved in the emission process. We performed angle-resolved polarized\nemission and Raman spectroscopy on the same two-dimensional lead iodide\nperovskite microcrystals, which revealed the impact of the organic cations on\nthe linear polarization of the emission, and corroborated our interpretation\nthat multiple phonon bands should be involved in the radiative recombination\nprocess. Our studies revealed a wealth of highly directional low-frequency\nphonons in 2DLPs from which several bands are involved in the emission process,\nwhich leads to diverse optical and vibrational properties depending on the type\nof organic cation in the material.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}