{"id":"2408.15268","title":"Anomaly Detection in Time Series of EDFA Pump Currents to Monitor\n  Degeneration Processes using Fuzzy Clustering","authors":"Dominic Schneider, Lutz Rapp, Christoph Ament","authorsParsed":[["Schneider","Dominic",""],["Rapp","Lutz",""],["Ament","Christoph",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 14:23:42 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 06:18:45 GMT"}],"updateDate":"2024-09-02","timestamp":1723472622000,"abstract":"  This article proposes a novel fuzzy clustering based anomaly detection method\nfor pump current time series of EDFA systems. The proposed change detection\nframework (CDF) strategically combines the advantages of entropy analysis (EA)\nand principle component analysis (PCA) with fuzzy clustering procedures. In the\nframework, EA is applied for dynamic selection of features for reduction of the\nfeature space and increase of computational performance. Furthermore, PCA is\nutilized to extract features from the raw feature space to enable\ngeneralization capability of the subsequent fuzzy clustering procedures. Three\ndifferent fuzzy clustering methods, more precisely the fuzzy clustering\nalgorithm, a probabilistic clustering algorithm and a possibilistic clustering\nalgorithm are evaluated for performance and generalization. Hence, the proposed\nframework has the innovative feature to detect changes in pump current time\nseries at an early stage for arbitrary points of operation, compared to\nstate-of-the-art predefined alarms in commercially used EDFAs. Moreover, the\napproach is implemented and tested using experimental data. In addition, the\nproposed framework enables further approaches of applying decentralized\npredictive maintenance for optical fiber networks.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}