{"id":"2408.16602","title":"Embedded Complexity and Quantum Circuit Volume","authors":"Zhenyu Du, Zi-Wen Liu, Xiongfeng Ma","authorsParsed":[["Du","Zhenyu",""],["Liu","Zi-Wen",""],["Ma","Xiongfeng",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:12:33 GMT"}],"updateDate":"2024-08-30","timestamp":1724944353000,"abstract":"  Quantum circuit complexity is a pivotal concept in quantum information,\nquantum many-body physics, and high-energy physics. While extensively studied\nfor closed systems, the characterization and dynamics of circuit complexity are\nlittle understood for the situation where the system is embedded within a\nlarger system, which encompasses measurement-assisted state preparation. To\naddress this gap, we introduce the notion of embedded complexity, which\naccounts for both system extensions and measurements. We study the complexity\nof projected states in a subsystem after measuring its complement and find that\nin random circuits, the embedded complexity is lower-bounded by the circuit\nvolume -- the total number of gates affecting both the subsystem and its\ncomplement. This finding indicates that the total cost of preparing the\nprojected state cannot be reduced by leveraging ancillary qubits and\nmeasurements in general. Our result underscores the operational meaning of\ncircuit volume, as it characterizes the embedded complexity of the generated\nstate. Specifically, for random circuits or Clifford circuits, we demonstrate a\nspacetime conversion that concentrates circuit volume onto a subsystem via a\nrandom gate teleportation approach. In scenarios of deep thermalization where\nthe system interacts extensively with a larger system, our analysis suggests\nthat the resulting projected states exhibit high complexity. Additionally, we\nintroduce a shadow tomography protocol that employs only ancillary random\nstates and Bell state measurements, circumventing the need to evolve the input\nstate and thereby simplifying experimental controls.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0ArwqgoOxGjvwo5xZ6RShzvBUVak05htYXsSGyeffE0","pdfSize":"2607179"}
