{"id":"2408.10588","title":"DEGAS: Detailed Expressions on Full-Body Gaussian Avatars","authors":"Zhijing Shao, Duotun Wang, Qing-Yao Tian, Yao-Dong Yang, Hengyu Meng,\n  Zeyu Cai, Bo Dong, Yu Zhang, Kang Zhang, Zeyu Wang","authorsParsed":[["Shao","Zhijing",""],["Wang","Duotun",""],["Tian","Qing-Yao",""],["Yang","Yao-Dong",""],["Meng","Hengyu",""],["Cai","Zeyu",""],["Dong","Bo",""],["Zhang","Yu",""],["Zhang","Kang",""],["Wang","Zeyu",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 06:52:03 GMT"}],"updateDate":"2024-08-21","timestamp":1724136723000,"abstract":"  Although neural rendering has made significant advancements in creating\nlifelike, animatable full-body and head avatars, incorporating detailed\nexpressions into full-body avatars remains largely unexplored. We present\nDEGAS, the first 3D Gaussian Splatting (3DGS)-based modeling method for\nfull-body avatars with rich facial expressions. Trained on multiview videos of\na given subject, our method learns a conditional variational autoencoder that\ntakes both the body motion and facial expression as driving signals to generate\nGaussian maps in the UV layout. To drive the facial expressions, instead of the\ncommonly used 3D Morphable Models (3DMMs) in 3D head avatars, we propose to\nadopt the expression latent space trained solely on 2D portrait images,\nbridging the gap between 2D talking faces and 3D avatars. Leveraging the\nrendering capability of 3DGS and the rich expressiveness of the expression\nlatent space, the learned avatars can be reenacted to reproduce photorealistic\nrendering images with subtle and accurate facial expressions. Experiments on an\nexisting dataset and our newly proposed dataset of full-body talking avatars\ndemonstrate the efficacy of our method. We also propose an audio-driven\nextension of our method with the help of 2D talking faces, opening new\npossibilities to interactive AI agents.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}