{"id":"2408.01746","title":"Domain penalisation for improved Out-of-Distribution Generalisation","authors":"Shuvam Jena, Sushmetha Sumathi Rajendran, Karthik Seemakurthy,\n  Sasithradevi A, Vijayalakshmi M, Prakash Poornachari","authorsParsed":[["Jena","Shuvam",""],["Rajendran","Sushmetha Sumathi",""],["Seemakurthy","Karthik",""],["A","Sasithradevi",""],["M","Vijayalakshmi",""],["Poornachari","Prakash",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 11:06:47 GMT"}],"updateDate":"2024-08-06","timestamp":1722683207000,"abstract":"  In the field of object detection, domain generalisation (DG) aims to ensure\nrobust performance across diverse and unseen target domains by learning the\nrobust domain-invariant features corresponding to the objects of interest\nacross multiple source domains. While there are many approaches established for\nperforming DG for the task of classification, there has been a very little\nfocus on object detection. In this paper, we propose a domain penalisation (DP)\nframework for the task of object detection, where the data is assumed to be\nsampled from multiple source domains and tested on completely unseen test\ndomains. We assign penalisation weights to each domain, with the values updated\nbased on the detection networks performance on the respective source domains.\nBy prioritising the domains that needs more attention, our approach effectively\nbalances the training process. We evaluate our solution on the GWHD 2021\ndataset, a component of the WiLDS benchmark and we compare against ERM and\nGroupDRO as these are primarily loss function based. Our extensive experimental\nresults reveals that the proposed approach improves the accuracy by 0.3 percent\nand 0.5 percent on validation and test out-of-distribution (OOD) sets,\nrespectively for FasterRCNN. We also compare the performance of our approach on\nFCOS detector and show that our approach improves the baseline OOD performance\nover the existing approaches by 1.3 percent and 1.4 percent on validation and\ntest sets, respectively. This study underscores the potential of performance\nbased domain penalisation in enhancing the generalisation ability of object\ndetection models across diverse environments.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}