{"id":"2408.12990","title":"A Survey on Drowsiness Detection -- Modern Applications and Methods","authors":"Biying Fu, Fadi Boutros, Chin-Teng Lin and Naser Damer","authorsParsed":[["Fu","Biying",""],["Boutros","Fadi",""],["Lin","Chin-Teng",""],["Damer","Naser",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 11:15:21 GMT"}],"updateDate":"2024-08-26","timestamp":1724411721000,"abstract":"  Drowsiness detection holds paramount importance in ensuring safety in\nworkplaces or behind the wheel, enhancing productivity, and healthcare across\ndiverse domains. Therefore accurate and real-time drowsiness detection plays a\ncritical role in preventing accidents, enhancing safety, and ultimately saving\nlives across various sectors and scenarios. This comprehensive review explores\nthe significance of drowsiness detection in various areas of application,\ntranscending the conventional focus solely on driver drowsiness detection. We\ndelve into the current methodologies, challenges, and technological\nadvancements in drowsiness detection schemes, considering diverse contexts such\nas public transportation, healthcare, workplace safety, and beyond. By\nexamining the multifaceted implications of drowsiness, this work contributes to\na holistic understanding of its impact and the crucial role of accurate and\nreal-time detection techniques in enhancing safety and performance. We\nidentified weaknesses in current algorithms and limitations in existing\nresearch such as accurate and real-time detection, stable data transmission,\nand building bias-free systems. Our survey frames existing works and leads to\npractical recommendations like mitigating the bias issue by using synthetic\ndata, overcoming the hardware limitations with model compression, and\nleveraging fusion to boost model performance. This is a pioneering work to\nsurvey the topic of drowsiness detection in such an entirely and not only\nfocusing on one single aspect. We consider the topic of drowsiness detection as\na dynamic and evolving field, presenting numerous opportunities for further\nexploration.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"LLQJxCJ1c2G0G91G2r5rlSWR-_k8IYdVC_UAJWfugpw","pdfSize":"1682184"}
