{"id":"2408.08425","title":"Physics-Guided Reinforcement Learning System for Realistic Vehicle\n  Active Suspension Control","authors":"Anh N. Nhu, Ngoc-Anh Le, Shihang Li, Thang D.V. Truong","authorsParsed":[["Nhu","Anh N.",""],["Le","Ngoc-Anh",""],["Li","Shihang",""],["Truong","Thang D. V.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 21:22:17 GMT"}],"updateDate":"2024-08-19","timestamp":1723756937000,"abstract":"  The suspension system is a crucial part of the automotive chassis, improving\nvehicle ride comfort and isolating passengers from rough road excitation.\nUnlike passive suspension, which has constant spring and damping coefficients,\nactive suspension incorporates electronic actuators into the system to\ndynamically control stiffness and damping variables. However, effectively\ncontrolling the suspension system poses a challenging task that necessitates\nreal-time adaptability to various road conditions. This paper presents the\nPhysics-Guided Deep Reinforcement Learning (DRL) for adjusting an active\nsuspension system's variable kinematics and compliance properties for a\nquarter-car model in real time. Specifically, the outputs of the model are\ndefined as actuator stiffness and damping control, which are bound within\nphysically realistic ranges to maintain the system's physical compliance. The\nproposed model was trained on stochastic road profiles according to ISO 8608\nstandards to optimize the actuator's control policy. According to qualitative\nresults on simulations, the vehicle body reacts smoothly to various novel\nreal-world road conditions, having a much lower degree of oscillation. These\nobservations mean a higher level of passenger comfort and better vehicle\nstability. Quantitatively, DRL outperforms passive systems in reducing the\naverage vehicle body velocity and acceleration by 43.58% and 17.22%,\nrespectively, minimizing the vertical movement impacts on the passengers. The\ncode is publicly available at github.com/anh-nn01/RL4Suspension-ICMLA23.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}