{"id":"2408.01436","title":"Qubernetes: Towards a Unified Cloud-Native Execution Platform for Hybrid\n  Classic-Quantum Computing","authors":"Vlad Stirbu, Otso Kinanen, Majid Haghparast, Tommi Mikkonen","authorsParsed":[["Stirbu","Vlad",""],["Kinanen","Otso",""],["Haghparast","Majid",""],["Mikkonen","Tommi",""]],"versions":[{"version":"v1","created":"Fri, 19 Jul 2024 06:33:10 GMT"}],"updateDate":"2024-08-07","timestamp":1721370790000,"abstract":"  Context: The emergence of quantum computing proposes a revolutionary paradigm\nthat can radically transform numerous scientific and industrial application\ndomains. The ability of quantum computers to scale computations beyond what the\ncurrent computers are capable of implies better performance and efficiency for\ncertain algorithmic tasks.\n  Objective: However, to benefit from such improvement, quantum computers must\nbe integrated with existing software systems, a process that is not\nstraightforward. In this paper, we propose a unified execution model that\naddresses the challenges that emerge from building hybrid classical-quantum\napplications at scale.\n  Method: Following the Design Science Research methodology, we proposed a\nconvention for mapping quantum resources and artifacts to Kubernetes concepts.\nThen, in an experimental Kubernetes cluster, we conducted experiments for\nscheduling and executing quantum tasks on both quantum simulators and hardware.\n  Results: The experimental results demonstrate that the proposed platform\nQubernetes (or Kubernetes for quantum) exposes the quantum computation tasks\nand hardware capabilities following established cloud-native principles,\nallowing seamless integration into the larger Kubernetes ecosystem.\n  Conclusion: The quantum computing potential cannot be realised without\nseamless integration into classical computing. By validating that it is\npractical to execute quantum tasks in a Kubernetes infrastructure, we pave the\nway for leveraging the existing Kubernetes ecosystem as an enabler for hybrid\nclassical-quantum computing.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Emerging Technologies","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/"}