{"id":"2408.01965","title":"The TRAPUM Small Magellanic Cloud pulsar survey with MeerKAT -- II. Nine\n  new radio timing solutions and glitches from young pulsars","authors":"E. Carli, D. Antonopoulou, M. Burgay, M. J. Keith, L. Levin, Y. Liu,\n  B. W. Stappers, J. D. Turner, E. D. Barr, R. P. Breton, S. Buchner, M.\n  Kramer, P. V. Padmanabh, A. Possenti, V. Venkatraman Krishnan, C. Venter, W.\n  Becker, C. Maitra, F. Haberl, T. Thongmeearkom","authorsParsed":[["Carli","E.",""],["Antonopoulou","D.",""],["Burgay","M.",""],["Keith","M. J.",""],["Levin","L.",""],["Liu","Y.",""],["Stappers","B. W.",""],["Turner","J. D.",""],["Barr","E. D.",""],["Breton","R. P.",""],["Buchner","S.",""],["Kramer","M.",""],["Padmanabh","P. V.",""],["Possenti","A.",""],["Krishnan","V. Venkatraman",""],["Venter","C.",""],["Becker","W.",""],["Maitra","C.",""],["Haberl","F.",""],["Thongmeearkom","T.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:02:56 GMT"}],"updateDate":"2024-08-08","timestamp":1722762176000,"abstract":"  We report new radio timing solutions from a three-year observing campaign\nconducted with the MeerKAT and Murriyang telescopes for nine Small Magellanic\nCloud pulsars, increasing the number of characterised rotation-powered\nextragalactic pulsars by 40 per cent. We can infer from our determined\nparameters that the pulsars are seemingly all isolated, that six are ordinary\npulsars, and that three of the recent MeerKAT discoveries have a young\ncharacteristic age of under 100 kyr and have undergone a spin-up glitch. Two of\nthe sources, PSRs J0040$-$7337 and J0048$-$7317, are energetic young pulsars\nwith spin-down luminosities of the order of 10$^{36}$ erg s$^{-1}$. They both\nexperienced a large glitch, with a change in frequency of about 30 $\\mu$Hz, and\na frequency derivative change of order $-10^{-14}$ Hz s$^{-1}$. These glitches,\nthe inferred glitch rate, and the properties of these pulsars (including\npotentially high inter-glitch braking indices) suggest these neutron stars\nmight be Vela-like repeating glitchers and should be closely monitored in the\nfuture. The position and energetics of PSR J0048$-$7317 confirm it is powering\na new Pulsar Wind Nebula (PWN) detected as a radio continuum source; and\nsimilarly the association of PSR J0040$-$7337 with the PWN of Supernova Remnant\n(SNR) DEM S5 (for which we present a new Chandra image) is strengthened.\nFinally, PSR J0040$-$7335 is also contained within the same SNR but is a chance\nsuperposition. It has also been seen to glitch with a change of frequency of\n$10^{-2}$ $\\mu$Hz. This work more than doubles the characterised population of\nSMC radio pulsars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}