{"id":"2408.14907","title":"Influence of Cavity Geometry on the Bubble Dynamics of Nucleate Pool\n  Boiling","authors":"M.S. Whiting, W.J. van den Bergh, P.E. Theodorakis, M. Everts","authorsParsed":[["Whiting","M. S.",""],["Bergh","W. J. van den",""],["Theodorakis","P. E.",""],["Everts","M.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:34:43 GMT"}],"updateDate":"2024-08-28","timestamp":1724751283000,"abstract":"  Nucleate pool boiling is known for its exceptional heat transfer\ncoefficients, with the use of cavities further improving bubble nucleation and\nheat transfer rate. To promote this heat transfer enhancement technique, a\nthorough understanding of the influence of cavity geometry on single bubble\ndynamics is required. The influence of depth and radius of cylindrical and\nconical cavities on the bubble dynamics of nucleate pool boiling of R1234yf\nwere numerically investigated. The cavity radius was varied between 50 {\\mu}m\nand 400 {\\mu}m and the cavity depth between 100 {\\mu}m and 1000 {\\mu}m at a\nfixed heat flux of 28 kW/m$^2$. It was found that the maximum equivalent\ndiameter prior to departure was constant for cavities with radii smaller than\n120 {\\mu}m, while it increased linearly when increasing the cavity radius\nfurther. Cylindrical cavities exhibited high stability regardless of cavity\nradius or depth whereas conical cavities showed a decrease in vapour retention\nwith increasing cavity angle. During the necking phase, the bubble interface\nbecame pinned at the cavity edge, depending on conical cavity angle, implying\nthat smaller radii allowed for enhanced surface rewetting. Conical cavities\ncould be considered as cylindrical cavities when the cavity angle was less than\na quarter of the interface contact angle. When translating the single cavity\nfindings to cavity array design, cylindrical cavities were recommended as they\nallowed for stable bubble behaviour. For increased nucleation zones and\nrewetting, a sub-critical radius was recommended. Wider cavities were\nrecommended for high superheat conditions as larger bubbles could enhance\nbubble growth.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}