{"id":"2408.14131","title":"GenFormer -- Generated Images are All You Need to Improve Robustness of\n  Transformers on Small Datasets","authors":"Sven Oehri and Nikolas Ebert and Ahmed Abdullah and Didier Stricker\n  and Oliver Wasenm\\\"uller","authorsParsed":[["Oehri","Sven",""],["Ebert","Nikolas",""],["Abdullah","Ahmed",""],["Stricker","Didier",""],["Wasenmüller","Oliver",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:26:08 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 05:54:42 GMT"}],"updateDate":"2024-08-28","timestamp":1724664368000,"abstract":"  Recent studies showcase the competitive accuracy of Vision Transformers\n(ViTs) in relation to Convolutional Neural Networks (CNNs), along with their\nremarkable robustness. However, ViTs demand a large amount of data to achieve\nadequate performance, which makes their application to small datasets\nchallenging, falling behind CNNs. To overcome this, we propose GenFormer, a\ndata augmentation strategy utilizing generated images, thereby improving\ntransformer accuracy and robustness on small-scale image classification tasks.\nIn our comprehensive evaluation we propose Tiny ImageNetV2, -R, and -A as new\ntest set variants of Tiny ImageNet by transferring established ImageNet\ngeneralization and robustness benchmarks to the small-scale data domain.\nSimilarly, we introduce MedMNIST-C and EuroSAT-C as corrupted test set variants\nof established fine-grained datasets in the medical and aerial domain. Through\na series of experiments conducted on small datasets of various domains,\nincluding Tiny ImageNet, CIFAR, EuroSAT and MedMNIST datasets, we demonstrate\nthe synergistic power of our method, in particular when combined with common\ntrain and test time augmentations, knowledge distillation, and architectural\ndesign choices. Additionally, we prove the effectiveness of our approach under\nchallenging conditions with limited training data, demonstrating significant\nimprovements in both accuracy and robustness, bridging the gap between CNNs and\nViTs in the small-scale dataset domain.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}