{"id":"2408.05897","title":"TRIZ-GPT: An LLM-augmented method for problem-solving","authors":"Liuqing Chen, Yaxuan Song, Shixian Ding, Lingyun Sun, Peter Childs,\n  and Haoyu Zuo","authorsParsed":[["Chen","Liuqing",""],["Song","Yaxuan",""],["Ding","Shixian",""],["Sun","Lingyun",""],["Childs","Peter",""],["Zuo","Haoyu",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 02:32:45 GMT"}],"updateDate":"2024-08-13","timestamp":1723429965000,"abstract":"  TRIZ, the Theory of Inventive Problem Solving, is derived from a\ncomprehensive analysis of patents across various domains, offering a framework\nand practical tools for problem-solving. Despite its potential to foster\ninnovative solutions, the complexity and abstractness of TRIZ methodology often\nmake its acquisition and application challenging. This often requires users to\nhave a deep understanding of the theory, as well as substantial practical\nexperience and knowledge across various disciplines. The advent of Large\nLanguage Models (LLMs) presents an opportunity to address these challenges by\nleveraging their extensive knowledge bases and reasoning capabilities for\ninnovative solution generation within TRIZ-based problem-solving process. This\nstudy explores and evaluates the application of LLMs within the TRIZ-based\nproblem-solving process. The construction of TRIZ case collections establishes\na solid empirical foundation for our experiments and offers valuable resources\nto the TRIZ community. A specifically designed workflow, utilizing step-by-step\nreasoning and evaluation-validated prompt strategies, effectively transforms\nconcrete problems into TRIZ problems and finally generates inventive solutions.\nFinally, we present a case study in mechanical engineering field that\nhighlights the practical application of this LLM-augmented method. It showcases\nGPT-4's ability to generate solutions that closely resonate with original\nsolutions and suggests more implementation mechanisms.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}