{"id":"2408.07988","title":"Exploring learning environments for label\\-efficient cancer diagnosis","authors":"Samta Rani, Tanvir Ahmad, Sarfaraz Masood, Chandni Saxena","authorsParsed":[["Rani","Samta",""],["Ahmad","Tanvir",""],["Masood","Sarfaraz",""],["Saxena","Chandni",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:30:21 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 01:50:47 GMT"}],"updateDate":"2024-08-19","timestamp":1723707021000,"abstract":"  Despite significant research efforts and advancements, cancer remains a\nleading cause of mortality. Early cancer prediction has become a crucial focus\nin cancer research to streamline patient care and improve treatment outcomes.\nManual tumor detection by histopathologists can be time consuming, prompting\nthe need for computerized methods to expedite treatment planning. Traditional\napproaches to tumor detection rely on supervised learning, necessitates a large\namount of annotated data for model training. However, acquiring such extensive\nlabeled data can be laborious and time\\-intensive. This research examines the\nthree learning environments: supervised learning (SL), semi\\-supervised\nlearning (Semi\\-SL), and self\\-supervised learning (Self\\-SL): to predict\nkidney, lung, and breast cancer. Three pre\\-trained deep learning models\n(Residual Network\\-50, Visual Geometry Group\\-16, and EfficientNetB0) are\nevaluated based on these learning settings using seven carefully curated\ntraining sets. To create the first training set (TS1), SL is applied to all\nannotated image samples. Five training sets (TS2\\-TS6) with different ratios of\nlabeled and unlabeled cancer images are used to evaluateSemi\\-SL. Unlabeled\ncancer images from the final training set (TS7) are utilized for Self\\-SL\nassessment. Among different learning environments, outcomes from the Semi\\-SL\nsetting show a strong degree of agreement with the outcomes achieved in the SL\nsetting. The uniform pattern of observations from the pre\\-trained models\nacross all three datasets validates the methodology and techniques of the\nresearch. Based on modest number of labeled samples and minimal computing cost,\nour study suggests that the Semi\\-SL option can be a highly viable replacement\nfor the SL option under label annotation constraint scenarios.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pSkZpjZCdXTxCJWp3FTHHk0T7MtwOl7iePFhJ1p7JwA","pdfSize":"1081602"}
