{"id":"2408.09606","title":"Global weather map reveals persistent top-of-atmosphere features on the\n  nearest brown dwarfs","authors":"Xueqing Chen, Beth A. Biller, Johanna M. Vos, Ian J. M. Crossfield,\n  Gregory N. Mace, Callie E. Hood, Xianyu Tan, Katelyn N. Allers, Emily C.\n  Martin, Emma Bubb, Jonathan J. Fortney, Caroline V. Morley, Mark Hammond","authorsParsed":[["Chen","Xueqing",""],["Biller","Beth A.",""],["Vos","Johanna M.",""],["Crossfield","Ian J. M.",""],["Mace","Gregory N.",""],["Hood","Callie E.",""],["Tan","Xianyu",""],["Allers","Katelyn N.",""],["Martin","Emily C.",""],["Bubb","Emma",""],["Fortney","Jonathan J.",""],["Morley","Caroline V.",""],["Hammond","Mark",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 22:23:24 GMT"}],"updateDate":"2024-08-23","timestamp":1724019804000,"abstract":"  Brown dwarfs and planetary-mass companions display rotationally modulated\nphotometric variability, especially those near the L/T transition. This\nvariability is commonly attributed to top-of-atmosphere (TOA) inhomogeneities,\nwith proposed models including patchy thick and thin clouds, planetary-scale\njets, or chemical disequilibrium. Surface mapping techniques are powerful tools\nto probe their atmospheric structures and distinguish between models. One of\nthe most successful methods for stellar surface mapping is Doppler imaging,\nwhere the existence of TOA inhomogeneities can be inferred from their varying\nDoppler shifts across the face of a rotating star. We applied Doppler imaging\nto the nearest brown dwarf binary WISE 1049AB (aka Luhman 16AB) using\ntime-resolved, high-resolution spectroscopic observations from Gemini IGRINS,\nand obtained for the first time H and K band simultaneous global weather map\nfor brown dwarfs. Compared to the only previous Doppler map for a brown dwarf\nin 2014 featuring a predominant mid-latitude cold spot on WISE 1049B and no\nfeature on WISE 1049A, our observations detected persistent spot-like\nstructures on WISE 1049B in the equatorial to mid-latitude regions on two\nnights, and revealed new polar spots on WISE 1049A. Our results suggest\nstability of atmospheric features over timescale of days and possible long-term\nstable or recurring structures. H and K band maps displayed similar structures\nin and out of CO bands, indicating the cold spots not solely due to chemical\nhotspots but must involve clouds. Upcoming 30-m extremely large telescopes\n(ELTs) will enable more sensitive Doppler imaging of dozens of brown dwarfs and\neven a small number of directly-imaged exoplanets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}