{"id":"2408.07490","title":"Attention-Guided Perturbation for Unsupervised Image Anomaly Detection","authors":"Tingfeng Huang, Yuxuan Cheng, Jingbo Xia, Rui Yu, Yuxuan Cai, Jinhai\n  Xiang, Xinwei He, Xiang Bai","authorsParsed":[["Huang","Tingfeng",""],["Cheng","Yuxuan",""],["Xia","Jingbo",""],["Yu","Rui",""],["Cai","Yuxuan",""],["Xiang","Jinhai",""],["He","Xinwei",""],["Bai","Xiang",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 12:12:43 GMT"}],"updateDate":"2024-08-15","timestamp":1723637563000,"abstract":"  Reconstruction-based methods have significantly advanced modern unsupervised\nanomaly detection. However, the strong capacity of neural networks often\nviolates the underlying assumptions by reconstructing abnormal samples well. To\nalleviate this issue, we present a simple yet effective reconstruction\nframework named Attention-Guided Pertuation Network (AGPNet), which learns to\nadd perturbation noise with an attention mask, for accurate unsupervised\nanomaly detection. Specifically, it consists of two branches, \\ie, a plain\nreconstruction branch and an auxiliary attention-based perturbation branch. The\nreconstruction branch is simply a plain reconstruction network that learns to\nreconstruct normal samples, while the auxiliary branch aims to produce\nattention masks to guide the noise perturbation process for normal samples from\neasy to hard. By doing so, we are expecting to synthesize hard yet more\ninformative anomalies for training, which enable the reconstruction branch to\nlearn important inherent normal patterns both comprehensively and efficiently.\nExtensive experiments are conducted on three popular benchmarks covering\nMVTec-AD, VisA, and MVTec-3D, and show that our framework obtains leading\nanomaly detection performance under various setups including few-shot,\none-class, and multi-class setups.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PamXavjzxKDcirLTIo2hrnNLKOtqUCmiJz8owtXW7zQ","pdfSize":"911521"}
