{"id":"2408.16398","title":"Pair Counting without Binning -- A New Approach to Correlation Functions\n  in Clustering Statistics","authors":"Shiyu Yue, Longlong Feng, Wenjie Ju, Jun Pan, Zhiqi Huang, Feng Fang,\n  Zhuoyang Li, Yan-Chuan Cai, Weishan Zhu","authorsParsed":[["Yue","Shiyu",""],["Feng","Longlong",""],["Ju","Wenjie",""],["Pan","Jun",""],["Huang","Zhiqi",""],["Fang","Feng",""],["Li","Zhuoyang",""],["Cai","Yan-Chuan",""],["Zhu","Weishan",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 09:58:25 GMT"}],"updateDate":"2024-08-30","timestamp":1724925505000,"abstract":"  This paper presents a novel perspective on correlation functions in the\nclustering analysis of the large-scale structure of the universe. We first\nrecognise that pair counting in bins of radial separation is equivalent to\nevaluating counts-in-cells (CIC), which can be modelled using a filtered\ndensity field with a binning-window function. This insight leads to an in situ\nexpression for the two-point correlation function (2PCF). Essentially, the core\nidea underlying our method is to introduce a window function to define the\nbinning scheme, enabling pair-counting without binning. This approach develops\na concept of generalised 2PCF, which extends beyond conventional discrete pair\ncounting by accommodating non-sharp-edged window functions. To extend this\nframework to N-point correlation functions (NPCF) using current optimal\nedge-corrected estimators, we developed a binning scheme independent of the\nspecific parameterisation of polyhedral configurations. In particular, we\ndemonstrate a fast algorithm for the three-point correlation function (3PCF),\nwhere triplet counting is accomplished by assigning either a spherical tophat\nor a Gaussian filter to each vertex of triangles. Additionally, we derive\nanalytical expressions for the 3PCF using a multipole expansion in Legendre\npolynomials, accounting for filtered field (binning) corrections. Numerical\ntests using several suites of N-body simulation samples show that our approach\naligns remarkably well with the theoretical predictions. Our method provides an\nexact solution for quantifying binning effects in practical measurements and\noffers a high-speed algorithm, enabling high-order clustering analysis in\nextremely large datasets from ongoing and upcoming surveys such as Euclid,\nLSST, and DESI.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}