{"id":"2408.03396","title":"Constraining the duration of ram pressure stripping features in the\n  optical from the direction of jellyfish galaxy tails","authors":"Vicente Salinas, Yara L. Jaff\\'e, Rory Smith, Jong-Ho Shinn, Jacob P.\n  Crossett, Marco Gullieuszik, Gemma Gonz\\'alez-Tor\\`a, Franco Piraino-Cerda,\n  Bianca Poggianti, Benedetta Vulcani, Andrea Biviano, Ana C. C. Louren\\c{c}o,\n  Lawrence E. Bilton, Kshitija Kelkar, Paula Calder\\'on-Castillo","authorsParsed":[["Salinas","Vicente",""],["Jaffé","Yara L.",""],["Smith","Rory",""],["Shinn","Jong-Ho",""],["Crossett","Jacob P.",""],["Gullieuszik","Marco",""],["González-Torà","Gemma",""],["Piraino-Cerda","Franco",""],["Poggianti","Bianca",""],["Vulcani","Benedetta",""],["Biviano","Andrea",""],["Lourenço","Ana C. C.",""],["Bilton","Lawrence E.",""],["Kelkar","Kshitija",""],["Calderón-Castillo","Paula",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 18:45:36 GMT"}],"updateDate":"2024-08-08","timestamp":1722969936000,"abstract":"  Ram pressure stripping is perhaps the most efficient mechanism for removing\ngas and quenching galaxies in dense environments as they move through the\nintergalactic medium. Extreme examples of on-going ram pressure stripping are\nknown as jellyfish galaxies, characterized by a tail of stripped material that\ncan be directly observed in multiple wavelengths. Using the largest homogeneous\nbroad-band optical jellyfish candidate sample in local clusters known to date,\nwe measure the angle between the direction of the tails visible in the\ngalaxies, and the direction towards the host cluster center. We find that\n$33\\%$ of the galaxy tails point away from the cluster center, $18\\%$ point\ntowards the cluster center, and $49\\%$ point elsewhere. Moreover, we find\nstronger signatures of ram pressure stripping happening on galaxies with a tail\npointing away and towards the cluster center, and larger velocity dispersion\nprofiles for galaxies with tails pointing away. These results are consistent\nwith a scenario where ram pressure stripping has a stronger effect for galaxies\nfollowing radial orbits on first infall. The results also suggest that in many\ncases, radially infalling galaxies are able to retain their tails after\npericenter and continue to experience significant on-going ram pressure\nstripping. We further constrain the lifespan of the optical tails from the\nmoment they first appear to the moment they disappear, by comparing the\nobserved tail directions with matched N-body simulations through Bayesian\nparameter estimation. We obtain that galaxy tails appear for the first time at\n$\\sim 1.16$ R$_{200}$ and disappear $\\sim660$ Myr after pericenter.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}