{"id":"2408.04681","title":"Conversational AI Powered by Large Language Models Amplifies False\n  Memories in Witness Interviews","authors":"Samantha Chan, Pat Pataranutaporn, Aditya Suri, Wazeer Zulfikar,\n  Pattie Maes, Elizabeth F. Loftus","authorsParsed":[["Chan","Samantha",""],["Pataranutaporn","Pat",""],["Suri","Aditya",""],["Zulfikar","Wazeer",""],["Maes","Pattie",""],["Loftus","Elizabeth F.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 04:55:03 GMT"}],"updateDate":"2024-08-12","timestamp":1723092903000,"abstract":"  This study examines the impact of AI on human false memories -- recollections\nof events that did not occur or deviate from actual occurrences. It explores\nfalse memory induction through suggestive questioning in Human-AI interactions,\nsimulating crime witness interviews. Four conditions were tested: control,\nsurvey-based, pre-scripted chatbot, and generative chatbot using a large\nlanguage model (LLM). Participants (N=200) watched a crime video, then\ninteracted with their assigned AI interviewer or survey, answering questions\nincluding five misleading ones. False memories were assessed immediately and\nafter one week. Results show the generative chatbot condition significantly\nincreased false memory formation, inducing over 3 times more immediate false\nmemories than the control and 1.7 times more than the survey method. 36.4% of\nusers' responses to the generative chatbot were misled through the interaction.\nAfter one week, the number of false memories induced by generative chatbots\nremained constant. However, confidence in these false memories remained higher\nthan the control after one week. Moderating factors were explored: users who\nwere less familiar with chatbots but more familiar with AI technology, and more\ninterested in crime investigations, were more susceptible to false memories.\nThese findings highlight the potential risks of using advanced AI in sensitive\ncontexts, like police interviews, emphasizing the need for ethical\nconsiderations.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computers and Society","Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"UeySjP1DCOu63R978Q8d4EDh6WPQ0PNDKiRfy-yr0DA","pdfSize":"2082755"}
