{"id":"2408.03779","title":"V407 Lup, an intermediate polar nova","authors":"M. Orio, M. Melicher\\v{c}\\'ik, S. Ciroi, V. Canton, E. Aydi, D. A. H.\n  Buckley, A. Dobrotka, G.J.M. Luna, and J. Ness","authorsParsed":[["Orio","M.",""],["Melicherčík","M.",""],["Ciroi","S.",""],["Canton","V.",""],["Aydi","E.",""],["Buckley","D. A. H.",""],["Dobrotka","A.",""],["Luna","G. J. M.",""],["Ness","J.",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:06:15 GMT"}],"updateDate":"2024-08-08","timestamp":1723039575000,"abstract":"  We present X-ray and optical observations of nova V407 Lup (Nova Lup 2016),\npreviously well monitored in outburst, as it returned to quiescent accretion.\nThe X-ray light curve in 2020 February revealed a clear flux modulation with a\nstable period of 564.64$\\pm$0.64 s, corresponding to the period measured in\noutburst and attributed to the spin of a magnetized white dwarf in an\nintermediate polar (IP) system. This detection in quiescence is consistent with\nthe IP classification proposed after the nova eruption. The XMM-Newton EPIC\nX-ray flux is about 1.3 $\\times 10^{-12}$ erg/cm$^2$/s at a distance, most\nlikely, larger than 5 kpc, emitted in the whole 0.2-12 keV range without a\nsignificant cut-off energy. The X-ray spectra are complex; they can be fitted\nincluding a power law component with a relatively flat slope (a power law index\nof about 1), although, alternatively, a hard thermal component at kT$\\geq$19\nkeV also yields a good fit. The SALT optical spectra obtained in 2019 March and\n2022 May are quite typical of IPs, with strong emission lines, including some\ndue to a high ionization potential, like He II at 4685.7 Angstrom. Nebular\nlines of O [III] were prominent in 2019 March, but their intensity and\nequivalent width appeared to be decreasing during that month, and they were no\nlonger detectable in 2022, indicating that the nova ejecta dispersed. Complex\nprofiles of the He II lines of V407 Lup are also characteristic of IPs, giving\nfurther evidence for this classification.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ud7k2Av2_rP_0hc85fRl56bwQBPlcxYAvWAK9QU-V_A","pdfSize":"2874160"}
