{"id":"2408.09083","title":"Imaginary Hamiltonian variational ansatz for combinatorial optimization\n  problems","authors":"Xiaoyang Wang, Yahui Chai, Xu Feng, Yibin Guo, Karl Jansen, Cenk\n  T\\\"uys\\\"uz","authorsParsed":[["Wang","Xiaoyang",""],["Chai","Yahui",""],["Feng","Xu",""],["Guo","Yibin",""],["Jansen","Karl",""],["Tüysüz","Cenk",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 03:34:17 GMT"}],"updateDate":"2024-08-20","timestamp":1723865657000,"abstract":"  Obtaining exact solutions to combinatorial optimization problems using\nclassical computing is computationally expensive. The current tenet in the\nfield is that quantum computers can address these problems more efficiently.\nWhile promising algorithms require fault-tolerant quantum hardware, variational\nalgorithms have emerged as viable candidates for near-term devices. The success\nof these algorithms hinges on multiple factors, with the design of the ansatz\nhaving the utmost importance. It is known that popular approaches such as\nquantum approximate optimization algorithm (QAOA) and quantum annealing suffer\nfrom adiabatic bottlenecks, that lead to either larger circuit depth or\nevolution time. On the other hand, the evolution time of imaginary time\nevolution is bounded by the inverse energy gap of the Hamiltonian, which is\nconstant for most non-critical physical systems. In this work, we propose\nimaginary Hamiltonian variational ansatz ($i$HVA) inspired by quantum imaginary\ntime evolution to solve the MaxCut problem. We introduce a tree arrangement of\nthe parametrized quantum gates, enabling the exact solution of arbitrary tree\ngraphs using the one-round $i$HVA. For randomly generated $D$-regular graphs,\nwe numerically demonstrate that the $i$HVA solves the MaxCut problem with a\nsmall constant number of rounds and sublinear depth, outperforming QAOA, which\nrequires rounds increasing with the graph size. Furthermore, our ansatz solves\nMaxCut exactly for graphs with up to 24 nodes and $D \\leq 5$, whereas only\napproximate solutions can be derived by the classical near-optimal\nGoemans-Williamson algorithm. We validate our simulated results with hardware\nexperiments on a graph with 63 nodes.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}