{"id":"2408.10320","title":"The Carousel Lens: A Well-Modeled Strong Lens with Multiple Lensed\n  Sources","authors":"William Sheu, Aleksandar Cikota, Xiaosheng Huang, Karl Glazebrook,\n  Christopher Storfer, Shrihan Agarwal, David J. Schlegel, Nao Suzuki, Tania M.\n  Barone, Fuyan Bian, Tesla Jeltema, Tucker Jones, Glenn G. Kacprzak, Jackson\n  H. O'Donnell, Keerthi Vasan G. C","authorsParsed":[["Sheu","William",""],["Cikota","Aleksandar",""],["Huang","Xiaosheng",""],["Glazebrook","Karl",""],["Storfer","Christopher",""],["Agarwal","Shrihan",""],["Schlegel","David J.",""],["Suzuki","Nao",""],["Barone","Tania M.",""],["Bian","Fuyan",""],["Jeltema","Tesla",""],["Jones","Tucker",""],["Kacprzak","Glenn G.",""],["O'Donnell","Jackson H.",""],["C","Keerthi Vasan G.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-21","timestamp":1724090406000,"abstract":"  Over the past few years alone, the lensing community has discovered thousands\nof strong lens candidates, and spectroscopically confirmed hundreds of them. In\nthis time of abundance, it becomes pragmatic to focus our time and resources on\nthe few extraordinary systems, in order to most efficiently study the universe.\nIn this paper, we present such a system: DESI-090.9854-35.9683, a cluster-scale\nlens at $z_{\\rm l} = 0.49$, with seven observed lensed sources around the core,\nand additional lensed sources further out in the cluster. From the number and\nthe textbook configuration of the lensed images, a tight constraint on the mass\npotential of the lens is possible. This would allow for detailed analysis on\nthe dark and luminous matter content within galaxy clusters, as well as a probe\ninto dark energy and high-redshift galaxies. We present our spatially resolved\nkinematic measurements of this system from the Very Large Telescope Multi Unit\nSpectroscopic Explorer, which confirm five of these source galaxies (in\nascending order, at $z_{\\rm s} = 0.962, 0.962, 1.166, 1.432,$ and $1.432$).\nWith previous Hubble Space Telescope imaging in the F140W and F200LP bands, we\nalso present a simple two power-law profile flux-based lens model that, for a\ncluster lens, well models the five lensed arc families with redshifts. We\ndetermine the mass to be $M(< \\theta_{\\rm E}) = 4.78\\times10^{13} M_{\\odot}$\nfor the primary mass potential. From the model, we extrapolate the redshift of\none of the two source galaxies not yet spectroscopically confirmed to be at\n$z_{\\rm s}=4.52^{+1.03}_{-0.71}$.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}