{"id":"2408.17430","title":"Virtual EVE: a Deep Learning Model for Solar Irradiance Prediction","authors":"Manuel Indaco, Daniel Gass, William James Fawcett, Richard Galvez,\n  Paul J. Wright, Andr\\'es Mu\\~noz-Jaramillo","authorsParsed":[["Indaco","Manuel",""],["Gass","Daniel",""],["Fawcett","William James",""],["Galvez","Richard",""],["Wright","Paul J.",""],["Muñoz-Jaramillo","Andrés",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:28:48 GMT"}],"updateDate":"2024-09-02","timestamp":1725038928000,"abstract":"  Understanding space weather is vital for the protection of our terrestrial\nand space infrastructure. In order to predict space weather accurately, large\namounts of data are required, particularly in the extreme ultraviolet (EUV)\nspectrum. An exquisite source of information for such data is provided by the\nSolar Dynamic Observatory (SDO), which has been gathering solar measurements\nfor the past 13 years. However, after a malfunction in 2014 affecting the\nonboard Multiple EUV Grating Spectrograph A (MEGS-A) instrument, the scientific\noutput in terms of EUV measurements has been significantly degraded. Building\nupon existing research, we propose to utilize deep learning for the\nvirtualization of the defective instrument. Our architecture features a linear\ncomponent and a convolutional neural network (CNN) -- with EfficientNet as a\nbackbone. The architecture utilizes as input grayscale images of the Sun at\nmultiple frequencies -- provided by the Atmospheric Imaging Assembly (AIA) --\nas well as solar magnetograms produced by the Helioseismic and Magnetic Imager\n(HMI). Our findings highlight how AIA data are all that is needed for accurate\npredictions of solar irradiance. Additionally, our model constitutes an\nimprovement with respect to the state-of-the-art in the field, further\npromoting the idea of deep learning as a viable option for the virtualization\nof scientific instruments.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"ebRE7LlC3OVaMn3F61fYecq__5nGItnkZ1P4Tp43jVg","pdfSize":"2974648"}
