{"id":"2408.17066","title":"Non-verbal Interaction and Interface with a Quadruped Robot using Body\n  and Hand Gestures: Design and User Experience Evaluation","authors":"Soohyun Shin, Trevor Evetts, Hunter Saylor, Hyunji Kim, Soojin Woo,\n  Wonhwha Rhee, Seong-Woo Kim","authorsParsed":[["Shin","Soohyun",""],["Evetts","Trevor",""],["Saylor","Hunter",""],["Kim","Hyunji",""],["Woo","Soojin",""],["Rhee","Wonhwha",""],["Kim","Seong-Woo",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 07:50:18 GMT"}],"updateDate":"2024-09-02","timestamp":1725004218000,"abstract":"  In recent years, quadruped robots have attracted significant attention due to\ntheir practical advantages in maneuverability, particularly when navigating\nrough terrain and climbing stairs. As these robots become more integrated into\nvarious industries, including construction and healthcare, researchers have\nincreasingly focused on developing intuitive interaction methods such as speech\nand gestures that do not require separate devices such as keyboards or\njoysticks. This paper aims at investigating a comfortable and efficient\ninteraction method with quadruped robots that possess a familiar form factor.\nTo this end, we conducted two preliminary studies to observe how individuals\nnaturally interact with a quadruped robot in natural and controlled settings,\nfollowed by a prototype experiment to examine human preferences for body-based\nand hand-based gesture controls using a Unitree Go1 Pro quadruped robot. We\nassessed the user experience of 13 participants using the User Experience\nQuestionnaire and measured the time taken to complete specific tasks. The\nfindings of our preliminary results indicate that humans have a natural\npreference for communicating with robots through hand and body gestures rather\nthan speech. In addition, participants reported higher satisfaction and\ncompleted tasks more quickly when using body gestures to interact with the\nrobot. This contradicts the fact that most gesture-based control technologies\nfor quadruped robots are hand-based. The video is available at\nhttps://youtu.be/rysv1p1zvp4.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}