{"id":"2408.05036","title":"When do molecular polaritons behave like optical filters?","authors":"Kai Schwennicke, Arghadip Koner, Juan B. P\\'erez-S\\'anchez, Wei Xiong,\n  Noel C. Giebink, Marissa L. Weichman, and Joel Yuen-Zhou","authorsParsed":[["Schwennicke","Kai",""],["Koner","Arghadip",""],["Pérez-Sánchez","Juan B.",""],["Xiong","Wei",""],["Giebink","Noel C.",""],["Weichman","Marissa L.",""],["Yuen-Zhou","Joel",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:48:34 GMT"}],"updateDate":"2024-08-12","timestamp":1723207714000,"abstract":"  This perspective outlines several linear optical effects featured by\nmolecular polaritons arising in the collective strong light-matter coupling\nregime, focusing on the limit when the number of molecules per photon mode is\nlarge. We show that, under these circumstances, molecular absorption within a\ncavity can be understood as the overlap between the polariton transmission and\nbare molecular absorption spectra, suggesting that polaritons act in part as\noptical filters. This framework demystifies and provides a straightforward\nexplanation for a large class of theoretical models of polaritonic phenomena,\nhighlighting that similar effects might be achievable outside a cavity with\nshaped laser pulses. With a few modifications, this simple conceptual picture\ncan also be adapted to understand the incoherent nonlinear response of\npolaritonic systems. However, we note that there are experimental observations\nin the collective regime that exhibit phenomena that go beyond this treatment.\nOur analysis underscores the importance of the notion that the field still\nneeds to establish a clear distinction between polaritonic phenomena that can\nbe fully explained through classical optics and those that require a more\nadvanced theoretical framework. The linear optics approach presented here is\nexact when the number of molecules tends to infinity and is quite accurate for\na large, but finite, number of molecules. We highlight the limitations of this\ntreatment when the rates of the single-molecule processes that facilitate\ndark-state-to-polariton relaxation cannot be neglected and in systems under\nstrong coupling with few molecules. Further exploration in these areas is\nneeded to uncover novel polaritonic phenomena.\n","subjects":["Physics/Chemical Physics","Physics/Optics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-VILJmCtUwlJrqHVOKtmH9l4omu2My5_ttngplVxkUk","pdfSize":"30874406"}
