{"id":"2408.14217","title":"Probabilistic Analysis and Empirical Validation of Patricia Tries in\n  Ethereum State Management","authors":"Oleksandr Kuznetsov, Anton Yezhov, Kateryna Kuznetsova, Oleksandr\n  Domin","authorsParsed":[["Kuznetsov","Oleksandr",""],["Yezhov","Anton",""],["Kuznetsova","Kateryna",""],["Domin","Oleksandr",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 12:31:44 GMT"}],"updateDate":"2024-08-27","timestamp":1724675504000,"abstract":"  This study presents a comprehensive theoretical and empirical analysis of\nPatricia tries, the fundamental data structure underlying Ethereum's state\nmanagement system. We develop a probabilistic model characterizing the\ndistribution of path lengths in Patricia tries containing random Ethereum\naddresses and validate this model through extensive computational experiments.\nOur findings reveal the logarithmic scaling of average path lengths with\nrespect to the number of addresses, confirming a crucial property for\nEthereum's scalability. The study demonstrates high precision in predicting\naverage path lengths, with discrepancies between theoretical and experimental\nresults not exceeding 0.01 across tested scales from 100 to 100,000 addresses.\nWe identify and verify the right-skewed nature of path length distributions,\nproviding insights into worst-case scenarios and informing optimization\nstrategies. Statistical analysis, including chi-square goodness-of-fit tests,\nstrongly supports the model's accuracy. The research offers structural insights\ninto node concentration at specific trie levels, suggesting avenues for\noptimizing storage and retrieval mechanisms. These findings contribute to a\ndeeper understanding of Ethereum's fundamental data structures and provide a\nsolid foundation for future optimizations. The study concludes by outlining\npotential directions for future research, including investigations into\nextreme-scale behavior, dynamic trie performance, and the applicability of the\nmodel to non-uniform address distributions and other blockchain systems.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}