{"id":"2408.12360","title":"Recursive Distributed Collaborative Aided Inertial Navigation","authors":"Roland Jung","authorsParsed":[["Jung","Roland",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 12:58:16 GMT"}],"updateDate":"2024-08-23","timestamp":1724331496000,"abstract":"  In this dissertation, we investigate the issue of robust localization in\nswarms of heterogeneous mobile agents with multiple and time-varying sensing\nmodalities. Our focus is the development of filter-based and decoupled\nestimators under the assumption that agents possess communication and\nprocessing capabilities. Based on the findings from Distributed Collaborative\nState Estimation and modular sensor fusion, we propose a novel Kalman filter\ndecoupling paradigm, which is termed Isolated Kalman Filtering (IKF). This\nparadigm is formally discussed and the treatment of delayed measurement is\nstudied. The impact of approximation made was investigated on different\nobservation graphs and the filter credibility was evaluated on a linear system\nin a Monte Carlo simulation. Finally, we propose a multi-agent modular sensor\nfusion approach based on the IKF paradigm, in order to cooperatively estimate\nthe global state of a multi-agent system in a distributed way and fuse\ninformation provided by different on-board sensors in a computationally\nefficient way. As a consequence, this approach can be performed distributed\namong agents, while (i) communication between agents is only required at the\nmoment of inter-agent joint observations, (ii) one agent acts as interim master\nto process state corrections isolated, (iii) agents can be added and removed\nfrom the swarm, (iv) each agent's full state can vary during mission (each\nlocal sensor suite can be truly modular), and (v) delayed and multi-rate sensor\nupdates are supported. Extensive evaluation on realistic simulated and\nreal-world data sets show that the proposed Isolated Kalman Filtering (IKF)\nparadigm, is applicable for both, truly modular single agent estimation and\ndistributed collaborative multi-agent estimation problems.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}