{"id":"2408.17011","title":"Disease Classification and Impact of Pretrained Deep Convolution Neural\n  Networks on Diverse Medical Imaging Datasets across Imaging Modalities","authors":"Jutika Borah, Kumaresh Sarmah, Hidam Kumarjit Singh","authorsParsed":[["Borah","Jutika",""],["Sarmah","Kumaresh",""],["Singh","Hidam Kumarjit",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 04:51:19 GMT"},{"version":"v2","created":"Mon, 2 Sep 2024 06:31:48 GMT"}],"updateDate":"2024-09-04","timestamp":1724993479000,"abstract":"  Imaging techniques such as Chest X-rays, whole slide images, and optical\ncoherence tomography serve as the initial screening and detection for a wide\nvariety of medical pulmonary and ophthalmic conditions respectively. This paper\ninvestigates the intricacies of using pretrained deep convolutional neural\nnetworks with transfer learning across diverse medical imaging datasets with\nvarying modalities for binary and multiclass classification. We conducted a\ncomprehensive performance analysis with ten network architectures and model\nfamilies each with pretraining and random initialization. Our finding showed\nthat the use of pretrained models as fixed feature extractors yields poor\nperformance irrespective of the datasets. Contrary, histopathology microscopy\nwhole slide images have better performance. It is also found that deeper and\nmore complex architectures did not necessarily result in the best performance.\nThis observation implies that the improvements in ImageNet are not parallel to\nthe medical imaging tasks. Within a medical domain, the performance of the\nnetwork architectures varies within model families with shifts in datasets.\nThis indicates that the performance of models within a specific modality may\nnot be conclusive for another modality within the same domain. This study\nprovides a deeper understanding of the applications of deep learning techniques\nin medical imaging and highlights the impact of pretrained networks across\ndifferent medical imaging datasets under five different experimental settings.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}