{"id":"2408.09835","title":"Experimental Characterization of Hydrodynamic Gating-Based Molecular\n  Communication Transmitter","authors":"Eren Akyol, Ahmet Baha Ozturk, Iman Mokari Bolhassan, Murat Kuscu","authorsParsed":[["Akyol","Eren",""],["Ozturk","Ahmet Baha",""],["Bolhassan","Iman Mokari",""],["Kuscu","Murat",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:29:52 GMT"}],"updateDate":"2024-08-20","timestamp":1724059792000,"abstract":"  Molecular communication (MC) is a bio-inspired method of transmitting\ninformation using biochemical signals, promising for novel medical,\nagricultural, and environmental applications at the intersection of bio-,\nnano-, and communication technologies. Developing reliable MC systems for\nhigh-rate information transfer remains challenging due to the complex and\ndynamic nature of application environments and the physical and resource\nlimitations of micro/nanoscale transmitters and receivers. Microfluidics can\nhelp overcome many such practical challenges by enabling testbeds that can\nreplicate the application media with precise control over flow conditions.\nHowever, existing microfluidic MC testbeds face significant limitations in\nchemical signal generation with programmable signal waveforms, e.g., in terms\nof pulse width. To tackle this, we previously proposed a practical microfluidic\nMC transmitter architecture based on the hydrodynamic gating technique, a\nprevalent chemical waveform generation method. This paper reports the\nexperimental validation and characterization of this method, examining its\nprecision in terms of spatiotemporal control on the generated molecular\nconcentration pulses. We detail the fabrication of the transmitter, its working\nmechanism and discuss its potential limitations based on empirical data. We\nshow that the microfluidic transmitter is capable of providing precise,\nprogrammable, and reproducible molecular concentration pulses, which would\nfacilitate the experimental research in MC.\n","subjects":["Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}