{"id":"2408.12134","title":"Machine Learning-based Channel Prediction in Wideband Massive MIMO\n  Systems with Small Overhead for Online Training","authors":"Beomsoo Ko, Hwanjin Kim, Minje Kim, Junil Choi","authorsParsed":[["Ko","Beomsoo",""],["Kim","Hwanjin",""],["Kim","Minje",""],["Choi","Junil",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 05:34:09 GMT"}],"updateDate":"2024-08-23","timestamp":1724304849000,"abstract":"  Channel prediction compensates for outdated channel state information in\nmultiple-input multiple-output (MIMO) systems. Machine learning (ML) techniques\nhave recently been implemented to design channel predictors by leveraging the\ntemporal correlation of wireless channels. However, most ML-based channel\nprediction techniques have only considered offline training when generating\nchannel predictors, which can result in poor performance when encountering\nchannel environments different from the ones they were trained on. To ensure\nprediction performance in varying channel conditions, we propose an online\nre-training framework that trains the channel predictor from scratch to\neffectively capture and respond to changes in the wireless environment. The\ntraining time includes data collection time and neural network training time,\nand should be minimized for practical channel predictors. To reduce the\ntraining time, especially data collection time, we propose a novel ML-based\nchannel prediction technique called aggregated learning (AL) approach for\nwideband massive MIMO systems. In the proposed AL approach, the training data\ncan be split and aggregated either in an array domain or frequency domain,\nwhich are the channel domains of MIMO-OFDM systems. This processing can\nsignificantly reduce the time for data collection. Our numerical results show\nthat the AL approach even improves channel prediction performance in various\nscenarios with small training time overhead.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}