{"id":"2408.10184","title":"Participatory Mapping of Local Green Hydrogen Cost-Potentials in\n  Sub-Saharan Africa","authors":"C. Winkler, H. Heinrichs, S. Ishmam, B. Bayat, A. Lahnaoui, S. Agbo,\n  E. U. Pe\\~na Sanchez, D. Franzmann, N. Oijeabou, C. Koerner, Y. Michael, B.\n  Oloruntoba, C. Montzka, H. Vereecken, H. Hendricks Franssen, J. Brendt, S.\n  Brauner, W. Kuckshinrichs, S. Venghaus, D. Kone, B. Korgo, K. Ogunjobi, J.\n  Olwoch, V. Chiteculo, Z. Getenga, J. Lin{\\ss}en and D. Stolten","authorsParsed":[["Winkler","C.",""],["Heinrichs","H.",""],["Ishmam","S.",""],["Bayat","B.",""],["Lahnaoui","A.",""],["Agbo","S.",""],["Sanchez","E. U. Peña",""],["Franzmann","D.",""],["Oijeabou","N.",""],["Koerner","C.",""],["Michael","Y.",""],["Oloruntoba","B.",""],["Montzka","C.",""],["Vereecken","H.",""],["Franssen","H. Hendricks",""],["Brendt","J.",""],["Brauner","S.",""],["Kuckshinrichs","W.",""],["Venghaus","S.",""],["Kone","D.",""],["Korgo","B.",""],["Ogunjobi","K.",""],["Olwoch","J.",""],["Chiteculo","V.",""],["Getenga","Z.",""],["Linßen","J.",""],["Stolten","D.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:42:25 GMT"}],"updateDate":"2024-08-20","timestamp":1724089345000,"abstract":"  Green hydrogen is a promising solution within carbon free energy systems with\nSub-Saharan Africa being a possibly well-suited candidate for its production.\nHowever, green hydrogen in Sub-Saharan Africa is not yet investigated in\ndetail. This work determines the green hydrogen cost-potential for green\nhydrogen within this region. Therefore, a potential analysis for PV, wind and\nhydropower, groundwater analysis, and energy systems optimization are\nconducted. The results are evaluated under local socio-economic factors.\nResults show that hydrogen costs start at 1.6 EUR/kg in Mauritania with a total\npotential of ~259 TWh/a under 2 EUR/kg in 2050. Two third of the regions\nexperience groundwater limitations and need desalination at surplus costs of\n~1% of hydrogen costs. Socio-economic analysis show, that green hydrogen\ndeployment can be hindered along the Upper Guinea Coast and the African Great\nLakes, driven by limited energy access, low labor costs in West Africa, and\nhigh labor potential in other regions.\n","subjects":["Economics/General Economics","Quantitative Finance/Economics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}