{"id":"2408.08355","title":"Model implementations of axion dark matter from kinetic misalignment","authors":"Cem Er\\\"oncel, Ryosuke Sato, G\\'eraldine Servant, Philip S{\\o}rensen","authorsParsed":[["Eröncel","Cem",""],["Sato","Ryosuke",""],["Servant","Géraldine",""],["Sørensen","Philip",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:04 GMT"}],"updateDate":"2024-08-19","timestamp":1723744804000,"abstract":"  The axion kinetic misalignment mechanism (KMM) opens the possibility of\nexplaining dark matter for almost any axion mass and decay constant that are\nnot accessible by the standard misalignment mechanism, in particular at low\nvalues of the axion decay constant (i.e. large coupling). This is a new\nopportunity for most axion experiments which could be sensitive to dark matter\nand probe new regimes of axion cosmology. We scrutinise UV completions that\nlead to the KMM mechanism. These mainly rely on the early dynamics of the axion\npartner, the radial mode of the complex scalar field, from which the axion\ninherits kinetic energy. The damping of the radial-mode energy density is then\na necessary ingredient. We study in detail thermal damping from interactions in\nthe plasma. A minimal and rather natural implementation consists of a KSVZ-type\nmodel with a nearly-quadratic potential for the radial mode extended by\nU(1)-breaking higher-dimensional operators. Furthermore, we study Higgs portal\ninteractions as an alternative damping mechanism and improve upon previously\nproposed implementations based on quartic potentials. These implementations can\nlead to the QCD axion being dark matter and in the reach of IAXO, while MADMAX,\nIAXO and ALPS II can be sensitive to a generic Axion-Like-Particle (ALP) as\ndark matter. Such models typically feature a kination era. We also show that\nALP dark matter from KMM points to a particular realization of inflation.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"byhaqKDwCzxkYKKzhfkeejB53Jz4fZAAv5WRiFn0w94","pdfSize":"16446862"}
