{"id":"2408.12104","title":"Minute-Cadence Observations of the LAMOST Fields with the TMTS: IV --\n  Catalog of Cataclysmic Variables from the First 3-yr Survey","authors":"Qichun Liu, Jie Lin, Xiaofeng Wang, Zhibin Dai, Yongkang Sun, Gaobo\n  Xi, Jun Mo, Jialian Liu, Shengyu Yan, Alexei V. Filippenko, Thomas G. Brink,\n  Yi Yang, Kishore C. Patra, Yongzhi Cai, Zhihao Chen, Liyang Chen, Fangzhou\n  Guo, Xiaojun Jiang, Gaici Li, Wenxiong Li, Weili Lin, Cheng Miao, Xiaoran Ma,\n  Haowei Peng, Qiqi Xia, Danfeng Xiang and Jicheng Zhang","authorsParsed":[["Liu","Qichun",""],["Lin","Jie",""],["Wang","Xiaofeng",""],["Dai","Zhibin",""],["Sun","Yongkang",""],["Xi","Gaobo",""],["Mo","Jun",""],["Liu","Jialian",""],["Yan","Shengyu",""],["Filippenko","Alexei V.",""],["Brink","Thomas G.",""],["Yang","Yi",""],["Patra","Kishore C.",""],["Cai","Yongzhi",""],["Chen","Zhihao",""],["Chen","Liyang",""],["Guo","Fangzhou",""],["Jiang","Xiaojun",""],["Li","Gaici",""],["Li","Wenxiong",""],["Lin","Weili",""],["Miao","Cheng",""],["Ma","Xiaoran",""],["Peng","Haowei",""],["Xia","Qiqi",""],["Xiang","Danfeng",""],["Zhang","Jicheng",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 03:39:43 GMT"}],"updateDate":"2024-08-23","timestamp":1724297983000,"abstract":"  The Tsinghua University--Ma Huateng Telescopes for Survey (TMTS) started to\nmonitor the LAMOST plates in 2020, leading to the discovery of numerous\nshort-period eclipsing binaries, peculiar pulsators, flare stars, and other\nvariable objects. Here, we present the uninterrupted light curves for a sample\nof 64 cataclysmic variables (CVs) observed/discovered using the TMTS during its\nfirst three-year observations, and we introduce new CVs and new light-variation\nperiods (from known CVs) revealed through the TMTS observations. Thanks to the\nhigh-cadence observations of TMTS, diverse light variations, including\nsuperhumps, quasi-periodic oscillations, large-amplitude orbital modulations,\nand rotational modulations, are able to be detected in our CV samples,\nproviding key observational clues for understanding the fast-developing\nphysical processes in various CVs. All of these short-timescale light-curve\nfeatures help further classify the subtypes of CV systems. We highlight the\nlight-curve features observed in our CV sample and discuss further implications\nof minute-cadence light curves for CV identifications and classifications.\nMoreover, we examine the H$\\alpha$ emission lines in the spectra from our\nnonmagnetic CV samples (i.e., dwarf novae and nova-like subclasses) and find\nthat the distribution of H$\\alpha$ emission strength shows significant\ndifferences between the sources with orbital periods above and below the period\ngap, which agrees with the trend seen from the SDSS nonmagnetic CV sample.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}