{"id":"2408.13563","title":"I-centered vs F-centered orthorhombic symmetry and negative thermal\n  expansion of the charge density wave of EuAl2Ga2","authors":"Harshit Agarwal, Surya Rohith Kotla, Leila Noohinejad, Biplab Bag,\n  Claudio Eisele, Sitaram Ramakrishnan, Martin Tolkiehn, Carsten Paulmann,\n  Arumugam Thamizhavel, Srinivasan Ramakrishnan, Sander van Smaalen","authorsParsed":[["Agarwal","Harshit",""],["Kotla","Surya Rohith",""],["Noohinejad","Leila",""],["Bag","Biplab",""],["Eisele","Claudio",""],["Ramakrishnan","Sitaram",""],["Tolkiehn","Martin",""],["Paulmann","Carsten",""],["Thamizhavel","Arumugam",""],["Ramakrishnan","Srinivasan",""],["van Smaalen","Sander",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 12:18:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724501938000,"abstract":"  Together with EuGa4 and EuAl4, EuAl2Ga2 belongs to the BaAl4 structure type\nwith space group symmetry I4/mmm. EuAl2Ga2 develops an incommensurate charge\ndensity wave (CDW) at temperatures below TCDW = 51 K. On the basis of\ntemperature dependent single-crystal X-ray diffraction (SXRD) data, the\nincommensurately modulated CDW crystal structure of EuAl2Ga2 is determined to\npossess orthorhombic superspace symmetry Immm(00g)s00. This symmetry is\ndifferent from the orthorhombic Fmmm based symmetry of the CDW state of EuAl4.\nNevertheless, both symmetries Immm(00g)s00 and Fmmm(00g)s00 lead to the same\nconclusion, that the CDW is supported by the layers of Al1 type atoms, while\nthe Eu and Al2 or Ga atoms are not directly involved in CDW formation. The\ndifferent symmetries of the CDW states of EuAl4 and EuAl2Ga2, as well as the\nobservation of negative thermal expansion in the CDW state of EuAl2Ga2 might be\nexplained by the effects of Ga substitution in the latter compound.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3rmr29eoyfM5upoNV8RWWcTGatD_e2FIqkdCeeKZLQQ","pdfSize":"3636499"}
