{"id":"2408.06041","title":"Logic and numbers related to solar neutrinos","authors":"L.M.Slad","authorsParsed":[["Slad","L. M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 10:18:00 GMT"}],"updateDate":"2024-08-13","timestamp":1723457880000,"abstract":"  In this work, first of all, we analyze a number of hidden aspects of the\nconcept of particle oscillations. The key element of this concept, which do not\ncomply with the principle of least action, is the notion of a mixture of\nparticles, introduced by Gell-Mann and Pais for neutral $K$-mesons. It has been\nproven that the law of conservation of energy-momentum in the processes of\nelectron neutrino production does not allow solving the problem of solar\nneutrinos based on the assumption of Gribov and Pontecorvo about their\noscillations. It has been established that the consequences of Wolfenstein's\nequation contradict the results of the SNO and Super-Kamiokande collaborations\nand that the assertion by Mikheev and Smirnov on the conversion of solar\nneutrinos is erroneous. Another part of the work is devoted to a logically\nclear solution to this problem based on the hypothesis of the existence of a\nnew interaction, the carrier of which is a massless pseudoscalar boson, which\nhas a Yukawa coupling with electron neutrinos and nucleons. At each act of\ninteraction of an electron neutrino with the nucleons of the Sun, caused by\nsuch interaction, the handedness of the neutrino changes from left to right and\nvice versa, and also the neutrino energy decreases. The hypothesis provides\ngood agreement between the theoretical and experimental values of the rates of\nall five observed processes with solar neutrinos. This serves as a significant\ncriterion for both the confidence of such a solution to the problem of solar\nneutrinos and the confidence of the existence of a new interaction.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Solar and Stellar Astrophysics","Physics/High Energy Physics - Experiment","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}