{"id":"2408.14461","title":"A domain decomposition-based autoregressive deep learning model for\n  unsteady and nonlinear partial differential equations","authors":"Sheel Nidhan, Haoliang Jiang, Lalit Ghule, Clancy Umphrey, Rishikesh\n  Ranade, Jay Pathak","authorsParsed":[["Nidhan","Sheel",""],["Jiang","Haoliang",""],["Ghule","Lalit",""],["Umphrey","Clancy",""],["Ranade","Rishikesh",""],["Pathak","Jay",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:50:47 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 16:43:52 GMT"}],"updateDate":"2024-08-28","timestamp":1724694647000,"abstract":"  In this paper, we propose a domain-decomposition-based deep learning (DL)\nframework, named transient-CoMLSim, for accurately modeling unsteady and\nnonlinear partial differential equations (PDEs). The framework consists of two\nkey components: (a) a convolutional neural network (CNN)-based autoencoder\narchitecture and (b) an autoregressive model composed of fully connected\nlayers. Unlike existing state-of-the-art methods that operate on the entire\ncomputational domain, our CNN-based autoencoder computes a lower-dimensional\nbasis for solution and condition fields represented on subdomains. Timestepping\nis performed entirely in the latent space, generating embeddings of the\nsolution variables from the time history of embeddings of solution and\ncondition variables. This approach not only reduces computational complexity\nbut also enhances scalability, making it well-suited for large-scale\nsimulations. Furthermore, to improve the stability of our rollouts, we employ a\ncurriculum learning (CL) approach during the training of the autoregressive\nmodel. The domain-decomposition strategy enables scaling to out-of-distribution\ndomain sizes while maintaining the accuracy of predictions -- a feature not\neasily integrated into popular DL-based approaches for physics simulations. We\nbenchmark our model against two widely-used DL architectures, Fourier Neural\nOperator (FNO) and U-Net, and demonstrate that our framework outperforms them\nin terms of accuracy, extrapolation to unseen timesteps, and stability for a\nwide range of use cases.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}