{"id":"2408.08141","title":"Visual Integration of Static and Dynamic Software Analysis in Code\n  Reviews via Software City Visualization","authors":"Alexander Krause-Glau, Lukas Damerau, Malte Hansen, Wilhelm\n  Hasselbring","authorsParsed":[["Krause-Glau","Alexander",""],["Damerau","Lukas",""],["Hansen","Malte",""],["Hasselbring","Wilhelm",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 13:19:55 GMT"}],"updateDate":"2024-08-16","timestamp":1723727995000,"abstract":"  Software visualization approaches for code reviews are often implemented as\nstandalone applications, which use static code analysis. The goal is to\nvisualize the structural changes introduced by a pull / merge request to\nfacilitate the review process. In this way, for example, structural changes\nthat hinder code evolution can be more easily identified, but understanding the\nchanged program behavior is still mainly done by reading the code. For software\nvisualization to be successful in code review, tools must be provided that go\nbeyond an alternative representation of code changes and integrate well into\nthe developers' daily workflow. In this paper, we report on the novel and\nin-progress design and implementation of a web-based approach capable of\ncombining static and dynamic analysis data in software city visualizations. Our\narchitectural tool design incorporates modern web technologies such as the\nintegration into common Git hosting services. As a result, code reviewers can\nexplore how the modified software evolves and execute its use cases, which is\nespecially helpful for distributed software systems. In this context,\ndevelopers can be directly linked from the Git hosting service's issue tracking\nsystem to the corresponding software city visualization. This approach\neliminates the recurring action of manual data collection and setup. We\nimplement our design by extending the web-based software visualization tool\nExplorViz. We invite other researchers to extend our open source software and\njointly research this approach. Video URL: https://youtu.be/DYxijdCEdrY\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZGvabxYRgbAg7va6Y5t8R-EQPFRtY4Uvnc4AzujtcNY","pdfSize":"3588523"}
