{"id":"2408.13467","title":"LlamaDuo: LLMOps Pipeline for Seamless Migration from Service LLMs to\n  Small-Scale Local LLMs","authors":"Chansung Park, Juyong Jiang, Fan Wang, Sayak Paul, Jing Tang","authorsParsed":[["Park","Chansung",""],["Jiang","Juyong",""],["Wang","Fan",""],["Paul","Sayak",""],["Tang","Jing",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:03:08 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 00:54:27 GMT"}],"updateDate":"2024-08-30","timestamp":1724475788000,"abstract":"  The widespread adoption of cloud-based proprietary large language models\n(LLMs) has introduced significant challenges, including operational\ndependencies, privacy concerns, and the necessity of continuous internet\nconnectivity. In this work, we introduce an LLMOps pipeline, \"LlamaDuo\", for\nthe seamless migration of knowledge and abilities from service-oriented LLMs to\nsmaller, locally manageable models. This pipeline is crucial for ensuring\nservice continuity in the presence of operational failures, strict privacy\npolicies, or offline requirements. Our LlamaDuo involves fine-tuning a small\nlanguage model against the service LLM using a synthetic dataset generated by\nthe latter. If the performance of the fine-tuned model falls short of\nexpectations, it is enhanced by further fine-tuning with additional similar\ndata created by the service LLM. This iterative process guarantees that the\nsmaller model can eventually match or even surpass the service LLM's\ncapabilities in specific downstream tasks, offering a practical and scalable\nsolution for managing AI deployments in constrained environments. Extensive\nexperiments with leading edge LLMs are conducted to demonstrate the\neffectiveness, adaptability, and affordability of LlamaDuo across various\ndownstream tasks. Our pipeline implementation is available at\nhttps://github.com/deep-diver/llamaduo.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wqzczMqUJOPOseenDSCFlSZEq9eSOx-K8XSmYNdskEc","pdfSize":"3720299"}
