{"id":"2408.01049","title":"Unexpected fault activation in underground gas storage. Part II:\n  Definition of safe operational bandwidths","authors":"Selena Baldan, Massimiliano Ferronato, Andrea Franceschini, Carlo\n  Janna, Claudia Zoccarato, Matteo Frigo, Giovanni Isotton, Cristiano\n  Collettini, Chiara Deangeli, Vera Rocca, Francesca Verga, Pietro Teatini","authorsParsed":[["Baldan","Selena",""],["Ferronato","Massimiliano",""],["Franceschini","Andrea",""],["Janna","Carlo",""],["Zoccarato","Claudia",""],["Frigo","Matteo",""],["Isotton","Giovanni",""],["Collettini","Cristiano",""],["Deangeli","Chiara",""],["Rocca","Vera",""],["Verga","Francesca",""],["Teatini","Pietro",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 06:52:52 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 07:11:46 GMT"},{"version":"v3","created":"Mon, 9 Sep 2024 09:24:25 GMT"}],"updateDate":"2024-09-10","timestamp":1722581572000,"abstract":"  Underground gas storage is a versatile tool for managing energy resources and\naddressing pressing environmental concerns. While natural gas is stored in\ngeological formations since the beginning of the 20th century, hydrogen has\nrecently been considered as a potential candidate toward a more flexible and\nsustainable energy infrastructure. Furthermore, these formations can also be\nused to sequester environmentally harmful gases such as CO2. When such\noperations are implemented in faulted basins, however, safety concerns may\narise due to the possible reactivation of pre-existing faults, which could\nresult in (micro)-seismicity events. In the Netherlands, it has been recently\nnoted that fault reactivation can occur \"unexpectedly\" during the life of an\nunderground gas storage (UGS) site, even when stress conditions are not\nexpected to cause a failure. The present two-part work aims to develop a\nmodeling framework to investigate the physical mechanisms causing such\noccurrences and define a safe operational bandwidth for pore pressure variation\nfor UGS operations in the faulted reservoirs of the Rotliegend formation, the\nNetherlands. In this follow-up paper, we investigate in detail the mechanisms\nand crucial factors that result in fault reactivation at various stages of a\nUGS. The mathematical and numerical model described in Part I is used, also\naccounting for the effect of geochemical dissolution on reservoir and caprock\nweakening. TThe study investigates the risks of fault activation caused by the\nstorage of different fluids for various purposes, such as long-term CO2\nsequestration, CH4 and N2 injection and extraction cycles, and N2 permanent\nstorage. The results show how geomechanical properties and reservoir operating\nconditions may increase the risk of fault reactivation at various UGS stages.\nFinally, operational guidelines for improving secure storage operations are\npresented.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}