{"id":"2408.15780","title":"Evaporation of water-in-oil microemulsion droplet","authors":"Bal Krishan (1), Preetika Rastogi (2 and 3), D. Chaitanya Kumar Rao\n  (4), Niket S. Kaisare (2), Madivala G. Basavaraj (2) and Saptarshi Basu (1\n  and 5) ((1) Department of Mechanical Engineering, Indian Institute of\n  Science, Bengaluru, India, (2) Department of Chemical Engineering, Indian\n  Institute of Technology, Madras, India, (3) Material Sciences Division and\n  The Molecular Foundry, Lawrence Berkeley National Laboratory, Berkeley, USA,\n  (4) Department of Aerospace Engineering, Indian Institute of Technology,\n  Kanpur, India, (5) Interdisciplinary Centre for Energy Research, Indian\n  Institute of Science, Bengaluru, India)","authorsParsed":[["Krishan","Bal","","2 and 3"],["Rastogi","Preetika","","2 and 3"],["Rao","D. Chaitanya Kumar","","1\n  and 5"],["Kaisare","Niket S.","","1\n  and 5"],["Basavaraj","Madivala G.","","1\n  and 5"],["Basu","Saptarshi","","1\n  and 5"]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:19:00 GMT"}],"updateDate":"2024-08-29","timestamp":1724851140000,"abstract":"  Emulsion fuels have the potential to reduce both particulate matter and NOx\nemissions and can potentially improve the efficiency of combustion engines.\nHowever, their limited stability remains a critical barrier to practical use as\nan alternative fuel. In this study, we explore the evaporation behavior of\nthermodynamically stable water-in-oil microemulsions. The water-in-oil\nmicroemulsion droplets prepared from different types of oil were acoustically\nlevitated and heated using a continuous laser at different irradiation\nintensities. We show that the evaporation characteristics of these\nmicroemulsions can be controlled by varying water-to-surfactant molar ratio\n({\\omega}) and volume fraction of the dispersed phase ({\\phi}). The emulsion\ndroplets undergo three distinct stages of evaporation, namely pre-heating,\nsteady evaporation, and unsteady evaporation. During the steady evaporation\nphase, increasing {\\phi} reduces the evaporation rate for a fixed {\\omega}. It\nis observed that the evaporation of microemulsion is governed by the complex\ninterplay between its constituents and their properties. We propose a parameter\n({\\eta}) denoting the volume fraction ratio between volatile and non-volatile\ncomponents, which indicates the cumulative influence of various factors\naffecting the evaporation process. The evaporation of microemulsions eventually\nleads to the formation of solid spherical shells, which may undergo buckling.\nThe distinction in the morphology of these shells is explored in detail using\nSEM imaging.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}