{"id":"2408.01851","title":"Cost-constrained multi-label group feature selection using shadow\n  features","authors":"Tomasz Klonecki, Pawe{\\l} Teisseyre and Jaesung Lee","authorsParsed":[["Klonecki","Tomasz",""],["Teisseyre","Paweł",""],["Lee","Jaesung",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 19:31:59 GMT"}],"updateDate":"2024-08-06","timestamp":1722713519000,"abstract":"  We consider the problem of feature selection in multi-label classification,\nconsidering the costs assigned to groups of features. In this task, the goal is\nto select a subset of features that will be useful for predicting the label\nvector, but at the same time, the cost associated with the selected features\nwill not exceed the assumed budget. Solving the problem is of great importance\nin medicine, where we may be interested in predicting various diseases based on\ngroups of features. The groups may be associated with parameters obtained from\na certain diagnostic test, such as a blood test. Because diagnostic test costs\ncan be very high, considering cost information when selecting relevant features\nbecomes crucial to reducing the cost of making predictions. We focus on the\nfeature selection method based on information theory. The proposed method\nconsists of two steps. First, we select features sequentially while maximizing\nconditional mutual information until the budget is exhausted. In the second\nstep, we select additional cost-free features, i.e., those coming from groups\nthat have already been used in previous steps. Limiting the number of added\nfeatures is possible using the stop rule based on the concept of so-called\nshadow features, which are randomized counterparts of the original ones. In\ncontrast to existing approaches based on penalized criteria, in our method, we\navoid the need for computationally demanding optimization of the penalty\nparameter. Experiments conducted on the MIMIC medical database show the\neffectiveness of the method, especially when the assumed budget is limited.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}