{"id":"2408.12217","title":"Quantifying Psychological Sophistication of Malicious Emails","authors":"Theodore Longtchi, Rosana Monta\\~nez Rodriguez, Kora Gwartney, Ekzhin\n  Ear, David P. Azari, Christopher P. Kelley and Shouhuai Xu","authorsParsed":[["Longtchi","Theodore",""],["Rodriguez","Rosana Montañez",""],["Gwartney","Kora",""],["Ear","Ekzhin",""],["Azari","David P.",""],["Kelley","Christopher P.",""],["Xu","Shouhuai",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:45:46 GMT"}],"updateDate":"2024-08-23","timestamp":1724316346000,"abstract":"  Malicious emails including Phishing, Spam, and Scam are one significant class\nof cyber social engineering attacks. Despite numerous defenses to counter them,\nthe problem remains largely open. The ineffectiveness of current defenses can\nbe attributed to our superficial understanding of the psychological properties\nthat make these attacks successful. This problem motivates us to investigate\nthe psychological sophistication, or sophistication for short, of malicious\nemails. We propose an innovative framework that accommodates two important and\ncomplementary aspects of sophistication, dubbed Psychological Techniques,\nPTechs, and Psychological Tactics, PTacs. We propose metrics and grading rules\nfor human experts to assess the sophistication of malicious emails via the lens\nof these PTechs and PTacs. To demonstrate the usefulness of the framework, we\nconduct a case study based on 1,036 malicious emails assessed by four\nindependent graders. Our results show that malicious emails are psychologically\nsophisticated, while exhibiting both commonalities and different patterns in\nterms of their PTechs and PTacs. Results also show that previous studies might\nhave focused on dealing with the less proliferated PTechs such as Persuasion\nand PTacs such as Reward, rather than the most proliferated PTechs such as\nAttention Grabbing and Impersonation, and PTacs such as Fit and Form and\nFamiliarity that are identified in this study. We also found among others that\nsocial events are widely exploited by attackers in contextualizing their\nmalicious emails. These findings could be leveraged to guide the design of\neffective defenses against malicious emails.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}