{"id":"2408.17182","title":"Hybrid Classification-Regression Adaptive Loss for Dense Object\n  Detection","authors":"Yanquan Huang and Liu Wei Zhen and Yun Hao and Mengyuan Zhang and\n  Qingyao Wu and Zikun Deng and Xueming Liu and Hong Deng","authorsParsed":[["Huang","Yanquan",""],["Zhen","Liu Wei",""],["Hao","Yun",""],["Zhang","Mengyuan",""],["Wu","Qingyao",""],["Deng","Zikun",""],["Liu","Xueming",""],["Deng","Hong",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:31:39 GMT"}],"updateDate":"2024-09-02","timestamp":1725013899000,"abstract":"  For object detection detectors, enhancing model performance hinges on the\nability to simultaneously consider inconsistencies across tasks and focus on\ndifficult-to-train samples. Achieving this necessitates incorporating\ninformation from both the classification and regression tasks. However, prior\nwork tends to either emphasize difficult-to-train samples within their\nrespective tasks or simply compute classification scores with IoU, often\nleading to suboptimal model performance. In this paper, we propose a Hybrid\nClassification-Regression Adaptive Loss, termed as HCRAL. Specifically, we\nintroduce the Residual of Classification and IoU (RCI) module for cross-task\nsupervision, addressing task inconsistencies, and the Conditioning Factor (CF)\nto focus on difficult-to-train samples within each task. Furthermore, we\nintroduce a new strategy named Expanded Adaptive Training Sample Selection\n(EATSS) to provide additional samples that exhibit classification and\nregression inconsistencies. To validate the effectiveness of the proposed\nmethod, we conduct extensive experiments on COCO test-dev. Experimental\nevaluations demonstrate the superiority of our approachs. Additionally, we\ndesigned experiments by separately combining the classification and regression\nloss with regular loss functions in popular one-stage models, demonstrating\nimproved performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}