{"id":"2408.03277","title":"Low-lying magnon frequency comb in skymion crystals","authors":"Xuejuan Liu, Zhejunyu Jin, Zhengyi Li, Zhaozhuo Zeng, Minghao Li,\n  Yuping Yao, Yunshan Cao, Yinghui Zhang, and Peng Yan","authorsParsed":[["Liu","Xuejuan",""],["Jin","Zhejunyu",""],["Li","Zhengyi",""],["Zeng","Zhaozhuo",""],["Li","Minghao",""],["Yao","Yuping",""],["Cao","Yunshan",""],["Zhang","Yinghui",""],["Yan","Peng",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:20:20 GMT"}],"updateDate":"2024-08-07","timestamp":1722961220000,"abstract":"  A stable, low-power and tunable magnon frequency comb (MFC) is crucial for\nmagnon-based precision measurements, quantum information processing and chip\nintegration. Original method for creating MFC utilizes the nonlinear\ninteractions between propagating spin waves and localized oscillations of an\nisolated magnetic texture, e.g., skyrmion. It requires a driving frequency well\nabove the ferromagnetic resonance (FMR) and the spectrum frequency of MFC will\nquickly approach to the detection limit of conventional microwave technique\nafter only tens of comb teeth. In addition, the detection and manipulation of a\nsingle skyrmion is challenging in experiments due to its high degree of\nlocality. These issues hinder the applications of MFC. In this work, we report\nthe low-lying MFC with comb frequencies below the FMR in a skyrmion crystal\n(SkX). We show that the MFC originates from the three-wave mixing between the\ncollective skyrmion gyration and breathing in the SkX. Our findings\nsignificantly improve the efficiency of the nonlinear frequency conversion from\na single-frequency mircowave input, and establish a synergistic relationship\nbetween the SkX and MFC, which paves the way to coherent information processing\nand ultra-sensitive metrology based on MFC.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}