{"id":"2408.14265","title":"ALMA Memo 628 -- High-cadence observations of the Sun","authors":"Sven Wedemeyer, Mikolaj Szydlarski, M. Carmen Toribio, Tobia Carozzi,\n  Daniel Jakobsson, Juan Camilo Guevara Gomez, Henrik Eklund, Vasco M. J.\n  Henriques, Shahin Jafarzadeh, and Jaime de la Cruz Rodriguez","authorsParsed":[["Wedemeyer","Sven",""],["Szydlarski","Mikolaj",""],["Toribio","M. Carmen",""],["Carozzi","Tobia",""],["Jakobsson","Daniel",""],["Gomez","Juan Camilo Guevara",""],["Eklund","Henrik",""],["Henriques","Vasco M. J.",""],["Jafarzadeh","Shahin",""],["Rodriguez","Jaime de la Cruz",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:36:55 GMT"}],"updateDate":"2024-08-27","timestamp":1724679415000,"abstract":"  The Atacama Large Millimeter/submillimeter Array (ALMA) offers new diagnostic\ncapabilities for studying the Sun, providing complementary insights through\nhigh spatial and temporal resolution at millimeter wavelengths. ALMA acts as a\nlinear thermometer for atmospheric gas, aiding in understanding the solar\natmosphere's structure, dynamics, and energy balance. Given the Sun's complex\nemission patterns and rapid evolution, high-cadence imaging is essential for\nsolar observations. Snapshot imaging is required, though it limits available\nvisibility data, making full exploitation of ALMA's capabilities non-trivial.\nChallenges in processing solar ALMA data highlight the need for revising and\nenhancing the solar observing mode. The ALMA development study High-Cadence\nImaging of the Sun demonstrated the potential benefits of high cadence\nobservations through a forward modelling approach. The resulting report\nprovides initial recommendations for improved post-processing solar ALMA data\nand explores increasing the observing cadence to sub-second intervals to\nimprove image reliability.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}