{"id":"2408.10457","title":"Parkinson's Disease Classification via EEG: All You Need is a Single\n  Convolutional Layer","authors":"Md Fahim Anjum","authorsParsed":[["Anjum","Md Fahim",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 23:58:25 GMT"}],"updateDate":"2024-08-21","timestamp":1724111905000,"abstract":"  In this work, we introduce LightCNN, a minimalist Convolutional Neural\nNetwork (CNN) architecture designed for Parkinson's disease (PD) classification\nusing EEG data. LightCNN's strength lies in its simplicity, utilizing just a\nsingle convolutional layer. Embracing Leonardo da Vinci's principle that\n\"simplicity is the ultimate sophistication,\" LightCNN demonstrates that\ncomplexity is not required to achieve outstanding results. We benchmarked\nLightCNN against several state-of-the-art deep learning models known for their\neffectiveness in EEG-based PD classification. Remarkably, LightCNN outperformed\nall these complex architectures, with a 2.3% improvement in recall, a 4.6%\nincrease in precision, a 0.1% edge in AUC, a 4% boost in F1-score, and a 3.3%\nhigher accuracy compared to the closest competitor. Furthermore, LightCNN\nidentifies known pathological brain rhythms associated with PD and effectively\ncaptures clinically relevant neurophysiological changes in EEG. Its simplicity\nand interpretability make it ideal for deployment in resource-constrained\nenvironments, such as mobile or embedded systems for EEG analysis. In\nconclusion, LightCNN represents a significant step forward in efficient\nEEG-based PD classification, demonstrating that a well-designed, lightweight\nmodel can achieve superior performance over more complex architectures. This\nwork underscores the potential for minimalist models to meet the needs of\nmodern healthcare applications, particularly where resources are limited.\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U420ty9j5r62tFR4kDnQimNzPrzbtwGhS8AZ7R6uv8I","pdfSize":"8393601"}
