{"id":"2408.07620","title":"Rotational velocities of Blue Straggler Stars in the Globular Cluster\n  M55","authors":"Alex Billi, Francesco R. Ferraro, Alessio Mucciarelli, Barbara\n  Lanzoni, Mario Cadelano and Lorenzo Monaco","authorsParsed":[["Billi","Alex",""],["Ferraro","Francesco R.",""],["Mucciarelli","Alessio",""],["Lanzoni","Barbara",""],["Cadelano","Mario",""],["Monaco","Lorenzo",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 15:42:07 GMT"}],"updateDate":"2024-08-15","timestamp":1723650127000,"abstract":"  By using high-resolution spectra acquired with FLAMES-GIRAFFE at the ESO/VLT,\nwe measured radial and rotational velocities of 115 stars in the Galactic\nglobular cluster M55. After field decontamination based on the radial velocity\nvalues, the final sample of member stars is composed of 32 blue straggler stars\n(BSSs) and 76 reference stars populating the red giant and horizontal branches\nof the cluster. In agreement with previous findings, the totality of red giant\nbranch stars has negligible rotation ($<$ 10 km s$^{-1}$), and horizontal\nbranch stars have rotational velocities of 40 km s$^{-1}$ at most. In contrast,\nthe BSS rotational velocity distribution shows a long tail extending up to\n$\\sim$ 200 km s$^{-1}$, with 15 BSSs (out of 32) spinning faster than 40 km\ns$^{-1}$. By defining the threshold for fast rotating BSSs at 40 km s$^{-1}$,\nthis sets the percentage of these stars at 47 $\\pm$ 14 %. Such a large value\nhas never been found before in any globular clusters. It is roughly comparable\nto that measured in other loose systems ($\\omega$ Centauri, M4, and NGC 3201)\nand significantly larger than that observed in high-density clusters (as 47\nTucanae, NGC 6397, NGC 6752, and M30). This evidence supports a scenario where\nrecent BSS formation is occurring in low-density environments. We also find\nthat the BSS rotational velocity tends to decrease for decreasing luminosity,\nas found for another loose cluster of the sample (namely, NGC 3201).\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}