{"id":"2408.16322","title":"BEVal: A Cross-dataset Evaluation Study of BEV Segmentation Models for\n  Autonomous Driving","authors":"Manuel Alejandro Diaz-Zapata (CHROMA), Wenqian Liu (CHROMA, UGA),\n  Robin Baruffa (CHROMA), Christian Laugier (CHROMA)","authorsParsed":[["Diaz-Zapata","Manuel Alejandro","","CHROMA"],["Liu","Wenqian","","CHROMA, UGA"],["Baruffa","Robin","","CHROMA"],["Laugier","Christian","","CHROMA"]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 07:49:31 GMT"},{"version":"v2","created":"Thu, 5 Sep 2024 07:47:53 GMT"},{"version":"v3","created":"Thu, 12 Sep 2024 11:42:31 GMT"}],"updateDate":"2024-09-13","timestamp":1724917771000,"abstract":"  Current research in semantic bird's-eye view segmentation for autonomous\ndriving focuses solely on optimizing neural network models using a single\ndataset, typically nuScenes. This practice leads to the development of highly\nspecialized models that may fail when faced with different environments or\nsensor setups, a problem known as domain shift. In this paper, we conduct a\ncomprehensive cross-dataset evaluation of state-of-the-art BEV segmentation\nmodels to assess their performance across different training and testing\ndatasets and setups, as well as different semantic categories. We investigate\nthe influence of different sensors, such as cameras and LiDAR, on the models'\nability to generalize to diverse conditions and scenarios. Additionally, we\nconduct multi-dataset training experiments that improve models' BEV\nsegmentation performance compared to single-dataset training. Our work\naddresses the gap in evaluating BEV segmentation models under cross-dataset\nvalidation. And our findings underscore the importance of enhancing model\ngeneralizability and adaptability to ensure more robust and reliable BEV\nsegmentation approaches for autonomous driving applications. The code for this\npaper available at https://github.com/manueldiaz96/beval .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}