{"id":"2408.09700","title":"Modelling Hydrogen-deficient Carbon stars in MESA -- The effects of\n  total mass and mass ratio","authors":"Courtney L. Crawford, Nikita Nikultsev, Geoffrey C. Clayton, Patrick\n  Tisserand, Jamie Soon, May G. Pedersen","authorsParsed":[["Crawford","Courtney L.",""],["Nikultsev","Nikita",""],["Clayton","Geoffrey C.",""],["Tisserand","Patrick",""],["Soon","Jamie",""],["Pedersen","May G.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 05:11:04 GMT"}],"updateDate":"2024-08-20","timestamp":1724044264000,"abstract":"  Hydrogen-deficient Carbon (HdC) stars are rare, low-mass, chemically\npeculiar, supergiant variables believed to be formed by a double white dwarf\n(DWD) merger, specifically of a Carbon/Oxygen- (CO-) and a Helium-white dwarf\n(He-WD). They consist of two subclasses -- the dust-producing R Coronae\nBorealis (RCB) variables and their dustless counterparts the dustless HdCs\n(dLHdCs). Additionally, there is another, slightly cooler set of potentially\nrelated carbon stars, the DY Persei type variables which have some, but not\nconclusive, evidence of Hydrogen-deficiency. Recent works have begun to explore\nthe relationship between these three classes of stars, theorizing that they\nshare an evolutionary pathway (a DWD merger) but come from different binary\npopulations, specifically different total masses (M$_{\\rm tot}$) and mass\nratios ($q$). In this work, we use the MESA modelling framework that has\npreviously been used to model RCB stars and vary the merger parameters, M$_{\\rm\ntot}$ and $q$, to explore how those parameters affect the abundances,\ntemperatures, and luminosities of the resultant post-merger stars. We find that\nlower M$_{\\rm tot}$ and larger $q$'s both decrease the luminosity and\ntemperatures of post-merger models to the region of the Hertzsprung-Russell\nDiagram populated by the dLHdCs. These lower M$_{\\rm tot}$ and larger $q$\nmodels also have smaller oxygen isotopic ratios ($^{16}$O/$^{18}$O) which is\nconsistent with recent observations of dLHdCs compared to RCBs. None of the\nmodels generated in this work can explain the existence of the DY Persei type\nvariables, however this may arise from the assumed metallicity of the models.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}