{"id":"2408.15748","title":"Manifestation of incoherent-coherent crossover and non-Stoner magnetism\n  in the electronic structure of Fe$_3$GeTe$_2$","authors":"Deepali Sharma, Asif Ali, Neeraj Bhatt, Rajeswari Roy Chowdhury,\n  Chandan Patra, Ravi Prakash Singh, and Ravi Shankar Singh","authorsParsed":[["Sharma","Deepali",""],["Ali","Asif",""],["Bhatt","Neeraj",""],["Chowdhury","Rajeswari Roy",""],["Patra","Chandan",""],["Singh","Ravi Prakash",""],["Singh","Ravi Shankar",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 12:29:01 GMT"}],"updateDate":"2024-08-29","timestamp":1724848141000,"abstract":"  Two-dimensional (2D) van der Waals ferromagnets have potential applications\nas next-generation spintronic devices and provide a platform to explore the\nfundamental physics behind 2D magnetism. The dual nature (localized and\nitinerant) of electrons adds further complexity to the understanding of\ncorrelated magnetic materials. Here, we present the temperature evolution of\nelectronic structure in 2D van der Waals ferromagnet, Fe$_{3}$GeTe$_{2}$, using\nphotoemission spectroscopy in conjunction with density functional theory (DFT)\nplus dynamical mean field theory (DMFT). With the appearance of quasiparticle\npeak and its evolution in the vicinity of Fermi energy, we unveil empirical\nevidences of incoherent-coherent crossover at around 125 K. DFT+DMFT results\nshow that the quasiparticle lifetime surpasses thermal energy for temperature\nbelow 150 K, confirming incoherent-coherent crossover in the system. No\nappreciable change in the Fe 2$p$ core level, overall valence band spectra\nacross the magnetic transition, and temperature dependent ferromagnetic\nDFT+DMFT results, provide substantial evidence for non-stoner magnetism in\nFe$_{3}$GeTe$_{2}$. We elucidate the temperature dependent intimate relation\nbetween magnetism and electronic structure in Fe$_{3}$GeTe$_{2}$. Sommerfeld\ncoefficient of $\\sim$ 104 mJ mol$^{-1}$ K$^{-2}$ obtained in the low\ntemperature limit from DFT+DMFT calculations resolve the long standing issue of\nlarge Sommerfeld coefficient ($\\sim$ 110 mJ mol$^{-1}$ K$^{-2}$) obtained from\nspecific heat measurements.\n","subjects":["Condensed Matter/Strongly Correlated Electrons"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HKM6K40kEaEJVtQFYsvvQFgoRgqfqzdgBGZUVRtl00g","pdfSize":"3795476"}
