{"id":"2408.17117","title":"Efficient and systematic calculation of arbitrary observables for the\n  matrix product state excitation ansatz","authors":"Jesse J. Osborne, Ian P. McCulloch","authorsParsed":[["Osborne","Jesse J.",""],["McCulloch","Ian P.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 08:59:29 GMT"}],"updateDate":"2024-09-02","timestamp":1725008369000,"abstract":"  Numerical methods based on matrix product states (MPSs) are currently the de\nfacto standard for calculating the ground state properties of\n(quasi-)one-dimensional quantum many-body systems. While the properties of the\nlow-lying excitations in such systems are often studied in this MPS framework\nthrough _dynamics_ by means of time-evolution simulations, we can also look at\ntheir _statics_ by directly calculating eigenstates corresponding to these\nexcitations. The so-called MPS excitation ansatz is a powerful method for\nfinding such eigenstates with a single-particle character in the thermodynamic\nlimit. Although this excitation ansatz has been used quite extensively, a\ngeneral method for calculating expectation values for these states is lacking\nin the literature: we aim to fill this gap by presenting a recursive algorithm\nto calculate arbitrary observables expressed as matrix product operators. This\nmethod concisely encapsulates existing methods for -- as well as extensions to\n-- the excitation ansatz, such as excitations with a larger spatial support and\nmulti-particle excitations, and is robust to handle further innovations. We\ndemonstrate the versatility of our method by studying the low-lying excitations\nin the spin-1 Heisenberg chain and the one-dimensional Hubbard model, looking\nat how the excitations converge in the former, while in the latter, we present\na novel method of targeting single-particle excitations inside of a continuum\nby minimizing the energy _variance_ rather than the energy itself. We hope that\nthis technique will foster further advancements with the excitation ansatz.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}