{"id":"2408.04356","title":"Fock-space perturbed relativistic coupled-cluster calculations of\n  electric dipole polarizability and nuclear spin-dependent parity\n  non-conservation in Cs","authors":"Suraj Pandey, Ravi Kumar, D. Angom, and B. K. Mani","authorsParsed":[["Pandey","Suraj",""],["Kumar","Ravi",""],["Angom","D.",""],["Mani","B. K.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 10:37:13 GMT"}],"updateDate":"2024-08-09","timestamp":1723113433000,"abstract":"  We implement the Fock-space perturbed relativistic coupled-cluster theory to\ncompute the electric dipole polarizability of ground and low lying excited\nstates, and nuclear spin-dependent parity violating transition amplitudes in\nCs. Moreover, to check the accuracy of the wavefunctions used in the\ncalculations, we compute the excitation energies, E1 transition amplitudes and\nmagnetic dipole hyperfine constants for ground and low lying excited states. To\nimprove the accuracy of the computed properties, we have incorporated the\ncorrections from the relativistic and QED effects in our calculations. The\ncontributions from triple excitations are accounted perturbatively. Our results\non excitation energies, E1 transition amplitudes and hyperfine constants are in\ngood agreement with the experimental results. Our polarizability results using\nFS-PRCC theory are in good agreement with the experimental data. Our values of\nparity-violating transition amplitudes are, in general, on the lower side of\nthe previous values. From the analysis of the electron correlations, we find\nthat the corrections from the Breit interaction and QED effects are important\nto get accurate results of nuclear spin-dependent parity-violating transition\namplitudes in Cs. The largest cumulative contribution from Breit and QED\ncorrections is found to be $\\approx$ 3.2\\% of the total value. The upper bound\non the theoretical uncertainty in our calculated parity violating transition\namplitudes is estimated to be about 1\\%.\n","subjects":["Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}