{"id":"2408.04208","title":"Visibility Analysis of the Sun as Viewed from Multiple Spacecraft at the\n  Sun-Earth Lagrange Points","authors":"Jinsung Lee, Sung-Hong Park, Arik Posner, Kyung-Suk Cho, Jaemyung Ahn","authorsParsed":[["Lee","Jinsung",""],["Park","Sung-Hong",""],["Posner","Arik",""],["Cho","Kyung-Suk",""],["Ahn","Jaemyung",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 04:22:04 GMT"}],"updateDate":"2024-08-09","timestamp":1723090924000,"abstract":"  Beyond the Sun-Earth line, spacecraft equipped with various solar telescopes\nare intended to be deployed at several different vantage points in the\nheliosphere to carry out coordinated, multi-view observations of the Sun and\nits dynamic activities. In this context, we investigate solar visibility by\nimaging instruments onboard the spacecraft orbiting the Sun-Earth Lagrange\npoints L1, L4 and L5, respectively. An optimal arrival time for vertical\nperiodic orbits stationed at L4 and L5 is determined based on geometric\nconsiderations that ensure maximum visibility of solar poles or higher\nlatitudes per year. For a different set of orbits around the three Lagrange\npoints (L1, L4 and L5), we calculate the visibility of the solar surface (i.e.,\nobservation days per year) as a function of the solar latitude. We also analyze\nwhere the solar limb viewed from one of the three Sun-Earth Lagrange points\nunder consideration is projected onto the solar surface visible to the other\ntwo. This analysis particularly aims at determining the feasibility of studying\nsolar eruptions, such as flares and coronal mass ejections, with coordinated\nobservations of off-limb erupting coronal structures and their on-disk magnetic\nfootpoints. In addition, visibility analysis of a feature (such as sunspots) on\nthe solar surface is made for multiple spacecraft in various types of orbits\nwith different inclinations to quantify the improvement in continuous tracking\nof the target feature for studying its long-term evolution from emergence,\ngrowth and to decay. A comprehensive comparison of observations from single\n(L1), double (L1 and L4) and multi-space missions (L1, L4 and L5) is carried\nout through our solar visibility analysis, and this may help us to design\nfuture space missions of constructing multiple solar observatories at the\nSun-Earth Lagrange points.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}