{"id":"2408.05705","title":"TC-KANRecon: High-Quality and Accelerated MRI Reconstruction via\n  Adaptive KAN Mechanisms and Intelligent Feature Scaling","authors":"Ruiquan Ge, Xiao Yu, Yifei Chen, Fan Jia, Shenghao Zhu, Guanyu Zhou,\n  Yiyu Huang, Chenyan Zhang, Dong Zeng, Changmiao Wang, Qiegen Liu, Shanzhou\n  Niu","authorsParsed":[["Ge","Ruiquan",""],["Yu","Xiao",""],["Chen","Yifei",""],["Jia","Fan",""],["Zhu","Shenghao",""],["Zhou","Guanyu",""],["Huang","Yiyu",""],["Zhang","Chenyan",""],["Zeng","Dong",""],["Wang","Changmiao",""],["Liu","Qiegen",""],["Niu","Shanzhou",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 06:31:56 GMT"}],"updateDate":"2024-08-13","timestamp":1723357916000,"abstract":"  Magnetic Resonance Imaging (MRI) has become essential in clinical diagnosis\ndue to its high resolution and multiple contrast mechanisms. However, the\nrelatively long acquisition time limits its broader application. To address\nthis issue, this study presents an innovative conditional guided diffusion\nmodel, named as TC-KANRecon, which incorporates the Multi-Free U-KAN (MF-UKAN)\nmodule and a dynamic clipping strategy. TC-KANRecon model aims to accelerate\nthe MRI reconstruction process through deep learning methods while maintaining\nthe quality of the reconstructed images. The MF-UKAN module can effectively\nbalance the tradeoff between image denoising and structure preservation.\nSpecifically, it presents the multi-head attention mechanisms and scalar\nmodulation factors, which significantly enhances the model's robustness and\nstructure preservation capabilities in complex noise environments. Moreover,\nthe dynamic clipping strategy in TC-KANRecon adjusts the cropping interval\naccording to the sampling steps, thereby mitigating image detail loss typically\ncaused by traditional cropping methods and enriching the visual features of the\nimages. Furthermore, the MC-Model module incorporates full-sampling k-space\ninformation, realizing efficient fusion of conditional information, enhancing\nthe model's ability to process complex data, and improving the realism and\ndetail richness of reconstructed images. Experimental results demonstrate that\nthe proposed method outperforms other MRI reconstruction methods in both\nqualitative and quantitative evaluations. Notably, TC-KANRecon method exhibits\nexcellent reconstruction results when processing high-noise, low-sampling-rate\nMRI data. Our source code is available at\nhttps://github.com/lcbkmm/TC-KANRecon.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}