{"id":"2408.11079","title":"Patterns of Transposable Element Distribution Around Chromatin Ligation\n  Points Revealed by Micro-C Data Analysis","authors":"Alexandr V. Vikhorev, Michael M. Rempel, Oksana O. Polesskaya, Ivan V.\n  Savelev, and Max V. Myakishev-Rempel","authorsParsed":[["Vikhorev","Alexandr V.",""],["Rempel","Michael M.",""],["Polesskaya","Oksana O.",""],["Savelev","Ivan V.",""],["Myakishev-Rempel","Max V.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 01:02:59 GMT"}],"updateDate":"2024-08-22","timestamp":1724115779000,"abstract":"  Transposable elements (TEs) constitute a significant portion of eukaryotic\ngenomes, yet their role in chromatin organization remains poorly understood.\nThis study investigates the distribution patterns of TEs around chromatin\nligation points (LPs) identified through Micro-C experiments in human cells. We\nanalyzed the density of various TE families within a 100kb window centered on\nLPs, focusing on major families such as Alu and LINE-1 (L1) elements. Our\nfindings reveal distinct, non-random distribution patterns that differ between\nTE families and exhibit consistent strand-specific biases. These patterns were\nreproducible across two independent datasets and showed marked differences from\nrandom genomic distributions. Notably, we observed family-specific variations\nin TE density near LPs, with some families showing depletion at LPs followed by\nperiodic fluctuations in density. The consistency of these patterns across TE\nfamilies and their orientation relative to chromosome arms suggest a\nfundamental relationship between TEs and higher-order chromatin structure. Our\nresults provide new insights into the potential role of TEs in genome\norganization and challenge the notion of TEs as passive genomic components.\nThis study lays the groundwork for future investigations into the functional\nimplications of TE distribution in chromatin architecture and gene regulation.\n","subjects":["Quantitative Biology/Other Quantitative Biology"],"license":"http://creativecommons.org/licenses/by/4.0/"}