{"id":"2408.07047","title":"Solar active region evolution and imminent flaring activity through a\n  color-coded visualization of photospheric vector magnetograms","authors":"I. Kontogiannis (1), A.G.M. Pietrow (1 and 2), M.K. Druett (2), E.\n  Dineva (2), M. Verma (1), and C. Denker (1) ((1) Leibniz-Institut f\\\"ur\n  Astrophysik Potsdam (AIP), (2) Centre for Mathematical Plasma Astrophysics,\n  Department of Mathematics, KU Leuven)","authorsParsed":[["Kontogiannis","I.","","1 and 2"],["Pietrow","A. G. M.","","1 and 2"],["Druett","M. K.",""],["Dineva","E.",""],["Verma","M.",""],["Denker","C.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:22:32 GMT"}],"updateDate":"2024-08-14","timestamp":1723569752000,"abstract":"  The emergence of magnetic flux, its transition to complex configurations, and\nthe pre-eruptive state of active regions are probed using photospheric\nmagnetograms. We aim to pinpoint different evolutionary stages in active\nregions, explore their differences and produce parameters that could advance\nflare prediction, using color-coded maps of the photospheric magnetic field.\nThe three components of the photospheric magnetic field vector are combined in\ncolor-coded magnetograms (COCOMAGs). From these, the areas occupied by\ndifferent colors are extracted, creating appropriate time series (color\ncurves). The COCOMAGs and color curves are used as proxies of the active region\nevolution and complexity. The COCOMAGs morphology reflects typical features of\nactive regions, such as sunspots, plages, and sheared polarity inversion lines.\nThe color curves represent the area occupied by photospheric magnetic field of\ndifferent orientation and contain information relevant to the evolutionary\nstages of active regions. During emergence, most of the area is dominated by\nhorizontal or highly inclined magnetic field, which gradually gives its place\nto more vertical magnetic field. In complex regions, large parts are covered by\nhighly inclined magnetic fields, appearing as abrupt color changes. Active\nregion decay is signified by a domination of vertical magnetic field,\nindicating a gradual relaxation of the magnetic field configuration. The color\ncurves exhibit varying degree of correlation with active region complexity. The\nred and magenta color curves, which represent strong, purely horizontal\nmagnetic field, are good indicators of future flaring. Color-coded magnetograms\nfacilitate a comprehensive view of the evolution of active regions and their\ncomplexity. They offer a framework for the treatment of complex observations\nand can be used in pattern recognition, feature extraction and flare\nprediction.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}