{"id":"2408.03347","title":"A ubiquitous transfer function links interacting elements to emerging\n  property of complex systems","authors":"Lina Yan, Jeffrey Huy Khong, Aleksandar Kostadinov, Jerry Ying Hsi\n  Fuh, Chih-Ming Ho","authorsParsed":[["Yan","Lina",""],["Khong","Jeffrey Huy",""],["Kostadinov","Aleksandar",""],["Fuh","Jerry Ying Hsi",""],["Ho","Chih-Ming",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:56:39 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 04:50:35 GMT"},{"version":"v3","created":"Sat, 17 Aug 2024 01:32:07 GMT"}],"updateDate":"2024-08-20","timestamp":1722869799000,"abstract":"  In the field of complex systems, self-organization magnifies the compounding\neffects of element interactions by propagating, modifying, and enhancing\nfunctionality, ultimately leading to emergent system properties. The\nintricacies of self-organization make unveiling the elusive link between\nelement interactions and emergent system properties akin to finding the\nproverbial Holy Grail. In the search for identifying a method to predict\nsystem-level properties, we used an inductive approach to bypass the\nself-organization. By observing drug interactions within biological complex\nsystem, system property, efficacy, emerged as a smooth response surface in the\nmulti-dimensional space of drug-system interactions, which can be represented\nby the Complex System Response (CSR) function. This CSR function has been\nsuccessfully validated across diverse disease models in cell lines, animals,\nand clinical trials. Notably, the CSR function reveals that biological complex\nsystems exhibit second-order non-linearity. In this study, we generalized the\nCSR function to physical complex systems, linking maximum compressive yielding\nstress to impactful manufacturing parameters of the Selective Laser Melting\n(SLM) process. Remarkably though anticipated, the CSR function reveals the\nconnection between the macroscale system property (compressive yielding stress)\nand the microstructure during self-organizing process. In addition, the\nsecond-order non-linear CSR functions ensure a single global optimum in complex\nsystems.\n","subjects":["Physics/Biological Physics","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}