{"id":"2408.10937","title":"Proxona: Leveraging LLM-Driven Personas to Enhance Creators'\n  Understanding of Their Audience","authors":"Yoonseo Choi, Eun Jeong Kang, Seulgi Choi, Min Kyung Lee and Juho Kim","authorsParsed":[["Choi","Yoonseo",""],["Kang","Eun Jeong",""],["Choi","Seulgi",""],["Lee","Min Kyung",""],["Kim","Juho",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 15:20:30 GMT"}],"updateDate":"2024-08-21","timestamp":1724167230000,"abstract":"  Creators are nothing without their audience, and thereby understanding their\naudience is the cornerstone of their professional achievement. Yet many\ncreators feel lost while comprehending audiences with existing tools, which\noffer insufficient insights for tailoring content to audience needs. To address\nthe challenges creators face in understanding their audience, we present\nProxona, a system for defining and extracting representative audience personas\nfrom the comments. Creators converse with personas to gain insights into their\npreferences and engagement, solicit feedback, and implement evidence-based\nimprovements to their content. Powered by large language models, Proxona\nanalyzes audience comments, distilling the latent characteristics of audiences\ninto tangible dimensions (classification categories) and values (category\nattributes). Proxona then clusters these into synthetic personas. Our technical\nevaluations demonstrated that our pipelines effectively generated relevant and\ndistinct dimensions and values, enabling the deduction of audience-reflecting\npersonas, while minimizing the likelihood of hallucinations in persona\nresponses. Our user evaluation with 11 creators showed that Proxona supported\ncreators to gain new insights about their audience, make informed decisions,\nand successfully complete content creation with high confidence. Proxona's\ndata-driven audience personas empower creators to seamlessly integrate audience\nperspectives into their creative processes, fostering a collaborative approach\nto content creation.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}