{"id":"2408.12152","title":"Behavior Pattern Mining-based Multi-Behavior Recommendation","authors":"Haojie Li, Zhiyong Cheng, Xu Yu, Jinhuan Liu, Guanfeng Liu, and Junwei\n  Du","authorsParsed":[["Li","Haojie",""],["Cheng","Zhiyong",""],["Yu","Xu",""],["Liu","Jinhuan",""],["Liu","Guanfeng",""],["Du","Junwei",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 06:41:59 GMT"}],"updateDate":"2024-08-23","timestamp":1724308919000,"abstract":"  Multi-behavior recommendation systems enhance effectiveness by leveraging\nauxiliary behaviors (such as page views and favorites) to address the\nlimitations of traditional models that depend solely on sparse target behaviors\nlike purchases. Existing approaches to multi-behavior recommendations typically\nfollow one of two strategies: some derive initial node representations from\nindividual behavior subgraphs before integrating them for a comprehensive\nprofile, while others interpret multi-behavior data as a heterogeneous graph,\napplying graph neural networks to achieve a unified node representation.\nHowever, these methods do not adequately explore the intricate patterns of\nbehavior among users and items. To bridge this gap, we introduce a novel\nalgorithm called Behavior Pattern mining-based Multi-behavior Recommendation\n(BPMR). Our method extensively investigates the diverse interaction patterns\nbetween users and items, utilizing these patterns as features for making\nrecommendations. We employ a Bayesian approach to streamline the recommendation\nprocess, effectively circumventing the challenges posed by graph neural network\nalgorithms, such as the inability to accurately capture user preferences due to\nover-smoothing. Our experimental evaluation on three real-world datasets\ndemonstrates that BPMR significantly outperforms existing state-of-the-art\nalgorithms, showing an average improvement of 268.29% in Recall@10 and 248.02%\nin NDCG@10 metrics. The code of our BPMR is openly accessible for use and\nfurther research at https://github.com/rookitkitlee/BPMR.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}