{"id":"2408.01526","title":"Multi-Unit Floor Plan Recognition and Reconstruction Using Improved\n  Semantic Segmentation of Raster-Wise Floor Plans","authors":"Lukas Kratochvila, Gijs de Jong, Monique Arkesteijn, Simon Bilik,\n  Tomas Zemcik, Karel Horak, Jan S. Rellermeyer","authorsParsed":[["Kratochvila","Lukas",""],["de Jong","Gijs",""],["Arkesteijn","Monique",""],["Bilik","Simon",""],["Zemcik","Tomas",""],["Horak","Karel",""],["Rellermeyer","Jan S.",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:36:45 GMT"}],"updateDate":"2024-08-06","timestamp":1722623805000,"abstract":"  Digital twins have a major potential to form a significant part of urban\nmanagement in emergency planning, as they allow more efficient designing of the\nescape routes, better orientation in exceptional situations, and faster rescue\nintervention. Nevertheless, creating the twins still remains a largely manual\neffort, due to a lack of 3D-representations, which are available only in\nlimited amounts for some new buildings. Thus, in this paper we aim to\nsynthesize 3D information from commonly available 2D architectural floor plans.\nWe propose two novel pixel-wise segmentation methods based on the MDA-Unet and\nMACU-Net architectures with improved skip connections, an attention mechanism,\nand a training objective together with a reconstruction part of the pipeline,\nwhich vectorizes the segmented plans to create a 3D model. The proposed methods\nare compared with two other state-of-the-art techniques and several benchmark\ndatasets. On the commonly used CubiCasa benchmark dataset, our methods have\nachieved the mean F1 score of 0.86 over five examined classes, outperforming\nthe other pixel-wise approaches tested. We have also made our code publicly\navailable to support research in the field.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SAH8e2kfuEQ2HC5oaqF-GGQfNnIoOdhFMc1-ioKsDHo","pdfSize":"23504217"}
