{"id":"2408.16836","title":"The Role of Allotropy on Phase Formation in High Entropy Alloys","authors":"Kevin Kaufmann, Haoren Wang, Jaskaran Saini, Kenneth S. Vecchio","authorsParsed":[["Kaufmann","Kevin",""],["Wang","Haoren",""],["Saini","Jaskaran",""],["Vecchio","Kenneth S.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 18:02:56 GMT"}],"updateDate":"2024-09-02","timestamp":1724954576000,"abstract":"  Identifying single phase, high-entropy systems has been a prominent research\nfocus of materials engineering over the past decade. The considerable effort in\ncomputational modeling and experimental verification has yielded several\nmethods and descriptors for predicting if a single phase will form; however,\nthe details surrounding the resulting crystal structure have largely remained a\nmystery. Here, we present a compelling argument for the role of allotropy in\ndetermining the crystal structure of a single-phase, high-entropy alloy. High\nentropy alloys can contain 5 or more elements and must achieve a\nconfigurational entropy greater than 1.5R. This study shows that when these\nhigh entropy material conditions are met, the majority crystal structure of the\nnon-allotrope forming element plays a dominant role in crystal structure\ndetermination. The theory is demonstrated via several approaches, including\nanalysis of 434 unique known single-phase compositions from the literature,\nthermodynamic modeling of more than 1,400 compositions, and experimental\nsynthesis of nine specific alloys that test this hypothesis. The results\ndemonstrate allotropy can identify a subset of compositions unlikely to form a\nsingle phase and predict the crystal structure with a high degree of accuracy\nfor a wide range of simple (e.g., 5 equiatomic elements) and more complex\n(e.g., Al0.3B0.6CoCrFeNiCu0.7Si0.1) high entropy alloys. Allotropy provides new\ninsight into the underlying physics governing the resultant crystal structure\nin materials without a principle element. As high entropy materials continue to\nbe an area of focus for developing materials with unique properties, this study\nis expected to serve as a significant tool in the screening of materials for\nspecific crystal structures.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}