{"id":"2408.16292","title":"The AMBRE Project: Lead abundance in Galactic stars","authors":"G. Contursi, P. de Laverny, A. Recio-Blanco, M. Molero, E. Spitoni, F.\n  Matteucci, S. Cristallo","authorsParsed":[["Contursi","G.",""],["de Laverny","P.",""],["Recio-Blanco","A.",""],["Molero","M.",""],["Spitoni","E.",""],["Matteucci","F.",""],["Cristallo","S.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:48:11 GMT"}],"updateDate":"2024-08-30","timestamp":1724914091000,"abstract":"  The chemical evolution of neutron capture elements in the Milky Way is still\na matter of debate. Although more and more studies investigate their chemical\nbehaviour, there is still a lack of a significant large sample of abundances of\na key heavy element: lead. Lead is the final product of the s-process\nnucleosynthesis channel and is one of the most stable heavy elements. We\nanalysed high-resolution spectra from the ESO UVES and FEROS archives.\nAtmospheric parameters were taken from the AMBRE parametrisation. We used the\nautomated abundance method GAUGUIN to derive lead abundances in 653\nslow-rotating FGK-type stars from the 368.34nm Pb I line. We present the\nlargest catalogue of homogeneous LTE and non-LTE lead abundances ever published\nwith metallicities ranging from -2.9 to 0.6dex and [Pb/Fe] from -0.7 to 3.3dex.\nWithin this sample, no lead-enhanced Asymptotic Giant Branch (AGB) stars were\nfound, but nine lead-enhanced metal-poor stars ([Pb/Fe] > 1.5) were detected.\nMost of them were already identified as carbon-enhanced metal-poor stars with\nenrichments in other s-process species. The lead abundance of 13 Gaia Benchmark\nStars are also provided. We then investigated the Pb content of the Milky Way\ndisc by computing vertical and radial gradients and found a slightly decreasing\n[Pb/Fe] radial trend with metallicity. This trend together with other related\nratios ([Pb/Eu], [Pb/Ba], and [Pb/alpha]) are interpreted thanks to chemical\nevolution models. The two-infall model closely reproduces the observed trends\nwith respect to the metallicity. It is also found that the AGB contribution to\nthe Pb Galactic enrichment has to be strongly reduced. Moreover, the\ncontribution of massive stars with rather high rotational velocities should be\nfavoured in the low-metallicity regime.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}