{"id":"2408.06365","title":"Effects of Quadratic Optomechanical Coupling on Bipartite Entanglements,\n  Mechanical Ground-State Cooling and Squeezing in an Electro-Optomechanical\n  System","authors":"N. Ghorbani, Ali Motazedifard, and M. H. Naderi","authorsParsed":[["Ghorbani","N.",""],["Motazedifard","Ali",""],["Naderi","M. H.",""]],"versions":[{"version":"v1","created":"Sat, 27 Jul 2024 12:45:27 GMT"}],"updateDate":"2024-08-14","timestamp":1722084327000,"abstract":"  We theoretically investigate the steady-state bipartite entanglements,\nmechanical ground-state cooling, and mechanical quadrature squeezing in a\nhybrid electro-optomechanical system where a moving membrane is linearly\ncoupled to the microwave field mode of an LC circuit, while it simultaneously\ninteracts both linearly and quadratically with the radiation pressure of a\nsingle-mode optical cavity. We show that by choosing a suitable sign and\namplitude for the quadratic optomechanical coupling (QOC), one can achieve\nenhanced and thermally robust stationary bipartite entanglement between the\nsubsystems, improved mechanical ground-state cooling, and Q-quadrature\nsqueezing of the mechanical mode beyond the 3-dB limit of squeezing. In\nparticular, we find that in the presence of QOC with positive sign the\nbipartite optical-microwave entanglement can be increased by about 2.25 times\naround the temperature of 1mK, and it can be preserved against thermal noise up\nto the ambient temperature of 90mK. Furthermore, the QOC with positive sign can\ngive rise to the enhancement of the mechanical ground-state cooling by about 1\norder of magnitude in the optical and microwave red-detuned regime. We also\nfind that for the positive sign of QOC and near the microwave resonance\nfrequency the squeezing degree of the Q-quadrature of the mechanical mode can\nbe amplified up to 7 dB. Such a hybrid electro-optomechanical system can serve\nas a promising platform to engineer an improved optical-microwave entangled\nsource for microwave sensing as well as quantum information processing.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"wZ3M3_3ou_P_3eAVxscAXAve6bQ4Fz4_Mm4vf9eHvEw","pdfSize":"11748873"}
