{"id":"2408.02906","title":"Dual-View Pyramid Pooling in Deep Neural Networks for Improved Medical\n  Image Classification and Confidence Calibration","authors":"Xiaoqing Zhang, Qiushi Nie, Zunjie Xiao, Jilu Zhao, Xiao Wu, Pengxin\n  Guo, Runzhi Li, Jin Liu, Yanjie Wei, Yi Pan","authorsParsed":[["Zhang","Xiaoqing",""],["Nie","Qiushi",""],["Xiao","Zunjie",""],["Zhao","Jilu",""],["Wu","Xiao",""],["Guo","Pengxin",""],["Li","Runzhi",""],["Liu","Jin",""],["Wei","Yanjie",""],["Pan","Yi",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 02:38:22 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 01:30:06 GMT"}],"updateDate":"2024-08-16","timestamp":1722911902000,"abstract":"  Spatial pooling (SP) and cross-channel pooling (CCP) operators have been\napplied to aggregate spatial features and pixel-wise features from feature maps\nin deep neural networks (DNNs), respectively. Their main goal is to reduce\ncomputation and memory overhead without visibly weakening the performance of\nDNNs. However, SP often faces the problem of losing the subtle feature\nrepresentations, while CCP has a high possibility of ignoring salient feature\nrepresentations, which may lead to both miscalibration of confidence issues and\nsuboptimal medical classification results. To address these problems, we\npropose a novel dual-view framework, the first to systematically investigate\nthe relative roles of SP and CCP by analyzing the difference between spatial\nfeatures and pixel-wise features. Based on this framework, we propose a new\npooling method, termed dual-view pyramid pooling (DVPP), to aggregate\nmulti-scale dual-view features. DVPP aims to boost both medical image\nclassification and confidence calibration performance by fully leveraging the\nmerits of SP and CCP operators from a dual-axis perspective. Additionally, we\ndiscuss how to fulfill DVPP with five parameter-free implementations. Extensive\nexperiments on six 2D/3D medical image classification tasks show that our DVPP\nsurpasses state-of-the-art pooling methods in terms of medical image\nclassification results and confidence calibration across different DNNs.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tr1wge8KEAsj5GxdyDHnNl8M-uPYMXdHqGcDMcb-xAY","pdfSize":"1609743"}
