{"id":"2408.15217","title":"Fundus2Video: Cross-Modal Angiography Video Generation from Static\n  Fundus Photography with Clinical Knowledge Guidance","authors":"Weiyi Zhang, Siyu Huang, Jiancheng Yang, Ruoyu Chen, Zongyuan Ge,\n  Yingfeng Zheng, Danli Shi, Mingguang He","authorsParsed":[["Zhang","Weiyi",""],["Huang","Siyu",""],["Yang","Jiancheng",""],["Chen","Ruoyu",""],["Ge","Zongyuan",""],["Zheng","Yingfeng",""],["Shi","Danli",""],["He","Mingguang",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 17:30:49 GMT"}],"updateDate":"2024-08-28","timestamp":1724779849000,"abstract":"  Fundus Fluorescein Angiography (FFA) is a critical tool for assessing retinal\nvascular dynamics and aiding in the diagnosis of eye diseases. However, its\ninvasive nature and less accessibility compared to Color Fundus (CF) images\npose significant challenges. Current CF to FFA translation methods are limited\nto static generation. In this work, we pioneer dynamic FFA video generation\nfrom static CF images. We introduce an autoregressive GAN for smooth,\nmemory-saving frame-by-frame FFA synthesis. To enhance the focus on dynamic\nlesion changes in FFA regions, we design a knowledge mask based on clinical\nexperience. Leveraging this mask, our approach integrates innovative knowledge\nmask-guided techniques, including knowledge-boosted attention, knowledge-aware\ndiscriminators, and mask-enhanced patchNCE loss, aimed at refining generation\nin critical areas and addressing the pixel misalignment challenge. Our method\nachieves the best FVD of 1503.21 and PSNR of 11.81 compared to other common\nvideo generation approaches. Human assessment by an ophthalmologist confirms\nits high generation quality. Notably, our knowledge mask surpasses supervised\nlesion segmentation masks, offering a promising non-invasive alternative to\ntraditional FFA for research and clinical applications. The code is available\nat https://github.com/Michi-3000/Fundus2Video.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}