{"id":"2408.03858","title":"Capturing Nonlinear Electron Dynamics with Fully Characterised\n  Attosecond X-ray Pulses","authors":"Lars Funke, Markus Ilchen, Kristina Dingel, Tommaso Mazza, Terence\n  Mullins, Thorsten Otto, Daniel Rivas, Sara Savio, Svitozar Serkez, Peter\n  Walter, Niclas Wieland, Lasse W\\\"ulfing, Sadia Bari, Rebecca Boll, Markus\n  Braune, Francesca Calegari, Alberto De Fanis, Winfried Decking, Andreas\n  Duensing, Stefan D\\\"usterer, Arno Ehresmann, Benjamin Erk, Danilo Enoque\n  Ferreira de Lima, Andreas Galler, Gianluca Geloni, Jan Gr\\\"unert, Marc Guetg,\n  Patrik Grychtol, Andreas Hans, Arne Held, Ruda Hindriksson, Ludger Inhester,\n  Till Jahnke, Joakim Laksman, Mats Larsson, Jia Liu, Jon P. Marangos, Lutz\n  Marder, David Meier, Michael Meyer, Najmeh Mirian, Christian Ott, Christopher\n  Passow, Thomas Pfeifer, Patrick Rupprecht, Albert Schletter, Philipp Schmidt,\n  Frank Scholz, Simon Schott, Evgeny Schneidmiller, Bernhard Sick, Sang-Kil\n  Son, Kai Tiedtke, Sergey Usenko, Vincent Wanie, Markus Wurzer, Mikhail\n  Yurkov, Vitali Zhaunerchyk, Wolfram Helml","authorsParsed":[["Funke","Lars",""],["Ilchen","Markus",""],["Dingel","Kristina",""],["Mazza","Tommaso",""],["Mullins","Terence",""],["Otto","Thorsten",""],["Rivas","Daniel",""],["Savio","Sara",""],["Serkez","Svitozar",""],["Walter","Peter",""],["Wieland","Niclas",""],["Wülfing","Lasse",""],["Bari","Sadia",""],["Boll","Rebecca",""],["Braune","Markus",""],["Calegari","Francesca",""],["De Fanis","Alberto",""],["Decking","Winfried",""],["Duensing","Andreas",""],["Düsterer","Stefan",""],["Ehresmann","Arno",""],["Erk","Benjamin",""],["de Lima","Danilo Enoque Ferreira",""],["Galler","Andreas",""],["Geloni","Gianluca",""],["Grünert","Jan",""],["Guetg","Marc",""],["Grychtol","Patrik",""],["Hans","Andreas",""],["Held","Arne",""],["Hindriksson","Ruda",""],["Inhester","Ludger",""],["Jahnke","Till",""],["Laksman","Joakim",""],["Larsson","Mats",""],["Liu","Jia",""],["Marangos","Jon P.",""],["Marder","Lutz",""],["Meier","David",""],["Meyer","Michael",""],["Mirian","Najmeh",""],["Ott","Christian",""],["Passow","Christopher",""],["Pfeifer","Thomas",""],["Rupprecht","Patrick",""],["Schletter","Albert",""],["Schmidt","Philipp",""],["Scholz","Frank",""],["Schott","Simon",""],["Schneidmiller","Evgeny",""],["Sick","Bernhard",""],["Son","Sang-Kil",""],["Tiedtke","Kai",""],["Usenko","Sergey",""],["Wanie","Vincent",""],["Wurzer","Markus",""],["Yurkov","Mikhail",""],["Zhaunerchyk","Vitali",""],["Helml","Wolfram",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 15:57:51 GMT"}],"updateDate":"2024-08-08","timestamp":1723046271000,"abstract":"  Attosecond X-ray pulses are the key to studying electron dynamics at their\nnatural time scale involving specific electronic states. They are promising to\nbuild the conceptual bridge between physical and chemical photo-reaction\nprocesses. Free-electron lasers have demonstrated their capability of\ngenerating intense attosecond X-ray pulses. However, harnessing them for\ntime-resolving experiments and investigations of nonlinear X-ray absorption\nmechanisms remains a cutting-edge challenge. We have characterised X-ray pulses\nwith durations of down to 700$\\,$attoseconds and peak powers up to 200$\\,$GW at\n$\\sim$ 1$\\,$keV photon energy via angular streaking at the SQS instrument of\nthe European XFEL. As direct application, we present results of nonlinear\nX-ray-matter interaction via state-specific spectroscopy on a transient system.\nUsing the derived spectral and temporal information of each pulse, we\ndeliberately steer the probability for formation of double-core vacancies in\nneon gas atoms through excitation or ionisation of the second inner-shell\nelectron after K-shell ionisation. Our results advance the field of attosecond\nscience with highly intense and fully characterised X-ray pulses to the\nsite-specific investigation of electronic motion in transient media.\n","subjects":["Physics/Optics","Physics/Atomic Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}