{"id":"2408.12207","title":"Electron States Emerging at Magnetic Domain Wall of magnetic\n  semiconductors with strong Rashba effect","authors":"I. P. Rusinov, V. N. Men'shov, E. V. Chulkov","authorsParsed":[["Rusinov","I. P.",""],["Men'shov","V. N.",""],["Chulkov","E. V.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 08:31:54 GMT"}],"updateDate":"2024-08-23","timestamp":1724315514000,"abstract":"  In the present article, we explore the electron properties of magnetic\nsemiconductors with strong Rashba spin-orbit coupling taking into account the\npresence of domain walls at the sample surface. We consider antiphase domain\nwalls separating domains with both in-plane and out-of-plane magnetization as\nwell as noncollinear domain walls. First, we propose the model and unveil\ngeneral physical picture of phenomenon supported by analytical arguments.\nFurther, we perform a comprehensive tight-binding numerical calculations to\nprovide a profound understanding of our findings. A domain wall separating\ndomains with any polarization directions is demonstrated to host a bound state.\nWhat is more interesting is that we predict that either of these domain walls\nalso induces one-dimensional resonant state. The surface energy spectrum and\nspin polarization of the states are highly sensitive to the magnetization\norientation in the adjacent domains. The spectral broadening and the spatial\nlocalization of the resonant state depend significantly on a relation between\nthe Rashba splitting and the exchange one. Our estimation shows that chiral\nconducting channels associated with the long-lived resonant states can emerge\nalong the magnetic domain walls and can be accessed experimentally at the\nsurface of BiTeI doped with transition metal atoms.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IvsOQu6pXGaRGj9iRYg3th_fksG89IEiem0tYt4sjf8","pdfSize":"2219963"}
