{"id":"2408.14620","title":"General targeted machine learning for modern causal mediation analysis","authors":"Richard Liu, Nicholas T. Williams, Kara E. Rudolph, Iv\\'an D\\'iaz","authorsParsed":[["Liu","Richard",""],["Williams","Nicholas T.",""],["Rudolph","Kara E.",""],["Díaz","Iván",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 20:31:26 GMT"}],"updateDate":"2024-08-28","timestamp":1724704286000,"abstract":"  Causal mediation analyses investigate the mechanisms through which causes\nexert their effects, and are therefore central to scientific progress. The\nliterature on the non-parametric definition and identification of mediational\neffects in rigourous causal models has grown significantly in recent years, and\nthere has been important progress to address challenges in the interpretation\nand identification of such effects. Despite great progress in the causal\ninference front, statistical methodology for non-parametric estimation has\nlagged behind, with few or no methods available for tackling non-parametric\nestimation in the presence of multiple, continuous, or high-dimensional\nmediators. In this paper we show that the identification formulas for six\npopular non-parametric approaches to mediation analysis proposed in recent\nyears can be recovered from just two statistical estimands. We leverage this\nfinding to propose an all-purpose one-step estimation algorithm that can be\ncoupled with machine learning in any mediation study that uses any of these six\ndefinitions of mediation. The estimators have desirable properties, such as\n$\\sqrt{n}$-convergence and asymptotic normality. Estimating the first-order\ncorrection for the one-step estimator requires estimation of complex density\nratios on the potentially high-dimensional mediators, a challenge that is\nsolved using recent advancements in so-called Riesz learning. We illustrate the\nproperties of our methods in a simulation study and illustrate its use on real\ndata to estimate the extent to which pain management practices mediate the\ntotal effect of having a chronic pain disorder on opioid use disorder.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}