{"id":"2408.07805","title":"Reduction to depth zero for tame p-adic groups via Hecke algebra\n  isomorphisms","authors":"Jeffrey D. Adler, Jessica Fintzen, Manish Mishra, and Kazuma Ohara","authorsParsed":[["Adler","Jeffrey D.",""],["Fintzen","Jessica",""],["Mishra","Manish",""],["Ohara","Kazuma",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 20:30:27 GMT"}],"updateDate":"2024-08-16","timestamp":1723667427000,"abstract":"  Let $F$ be a nonarchimedean local field of residual characteristic $p$. Let\n$G$ denote a connected reductive group over $F$ that splits over a tamely\nramified extension of $F$. Let $(K ,\\rho)$ be a type as constructed by Kim and\nYu. We show that there exists a twisted Levi subgroup $G^0 \\subset G$ and a\ntype $(K^0, \\rho^0)$ for $G^0$ such that the corresponding Hecke algebras\n$\\mathcal{H}(G(F), (K, \\rho))$ and $\\mathcal{H}(G^0(F), (K^0, \\rho^0))$ are\nisomorphic. If $p$ does not divide the order of the absolute Weyl group of $G$,\nthen every Bernstein block is equivalent to modules over such a Hecke algebra.\nHence, under this assumption on $p$, our result implies that every Bernstein\nblock is equivalent to a depth-zero Bernstein block. This allows one to reduce\nmany problems about (the category of) smooth, complex representations of\n$p$-adic groups to analogous problems about (the category of) depth-zero\nrepresentations.\n  Our isomorphism of Hecke algebras is very explicit and also includes an\nexplicit description of the Hecke algebras as semi-direct products of an affine\nHecke with a twisted group algebra. Moreover, we work with arbitrary\nalgebraically closed fields of characteristic different from $p$ as our\ncoefficient field.\n  This paper relies on a prior axiomatic result about the structure of Hecke\nalgebras by the same authors and a key ingredient consists of extending the\nquadratic character of Fintzen--Kaletha--Spice to the support of the Hecke\nalgebra, which might be of independent interest.\n","subjects":["Mathematics/Representation Theory","Mathematics/Number Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}