{"id":"2408.00078","title":"Searching for New Cataclysmic Variables in the Chandra Source Catalog","authors":"Ilkham Galiullin, Antonio C. Rodriguez, Kareem El-Badry, Paula Szkody,\n  Abhijeet Anand, Jan van Roestel, Askar Sibgatullin, Vladislav Dodon, Nikita\n  Tyrin, Ilaria Caiazzo, Matthew J. Graham, Russ R. Laher, Shrinivas R.\n  Kulkarni, Thomas A. Prince, Reed Riddle, Zachary P. Vanderbosch, Avery Wold","authorsParsed":[["Galiullin","Ilkham",""],["Rodriguez","Antonio C.",""],["El-Badry","Kareem",""],["Szkody","Paula",""],["Anand","Abhijeet",""],["van Roestel","Jan",""],["Sibgatullin","Askar",""],["Dodon","Vladislav",""],["Tyrin","Nikita",""],["Caiazzo","Ilaria",""],["Graham","Matthew J.",""],["Laher","Russ R.",""],["Kulkarni","Shrinivas R.",""],["Prince","Thomas A.",""],["Riddle","Reed",""],["Vanderbosch","Zachary P.",""],["Wold","Avery",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:00:06 GMT"}],"updateDate":"2024-08-02","timestamp":1722448806000,"abstract":"  Cataclysmic variables (CVs) are compact binary systems in which a white dwarf\naccretes matter from a Roche-lobe-filling companion star. In this study, we\nsearched for new CVs in the Milky Way in the Chandra Source Catalog v2.0,\ncross-matched with Gaia Data Release 3 (DR3). We identified new CV candidates\nby combining X-ray and optical data in a color-color diagram called the ``X-ray\nMain Sequence\". We used two different cuts in this diagram to compile pure and\noptically variable samples of CV candidates. We undertook optical spectroscopic\nfollow-up observations with the Keck and Palomar Observatories to confirm the\nnature of these sources. We assembled a sample of 25,887 Galactic X-ray sources\nand found 14 new CV candidates. Seven objects show X-ray and/or optical\nvariability. All sources show X-ray luminosity in the $\\rm 10^{29}-10^{32}$\n$\\rm erg\\ s^{-1}$ range, and their X-ray spectra can be approximated by a\npower-law model with photon indices in the $\\rm \\Gamma \\sim 1-3$ range or an\noptically thin thermal emission model in the $\\rm kT \\sim 1-70$ keV range. We\nspectroscopically confirmed four CVs, discovering two new polars, one low\naccretion rate polar and a WZ~Sge-like low accretion rate CV. X-ray and optical\nproperties of the other 9 objects suggest that they are also CVs (likely\nmagnetic or dwarf novae), and one other object could be an eclipsing binary,\nbut revealing their true nature requires further observations. These results\nshow that a joint X-ray and optical analysis can be a powerful tool for finding\nnew CVs in large X-ray and optical catalogs. X-ray observations such as those\nby Chandra are particularly efficient at discovering magnetic and low accretion\nrate CVs, which could be missed by purely optical surveys.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}