{"id":"2408.13244","title":"Fullerene-encapsulated Cyclic Ozone for the Next Generation of\n  Nano-sized Propellants via Quantum Computation","authors":"Thomas W. Watts, Matthew Otten, Jason T. Necaise, Nam Nguyen, Benjamin\n  Link, Kristen S. Williams, Yuval R. Sanders, Samuel J. Elman, Maria\n  Kieferova, Michael J. Bremner, Kaitlyn J. Morrell, Justin E. Elenewski,\n  Samuel D. Johnson, Luke Mathieson, Kevin M. Obenland, Rashmi Sundareswara,\n  Adam Holmes","authorsParsed":[["Watts","Thomas W.",""],["Otten","Matthew",""],["Necaise","Jason T.",""],["Nguyen","Nam",""],["Link","Benjamin",""],["Williams","Kristen S.",""],["Sanders","Yuval R.",""],["Elman","Samuel J.",""],["Kieferova","Maria",""],["Bremner","Michael J.",""],["Morrell","Kaitlyn J.",""],["Elenewski","Justin E.",""],["Johnson","Samuel D.",""],["Mathieson","Luke",""],["Obenland","Kevin M.",""],["Sundareswara","Rashmi",""],["Holmes","Adam",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 17:38:44 GMT"}],"updateDate":"2024-08-26","timestamp":1724434724000,"abstract":"  Cyclic ozone additives have the potential to significantly increase the\nspecific impulse of rocket fuel, which would lead to greater efficiency and\nreduced costs for space launches, allowing up to one third more payload per\nrocket. Although practical attempts to capture this isomer have not been\nsuccessful, cyclic ozone might be stabilized within confined geometries.\nHowever, the required synthetic methods are challenging to design and need\ntheory-driven inputs that exceed the capabilities of classical methods. Quantum\ncomputation could enable these calculations, but the hardware requirements for\nmany practical applications are still unclear. We provide a comprehensive\nanalysis of how quantum methods could aid efforts to isolate cyclic ozone using\nfullerene encapsulation. Our discussion goes beyond formal complexity analysis,\noffering both logical and physical overhead estimates for determining ground\nstate energies based on quantum phase estimation (QPE). Together, these data\noutline a plausible scale for realistic, computationally-assisted molecular\ndesign efforts using fault-tolerant quantum computation.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"ZBn-C2SMRKSlAKz4BC7IL6zojVNhFVrkP_0W5fPQNy4","pdfSize":"4282143"}
