{"id":"2408.13383","title":"A physically modelled selection function for compact binary mergers in\n  the LIGO-Virgo O3 run and beyond","authors":"Ana Lorenzo-Medina and Thomas Dent","authorsParsed":[["Lorenzo-Medina","Ana",""],["Dent","Thomas",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:28:57 GMT"}],"updateDate":"2024-08-27","timestamp":1724448537000,"abstract":"  Despite the observation of nearly 100 compact binary coalescence (CBC) events\nup to the end of the Advanced gravitational-wave (GW) detectors' third\nobserving run (O3), there remain fundamental open questions regarding their\nastrophysical formation mechanisms and environments. Population analysis should\nyield insights into these questions, but requires careful control of\nuncertainties and biases. GW observations have a strong selection bias: this is\ndue first to the dependence of the signal amplitude on the source's (intrinsic\nand extrinsic) parameters, and second to the complicated nature of detector\nnoise and of current detection methods. In this work, we introduce a new\nphysically-motivated model of the sensitivity of GW searches for CBC events,\naimed at enhancing the accuracy and efficiency of population reconstructions.\nIn contrast to current methods which rely on re-weighting simulated signals\n(injections) via importance sampling, we model the probability of detection of\nbinary black hole (BBH) mergers as a smooth, analytic function of source\nmasses, orbit-aligned spins, and distance, fitted to accurately match injection\nresults. The estimate can thus be used for population models whose signal\ndistribution over parameter space differs significantly from the injection\ndistribution. Our method has already been used in population studies such as\nreconstructing the BBH merger rate dependence on redshift.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}