{"id":"2408.08173","title":"On-sky demonstration of an ultra-fast intensity interferometry\n  instrument utilising hybrid single photon counting detectors","authors":"Verena G. Leopold, Sebastian Karl, Jean-Pierre Rivet and Joachim von\n  Zanthier","authorsParsed":[["Leopold","Verena G.",""],["Karl","Sebastian",""],["Rivet","Jean-Pierre",""],["von Zanthier","Joachim",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:19:29 GMT"}],"updateDate":"2024-08-16","timestamp":1723731569000,"abstract":"  Intensity interferometry is a reemerging astronomical technique for\nperforming high angular resolution studies at visible wavelengths, benefiting\nimmensely from the recent improvements in (single) photon detection\ninstrumentation. Contrary to direct imaging or amplitude interferometry,\nintensity interferometry correlates light intensities rather than light\namplitudes, circumventing atmospheric seeing limitations at the cost of reduced\nsensitivity. In this paper we present measurements with the 1.04 m Omicron\ntelescope of C2PU (Centre P\\'edagogique Plan\\`ete Univers) at the Calern\nObservatory in the south of France featuring hybrid single photon counting\ndetectors (HPDs). We successfully measured photon bunching from temporal\ncorrelations of three different A-type stars - Vega, Altair and Deneb - in the\nblue at 405 nm. In all cases the observed coherence time fits well to both the\npre-calculated expectations as well as the values measured in preceding\nlaboratory tests. The best signal to noise ratio (SNR), with a value of 12, is\nobtained for Vega for an observation time of 12.1 h. The combination of HPDs\nand time to digital converter (TDC) results in a timing jitter of the detection\nsystem < 50 ps. Our setup demonstrates stable and efficient detection of the\nstarlight owed to the large active area of the HPDs. Utilizing a new class of\nlarge area single photon detectors based on multichannel plate amplification,\nhigh resolution spatial intensity interferometry experiments are within reach\nat 1 m diameter class telescopes within one night of observation time for\nbright stars.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}