{"id":"2408.14908","title":"Tripl\\`etoile: Extraction of Knowledge from Microblogging Text","authors":"Vanni Zavarella, Sergio Consoli, Diego Reforgiato Recupero, Gianni\n  Fenu, Simone Angioni, Davide Buscaldi, Danilo Dess\\`i, Francesco Osborne","authorsParsed":[["Zavarella","Vanni",""],["Consoli","Sergio",""],["Recupero","Diego Reforgiato",""],["Fenu","Gianni",""],["Angioni","Simone",""],["Buscaldi","Davide",""],["Dessì","Danilo",""],["Osborne","Francesco",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:35:13 GMT"}],"updateDate":"2024-08-28","timestamp":1724751313000,"abstract":"  Numerous methods and pipelines have recently emerged for the automatic\nextraction of knowledge graphs from documents such as scientific publications\nand patents. However, adapting these methods to incorporate alternative text\nsources like micro-blogging posts and news has proven challenging as they\nstruggle to model open-domain entities and relations, typically found in these\nsources. In this paper, we propose an enhanced information extraction pipeline\ntailored to the extraction of a knowledge graph comprising open-domain entities\nfrom micro-blogging posts on social media platforms. Our pipeline leverages\ndependency parsing and classifies entity relations in an unsupervised manner\nthrough hierarchical clustering over word embeddings. We provide a use case on\nextracting semantic triples from a corpus of 100 thousand tweets about digital\ntransformation and publicly release the generated knowledge graph. On the same\ndataset, we conduct two experimental evaluations, showing that the system\nproduces triples with precision over 95% and outperforms similar pipelines of\naround 5% in terms of precision, while generating a comparatively higher number\nof triples.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"G1By3hLn9A9NVnp38NJJufImDgathxo6WO-j7dsKq7c","pdfSize":"1257376"}
