{"id":"2408.10522","title":"On the Security of Directional Modulation via Time Modulated Arrays\n  Using OFDM Waveforms","authors":"Zhihao Tao and Athina Petropulu","authorsParsed":[["Tao","Zhihao",""],["Petropulu","Athina",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:54:24 GMT"}],"updateDate":"2024-08-21","timestamp":1724126064000,"abstract":"  In this paper, we investigate how secure the TMA OFDM system is, by looking\nat the transmitted signal from an the viewpoint of eavesdropper. First, we\npropose a novel, low-complexity scheme via which the eavesdropper could defy\nthe scrambling in the received signal and recover the transmitted symbols. We\nshow that the symbols which the eavesdropper sees along the OFDM subcarriers\nare linear mixtures of the source symbols, where the mixing coefficients are\nunknown to the eavesdropper. Independent component analysis (ICA) could be used\nto obtain the mixing matrix but there would be permutation and scaling\nambiguities. We show that these ambiguities can be resolved by leveraging the\nstructure of the mixing matrix and the characteristics of the TMA OFDM system.\nIn particular, we construct a k-nearest neighbors (KNN)-based algorithm that\nexploits jointly the Toeplitz structure of the mixing matrix, knowledge of data\nconstellation, and the rules for designing the TMA ON-OFF pattern to resolve\nthe ambiguities. In general, resolving the ambiguities and recovering the\nsymbols requires long data. Specifically for the case of the constant modulus\nsymbols, we propose a modified ICA approach, namely the constant-modulus ICA\n(CMICA), that provides a good estimate of the mixing matrix using a small\nnumber of received samples. We also propose measures which the TMA could\nundertake in order to defend the scrambling. Simulation results are presented\nto demonstrate the effectiveness, efficiency and robustness of our scrambling\ndefying and defending schemes. Complete abstract please see in the paper.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}