{"id":"2408.05166","title":"Pressure-Velocity Coupling in Transpiration Cooling","authors":"Sophie Hillcoat and Jean-Pierre Hickey","authorsParsed":[["Hillcoat","Sophie",""],["Hickey","Jean-Pierre",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 16:37:39 GMT"}],"updateDate":"2024-08-12","timestamp":1723221459000,"abstract":"  Transpiration cooling is an active thermal protection system of increasing\ninterest in aerospace applications wherein a coolant is effused through a\nporous wall into a hot external flow. The present work focuses on the\ninteraction between the high-temperature turbulent boundary layer and the\npressure-driven coolant flow through the porous wall. Coupling functions were\nobtained from pore-network simulations to characterize the flow through the\nporous medium. These were then coupled to direct numerical simulations of a\nturbulent boundary layer over a massively-cooled flat plate. Two different\ntypes of coupling function were used: linear expressions, which do not account\nfor flow interactions between neighbouring pores, and shallow convolutional\nneural networks (CNN) which incorporate spatial correlations. All coupled cases\ndemonstrated a significant variation in blowing due to the streamwise variation\nin mean pressure associated with the onset of coolant injection. This trend was\nreflected in the cooling effectiveness, and was mitigated in the CNN-coupled\ncases due to the incorporation of lateral flow between neighbouring pores. The\ndistribution of turbulent kinetic energy (TKE) in the coupled cases was also\nmodified by the coupling due to the competing effects of near-wall turbulence\nattenuation and increased shear due to increasing blowing ratio. Finally, the\ncoupling was shown to impact the power spectral density of the pressure\nfluctuations at the wall within the transpiration region, attenuating the\nlargest scales of the turbulence whilst leaving the smaller scales relatively\nunaffected.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}