{"id":"2408.05193","title":"A hybrid SIAC -- data-driven post-processing filter for discontinuities\n  in solutions to numerical PDEs","authors":"Soraya Terrab, Samy Wu Fung, Jennifer K. Ryan","authorsParsed":[["Terrab","Soraya",""],["Fung","Samy Wu",""],["Ryan","Jennifer K.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:34:14 GMT"}],"updateDate":"2024-08-12","timestamp":1723224854000,"abstract":"  We introduce a hybrid filter that incorporates a mathematically accurate\nmoment-based filter with a data driven filter for discontinuous Galerkin\napproximations to PDE solutions that contain discontinuities. Numerical\nsolutions of PDEs suffer from an $\\mathcal{O}(1)$ error in the neighborhood\nabout discontinuities, especially for shock waves that arise in inviscid\ncompressible flow problems. While post-processing filters, such as the\nSmoothness-Increasing Accuracy-Conserving (SIAC) filter, can improve the order\nof error in smooth regions, the $\\mathcal{O}(1)$ error in the vicinity of a\ndiscontinuity remains. To alleviate this, we combine the SIAC filter with a\ndata-driven filter based on Convolutional Neural Networks. The data-driven\nfilter is specifically focused on improving the errors in discontinuous regions\nand therefore {\\it only includes top-hat functions in the training dataset.}\nFor both filters, a consistency constraint is enforced, while the SIAC filter\nadditionally satisfies $r-$moments. This hybrid filter approach allows for\nmaintaining the accuracy guaranteed by the theory in smooth regions while the\nhybrid SIAC-data-driven approach reduces the $\\ell_2$ and $\\ell_\\infty$ errors\nabout discontinuities. Thus, overall the global errors are reduced. We examine\nthe performance of the hybrid filter about discontinuities for the\none-dimensional Euler equations for the Lax, Sod, and sine-entropy (Shu-Osher)\nshock-tube problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}