{"id":"2408.05039","title":"A combined study of thermohaline mixing and envelope overshooting with\n  PARSEC: Calibration to NGC 6397 and M4","authors":"C. T. Nguyen, A. Bressan, A.J. Korn, G. Cescutti, G. Costa, F. Addari,\n  L. Girardi, X. Fu, Y. Chen, and P. Marigo","authorsParsed":[["Nguyen","C. T.",""],["Bressan","A.",""],["Korn","A. J.",""],["Cescutti","G.",""],["Costa","G.",""],["Addari","F.",""],["Girardi","L.",""],["Fu","X.",""],["Chen","Y.",""],["Marigo","P.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 12:49:41 GMT"}],"updateDate":"2024-08-12","timestamp":1723207781000,"abstract":"  Thermohaline mixing is one of the main processes in low-mass red giant stars\nthat affect the transport of chemicals and, thus, the surface abundances along\nthe evolution. The interplay of thermohaline mixing with other processes, such\nas the downward overshooting from the convective envelope, should be carefully\ninvestigated. This study aims to understand the combined effects of\nthermohaline mixing and envelope overshooting. After implementing the\nthermohaline mixing process in the \\textsc{parsec} stellar evolutionary code,\nwe compute tracks and isochrones (with \\textsc{trilegal} code) and compare them\nwith observational data. To constrain the efficiencies of both processes, we\nperform a detailed modelling that is suitable for globular clusters NGC 6397\nand M4. Our results indicate that an envelope overshooting efficiency\nparameter, $\\Lambda_\\mathrm{e}=0.6$, and a thermohaline efficiency parameter,\n$\\alpha_\\mathrm{th}=50$, are necessary to reproduce the RGB bump magnitudes and\nlithium abundances observed in these clusters. We find that both envelope\novershooting and thermohaline mixing have a significant impact on the variation\nof $^7$Li abundances. Additionally, we also explore the effects of adopting\nsolar-scaled or $\\alpha$-enhanced mixtures on our models. The $^{12}$C and the\n$^{12}$C/$^{13}$C ratio are also effective indicators to probe extra mixing in\nRGB stars. Although, their usefulness is currently limited by the lack of\nprecise and accurate C-isotopes abundances.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oDRqKvQYxXXkMWr1BIVdvZfrh93CDdLyfEktXVhvB0o","pdfSize":"2195077"}
