{"id":"2408.09808","title":"Topological phase transitions in perovskite superlattices driven by\n  temperature, electric field, and doping","authors":"Jiyuan Yang, Shi Liu","authorsParsed":[["Yang","Jiyuan",""],["Liu","Shi",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:57:45 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 03:38:56 GMT"}],"updateDate":"2024-08-29","timestamp":1724057865000,"abstract":"  Many dipolar topological structures have been experimentally demonstrated in\n(PbTiO$_3$)$_n$/(SrTiO$_3$)$_n$ superlattices, such as flux-closure, vortice,\nand skyrmion. In this work, we employ deep potential molecular dynamics (MD) to\ninvestigate the dynamical response of the (PbTiO$_3$)$_{10}$/(SrTiO$_3$)$_{10}$\nsuperlattice, supporting polar vortex arrays, to temperature and electric field\nat the atomic level. Our simulations reveal a unique phase transition sequence\nfrom ferroelectric-like to antiferroelectric-like to paraelectric in the\nin-plane direction as temperature increases. In the ferroelectric-like state,\nwe observe field-driven reversible switching of in-plane polarization coupled\nwith out-of-plane movements of vortex cores during MD simulations. In the\nantiferroelectric-like region, the polarization-electric field hysteresis loop\nexhibits a superparaelectric feature, showing nearly no loss. This behavior is\nattributed to a strong recovering force to form polar vortex arrays, dictated\nby the electrical and mechanical boundary conditions within the superlattice.\nThe (PbTiO$_3$)$_{10}$/(SrTiO$_3$)$_{10}$ superlattice in the\nantiferroelectric-like state also demonstrates large in-plane susceptibility\nand tunability. The effect of Pb doping in the SrTiO$_3$ layer on the\ntopological structural transition in the superlattice is investigated. The\nweakened depolarization field in the PbTiO$_3$ layers leads to new dipolar\nconfigurations, such as enlarged skyrmion bubble within $c$ domains in\n(PbTiO$_3$)$_{10}$/(Pb$_{0.4}$Sr$_{0.6}$TiO$_3$)$_{10}$, and we quantify their\nthermal and electrical responses through MD simulations. These quantitative\natomistic insights will be useful for the controlled optimization of perovskite\nsuperlattices for various device applications.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"8ht8kItW8d4vv0K8RrWCvPlKMSFnaPLP-wsuaQtaAPI","pdfSize":"19601539"}
