{"id":"2408.16619","title":"The MeerKAT Absorption Line Survey Data Release 2: Wideband continuum\n  catalogues and a measurement of the cosmic radio dipole","authors":"J. D. Wagenveld, H-R. Kl\\\"ockner, N. Gupta, S. Sekhar, P. Jagannathan,\n  P. P. Deka, J. Jose, S. A. Balashev, D. Borgaonkar, A. Chatterjee, F. Combes,\n  K. L. Emig, A. N. Gaunekar, M. Hilton, G. I. G. J\\'ozsa, D. Y. Klutse, K.\n  Knowles, J.-K. Krogager, E. Momjian, S. Muller, and S. P. Sikhosana","authorsParsed":[["Wagenveld","J. D.",""],["Klöckner","H-R.",""],["Gupta","N.",""],["Sekhar","S.",""],["Jagannathan","P.",""],["Deka","P. P.",""],["Jose","J.",""],["Balashev","S. A.",""],["Borgaonkar","D.",""],["Chatterjee","A.",""],["Combes","F.",""],["Emig","K. L.",""],["Gaunekar","A. N.",""],["Hilton","M.",""],["Józsa","G. I. G.",""],["Klutse","D. Y.",""],["Knowles","K.",""],["Krogager","J. -K.",""],["Momjian","E.",""],["Muller","S.",""],["Sikhosana","S. P.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:25:34 GMT"}],"updateDate":"2024-08-30","timestamp":1724945134000,"abstract":"  We present the second data release of the MeerKAT Absorption Line Survey\n(MALS), consisting of wideband continuum catalogues of 391 pointings observed\nat L~band. The full wideband catalogue covers 4344 deg$^2$ of sky, reaches a\ndepth of 10 $\\mu$Jy beam$^{-1}$, and contains 971,980 sources. With its balance\nbetween survey depth and sky coverage, MALS DR2 covers five orders of magnitude\nof flux density, presenting a robust view of the extragalactic radio source\npopulation down to 200 $\\mu$Jy. Using this catalogue, we perform a measurement\nof the cosmic radio dipole, an anisotropy in the number counts of radio sources\nwith respect to the cosmic background, analogous to the dipole found in the\ncosmic microwave background (CMB). For this measurement, we present the\ncharacterisation of completeness and noise properties of the catalogue, and\nshow that a declination-dependent systematic affects the number density of\nfaint sources. In the dipole measurement on the MALS catalogue, we recover\nreasonable dipole measurements once we model the declination systematic with a\nlinear fit between the size of the major axis of the restoring beam and the\namount of sources of each pointing. The final results are consistent with the\nCMB dipole in terms of direction and amplitude, unlike many recent measurements\nof the cosmic radio dipole made with other centimetre wavelength catalogues,\nwhich generally show a significantly larger amplitude. This result demonstrates\nthe value of dipole measurements with deeper and more sparse radio surveys, as\nthe population of faint sources probed may have had a significant impact on the\nmeasured dipole.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}