{"id":"2408.09456","title":"In-Memory Learning Automata Architecture using Y-Flash Cell","authors":"Omar Ghazal, Tian Lan, Shalman Ojukwu, Komal Krishnamurthy, Alex\n  Yakovlev, Rishad Shafik","authorsParsed":[["Ghazal","Omar",""],["Lan","Tian",""],["Ojukwu","Shalman",""],["Krishnamurthy","Komal",""],["Yakovlev","Alex",""],["Shafik","Rishad",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 12:31:54 GMT"}],"updateDate":"2024-08-20","timestamp":1723984314000,"abstract":"  The modern implementation of machine learning architectures faces significant\nchallenges due to frequent data transfer between memory and processing units.\nIn-memory computing, primarily through memristor-based analog computing, offers\na promising solution to overcome this von Neumann bottleneck. In this\ntechnology, data processing and storage are located inside the memory. Here, we\nintroduce a novel approach that utilizes floating-gate Y-Flash memristive\ndevices manufactured with a standard 180 nm CMOS process. These devices offer\nattractive features, including analog tunability and moderate device-to-device\nvariation; such characteristics are essential for reliable decision-making in\nML applications. This paper uses a new machine learning algorithm, the Tsetlin\nMachine (TM), for in-memory processing architecture. The TM's learning element,\nAutomaton, is mapped into a single Y-Flash cell, where the Automaton's range is\ntransferred into the Y-Flash's conductance scope. Through comprehensive\nsimulations, the proposed hardware implementation of the learning automata,\nparticularly for Tsetlin machines, has demonstrated enhanced scalability and\non-edge learning capabilities.\n","subjects":["Computing Research Repository/Hardware Architecture","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g0C_BJKynJKGztgOYMnhHKwWgnNuNBy275v2lJsz7I8","pdfSize":"3541404"}
