{"id":"2408.01908","title":"Public Transit of the Future: Enhancing Well-Being through Designing\n  Human-centered Public Transportation Spaces","authors":"Yasaman Hakiminejad, Elizabeth Pantesco, and Arash Tavakoli","authorsParsed":[["Hakiminejad","Yasaman",""],["Pantesco","Elizabeth",""],["Tavakoli","Arash",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 02:49:15 GMT"}],"updateDate":"2024-08-06","timestamp":1722739755000,"abstract":"  Studies show that psychological effects are among one of the top concerns for\npublic transportation users. While many Americans spend a significant portion\nof their time in public transportation spaces, the impact of the design and\nmaintenance of these spaces on user well-being has not been fully studied. In\nthis study, we conducted a survey to better understand the effect of\nimplementing different designs on people's well-being and perceptual metrics\n(N=304). Participants were presented with six images depicting different cabin\nconfigurations, including (1) the current version of the cabin space, (2) a\nlow-maintenance version, (3) an aesthetically enhanced version, (4) a bike\nrack-enabled version, (5) a version with an added workspace, and (6) an\nimproved version with biophilic design. After viewing each image, participants'\nwell-being metrics (e.g., stress, and emotion) and their public transportation\nperception metrics (e.g., perceptions of safety, and reasonable cost) were\nevaluated. Our results from linear mixed-effect modeling indicated that adding\nfunctional amenities and biophilic design elements led to an overall\nenhancement in well-being and perceptual metrics. Conversely, low maintenance\nworsened all measured well-being. This research lays the ground for developing\nhuman-centered public transportation spaces that can lead to an increase in\npublic transportation adoption.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}