{"id":"2408.13347","title":"ORCHID: Streaming Threat Detection over Versioned Provenance Graphs","authors":"Akul Goyal and Jason Liu and Adam Bates and Gang Wang","authorsParsed":[["Goyal","Akul",""],["Liu","Jason",""],["Bates","Adam",""],["Wang","Gang",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:44:40 GMT"}],"updateDate":"2024-08-27","timestamp":1724442280000,"abstract":"  While Endpoint Detection and Response (EDR) are able to efficiently monitor\nthreats by comparing static rules to the event stream, their inability to\nincorporate past system context leads to high rates of false alarms. Recent\nwork has demonstrated Provenance-based Intrusion Detection Systems (Prov-IDS)\nthat can examine the causal relationships between abnormal behaviors to improve\nthreat classification. However, employing these Prov-IDS in practical settings\nremains difficult -- state-of-the-art neural network based systems are only\nfast in a fully offline deployment model that increases attacker dwell time,\nwhile simultaneously using simplified and less accurate provenance graphs to\nreduce memory consumption. Thus, today's Prov-IDS cannot operate effectively in\nthe real-time streaming setting required for commercial EDR viability.\n  This work presents the design and implementation of ORCHID, a novel Prov-IDS\nthat performs fine-grained detection of process-level threats over a real time\nevent stream. ORCHID takes advantage of the unique immutable properties of a\nversioned provenance graphs to iteratively embed the entire graph in a\nsequential RNN model while only consuming a fraction of the computation and\nmemory costs. We evaluate ORCHID on four public datasets, including DARPA TC,\nto show that ORCHID can provide competitive classification performance while\neliminating detection lag and reducing memory consumption by two orders of\nmagnitude.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}