{"id":"2408.09093","title":"BaThe: Defense against the Jailbreak Attack in Multimodal Large Language\n  Models by Treating Harmful Instruction as Backdoor Trigger","authors":"Yulin Chen, Haoran Li, Zihao Zheng, Yangqiu Song","authorsParsed":[["Chen","Yulin",""],["Li","Haoran",""],["Zheng","Zihao",""],["Song","Yangqiu",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 04:43:26 GMT"}],"updateDate":"2024-08-20","timestamp":1723869806000,"abstract":"  Multimodal Large Language Models (MLLMs) have showcased impressive\nperformance in a variety of multimodal tasks. On the other hand, the\nintegration of additional image modality may allow the malicious users to\ninject harmful content inside the images for jailbreaking. Unlike text-based\nLLMs, where adversaries need to select discrete tokens to conceal their\nmalicious intent using specific algorithms, the continuous nature of image\nsignals provides a direct opportunity for adversaries to inject harmful\nintentions. In this work, we propose $\\textbf{BaThe}$ ($\\textbf{Ba}$ckdoor\n$\\textbf{T}$rigger S$\\textbf{h}$i$\\textbf{e}$ld), a simple yet effective\njailbreak defense mechanism. Our work is motivated by recent research on\njailbreak backdoor attack and virtual prompt backdoor attack in generative\nlanguage models. Jailbreak backdoor attack uses harmful instructions combined\nwith manually crafted strings as triggers to make the backdoored model generate\nprohibited responses. We assume that harmful instructions can function as\ntriggers, and if we alternatively set rejection responses as the triggered\nresponse, the backdoored model then can defend against jailbreak attacks. We\nachieve this by utilizing virtual rejection prompt, similar to the virtual\nprompt backdoor attack. We embed the virtual rejection prompt into the soft\ntext embeddings, which we call ``wedge''. Our comprehensive experiments\ndemonstrate that BaThe effectively mitigates various types of jailbreak attacks\nand is adaptable to defend against unseen attacks, with minimal impact on\nMLLMs' performance.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Z_gpAbwdpxViQAe8KB3MhV_I-w3tH50Hs5DX8jjLWsw","pdfSize":"1486180"}
