{"id":"2408.16461","title":"Can gap-edge illumination excite spirals in protoplanetary disks?\n  Three-temperature radiation hydrodynamics and NIR image modelling","authors":"Dhruv Muley, Julio David Melon Fuksman, Hubert Klahr","authorsParsed":[["Muley","Dhruv",""],["Fuksman","Julio David Melon",""],["Klahr","Hubert",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:49:15 GMT"}],"updateDate":"2024-08-30","timestamp":1724932155000,"abstract":"  The advent of high-resolution, near-infrared instruments such as VLT/SPHERE\nand Gemini/GPI has helped uncover a wealth of substructure in planet-forming\ndisks, including large, prominent spiral arms in MWC 758, SAO 206462, and V1247\nOri among others. In the classical theory of disk-planet interaction, these\narms are consistent with Lindblad-resonance driving by multi-Jupiter-mass\ncompanions. Despite improving detection limits, evidence for such massive\nbodies in connection with spiral substructure has been inconclusive. In search\nof an alternative explanation, we use the PLUTO code to run 3D hydrodynamical\nsimulations with two comparatively low planet masses (Saturn-mass,\nJupiter-mass) and two thermodynamic prescriptions (three-temperature radiation\nhydrodynamics, and the more traditional $\\beta$-cooling) in a low-mass disk. In\nthe radiative cases, an $m = 2$ mode, potentially attributable to the\ninteraction of stellar radiation with gap-edge asymmetries, creates an\nazimuthal pressure gradient, which in turn gives rise to prominent spiral arms\nin the upper layers of the disk. Monte Carlo radiative transfer (MCRT)\npost-processing with RADMC3D reveals that in near-infrared scattered light,\nthese gap-edge spirals are significantly more prominent than the traditional\nLindblad spirals for planets in the mass range tested. Our results demonstrate\nthat even intermediate-mass protoplanets -- less detectable, but more\nubiquitous, than super-Jupiters -- are capable of indirectly inducing\nlarge-scale spiral disk features, and underscore the importance of including\nradiation physics in efforts to reproduce observations.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}