{"id":"2408.01853","title":"Effect of Uniform and Non-uniform wall heating on Three-Dimensional\n  Magneto-Hydrodynamics Natural Convection and Entropy Generation: A\n  computational study using New Higher Order Super Compact Scheme","authors":"Ashwani Punia and Rajendra K. Ray","authorsParsed":[["Punia","Ashwani",""],["Ray","Rajendra K.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 19:34:51 GMT"}],"updateDate":"2024-08-06","timestamp":1722713691000,"abstract":"  Current research work deals with the effect of uniform and non-uniform wall\nheating on magnetohydrodynamic (MHD) natural convection within a\nthree-dimensional (3D) cavity filled with molten lithium. A new Higher-Order\nSuper Compact (HOSC) finite difference scheme is used to analyze the thermal\nbehavior under both heating scenarios. After the quantitative and qualitative\nvalidations, the computed results are analyzed for a range of Hartman number\n($Ha = 25, 50, 100, 150$) and Rayleigh number ($Ra = 10^3, 10^4, 10^5$) with\nfixed $Pr=0.065$ (molten lithium). Three distinct heating scenarios, i.e.,\nuniform heating ($T_h = 1$), $y$-dependent non-uniform heating ($T_h = sin(\\pi\ny$)), and a combination of $y$ and $z$-dependent non-uniform heating ($T_h =\nsin(\\pi y)sin(\\pi z)$) are investigated on the left wall ($x=0$) of the cubic\ncavity. It is found that variations in the $Ha$ and $Ra$, along with distinct\nthermal boundary conditions, exert significant effects on both the temperature\ndistribution and flow field inside the 3D cubical cavity. Specifically, an\nincrease in $Ra$ corresponds to enhanced heat transfer, highlighting the\ndominance of convection. Conversely, an increase in $Ha$ leads to a reduction\nin heat transfer due to the deceleration of fluid velocity. The scenario in\nwhich walls are uniformly heated exhibits the most significant total entropy\ngeneration. It is observed that with an increase in the $Ra$, the Bejan number\n($Be$) decreases, which ultimately leads to an increase in total entropy\ngeneration. The implementation of the new HOSC scheme in this analysis\nshowcases its effectiveness in capturing the complexities of 3D MHD-driven\nnatural convection and entropy generation. This study offers significant\ninformation that might help improve the optimization and design of relevant\nengineering systems. Thus, our work stands out as genuinely novel and\npioneering in its approach.\n","subjects":["Physics/Fluid Dynamics","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}