{"id":"2408.06139","title":"Curio: A Dataflow-Based Framework for Collaborative Urban Visual\n  Analytics","authors":"Gustavo Moreira, Maryam Hosseini, Carolina Veiga, Lucas Alexandre,\n  Nicola Colaninno, Daniel de Oliveira, Nivan Ferreira, Marcos Lage, Fabio\n  Miranda","authorsParsed":[["Moreira","Gustavo",""],["Hosseini","Maryam",""],["Veiga","Carolina",""],["Alexandre","Lucas",""],["Colaninno","Nicola",""],["de Oliveira","Daniel",""],["Ferreira","Nivan",""],["Lage","Marcos",""],["Miranda","Fabio",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 13:31:40 GMT"}],"updateDate":"2024-08-13","timestamp":1723469500000,"abstract":"  Over the past decade, several urban visual analytics systems and tools have\nbeen proposed to tackle a host of challenges faced by cities, in areas as\ndiverse as transportation, weather, and real estate. Many of these tools have\nbeen designed through collaborations with urban experts, aiming to distill\nintricate urban analysis workflows into interactive visualizations and\ninterfaces. However, the design, implementation, and practical use of these\ntools still rely on siloed approaches, resulting in bespoke applications that\nare difficult to reproduce and extend. At the design level, these tools\nundervalue rich data workflows from urban experts, typically treating them only\nas data providers and evaluators. At the implementation level, they lack\ninteroperability with other technical frameworks. At the practical use level,\nthey tend to be narrowly focused on specific fields, inadvertently creating\nbarriers to cross-domain collaboration. To address these gaps, we present\nCurio, a framework for collaborative urban visual analytics. Curio uses a\ndataflow model with multiple abstraction levels (code, grammar, GUI elements)\nto facilitate collaboration across the design and implementation of visual\nanalytics components. The framework allows experts to intertwine data\npreprocessing, management, and visualization stages while tracking the\nprovenance of code and visualizations. In collaboration with urban experts, we\nevaluate Curio through a diverse set of usage scenarios targeting urban\naccessibility, urban microclimate, and sunlight access. These scenarios use\ndifferent types of data and domain methodologies to illustrate Curio's\nflexibility in tackling pressing societal challenges. Curio is available at\nhttps://urbantk.org/curio.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}