{"id":"2408.14748","title":"Optimization model for electric aircraft tow tractors considering\n  operator coalition","authors":"Dan-Wen Bao, Jia-Yi Zhou, Di Kang, Zhuo Chen","authorsParsed":[["Bao","Dan-Wen",""],["Zhou","Jia-Yi",""],["Kang","Di",""],["Chen","Zhuo",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 02:52:46 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 17:44:50 GMT"}],"updateDate":"2024-09-04","timestamp":1724727166000,"abstract":"  Horizontal collaboration between operators can save traffic operation costs,\na concept that has been particularly validated in the logistics field. Due to\nthe increasing transportation demand and the introduction of charging times for\nelectric vehicles, there is growing pressure on airport ground support\nservices. This study introduces the concept of coalition to airport ground\nsupport services. Unlike most studies on horizontal collaboration, the\nscheduling for airport ground support services needs to particularly consider\npunctuality issues. In this study, we separately establish electric vehicle\nscheduling models for operator-separate and operator-cooperated modes and\ndesign an algorithm based on the concept of the Adaptive Large Neighborhood\nSearch algorithm, aiming to obtain the electric vehicle scheduling plan with\nminimum cost and delay time. Furthermore, the study proposes a cost allocation\nmethod that considers the degree of sharing among operators to ensure the\nfeasibility of coalition. Finally, we conducted numerical experiments based on\nactual airport operation data. The experiments verified the effectiveness of\nthe algorithm and the cost allocation method. Compared to solvers, our\nalgorithm can obtain feasible solutions in a shorter time while ensuring that\nthe objective function gap is within 2%. Additionally, the improved cost\nallocation method is fairer compared to the traditional Shapley method.\nNumerical experiments also show that coalition can save 15-25% of airport\noperating costs and 26-39% of delay time, with savings varying based on the\nsharing parameters. Through quantitative analysis such as sensitivity analysis,\nthe study provides insights into the variation patterns of overall and\nindividual shared utilities and offers suggestions and decision-making\nmechanisms for the configuration and operation of airport ground operators.\n","subjects":["Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}