{"id":"2408.09067","title":"FAS vs. ARIS: Which Is More Important for FAS-ARIS Communication\n  Systems?","authors":"Junteng Yao, Liaoshi Zhou, Tuo Wu, Ming Jin, Chongwen Huang, and Chau\n  Yuen","authorsParsed":[["Yao","Junteng",""],["Zhou","Liaoshi",""],["Wu","Tuo",""],["Jin","Ming",""],["Huang","Chongwen",""],["Yuen","Chau",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 01:53:13 GMT"}],"updateDate":"2024-08-20","timestamp":1723859593000,"abstract":"  In this paper, we investigate the question of which technology, fluid antenna\nsystems (FAS) or active reconfigurable intelligent surfaces (ARIS), plays a\nmore crucial role in FAS-ARIS wireless communication systems. To address this,\nwe develop a comprehensive system model and explore the problem from an\noptimization perspective. We introduce an alternating optimization (AO)\nalgorithm incorporating majorization-minimization (MM), successive convex\napproximation (SCA), and sequential rank-one constraint relaxation (SRCR) to\ntackle the non-convex challenges inherent in these systems. Specifically, for\nthe transmit beamforming of the BS optimization, we propose a closed-form\nrank-one solution with low-complexity. For the optimization the positions of\nfluid antennas (FAs) of the BS, the Taylor expansions and MM algorithm are\nutilized to construct the effective lower bounds and upper bounds of the\nobjective function and constraints, transforming the non-convex optimization\nproblem into a convex one. Furthermore, we use the SCA and SRCR to optimize the\nreflection coefficient matrix of the ARIS and effectively solve the rank-one\nconstraint. Simulation results reveal that the relative importance of FAS and\nARIS varies depending on the scenario: FAS proves more critical in simpler\nmodels with fewer reflecting elements or limited transmission paths, while ARIS\nbecomes more significant in complex scenarios with a higher number of\nreflecting elements or transmission paths. Ultimately, the integration of both\nFAS and ARIS creates a win-win scenario, resulting in a more robust and\nefficient communication system. This study underscores the importance of\ncombining FAS with ARIS, as their complementary use provides the most\nsubstantial benefits across different communication environments.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xSUgqnhL4o-Yaoe_DG75lRGd2TWcZGahrzqsu1dufFs","pdfSize":"539588"}
