{"id":"2408.13386","title":"CloudSim 7G: An Integrated Toolkit for Modeling and Simulation of Future\n  Generation Cloud Computing Environments","authors":"Remo Andreoli, Jie Zhao, Tommaso Cucinotta and Rajkumar Buyya","authorsParsed":[["Andreoli","Remo",""],["Zhao","Jie",""],["Cucinotta","Tommaso",""],["Buyya","Rajkumar",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 21:40:56 GMT"}],"updateDate":"2024-08-27","timestamp":1724449256000,"abstract":"  Cloud Computing has established itself as an efficient and cost-effective\nparadigm for the execution of web-based applications, and scientific workloads,\nthat need elasticity and on-demand scalability capabilities. However, the\nevaluation of novel resource provisioning and management techniques is a major\nchallenge due to the complexity of large-scale data centers. Therefore, Cloud\nsimulators are an essential tool for academic and industrial researchers, to\ninvestigate on the effectiveness of novel algorithms and mechanisms in\nlarge-scale scenarios. This article unveils CloudSim7G, the seventh generation\nof CloudSim, one of the first simulators specialized in evaluating resource\nmanagement techniques for Cloud infrastructures. In particular, CloudSim7G\nfeatures a re-engineered and generalized internal architecture to facilitate\nthe integration of multiple CloudSim extensions, which were previously\navailable independently and often had compatibility issues, within the same\nsimulated environment. Such architectural change is coupled with an extensive\nrefactoring and refinement of the codebase, leading to the removal of over\n13,000 lines of code without loss of functionality. As a result, CloudSim7G\ndelivers significantly better performance in both run-time and total memory\nallocated (up to ~20% less heap memory allocated), along with increased\nflexibility, ease-of-use, and extensibility of the framework. These\nimprovements benefit not only CloudSim developers but also researchers and\npractitioners using the framework for modeling and simulating next-generation\ncloud computing environments.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}