{"id":"2408.01655","title":"Stimulating Imagination: Towards General-purpose Object Rearrangement","authors":"Jianyang Wu, Jie Gu, Xiaokang Ma, Chu Tang, Jingmin Chen","authorsParsed":[["Wu","Jianyang",""],["Gu","Jie",""],["Ma","Xiaokang",""],["Tang","Chu",""],["Chen","Jingmin",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 03:53:05 GMT"}],"updateDate":"2024-08-06","timestamp":1722657185000,"abstract":"  General-purpose object placement is a fundamental capability of an\nintelligent generalist robot, i.e., being capable of rearranging objects\nfollowing human instructions even in novel environments. To achieve this, we\nbreak the rearrangement down into three parts, including object localization,\ngoal imagination and robot control, and propose a framework named SPORT. SPORT\nleverages pre-trained large vision models for broad semantic reasoning about\nobjects, and learns a diffusion-based 3D pose estimator to ensure\nphysically-realistic results. Only object types (to be moved or reference) are\ncommunicated between these two parts, which brings two benefits. One is that we\ncan fully leverage the powerful ability of open-set object localization and\nrecognition since no specific fine-tuning is needed for robotic scenarios.\nFurthermore, the diffusion-based estimator only need to \"imagine\" the poses of\nthe moving and reference objects after the placement, while no necessity for\ntheir semantic information. Thus the training burden is greatly reduced and no\nmassive training is required. The training data for goal pose estimation is\ncollected in simulation and annotated with GPT-4. A set of simulation and\nreal-world experiments demonstrate the potential of our approach to accomplish\ngeneral-purpose object rearrangement, placing various objects following precise\ninstructions.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}