{"id":"2408.00427","title":"CARMIL: Context-Aware Regularization on Multiple Instance Learning\n  models for Whole Slide Images","authors":"Thiziri Nait Saada, Valentina Di Proietto, Benoit Schmauch, Katharina\n  Von Loga, Lucas Fidon","authorsParsed":[["Saada","Thiziri Nait",""],["Di Proietto","Valentina",""],["Schmauch","Benoit",""],["Von Loga","Katharina",""],["Fidon","Lucas",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:59:57 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 08:45:19 GMT"}],"updateDate":"2024-08-13","timestamp":1722506397000,"abstract":"  Multiple Instance Learning (MIL) models have proven effective for cancer\nprognosis from Whole Slide Images. However, the original MIL formulation\nincorrectly assumes the patches of the same image to be independent, leading to\na loss of spatial context as information flows through the network.\nIncorporating contextual knowledge into predictions is particularly important\ngiven the inclination for cancerous cells to form clusters and the presence of\nspatial indicators for tumors. State-of-the-art methods often use attention\nmechanisms eventually combined with graphs to capture spatial knowledge. In\nthis paper, we take a novel and transversal approach, addressing this issue\nthrough the lens of regularization. We propose Context-Aware Regularization for\nMultiple Instance Learning (CARMIL), a versatile regularization scheme designed\nto seamlessly integrate spatial knowledge into any MIL model. Additionally, we\npresent a new and generic metric to quantify the Context-Awareness of any MIL\nmodel when applied to Whole Slide Images, resolving a previously unexplored gap\nin the field. The efficacy of our framework is evaluated for two survival\nanalysis tasks on glioblastoma (TCGA GBM) and colon cancer data (TCGA COAD).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}