{"id":"2408.00441","title":"Focus, Distinguish, and Prompt: Unleashing CLIP for Efficient and\n  Flexible Scene Text Retrieval","authors":"Gangyan Zeng, Yuan Zhang, Jin Wei, Dongbao Yang, Peng Zhang, Yiwen\n  Gao, Xugong Qin, Yu Zhou","authorsParsed":[["Zeng","Gangyan",""],["Zhang","Yuan",""],["Wei","Jin",""],["Yang","Dongbao",""],["Zhang","Peng",""],["Gao","Yiwen",""],["Qin","Xugong",""],["Zhou","Yu",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:25:14 GMT"}],"updateDate":"2024-08-02","timestamp":1722507914000,"abstract":"  Scene text retrieval aims to find all images containing the query text from\nan image gallery. Current efforts tend to adopt an Optical Character\nRecognition (OCR) pipeline, which requires complicated text detection and/or\nrecognition processes, resulting in inefficient and inflexible retrieval.\nDifferent from them, in this work we propose to explore the intrinsic potential\nof Contrastive Language-Image Pre-training (CLIP) for OCR-free scene text\nretrieval. Through empirical analysis, we observe that the main challenges of\nCLIP as a text retriever are: 1) limited text perceptual scale, and 2)\nentangled visual-semantic concepts. To this end, a novel model termed FDP\n(Focus, Distinguish, and Prompt) is developed. FDP first focuses on scene text\nvia shifting the attention to the text area and probing the hidden text\nknowledge, and then divides the query text into content word and function word\nfor processing, in which a semantic-aware prompting scheme and a distracted\nqueries assistance module are utilized. Extensive experiments show that FDP\nsignificantly enhances the inference speed while achieving better or\ncompetitive retrieval accuracy compared to existing methods. Notably, on the\nIIIT-STR benchmark, FDP surpasses the state-of-the-art model by 4.37% with a 4\ntimes faster speed. Furthermore, additional experiments under phrase-level and\nattribute-aware scene text retrieval settings validate FDP's particular\nadvantages in handling diverse forms of query text. The source code will be\npublicly available at https://github.com/Gyann-z/FDP.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"cuWqxCNRymC8j-xkCMToiKFN2oi6vHx76igkQOaR1H0","pdfSize":"19488967","txDigest":"HvnxrjD3vhtdRwinPMAcXYR2XBykcMmXaMLbxZFNfsmZ","endEpoch":"1","status":"CERTIFIED"}
