{"id":"2408.08819","title":"Reality of Inverse Cascading in Neutron Star Crusts","authors":"Clara Dehman and Axel Brandenburg","authorsParsed":[["Dehman","Clara",""],["Brandenburg","Axel",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 16:05:39 GMT"}],"updateDate":"2024-08-19","timestamp":1723824339000,"abstract":"  The braking torque that dictates the timing properties of magnetars is\nclosely tied to the large-scale dipolar magnetic field on their surface. The\nformation of this field has been a topic of ongoing debate. One proposed\nmechanism, based on macroscopic principles, involves an inverse cascade within\nthe neutron star's crust. However, this phenomenon has not been observed in\nrealistic simulations. In this study, we provide compelling evidence supporting\nthe feasibility of the inverse cascading process in the presence of an initial\nhelical magnetic field within realistic neutron star crusts and discuss its\ncontribution to the amplification of the large-scale magnetic field. Our\nfindings, derived from a systematic investigation that considers various\ncoordinate systems, peak wavenumber positions, crustal thicknesses, magnetic\nboundary conditions, and magnetic Lundquist numbers, reveal that the specific\ngeometry of the crustal domain - with its extreme aspect ratio - requires an\ninitial peak wavenumber from small-scale structures for the inverse cascade to\noccur. However, this extreme aspect ratio limits the inverse cascade to\nmagnetic field structures on scales comparable to the neutron star's crust,\nmaking the formation of a large-scale dipolar surface field unlikely. Despite\nthis limitation, the inverse cascade can significantly impact the magnetic\nfield evolution in the interior of the crust, potentially explaining the\nobserved characteristics of highly magnetized objects with weak surface dipolar\nfields, such as low-field magnetars or central compact objects.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Physics/Plasma Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}