{"id":"2408.13033","title":"Emergence of global receptive fields capturing multipartite quantum\n  correlations","authors":"Oleg M. Sotnikov, Ilia A. Iakovlev, Evgeniy O. Kiktenko, Mikhail I.\n  Katsnelson, Aleksey K. Fedorov, Vladimir V. Mazurenko","authorsParsed":[["Sotnikov","Oleg M.",""],["Iakovlev","Ilia A.",""],["Kiktenko","Evgeniy O.",""],["Katsnelson","Mikhail I.",""],["Fedorov","Aleksey K.",""],["Mazurenko","Vladimir V.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 12:45:40 GMT"}],"updateDate":"2024-08-26","timestamp":1724417140000,"abstract":"  In quantum physics, even simple data with a well-defined structure at the\nwave function level can be characterized by extremely complex correlations\nbetween its constituent elements. The inherent non-locality of the quantum\ncorrelations generally prevents one from providing their simple and transparent\ninterpretation, which also remains a challenging problem for advanced classical\ntechniques that approximate quantum states with neural networks. Here we show\nthat monitoring the neural network weight space while learning quantum\nstatistics from measurements allows to develop physical intuition about complex\nmultipartite patterns and thus helps to construct more effective classical\nrepresentations of the wave functions. Particularly, we observe the formation\nof distinct global convolutional structures, receptive fields in the hidden\nlayer of the Restricted Boltzmann Machine (RBM) within the neural quantum\ntomography of the highly-entangled Dicke states. On this basis we propose an\nexact two-parameter classical representation not only for a specific quantum\nwave function, but for the whole family of the N-qubit Dicke states of\ndifferent entanglement. Our findings suggest a fresh look at constructing\nconvolutional neural networks for processing data with non-local patterns and\npave the way for developing exact learning-based representations of entangled\nquantum states.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}