{"id":"2408.02507","title":"Estimating Pore Location of PBF-LB/M Processes with Segmentation Models","authors":"Hans Aoyang Zhou, Jan Theunissen, Marco Kemmerling, Anas Abdelrazeq,\n  Johannes Henrich Schleifenbaum and Robert H. Schmitt","authorsParsed":[["Zhou","Hans Aoyang",""],["Theunissen","Jan",""],["Kemmerling","Marco",""],["Abdelrazeq","Anas",""],["Schleifenbaum","Johannes Henrich",""],["Schmitt","Robert H.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:31:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722868269000,"abstract":"  Reliably manufacturing defect free products is still an open challenge for\nLaser Powder Bed Fusion processes. Particularly, pores that occur frequently\nhave a negative impact on mechanical properties like fatigue performance.\nTherefore, an accurate localisation of pores is mandatory for quality\nassurance, but requires time-consuming post-processing steps like computer\ntomography scans. Although existing solutions using in-situ monitoring data can\ndetect pore occurrence within a layer, they are limited in their localisation\nprecision. Therefore, we propose a pore localisation approach that estimates\ntheir position within a single layer using a Gaussian kernel density\nestimation. This allows segmentation models to learn the correlation between\nin-situ monitoring data and the derived probability distribution of pore\noccurrence. Within our experiments, we compare the prediction performance of\ndifferent segmentation models depending on machine parameter configuration and\ngeometry features. From our results, we conclude that our approach allows a\nprecise localisation of pores that requires minimal data preprocessing. Our\nresearch extends the literature by providing a foundation for more precise pore\ndetection systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Kz2ceocDcCDQvU59YpJrUB3NLsr61rxClvjTtBC6kGQ","pdfSize":"4862072","txDigest":"HMvNsbdVRP6AMhpdnqqtvChfQSRwkpY2ezQgErKAgKwu","endEpoch":"1","status":"CERTIFIED"}
