{"id":"2408.01975","title":"Intensities of the hydrogen Balmer lines of solar-like stars revealed by\n  the LAMOST spectroscopic surveys","authors":"Han He","authorsParsed":[["He","Han",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 09:41:17 GMT"}],"updateDate":"2024-08-06","timestamp":1722764477000,"abstract":"  The intensities of the hydrogen Balmer lines of solar-like stars are\ninvestigated for stellar chromospheric activity by using the co-source spectral\ndata of the LAMOST Low-Resolution Spectroscopic Survey (LRS) and\nMedium-Resolution Spectroscopic Survey (MRS). The Balmer H$\\alpha$, H$\\beta$,\nH$\\gamma$, and H$\\delta$ lines in the LRS data and the H$\\alpha$ line in the\nMRS data are analyzed. The absolute flux indexes, defined as the ratios of the\nabsolute fluxes at the centers of the Balmer lines to the stellar bolometric\nflux, are employed to indicate the intensity magnitudes of the Balmer lines in\nresponse to stellar activity. The H$\\alpha$ indexes derived from the LRS data\nand the MRS data, respectively, are calibrated to be quantitatively consistent\nwith each other. It is found that, as the H$\\alpha$ index increases, the\nH$\\beta$, H$\\gamma$, and H$\\delta$ indexes first present trend of increasing\nand then decreasing, and finally increase synchronously with the H$\\alpha$\nindex. The distributions of the Balmer line indexes also reveal the three\ndistinct stages of stellar activity (normal stage, intense stage, and extremely\nintense stage), in which the extremely intense stage is characterized by the\nsynchronous growth of the indexes of the four Balmer lines. The different\nbehaviors of the H$\\beta$, H$\\gamma$, and H$\\delta$ lines from that of the\nH$\\alpha$ line can be interpreted by the different mechanisms by which the\nline-core intensities are formed, and the three distinct activity stages imply\nthe very different magnetic field environments and physical conditions of\nsolar-like stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}