{"id":"2408.03351","title":"Quantum Transfer Learning for MNIST Classification Using a Hybrid\n  Quantum-Classical Approach","authors":"Soumyadip Sarkar","authorsParsed":[["Sarkar","Soumyadip",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 22:16:27 GMT"}],"updateDate":"2024-08-08","timestamp":1722896187000,"abstract":"  In this research, we explore the integration of quantum computing with\nclassical machine learning for image classification tasks, specifically\nfocusing on the MNIST dataset. We propose a hybrid quantum-classical approach\nthat leverages the strengths of both paradigms. The process begins with\npreprocessing the MNIST dataset, normalizing the pixel values, and reshaping\nthe images into vectors. An autoencoder compresses these 784-dimensional\nvectors into a 64-dimensional latent space, effectively reducing the data's\ndimensionality while preserving essential features. These compressed features\nare then processed using a quantum circuit implemented on a 5-qubit system. The\nquantum circuit applies rotation gates based on the feature values, followed by\nHadamard and CNOT gates to entangle the qubits, and measurements are taken to\ngenerate quantum outcomes. These outcomes serve as input for a classical neural\nnetwork designed to classify the MNIST digits. The classical neural network\ncomprises multiple dense layers with batch normalization and dropout to enhance\ngeneralization and performance. We evaluate the performance of this hybrid\nmodel and compare it with a purely classical approach. The experimental results\nindicate that while the hybrid model demonstrates the feasibility of\nintegrating quantum computing with classical techniques, the accuracy of the\nfinal model, trained on quantum outcomes, is currently lower than the classical\nmodel trained on compressed features. This research highlights the potential of\nquantum computing in machine learning, though further optimization and advanced\nquantum algorithms are necessary to achieve superior performance.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"5J1GPiNaB_4XJSMXgtXBKwVV1250VImm1R7S24Kq1xA","pdfSize":"431004"}
