{"id":"2408.09680","title":"MambaLoc: Efficient Camera Localisation via State Space Model","authors":"Jialu Wang, Kaichen Zhou, Andrew Markham and Niki Trigoni","authorsParsed":[["Wang","Jialu",""],["Zhou","Kaichen",""],["Markham","Andrew",""],["Trigoni","Niki",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 03:38:29 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 08:44:42 GMT"}],"updateDate":"2024-08-21","timestamp":1724038709000,"abstract":"  Location information is pivotal for the automation and intelligence of\nterminal devices and edge-cloud IoT systems, such as autonomous vehicles and\naugmented reality. However, achieving reliable positioning across diverse IoT\napplications remains challenging due to significant training costs and the\nnecessity of densely collected data. To tackle these issues, we have\ninnovatively applied the selective state space (SSM) model to visual\nlocalization, introducing a new model named MambaLoc. The proposed model\ndemonstrates exceptional training efficiency by capitalizing on the SSM model's\nstrengths in efficient feature extraction, rapid computation, and memory\noptimization, and it further ensures robustness in sparse data environments due\nto its parameter sparsity. Additionally, we propose the Global Information\nSelector (GIS), which leverages selective SSM to implicitly achieve the\nefficient global feature extraction capabilities of Non-local Neural Networks.\nThis design leverages the computational efficiency of the SSM model alongside\nthe Non-local Neural Networks' capacity to capture long-range dependencies with\nminimal layers. Consequently, the GIS enables effective global information\ncapture while significantly accelerating convergence. Our extensive\nexperimental validation using public indoor and outdoor datasets first\ndemonstrates our model's effectiveness, followed by evidence of its versatility\nwith various existing localization models. Our code and models are publicly\navailable to support further research and development in this area.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}