{"id":"2408.11594","title":"On the handling of method failure in comparison studies","authors":"Milena W\\\"unsch and Moritz Herrmann and Elisa Noltenius and Mattia\n  Mohr and Tim P. Morris and Anne-Laure Boulesteix","authorsParsed":[["Wünsch","Milena",""],["Herrmann","Moritz",""],["Noltenius","Elisa",""],["Mohr","Mattia",""],["Morris","Tim P.",""],["Boulesteix","Anne-Laure",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:02:27 GMT"}],"updateDate":"2024-08-22","timestamp":1724245347000,"abstract":"  Comparison studies in methodological research are intended to compare methods\nin an evidence-based manner, offering guidance to data analysts to select a\nsuitable method for their application. To provide trustworthy evidence, they\nmust be carefully designed, implemented, and reported, especially given the\nmany decisions made in planning and running. A common challenge in comparison\nstudies is to handle the ``failure'' of one or more methods to produce a result\nfor some (real or simulated) data sets, such that their performances cannot be\nmeasured in those instances. Despite an increasing emphasis on this topic in\nrecent literature (focusing on non-convergence as a common manifestation),\nthere is little guidance on proper handling and interpretation, and reporting\nof the chosen approach is often neglected. This paper aims to fill this gap and\nprovides practical guidance for handling method failure in comparison studies.\nIn particular, we show that the popular approaches of discarding data sets\nyielding failure (either for all or the failing methods only) and imputing are\ninappropriate in most cases. We also discuss how method failure in published\ncomparison studies -- in various contexts from classical statistics and\npredictive modeling -- may manifest differently, but is often caused by a\ncomplex interplay of several aspects. Building on this, we provide\nrecommendations derived from realistic considerations on suitable fallbacks\nwhen encountering method failure, hence avoiding the need for discarding data\nsets or imputation. Finally, we illustrate our recommendations and the dangers\nof inadequate handling of method failure through two illustrative comparison\nstudies.\n","subjects":["Statistics/Methodology"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}