{"id":"2408.00982","title":"Adaptive optical signal-to-noise ratio recovery for long-distance\n  optical fiber transmission","authors":"Mingwen Zhu, Shangsu Ding, Zhixue Li, Song Yu, Jianming Shang, Bin Luo","authorsParsed":[["Zhu","Mingwen",""],["Ding","Shangsu",""],["Li","Zhixue",""],["Yu","Song",""],["Shang","Jianming",""],["Luo","Bin",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 02:33:04 GMT"}],"updateDate":"2024-08-05","timestamp":1722565984000,"abstract":"  In long-distance fiber optic transmission, the optic fiber link and\nerbium-doped fiber amplifiers can introduce excessive noise, which reduces the\noptical signal-to-noise ratio (OSNR). The narrow-band optical filters can be\nused to eliminate noise and thereby improve OSNR. However, there is a relative\nfrequency drift between the signal and the narrow-band filter, which leads to\nfiltered signal instability. This paper proposes an adaptive OSNR recovery\nscheme based on a Fabry-Perot (F-P) cavity with mode width of 6 MHz. Utilizing\nthe comb filtering of F-P cavity, the noise around the carrier and sidebands of\nthe signal is filtered out simultaneously. To avoid frequency mismatch, we\npropose a double-servo scheme to suppress relative frequency drift between the\nsignal and the F-P cavity. We constructed a stable radio frequency transfer\nsystem based on passive phase compensation and compared our scheme with other\nOSNR recovery schemes based on optical filters. Compared to the schemes based\non dense wavelength division multiplexing (DWDM) and Waveshaper, our scheme\ndemonstrates an improvement in OSNR of carrier by at least 12 dB and sidebands\nby at least 23.5 dB. The short-term transfer stability (1 s) is improved by one\norder of magnitude compared to DWDM and half an order of magnitude compared to\nWaveshper. This scheme can be applied to the recovery of signals with low OSNR\nin long-distance fiber optic transmission, improving signal quaility and\nextending the transmission distance limit.\n","subjects":["Physics/Optics","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}