{"id":"2408.03791","title":"Microwave-optics entanglement via coupled opto- and magnomechanical\n  microspheres","authors":"Hao-Tian Li, Zhi-Yuan Fan, Huai-Bing Zhu, Simon Gr\\\"oblacher, Jie Li","authorsParsed":[["Li","Hao-Tian",""],["Fan","Zhi-Yuan",""],["Zhu","Huai-Bing",""],["Gröblacher","Simon",""],["Li","Jie",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 14:15:55 GMT"}],"updateDate":"2024-08-08","timestamp":1723040155000,"abstract":"  Microwave-optics entanglement plays a crucial role in building hybrid quantum\nnetworks with quantum nodes working in the microwave and optical frequency\nbands. However, there are limited efficient ways to produce such entanglement\ndue to the large frequency mismatch between the two regimes. Here, we present a\nnew mechanism to prepare microwave-optics entanglement based on a hybrid system\nof two coupled opto- and magnomechanical microspheres, i.e., a YIG sphere and a\nsilica sphere. The YIG sphere holds a magnon mode and a vibration mode induced\nby magnetostriction, while the silica sphere supports an optical\nwhispering-gallery mode and a mechanical mode coupled via an optomechanical\ninteraction. The two mechanical modes are close in frequency and directly\ncoupled via physical contact of the two microspheres. We show that by\nsimultaneously activating the magnomechanical (optomechanical) Stokes\n(anti-Stokes) scattering, stationary entanglement can be established between\nthe magnon and optical modes via mechanics-mechanics coupling. This leads to\nstationary microwave-optics entanglement by further coupling the YIG sphere to\na microwave cavity and utilizing the magnon-microwave state swapping. Our\nprotocol is within reach of current technology and may become a promising new\napproach for preparing microwave-optics entanglement, which finds unique\napplications in hybrid quantum networks and quantum information processing with\nhybrid quantum systems.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Optics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}