{"id":"2408.06338","title":"Closeby Habitable Exoplanet Survey (CHES). II. An Observation Strategy\n  for the Target Stars","authors":"Dongjie Tan, Jianghui Ji, Chunhui Bao, Xiumin Huang, Guo Chen, Su\n  Wang, Yao Dong, Haitao Li, Junbo Zhang, Liang Fang, Dong Li, Lei Deng,\n  Jiacheng Liu, Zi Zhu","authorsParsed":[["Tan","Dongjie",""],["Ji","Jianghui",""],["Bao","Chunhui",""],["Huang","Xiumin",""],["Chen","Guo",""],["Wang","Su",""],["Dong","Yao",""],["Li","Haitao",""],["Zhang","Junbo",""],["Fang","Liang",""],["Li","Dong",""],["Deng","Lei",""],["Liu","Jiacheng",""],["Zhu","Zi",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 17:54:46 GMT"}],"updateDate":"2024-08-13","timestamp":1723485286000,"abstract":"  The Closeby Habitable Exoplanet Survey (CHES) constitutes a mission\nintricately designed to systematically survey approximately 100 solar-type\nstars located within the immediate proximity of the solar system, specifically\nwithin a range of 10 parsecs. The core objective of this mission is the\ndetection and characterization of potentially habitable Earth-like planets or\nsuper-Earths within the habitable zone of these stars. The CHES mission obtains\nhigh-precision astrometric measurements of planets orbiting the target stars by\nobserving angular distance variations between the target star and reference\nstars. As a result, we surveyed the relevant parameters of both target and\nreference stars in detail, conducting a thorough analysis and calculation of\nthe required observation accuracy, the number of observations, and the priority\nassigned to each target star. Observational emphasis will be concentrated on\ntargets considered of higher priority, ensuring the effectiveness of their\nobservation capabilities. Through this approach, we formulate a five-year\nobservation strategy that will cover all the target stars within a six-month\ntimeframe. The strategy not only fulfills the required observing capability but\nalso exhibit high efficiency simultaneously, providing an executable program\nfor future mission. Over the span of the mission's five-year duration, a\ncumulative observation time of 29,220 hours will be available. Approximately 86\npercent of this, totaling 25,120 hours, is allocated for the observation of\ntarget stars. This allocation leaves approximately 4,100 hours for extended\nscientific observation programs. We have also performed simulated observations\nbased on this strategy and verified its observational capability for\nexoplanets.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Astrophysics of Galaxies","Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}