{"id":"2408.05778","title":"Pareto Front Shape-Agnostic Pareto Set Learning in Multi-Objective\n  Optimization","authors":"Rongguang Ye, Longcan Chen, Wei-Bin Kou, Jinyuan Zhang and Hisao\n  Ishibuchi","authorsParsed":[["Ye","Rongguang",""],["Chen","Longcan",""],["Kou","Wei-Bin",""],["Zhang","Jinyuan",""],["Ishibuchi","Hisao",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 14:09:40 GMT"}],"updateDate":"2024-08-13","timestamp":1723385380000,"abstract":"  Pareto set learning (PSL) is an emerging approach for acquiring the complete\nPareto set of a multi-objective optimization problem. Existing methods\nprimarily rely on the mapping of preference vectors in the objective space to\nPareto optimal solutions in the decision space. However, the sampling of\npreference vectors theoretically requires prior knowledge of the Pareto front\nshape to ensure high performance of the PSL methods. Designing a sampling\nstrategy of preference vectors is difficult since the Pareto front shape cannot\nbe known in advance. To make Pareto set learning work effectively in any Pareto\nfront shape, we propose a Pareto front shape-agnostic Pareto Set Learning\n(GPSL) that does not require the prior information about the Pareto front. The\nfundamental concept behind GPSL is to treat the learning of the Pareto set as a\ndistribution transformation problem. Specifically, GPSL can transform an\narbitrary distribution into the Pareto set distribution. We demonstrate that\ntraining a neural network by maximizing hypervolume enables the process of\ndistribution transformation. Our proposed method can handle any shape of the\nPareto front and learn the Pareto set without requiring prior knowledge.\nExperimental results show the high performance of our proposed method on\ndiverse test problems compared with recent Pareto set learning algorithms.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}