{"id":"2408.06382","title":"FedRobo: Federated Learning Driven Autonomous Inter Robots Communication\n  For Optimal Chemical Sprays","authors":"Jannatul Ferdaus, Sameera Pisupati, Mahedi Hasan, Sathwick Paladugu","authorsParsed":[["Ferdaus","Jannatul",""],["Pisupati","Sameera",""],["Hasan","Mahedi",""],["Paladugu","Sathwick",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 00:32:39 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 20:58:24 GMT"}],"updateDate":"2024-08-19","timestamp":1723249959000,"abstract":"  Federated Learning enables robots to learn from each other's experiences\nwithout relying on centralized data collection. Each robot independently\nmaintains a model of crop conditions and chemical spray effectiveness, which is\nperiodically shared with other robots in the fleet. A communication protocol is\ndesigned to optimize chemical spray applications by facilitating the exchange\nof information about crop conditions, weather, and other critical factors. The\nfederated learning algorithm leverages this shared data to continuously refine\nthe chemical spray strategy, reducing waste and improving crop yields. This\napproach has the potential to revolutionize the agriculture industry by\noffering a scalable and efficient solution for crop protection. However,\nsignificant challenges remain, including the development of a secure and robust\ncommunication protocol, the design of a federated learning algorithm that\neffectively integrates data from multiple sources, and ensuring the safety and\nreliability of autonomous robots. The proposed cluster-based federated learning\napproach also effectively reduces the computational load on the global server\nand minimizes communication overhead among clients.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}