{"id":"2408.04703","title":"Extreme heating of minor ions in imbalanced solar-wind turbulence","authors":"Michael F. Zhang, Matthew W. Kunz, Jonathan Squire, Kristopher G.\n  Klein","authorsParsed":[["Zhang","Michael F.",""],["Kunz","Matthew W.",""],["Squire","Jonathan",""],["Klein","Kristopher G.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 18:00:49 GMT"}],"updateDate":"2024-08-12","timestamp":1723140049000,"abstract":"  Minor ions in the solar corona are heated to extreme temperatures, far in\nexcess of those of the electrons and protons that comprise the bulk of the\nplasma. These highly non-thermal distributions make minor ions sensitive probes\nof the underlying collisionless heating processes, which are crucial to coronal\nheating and the creation of the solar wind. The recent discovery of the\n\"helicity barrier\" offers a mechanism where imbalanced Alfv\\'enic turbulence in\nlow-beta plasmas preferentially heats protons over electrons, generating\nhigh-frequency, proton-cyclotron-resonant fluctuations. We use the\nhybrid-kinetic particle-in-cell code, Pegasus++, to drive imbalanced Alfv\\'enic\nturbulence in a 3D low-beta plasma with additional passive ion species,\nHe$^{2+}$ and O$^{5+}$. A helicity barrier naturally develops, followed by\nclear phase-space signatures of oblique ion-cyclotron-wave heating and\nLandau-resonant heating from the imbalanced Alfv\\'enic fluctuations. The former\nresults in characteristically arced ion velocity distribution functions, whose\nnon-bi-Maxwellian features are shown by linear ALPS calculations to be critical\nto the heating process. Additional features include a steep transition-range\nelectromagnetic spectrum, the presence of ion-cyclotron waves propagating in\nthe direction of imbalance, significantly enhanced proton-to-electron heating\nratios, anisotropic ion temperatures that are significantly more perpendicular\nwith respect to magnetic field, and extreme heating of heavier species in a\nmanner consistent with empirically derived mass scalings informed by\nmeasurements. None of these features are realized in an otherwise equivalent\nsimulation of balanced turbulence. If seen simultaneously in the fast solar\nwind, these signatures of the helicity barrier would testify to the necessity\nof incorporating turbulence imbalance in a complete theory for the evolution of\nthe solar wind.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Physics/Plasma Physics","Physics/Space Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}