{"id":"2408.16764","title":"An algebraic characterisation of Kochen-Specker contextuality","authors":"Markus Frembs","authorsParsed":[["Frembs","Markus",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:58:12 GMT"}],"updateDate":"2024-08-30","timestamp":1724954292000,"abstract":"  Contextuality is a key distinguishing feature between classical and quantum\nphysics. It expresses a fundamental obstruction to describing quantum theory\nusing classical concepts. In turn, understood as a resource for quantum\ncomputation, it is expected to hold the key to quantum advantage. Yet, despite\nits long recognised importance in quantum foundations and, more recently, in\nquantum computation, the structural essence of contextuality has remained\nsomewhat elusive - different frameworks address different aspects of the\nphenomenon, yet their precise relationship often remains unclear. This issue\nalready looms large at the level of the Bell-Kochen-Specker theorem: while\ntraditional proofs proceed by showing the nonexistence of valuations, the\nnotion of state-independent contextuality in the marginal approach allows to\nprove contextuality from seemingly weaker assumptions. In the light of this,\nand at the absence of a unified mathematical framework for Kochen-Specker\ncontextuality, the original algebraic approach has been widely abandoned, in\nfavour of the study of contextual correlations.\n  Here, we reinstate the algebraic perspective on contextuality. Concretely, by\nbuilding on the novel concept of context connections, we reformulate the\nalgebraic relations between observables originally postulated by Kochen and\nSpecker, and we explicitly demonstrate their consistency with the notion of\nstate-independent contextuality. In the present paper, we focus on the new\nconceptual ideas and discuss them in the concrete setting of spin-1\nobservables, specifically those in the example of [S. Yu and C.H. Oh, Phys.\nRev. Lett., 108, 030402 (2012)]; in a companion paper, we generalise these\nideas, obtain a complete characterisation of Kochen-Specker contextuality and\nprovide a detailed comparison with the related notions of contextuality in the\nmarginal and graph-theoretic approach.\n","subjects":["Physics/Quantum Physics","Physics/Mathematical Physics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ZhzNeSiaxeHn2rEvcaXCK0MbL_wnWvKJToc-yBq7bko","pdfSize":"353277"}
