{"id":"2408.02307","title":"Low-Cost Self-Ensembles Based on Multi-Branch Transformation and Grouped\n  Convolution","authors":"Hojung Lee, Jong-Seok Lee","authorsParsed":[["Lee","Hojung",""],["Lee","Jong-Seok",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:36:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722846973000,"abstract":"  Recent advancements in low-cost ensemble learning have demonstrated improved\nefficiency for image classification. However, the existing low-cost ensemble\nmethods show relatively lower accuracy compared to conventional ensemble\nlearning. In this paper, we propose a new low-cost ensemble learning, which can\nsimultaneously achieve high efficiency and classification performance. A CNN is\ntransformed into a multi-branch structure without introduction of additional\ncomponents, which maintains the computational complexity as that of the\noriginal single model and also enhances diversity among the branches' outputs\nvia sufficient separation between different pathways of the branches. In\naddition, we propose a new strategy that applies grouped convolution in the\nbranches with different numbers of groups in different branches, which boosts\nthe diversity of the branches' outputs. For training, we employ knowledge\ndistillation using the ensemble of the outputs as the teacher signal. The high\ndiversity among the outputs enables to form a powerful teacher, enhancing the\nindividual branch's classification performance and consequently the overall\nensemble performance. Experimental results show that our method achieves\nstate-of-the-art classification accuracy and higher uncertainty estimation\nperformance compared to previous low-cost ensemble methods. The code is\navailable at https://github.com/hjdw2/SEMBG.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jVSxgojg26L7i6enu6paIE_a1lRoYj2PyX4QBXeXrDA","pdfSize":"1522091"}
