{"id":"2408.09512","title":"Contactless seismocardiography via Gunnar-Farneback optical flow","authors":"Mohammad Muntasir Rahman, Amirtaha Taebi","authorsParsed":[["Rahman","Mohammad Muntasir",""],["Taebi","Amirtaha",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 15:29:34 GMT"}],"updateDate":"2024-08-20","timestamp":1723994974000,"abstract":"  Seismocardiography (SCG) has gained significant attention due to its\npotential applications in monitoring cardiac health and diagnosing\ncardiovascular conditions. Conventional SCG methods rely on accelerometers\nattached to the chest, which can be uncomfortable or inconvenient. In recent\nyears, researchers have explored non-contact methods to capture SCG signals,\nand one promising approach involves analyzing video recordings of the chest. In\nthis study, we investigate a vision-based method based on the Gunnar-Farneback\noptical flow to extract SCG signals from the chest skin movements recorded by a\nsmartphone camera. We compared the SCG signals extracted from the chest videos\nof four healthy subjects with those obtained from accelerometers and our\nprevious method based on sticker tracking. Our results demonstrated that the\nvision-based SCG signals extracted by the proposed method closely resembled\nthose from accelerometers and stickers, although these signals were captured\nfrom slightly different locations. The mean squared error between the\nvision-based SCG signals and accelerometer-based signals was found to be within\na reasonable range, especially between signals on head-to-foot direction\n(0.2$<$MSE$<$1.5). Additionally, heart rates derived from the vision-based SCG\nexhibited good agreement with the gold-standard ECG measurements, with a mean\ndifference of 0.8 bpm. These results indicate the potential of this\nnon-invasive method in health monitoring and diagnostics.\n","subjects":["Physics/Medical Physics","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}