{"id":"2408.06032","title":"Next-generation global gravitational-wave detector network: Impact of\n  detector orientation on compact binary coalescence and stochastic\n  gravitational-wave background searches","authors":"Michael Ebersold, Tania Regimbau, Nelson Christensen","authorsParsed":[["Ebersold","Michael",""],["Regimbau","Tania",""],["Christensen","Nelson",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:48:28 GMT"}],"updateDate":"2024-08-13","timestamp":1723456108000,"abstract":"  Next-generation gravitational-wave detectors like the Einstein Telescope and\nCosmic Explorer, currently in their preparatory phase, have the potential to\nsignificantly improve our understanding of astrophysics, cosmology and\nfundamental physics. We examine how the arm orientations of the proposed\ndetectors influence the sensitivity of a combined Einstein Telescope - Cosmic\nExplorer network with respect to the sensitivity to the stochastic\ngravitational-wave background and compact binary coalescences, where measuring\nboth gravitational-wave polarizations is favorable. We present a method to\noptimize the arm orientations in the network for these two targets, and also\ndemonstrate how to achieve a balanced configuration for both stochastic\nbackground and compact binary coalescence searches. For five specific network\nconfigurations, we explicitly compare the sensitivity to the stochastic\nbackground and binary neutron star mergers. For the latter, we conduct Bayesian\nparameter estimation on the extrinsic parameters of a reference binary neutron\nstar system to assess sky localization and distance estimation capabilities.\nThese are illustrated through efficiency curves showing the fraction of events\nmeeting sky localization and distance uncertainty criteria as a function of\nredshift. Our findings suggest that globally coordinating efforts towards the\nnext-generation gravitational-wave detector network is advantageous.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}