{"id":"2408.11149","title":"Exploring the Thermostability of CRISPR Cas12b using Molecular Dynamics\n  Simulations","authors":"Yinhao Jia, Katelynn Horvath, Santosh R. Rananaware, Piyush K. Jain\n  and Janani Sampath","authorsParsed":[["Jia","Yinhao",""],["Horvath","Katelynn",""],["Rananaware","Santosh R.",""],["Jain","Piyush K.",""],["Sampath","Janani",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 19:10:38 GMT"}],"updateDate":"2024-08-22","timestamp":1724181038000,"abstract":"  CRISPR (clustered regularly interspaced short palindromic repeat)- based\ndiagnostics are at the forefront of rapid detection platforms of infectious\ndiseases. The integration of reverse transcription-loop-mediated isothermal\namplification (RT-LAMP) with CRISPR-Cas protein systems has led to the creation\nof advanced one-pot assays. The sensitivity of these assays has been bolstered\nby the utilization of a thermophilic Cas12 protein, BrCas12b, and its\nengineered variant, which exhibits enhanced thermal stability and allows for\nbroader operation temperatures of the assay. Here, we perform all-atom\nmolecular dynamics (MD) simulations on wild-type and mutant BrCas12b to reveal\nthe mechanism of stabilization conferred by the mutation. High-temperature\nsimulations reveal a small structural change along with greater flexibility in\nthe PAM-interacting domain of the mutant BrCas12b, with marginal structural and\nflexibility changes in the other mutated domains. Comparative essential\ndynamics analysis between the wild-type and mutant BrCas12b at both ambient and\nelevated temperatures provides insights into the stabilizing effects of the\nmutations. Our findings not only offer a comprehensive insight into the dynamic\nalterations induced by mutations but reveal important motions in BrCas12b,\nimportant for the rational design of diagnostic and therapeutic platforms of\nCas12 proteins.\n","subjects":["Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"vpl5rSBNNdEIIMaCMKlOl9DJ74CXBYIUUb0wenzdaLI","pdfSize":"21658949"}
