{"id":"2408.17387","title":"Bayesian Optimization for Non-Convex Two-Stage Stochastic Optimization\n  Problems","authors":"Jack M. Buckingham, Ivo Couckuyt and Juergen Branke","authorsParsed":[["Buckingham","Jack M.",""],["Couckuyt","Ivo",""],["Branke","Juergen",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 16:26:31 GMT"}],"updateDate":"2024-09-02","timestamp":1725035191000,"abstract":"  Bayesian optimization is a sample-efficient method for solving expensive,\nblack-box optimization problems. Stochastic programming concerns optimization\nunder uncertainty where, typically, average performance is the quantity of\ninterest. In the first stage of a two-stage problem, here-and-now decisions\nmust be made in the face of this uncertainty, while in the second stage,\nwait-and-see decisions are made after the uncertainty has been resolved. Many\nmethods in stochastic programming assume that the objective is cheap to\nevaluate and linear or convex. In this work, we apply Bayesian optimization to\nsolve non-convex, two-stage stochastic programs which are expensive to\nevaluate. We formulate a knowledge-gradient-based acquisition function to\njointly optimize the first- and second-stage variables, establish a guarantee\nof asymptotic consistency and provide a computationally efficient\napproximation. We demonstrate comparable empirical results to an alternative we\nformulate which alternates its focus between the two variable types, and\nsuperior empirical results over the standard, naive, two-step benchmark. We\nshow that differences in the dimension and length scales between the variable\ntypes can lead to inefficiencies of the two-step algorithm, while the joint and\nalternating acquisition functions perform well in all problems tested.\nExperiments are conducted on both synthetic and real-world examples.\n","subjects":["Statistics/Machine Learning","Computing Research Repository/Machine Learning","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3vwM3YXt8ReM8pzZzj7JL76MyrXaANXERqGp4TN898w","pdfSize":"2958181"}
