{"id":"2408.05946","title":"Exciton diffusion in two-dimensional chiral perovskites","authors":"Sophia Terres, Lucas Scalon, Julius Brunner, Dominik Horneber,\n  Johannes Dureth, Shiyu Huang, Takashi Taniguchi, Kenji Watanabe, Ana Flavia\n  Nogueira, Sven Hoefling, Sebastian Klembt, Yana Vaynzof, Alexey Chernikov","authorsParsed":[["Terres","Sophia",""],["Scalon","Lucas",""],["Brunner","Julius",""],["Horneber","Dominik",""],["Dureth","Johannes",""],["Huang","Shiyu",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Nogueira","Ana Flavia",""],["Hoefling","Sven",""],["Klembt","Sebastian",""],["Vaynzof","Yana",""],["Chernikov","Alexey",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:48:09 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 07:57:53 GMT"}],"updateDate":"2024-08-14","timestamp":1723445289000,"abstract":"  Two-dimensional (2D) organic-inorganic hybrid perovskites emerged as a\nversatile platform for light-emitting and photovol-taic applications due to\ntheir unique structural design and chemical flexibility. Their properties\ndepend heavily on both the choice of the inorganic lead halide framework and\nthe surrounding organic layers. Recently, the introduction of chiral cations\ninto 2D perovskites has attracted major interest due to their potential for\nintroducing chirality and tuning the chiro-optical response. Importantly, the\noptical properties in these materials are dominated by tightly bound excitons\nthat also serve as primary carriers for the energy transport. The mobility of\nphotoinjected excitons is thus important from the perspectives of fundamental\nmaterial properties and optoelectronic applications, yet remains an open\nquestion. Here, we demonstrate exciton propagation in a 2D chiral perovskite\nmethylbenzylammonium lead iodide (MBA2PbI4) using transient photoluminescence\nmicroscopy and reveal density-dependent transport over more than 100 nanometers\nat room temperature with diffusion coeffi-cients as high as 2 cm2/s. We observe\ntwo distinct regimes of initially rapid diffusive propagation and subsequent\nlocaliza-tion. Moreover, perovskites with enantiomer pure cations are found to\nexhibit faster exciton diffusion compared to the race-mic mixture, correlated\nwith the impact of the material composition on disorder. Altogether, the\nobservations of efficient exciton diffusion at room temperature highlight the\npotential of 2D chiral perovskites to merge chiro-optical properties with\nstrong light-matter interaction and efficient energy transport.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RNzagGN7l9lPYGCG2SOrmRxEudVDPw0LlR3xNV8Vj3c","pdfSize":"1133343"}
