{"id":"2408.14769","title":"Points2Plans: From Point Clouds to Long-Horizon Plans with Composable\n  Relational Dynamics","authors":"Yixuan Huang, Christopher Agia, Jimmy Wu, Tucker Hermans, Jeannette\n  Bohg","authorsParsed":[["Huang","Yixuan",""],["Agia","Christopher",""],["Wu","Jimmy",""],["Hermans","Tucker",""],["Bohg","Jeannette",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 04:10:22 GMT"}],"updateDate":"2024-08-28","timestamp":1724731822000,"abstract":"  We present Points2Plans, a framework for composable planning with a\nrelational dynamics model that enables robots to solve long-horizon\nmanipulation tasks from partial-view point clouds. Given a language instruction\nand a point cloud of the scene, our framework initiates a hierarchical planning\nprocedure, whereby a language model generates a high-level plan and a\nsampling-based planner produces constraint-satisfying continuous parameters for\nmanipulation primitives sequenced according to the high-level plan. Key to our\napproach is the use of a relational dynamics model as a unifying interface\nbetween the continuous and symbolic representations of states and actions, thus\nfacilitating language-driven planning from high-dimensional perceptual input\nsuch as point clouds. Whereas previous relational dynamics models require\ntraining on datasets of multi-step manipulation scenarios that align with the\nintended test scenarios, Points2Plans uses only single-step simulated training\ndata while generalizing zero-shot to a variable number of steps during\nreal-world evaluations. We evaluate our approach on tasks involving geometric\nreasoning, multi-object interactions, and occluded object reasoning in both\nsimulated and real-world settings. Results demonstrate that Points2Plans offers\nstrong generalization to unseen long-horizon tasks in the real world, where it\nsolves over 85% of evaluated tasks while the next best baseline solves only\n50%. Qualitative demonstrations of our approach operating on a mobile\nmanipulator platform are made available at\nsites.google.com/stanford.edu/points2plans.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}