{"id":"2408.16463","title":"An Exploratory Deep Learning Approach for Predicting Subsequent Suicidal\n  Acts in Chinese Psychological Support Hotlines","authors":"Changwei Song, Qing Zhao, Jianqiang Li, Yining Chen, Yongsheng Tong,\n  Guanghui Fu","authorsParsed":[["Song","Changwei",""],["Zhao","Qing",""],["Li","Jianqiang",""],["Chen","Yining",""],["Tong","Yongsheng",""],["Fu","Guanghui",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 11:51:41 GMT"}],"updateDate":"2024-08-30","timestamp":1724932301000,"abstract":"  Psychological support hotlines are an effective suicide prevention measure\nthat typically relies on professionals using suicide risk assessment scales to\npredict individual risk scores. However, the accuracy of scale-based predictive\nmethods for suicide risk assessment can vary widely depending on the expertise\nof the operator. This limitation underscores the need for more reliable\nmethods, prompting this research's innovative exploration of the use of\nartificial intelligence to improve the accuracy and efficiency of suicide risk\nprediction within the context of psychological support hotlines. The study\nincluded data from 1,549 subjects from 2015-2017 in China who contacted a\npsychological support hotline. Each participant was followed for 12 months to\nidentify instances of suicidal behavior. We proposed a novel multi-task\nlearning method that uses the large-scale pre-trained model Whisper for feature\nextraction and fits psychological scales while predicting the risk of suicide.\nThe proposed method yields a 2.4\\% points improvement in F1-score compared to\nthe traditional manual approach based on the psychological scales. Our model\ndemonstrated superior performance compared to the other eight popular models.\nTo our knowledge, this study is the first to apply deep learning to long-term\nspeech data to predict suicide risk in China, indicating grate potential for\nclinical applications. The source code is publicly available at:\n\\url{https://github.com/songchangwei/Suicide-Risk-Prediction}.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"evhWu_tzoG9MRMezDhrpeiMpRk05kHzlUeRMPKNkbJk","pdfSize":"1676967"}
