{"id":"2408.00544","title":"Illustrating Classic Brazilian Books using a Text-To-Image Diffusion\n  Model","authors":"Felipe Mahlow, Andr\\'e Felipe Zanella, William Alberto Cruz\n  Casta\\~neda, Regilene Aparecida Sarzi-Ribeiro","authorsParsed":[["Mahlow","Felipe",""],["Zanella","André Felipe",""],["Castañeda","William Alberto Cruz",""],["Sarzi-Ribeiro","Regilene Aparecida",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:28:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722518895000,"abstract":"  In recent years, Generative Artificial Intelligence (GenAI) has undergone a\nprofound transformation in addressing intricate tasks involving diverse\nmodalities such as textual, auditory, visual, and pictorial generation. Within\nthis spectrum, text-to-image (TTI) models have emerged as a formidable approach\nto generating varied and aesthetically appealing compositions, spanning\napplications from artistic creation to realistic facial synthesis, and\ndemonstrating significant advancements in computer vision, image processing,\nand multimodal tasks. The advent of Latent Diffusion Models (LDMs) signifies a\nparadigm shift in the domain of AI capabilities. This article delves into the\nfeasibility of employing the Stable Diffusion LDM to illustrate literary works.\nFor this exploration, seven classic Brazilian books have been selected as case\nstudies. The objective is to ascertain the practicality of this endeavor and to\nevaluate the potential of Stable Diffusion in producing illustrations that\naugment and enrich the reader's experience. We will outline the beneficial\naspects, such as the capacity to generate distinctive and contextually\npertinent images, as well as the drawbacks, including any shortcomings in\nfaithfully capturing the essence of intricate literary depictions. Through this\nstudy, we aim to provide a comprehensive assessment of the viability and\nefficacy of utilizing AI-generated illustrations in literary contexts,\nelucidating both the prospects and challenges encountered in this pioneering\napplication of technology.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"OKYrOKDPrCRwRcz9hZ5bLQik5gDAod872QcXFDM27is","pdfSize":"4249794","txDigest":"RGYtjbd3HEw9QgiFtQ3uZYz3wU2ChfrzUHLq77skDT5","endEpoch":"1","status":"CERTIFIED"}
