{"id":"2408.12492","title":"The Importance of Cognitive Biases in the Recommendation Ecosystem","authors":"Markus Schedl, Oleg Lesota, Stefan Brandl, Mohammad Lotfi, Gustavo\n  Junior Escobedo Ticona, Shahed Masoudian","authorsParsed":[["Schedl","Markus",""],["Lesota","Oleg",""],["Brandl","Stefan",""],["Lotfi","Mohammad",""],["Ticona","Gustavo Junior Escobedo",""],["Masoudian","Shahed",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:33:46 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 07:58:46 GMT"}],"updateDate":"2024-09-02","timestamp":1724340826000,"abstract":"  Cognitive biases have been studied in psychology, sociology, and behavioral\neconomics for decades. Traditionally, they have been considered a negative\nhuman trait that leads to inferior decision-making, reinforcement of\nstereotypes, or can be exploited to manipulate consumers, respectively. We\nargue that cognitive biases also manifest in different parts of the\nrecommendation ecosystem and at different stages of the recommendation process.\nMore importantly, we contest this traditional detrimental perspective on\ncognitive biases and claim that certain cognitive biases can be beneficial when\naccounted for by recommender systems. Concretely, we provide empirical evidence\nthat biases such as feature-positive effect, Ikea effect, and cultural\nhomophily can be observed in various components of the recommendation pipeline,\nincluding input data (such as ratings or side information), recommendation\nalgorithm or model (and consequently recommended items), and user interactions\nwith the system. In three small experiments covering recruitment and\nentertainment domains, we study the pervasiveness of the aforementioned biases.\nWe ultimately advocate for a prejudice-free consideration of cognitive biases\nto improve user and item models as well as recommendation algorithms.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}