{"id":"2408.10293","title":"A reassessment of the \"hard-steps\" model for the evolution of\n  intelligent life","authors":"Daniel B. Mills, Jennifer L. Macalady, Adam Frank, and Jason T. Wright","authorsParsed":[["Mills","Daniel B.",""],["Macalady","Jennifer L.",""],["Frank","Adam",""],["Wright","Jason T.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 16:30:06 GMT"}],"updateDate":"2024-08-21","timestamp":1724085006000,"abstract":"  According to the \"hard-steps\" model, the origin of humanity required\n\"successful passage through a number of intermediate steps\" (so-called \"hard\"\nor \"critical\" steps) that were intrinsically improbable with respect to the\ntotal time available for biological evolution on Earth. This model similarly\npredicts that technological life analogous to human life on Earth is\n\"exceedingly rare\" in the universe. Here, we critically reevaluate the core\nassumptions of the hard-steps model in light of recent advances in the Earth\nand life sciences. Specifically, we advance a potential alternative model where\nthere are no hard steps, and evolutionary novelties (or singularities) required\nfor human origins can be explained via mechanisms outside of intrinsic\nimprobability. Furthermore, if Earth's surface environment was initially\ninhospitable not only to human life, but also to certain key intermediate steps\nin human evolution (e.g., the origin of eukaryotic cells, multicellular\nanimals), then the \"delay\" in the appearance of humans can be best explained\nthrough the sequential opening of new global environmental windows of\nhabitability over Earth history, with humanity arising relatively quickly once\nthe right conditions were established. In this co-evolutionary (or\ngeobiological) scenario, humans did not evolve \"early\" or \"late\" with respect\nto the total lifespan of the biosphere, but \"on time.\"\n","subjects":["Quantitative Biology/Populations and Evolution","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RJcxYQLHXJdqw1Z3-WLBMvnnePBL2JxqokX7ARvhJwA","pdfSize":"1872875"}
