{"id":"2408.02843","title":"The rich interstellar reservoir of dinitriles: Detection of\n  malononitrile and maleonitrile in TMC-1","authors":"M. Agundez, C. Bermudez, C. Cabezas, G. Molpeceres, Y. Endo, N.\n  Marcelino, B. Tercero, J.-C. Guillemin, P. de Vicente, J. Cernicharo","authorsParsed":[["Agundez","M.",""],["Bermudez","C.",""],["Cabezas","C.",""],["Molpeceres","G.",""],["Endo","Y.",""],["Marcelino","N.",""],["Tercero","B.",""],["Guillemin","J. -C.",""],["de Vicente","P.",""],["Cernicharo","J.",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 21:52:00 GMT"}],"updateDate":"2024-08-07","timestamp":1722894720000,"abstract":"  While the nitrile group is by far the most prevalent one among interstellar\nmolecules, the existence of interstellar dinitriles (molecules containing two\n-CN groups) has recently been proven. Here we report the discovery of two new\ndinitriles in the cold dense cloud TMC-1. These newly identified species are\nmalononitrile, CH2(CN)2, and maleonitrile, the Z isomer of NC-CH=CH-CN, which\ncan be seen as the result of substituting two H atoms with two -CN groups in\nmethane and ethylene, respectively. These two molecules were detected using\ndata from the ongoing QUIJOTE line survey of TMC-1 that is being carried out\nwith the Yebes 40m telescope. We derive column densities of 1.8e11 cm-2 and\n5.1e10 cm-2 for malononitrile and maleonitrile, respectively. This means that\nthey are eight and three times less abundant than HCC-CH2-CN and\n(E)-HCC-CH=CH-CN, respectively, which are analog molecules detected in TMC-1 in\nwhich one -CN group is converted into a -CCH group. This is in line with\nprevious findings in which -CCH derivatives are more abundant than the -CN\ncounterparts in TMC-1. We examined the potential chemical pathways to these two\ndinitriles, and we find that while maleonitrile can be efficiently formed\nthrough the reaction of CN with CH2CHCN, the formation of malononitrile is not\nclear because the neutral-neutral reactions that could potentially form it are\nnot feasible under the physical conditions of TMC-1.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}