{"id":"2408.01058","title":"Numerical and Lyapunov-Based Investigation of the Effect of Stenosis on\n  Blood Transport Stability Using a Control-Theoretic PDE Model of\n  Cardiovascular Flow","authors":"Shantanu Singh and Nikolaos Bekiaris-Liberis","authorsParsed":[["Singh","Shantanu",""],["Bekiaris-Liberis","Nikolaos",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:11:37 GMT"}],"updateDate":"2024-08-05","timestamp":1722582697000,"abstract":"  We perform various numerical tests to study the effect of (boundary) stenosis\non blood flow stability, employing a detailed and accurate, second-order\nfinite-volume scheme for numerically implementing a partial differential\nequation (PDE) model, using clinically realistic values for the artery's\nparameters and the blood inflow. The model consists of a baseline $2\\times 2$\nhetero-directional, nonlinear hyperbolic PDE system, in which, the stenosis'\neffect is described by a pressure drop at the outlet of an arterial segment\nconsidered. We then study the stability properties (observed in our numerical\ntests) of a reference trajectory, corresponding to a given time-varying inflow\n(e.g., a periodic trajectory with period equal to the time interval between two\nconsecutive heartbeats) and stenosis severity, deriving the respective\nlinearized system and constructing a Lyapunov functional. Due to the fact that\nthe linearized system is time varying, with time-varying parameters depending\non the reference trajectories themselves (that, in turn, depend in an implicit\nmanner on the stenosis degree), which cannot be derived analytically, we verify\nthe Lyapunov-based stability conditions obtained, numerically. Both the\nnumerical tests and the Lyapunov-based stability analysis show that a reference\ntrajectory is asymptotically stable with a decay rate that decreases as the\nstenosis severity deteriorates.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}