{"id":"2408.01730","title":"Real-time Hybrid System Identification with Online Deterministic\n  Annealing","authors":"Christos Mavridis, Karl Henrik Johansson","authorsParsed":[["Mavridis","Christos",""],["Johansson","Karl Henrik",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 10:02:49 GMT"}],"updateDate":"2024-08-06","timestamp":1722679369000,"abstract":"  We introduce a real-time identification method for discrete-time\nstate-dependent switching systems in both the input--output and state-space\ndomains. In particular, we design a system of adaptive algorithms running in\ntwo timescales; a stochastic approximation algorithm implements an online\ndeterministic annealing scheme at a slow timescale and estimates the\nmode-switching signal, and an recursive identification algorithm runs at a\nfaster timescale and updates the parameters of the local models based on the\nestimate of the switching signal. We first focus on piece-wise affine systems\nand discuss identifiability conditions and convergence properties based on the\ntheory of two-timescale stochastic approximation. In contrast to standard\nidentification algorithms for switched systems, the proposed approach gradually\nestimates the number of modes and is appropriate for real-time system\nidentification using sequential data acquisition. The progressive nature of the\nalgorithm improves computational efficiency and provides real-time control over\nthe performance-complexity trade-off. Finally, we address specific challenges\nthat arise in the application of the proposed methodology in identification of\nmore general switching systems. Simulation results validate the efficacy of the\nproposed methodology.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Machine Learning","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6OA52tm47dFjELsOZlO-OYH1Kzqj4TOswXgzvtxkcW4","pdfSize":"3041714","txDigest":"6F7Not97XEUnLrTX9cnoUuqerNDZSrD3cJ7HyW5bMdXK","endEpoch":"1","status":"CERTIFIED"}
