{"id":"2408.11836","title":"Analysis of Unstructured High-Density Crowded Scenes for Crowd\n  Monitoring","authors":"Alexandre Matov","authorsParsed":[["Matov","Alexandre",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 22:09:50 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 02:38:07 GMT"},{"version":"v3","created":"Mon, 26 Aug 2024 20:31:08 GMT"},{"version":"v4","created":"Tue, 10 Sep 2024 15:00:14 GMT"}],"updateDate":"2024-09-11","timestamp":1722982190000,"abstract":"  We are interested in developing an automated system for detection of\norganized movements in human crowds. Computer vision algorithms can extract\ninformation from videos of crowded scenes and automatically detect and track\ngroups of individuals undergoing organized motion that represents an anomalous\nbehavior in the context of conflict aversion. Our system can detect organized\ncohorts against the background of randomly moving objects and we can estimate\nthe number of participants in an organized cohort, the speed and direction of\nmotion in real time, within three to four video frames, which is less than one\nsecond from the onset of motion captured on a CCTV. We have performed\npreliminary analysis in this context in biological cell data containing up to\nfour thousand objects per frame and will extend this numerically to a\nhundred-fold for public safety applications.\n  We envisage using the existing infrastructure of video cameras for acquiring\nimage datasets on-the-fly and deploying an easy-to-use data-driven software\nsystem for parsing of significant events by analyzing image sequences taken\ninside and outside of sports stadiums or other public venues. Other prospective\nusers are organizers of political rallies, civic and wildlife organizations,\nsecurity firms, and the military. We will optimize the performance of the\nsoftware by implementing a classification method able to distinguish between\nactivities posing a threat and those not posing a threat.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}