{"id":"2408.10346","title":"Toward Fair and Strategyproof Tournament Rules for Tournaments with\n  Partially Transferable Utilities","authors":"David Pennock, Ariel Schvartzman, Eric Xue","authorsParsed":[["Pennock","David",""],["Schvartzman","Ariel",""],["Xue","Eric",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:37:41 GMT"}],"updateDate":"2024-08-21","timestamp":1724092661000,"abstract":"  A tournament on $n$ agents is a complete oriented graph with the agents as\nvertices and edges that describe the win-loss outcomes of the $\\binom{n}{2}$\nmatches played between each pair of agents. The winner of a tournament is\ndetermined by a tournament rule that maps tournaments to probability\ndistributions over the agents. We want these rules to be fair (choose a\nhigh-quality agent) and robust to strategic manipulation. Prior work has shown\nthat under minimally fair rules, manipulations between two agents can be\nprevented when utility is nontransferable but not when utility is completely\ntransferable. We introduce a partially transferable utility model that\ninterpolates between these two extremes using a selfishness parameter\n$\\lambda$. Our model is that an agent may be willing to lose on purpose,\nsacrificing some of her own chance of winning, but only if the colluding pair's\njoint gain is more than $\\lambda$ times the individual's sacrifice.\n  We show that no fair tournament rule can prevent manipulations when $\\lambda\n< 1$. We computationally solve for fair and manipulation-resistant tournament\nrules for $\\lambda = 1$ for up to 6 agents. We conjecture and leave as a major\nopen problem that such a tournament rule exists for all $n$. We analyze the\ntrade-offs between ``relative'' and ``absolute'' approximate strategyproofness\nfor previously studied rules and derive as a corollary that all of these rules\nrequire $\\lambda \\geq \\Omega(n)$ to be robust to manipulation. We show that for\nstronger notions of fairness, non-manipulable tournament rules are closely\nrelated to tournament rules that witness decreasing gains from manipulation as\nthe number of agents increases.\n","subjects":["Computing Research Repository/Computer Science and Game Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}