{"id":"2408.05692","title":"A Novel Momentum-Based Deep Learning Techniques for Medical Image\n  Classification and Segmentation","authors":"Koushik Biswas, Ridal Pal, Shaswat Patel, Debesh Jha, Meghana Karri,\n  Amit Reza, Gorkem Durak, Alpay Medetalibeyoglu, Matthew Antalek, Yury\n  Velichko, Daniela Ladner, Amir Borhani, Ulas Bagci","authorsParsed":[["Biswas","Koushik",""],["Pal","Ridal",""],["Patel","Shaswat",""],["Jha","Debesh",""],["Karri","Meghana",""],["Reza","Amit",""],["Durak","Gorkem",""],["Medetalibeyoglu","Alpay",""],["Antalek","Matthew",""],["Velichko","Yury",""],["Ladner","Daniela",""],["Borhani","Amir",""],["Bagci","Ulas",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 04:12:35 GMT"}],"updateDate":"2024-08-13","timestamp":1723349555000,"abstract":"  Accurately segmenting different organs from medical images is a critical\nprerequisite for computer-assisted diagnosis and intervention planning. This\nstudy proposes a deep learning-based approach for segmenting various organs\nfrom CT and MRI scans and classifying diseases. Our study introduces a novel\ntechnique integrating momentum within residual blocks for enhanced training\ndynamics in medical image analysis. We applied our method in two distinct\ntasks: segmenting liver, lung, & colon data and classifying abdominal pelvic CT\nand MRI scans. The proposed approach has shown promising results, outperforming\nstate-of-the-art methods on publicly available benchmarking datasets. For\ninstance, in the lung segmentation dataset, our approach yielded significant\nenhancements over the TransNetR model, including a 5.72% increase in dice\nscore, a 5.04% improvement in mean Intersection over Union (mIoU), an 8.02%\nimprovement in recall, and a 4.42% improvement in precision. Hence,\nincorporating momentum led to state-of-the-art performance in both segmentation\nand classification tasks, representing a significant advancement in the field\nof medical imaging.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}