{"id":"2408.05013","title":"Galaxy-dark matter connection from weak lensing in imaging surveys:\n  Impact of photometric redshift errors","authors":"Navin Chaurasiya, Surhud More, Daichi Kashino, Shogo Masaki, Shogo\n  Ishikawa","authorsParsed":[["Chaurasiya","Navin",""],["More","Surhud",""],["Kashino","Daichi",""],["Masaki","Shogo",""],["Ishikawa","Shogo",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 11:49:18 GMT"}],"updateDate":"2024-08-12","timestamp":1723204158000,"abstract":"  The uncertainties in photometric redshifts and stellar masses from imaging\nsurveys affect galaxy sample selection, their abundance measurements, as well\nas the measured weak lensing signals. We develop a framework to assess the\nsystematic effects arising from the use of redshifts and stellar masses derived\nfrom photometric data, and explore their impact on the inferred galaxy-dark\nmatter connection. We use galaxy catalogues from the UniverseMachine (UM)\ngalaxy formation model to create Pz-mock galaxy samples that approximately\nfollow the redshift errors in the Subaru HSC survey. We focus on galaxy\nstellar-mass thresholds ranging from $\\log\\left[M_*/(h^{-2}M_\\odot)\\right]$\nfrom $8.6$ to $11.2$ in steps of 0.2 dex within two redshift bins $0.30-0.55$\nand $0.55-0.80$. A comparison of the Pz-mock samples to true galaxy samples in\nUM shows a relatively mild sample contamination for thresholds with\n$\\log\\left[M_{*,\\rm limit}/(h^{-2}M_\\odot)\\right]<10.6$, while an increasing\ncontamination towards the more massive end. We show how such contamination\naffects the measured abundance and the lensing signal. A joint HOD modelling of\nthe observables from the Pz-mock compared to the truth in the UM informs the\nsystematic biases on the average halo masses of central galaxies in the HSC\nsurvey. Even with a reasonably conservative choice of photo-$z$ errors in\nPz-mock, we show that the inferred halo masses deduced from the HSC galaxies\nfor low-mass thresholds will have a systematic bias smaller than 0.05 dex.\nBeyond $\\log\\left[M_{*,\\rm limit}/(h^{-2}M_\\odot)\\right]=10.6$, the inferred\nhalo masses show an increasing systematic bias with stellar mass, reaching\nvalues of order $0.2$ dex, larger than the statistical error.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}