{"id":"2408.10871","title":"Radio U-Net: a convolutional neural network to detect diffuse radio\n  sources in galaxy clusters and beyond","authors":"Chiara Stuardi, Claudio Gheller, Franco Vazza and Andrea Botteon","authorsParsed":[["Stuardi","Chiara",""],["Gheller","Claudio",""],["Vazza","Franco",""],["Botteon","Andrea",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 14:03:21 GMT"}],"updateDate":"2024-08-21","timestamp":1724162601000,"abstract":"  The forthcoming generation of radio telescope arrays promises significant\nadvancements in sensitivity and resolution, enabling the identification and\ncharacterization of many new faint and diffuse radio sources. Conventional\nmanual cataloging methodologies are anticipated to be insufficient to exploit\nthe capabilities of new radio surveys. Radio interferometric images of diffuse\nsources present a challenge for image segmentation tasks due to noise,\nartifacts, and embedded radio sources. In response to these challenges, we\nintroduce Radio U-Net, a fully convolutional neural network based on the U-Net\narchitecture. Radio U-Net is designed to detect faint and extended sources in\nradio surveys, such as radio halos, relics, and cosmic web filaments. Radio\nU-Net was trained on synthetic radio observations built upon cosmological\nsimulations and then tested on a sample of galaxy clusters, where the detection\nof cluster diffuse radio sources relied on customized data reduction and visual\ninspection of LOFAR Two Metre Sky Survey (LoTSS) data. The 83% of clusters\nexhibiting diffuse radio emission were accurately identified, and the\nsegmentation successfully recovered the morphology of the sources even in\nlow-quality images. In a test sample comprising 246 galaxy clusters, we\nachieved a 73% accuracy rate in distinguishing between clusters with and\nwithout diffuse radio emission. Our results establish the applicability of\nRadio U-Net to extensive radio survey datasets, probing its efficiency on\ncutting-edge high-performance computing systems. This approach represents an\nadvancement in optimizing the exploitation of forthcoming large radio surveys\nfor scientific exploration.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Cosmology and Nongalactic Astrophysics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}