{"id":"2408.03069","title":"Probabilistic error analysis of limited-precision stochastic rounding","authors":"El-mehdi El Arar (TARAN), Massimiliano Fasi, Silviu-Ioan Filip\n  (TARAN), Mantas Mikaitis","authorsParsed":[["Arar","El-mehdi El","","TARAN"],["Fasi","Massimiliano","","TARAN"],["Filip","Silviu-Ioan","","TARAN"],["Mikaitis","Mantas",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 09:54:21 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 08:09:10 GMT"}],"updateDate":"2024-08-22","timestamp":1722938061000,"abstract":"  Classical probabilistic rounding error analysis is particularly well suited\nto stochastic rounding (SR), and it yields strong results when dealing with\nfloating-point algorithms that rely heavily on summation. For many numerical\nlinear algebra algorithms, one can prove probabilistic error bounds that grow\nas O(nu), where n is the problem size and u is the unit roundoff. These\nprobabilistic bounds are asymptotically tighter than the worst-case ones, which\ngrow as O(nu). For certain classes of algorithms, SR has been shown to be\nunbiased. However, all these results were derived under the assumption that SR\nis implemented exactly, which typically requires a number of random bits that\nis too large to be suitable for practical implementations. We investigate the\neffect of the number of random bits on the probabilistic rounding error\nanalysis of SR. To this end, we introduce a new rounding mode,\nlimited-precision SR. By taking into account the number r of random bits used,\nthis new rounding mode matches hardware implementations accurately, unlike the\nideal SR operator generally used in the literature. We show that this new\nrounding mode is biased and that the bias is a function of r. As r approaches\ninfinity, however, the bias disappears, and limited-precision SR converges to\nthe ideal, unbiased SR operator. We develop a novel model for probabilistic\nerror analysis of algorithms employing SR. Several numerical examples\ncorroborate our theoretical findings.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}