{"id":"2408.09825","title":"TDNetGen: Empowering Complex Network Resilience Prediction with\n  Generative Augmentation of Topology and Dynamics","authors":"Chang Liu, Jingtao Ding, Yiwen Song, Yong Li","authorsParsed":[["Liu","Chang",""],["Ding","Jingtao",""],["Song","Yiwen",""],["Li","Yong",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:20:31 GMT"}],"updateDate":"2024-08-20","timestamp":1724059231000,"abstract":"  Predicting the resilience of complex networks, which represents the ability\nto retain fundamental functionality amidst external perturbations or internal\nfailures, plays a critical role in understanding and improving real-world\ncomplex systems. Traditional theoretical approaches grounded in nonlinear\ndynamical systems rely on prior knowledge of network dynamics. On the other\nhand, data-driven approaches frequently encounter the challenge of insufficient\nlabeled data, a predicament commonly observed in real-world scenarios. In this\npaper, we introduce a novel resilience prediction framework for complex\nnetworks, designed to tackle this issue through generative data augmentation of\nnetwork topology and dynamics. The core idea is the strategic utilization of\nthe inherent joint distribution present in unlabeled network data, facilitating\nthe learning process of the resilience predictor by illuminating the\nrelationship between network topology and dynamics. Experiment results on three\nnetwork datasets demonstrate that our proposed framework TDNetGen can achieve\nhigh prediction accuracy up to 85%-95%. Furthermore, the framework still\ndemonstrates a pronounced augmentation capability in extreme low-data regimes,\nthereby underscoring its utility and robustness in enhancing the prediction of\nnetwork resilience. We have open-sourced our code in the following link,\nhttps://github.com/tsinghua-fib-lab/TDNetGen.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/"}