{"id":"2408.11381","title":"RAGLAB: A Modular and Research-Oriented Unified Framework for\n  Retrieval-Augmented Generation","authors":"Xuanwang Zhang, Yunze Song, Yidong Wang, Shuyun Tang, Xinfeng Li,\n  Zhengran Zeng, Zhen Wu, Wei Ye, Wenyuan Xu, Yue Zhang, Xinyu Dai, Shikun\n  Zhang, Qingsong Wen","authorsParsed":[["Zhang","Xuanwang",""],["Song","Yunze",""],["Wang","Yidong",""],["Tang","Shuyun",""],["Li","Xinfeng",""],["Zeng","Zhengran",""],["Wu","Zhen",""],["Ye","Wei",""],["Xu","Wenyuan",""],["Zhang","Yue",""],["Dai","Xinyu",""],["Zhang","Shikun",""],["Wen","Qingsong",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 07:20:48 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 11:18:16 GMT"}],"updateDate":"2024-09-10","timestamp":1724224848000,"abstract":"  Large Language Models (LLMs) demonstrate human-level capabilities in\ndialogue, reasoning, and knowledge retention. However, even the most advanced\nLLMs face challenges such as hallucinations and real-time updating of their\nknowledge. Current research addresses this bottleneck by equipping LLMs with\nexternal knowledge, a technique known as Retrieval Augmented Generation (RAG).\nHowever, two key issues constrained the development of RAG. First, there is a\ngrowing lack of comprehensive and fair comparisons between novel RAG\nalgorithms. Second, open-source tools such as LlamaIndex and LangChain employ\nhigh-level abstractions, which results in a lack of transparency and limits the\nability to develop novel algorithms and evaluation metrics. To close this gap,\nwe introduce RAGLAB, a modular and research-oriented open-source library.\nRAGLAB reproduces 6 existing algorithms and provides a comprehensive ecosystem\nfor investigating RAG algorithms. Leveraging RAGLAB, we conduct a fair\ncomparison of 6 RAG algorithms across 10 benchmarks. With RAGLAB, researchers\ncan efficiently compare the performance of various algorithms and develop novel\nalgorithms.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}