{"id":"2408.07484","title":"GRFormer: Grouped Residual Self-Attention for Lightweight Single Image\n  Super-Resolution","authors":"Yuzhen Li, Zehang Deng, Yuxin Cao, Lihua Liu","authorsParsed":[["Li","Yuzhen",""],["Deng","Zehang",""],["Cao","Yuxin",""],["Liu","Lihua",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 11:56:35 GMT"}],"updateDate":"2024-08-15","timestamp":1723636595000,"abstract":"  Previous works have shown that reducing parameter overhead and computations\nfor transformer-based single image super-resolution (SISR) models (e.g.,\nSwinIR) usually leads to a reduction of performance. In this paper, we present\nGRFormer, an efficient and lightweight method, which not only reduces the\nparameter overhead and computations, but also greatly improves performance. The\ncore of GRFormer is Grouped Residual Self-Attention (GRSA), which is\nspecifically oriented towards two fundamental components. Firstly, it\nintroduces a novel grouped residual layer (GRL) to replace the Query, Key,\nValue (QKV) linear layer in self-attention, aimed at efficiently reducing\nparameter overhead, computations, and performance loss at the same time.\nSecondly, it integrates a compact Exponential-Space Relative Position Bias\n(ES-RPB) as a substitute for the original relative position bias to improve the\nability to represent position information while further minimizing the\nparameter count. Extensive experimental results demonstrate that GRFormer\noutperforms state-of-the-art transformer-based methods for $\\times$2, $\\times$3\nand $\\times$4 SISR tasks, notably outperforming SOTA by a maximum PSNR of\n0.23dB when trained on the DIV2K dataset, while reducing the number of\nparameter and MACs by about \\textbf{60\\%} and \\textbf{49\\% } in only\nself-attention module respectively. We hope that our simple and effective\nmethod that can easily applied to SR models based on window-division\nself-attention can serve as a useful tool for further research in image\nsuper-resolution. The code is available at\n\\url{https://github.com/sisrformer/GRFormer}.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"0ptcE0d3bcmLSXvxlYqlX0DSP1LtVLz9R6yHVazW_2g","pdfSize":"3146249"}
