{"id":"2408.10679","title":"DemMamba: Alignment-free Raw Video Demoireing with Frequency-assisted\n  Spatio-Temporal Mamba","authors":"Shuning Xu, Xina Liu, Binbin Song, Xiangyu Chen, Qiubo Chen, Jiantao\n  Zhou","authorsParsed":[["Xu","Shuning",""],["Liu","Xina",""],["Song","Binbin",""],["Chen","Xiangyu",""],["Chen","Qiubo",""],["Zhou","Jiantao",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:31:03 GMT"}],"updateDate":"2024-08-21","timestamp":1724146263000,"abstract":"  Moire patterns arise when two similar repetitive patterns interfere, a\nphenomenon frequently observed during the capture of images or videos on\nscreens. The color, shape, and location of moire patterns may differ across\nvideo frames, posing a challenge in learning information from adjacent frames\nand preserving temporal consistency. Previous video demoireing methods heavily\nrely on well-designed alignment modules, resulting in substantial computational\nburdens. Recently, Mamba, an improved version of the State Space Model (SSM),\nhas demonstrated significant potential for modeling long-range dependencies\nwith linear complexity, enabling efficient temporal modeling in video\ndemoireing without requiring a specific alignment module. In this paper, we\npropose a novel alignment-free Raw video demoireing network with\nfrequency-assisted spatio-temporal Mamba (DemMamba). The Spatial Mamba Block\n(SMB) and Temporal Mamba Block (TMB) are sequentially arranged to facilitate\neffective intra- and inter-relationship modeling in Raw videos with moire\npatterns. Within SMB, an Adaptive Frequency Block (AFB) is introduced to aid\ndemoireing in the frequency domain. For TMB, a Channel Attention Block (CAB) is\nembedded to further enhance temporal information interactions by exploiting the\ninter-channel relationships among features. Extensive experiments demonstrate\nthat our proposed DemMamba surpasses state-of-the-art approaches by 1.3 dB and\ndelivers a superior visual experience.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}