{"id":"2408.12864","title":"FRB Line-of-sight Ionization Measurement From Lightcone AAOmega Mapping\n  Survey: the First Data Release","authors":"Yuxin Huang, Sunil Simha, Ilya Khrykin, Khee-Gan Lee, J. Xavier\n  Prochaska, Nicolas Tejos, Keith Bannister, Jason Barrios, John Chisholm, Jeff\n  Cooke, Adam Deller, Marcin Glowacki, Lachlan Marnoch, Ryan Shannon and Jielai\n  Zhang","authorsParsed":[["Huang","Yuxin",""],["Simha","Sunil",""],["Khrykin","Ilya",""],["Lee","Khee-Gan",""],["Prochaska","J. Xavier",""],["Tejos","Nicolas",""],["Bannister","Keith",""],["Barrios","Jason",""],["Chisholm","John",""],["Cooke","Jeff",""],["Deller","Adam",""],["Glowacki","Marcin",""],["Marnoch","Lachlan",""],["Shannon","Ryan",""],["Zhang","Jielai",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 06:33:28 GMT"}],"updateDate":"2024-08-26","timestamp":1724394808000,"abstract":"  This paper presents the first public data release (DR1) of the FRB\nLine-of-sight Ionization Measurement From Lightcone AAOmega Mapping (FLIMFLAM)\nSurvey, a wide field spectroscopic survey targeted on the fields of 10\nprecisely localized Fast Radio Bursts (FRBs). DR1 encompasses spectroscopic\ndata for 10,468 galaxy redshifts across 10 FRBs fields with z<0.4, covering\napproximately 26 deg^2 of the sky in total. FLIMFLAM is composed of several\nlayers, encompassing the `Wide' (covering ~ degree or >10 Mpc scales),\n`Narrow', (several-arcminute or ~ Mpc) and integral field unit (`IFU'; ~\narcminute or ~ 100 kpc ) components. The bulk of the data comprise spectroscopy\nfrom the 2dF-AAOmega on the 3.9-meter Anglo-Australian Telescope, while most of\nthe Narrow and IFU data was achieved using an ensemble of 8-10-meter class\ntelescopes. We summarize the information on our selected FRB fields, the\ncriteria for target selection, methodologies employed for data reduction,\nspectral analysis processes, and an overview of our data products. An\nevaluation of our data reveals an average spectroscopic completeness of 48.43%,\nwith over 80% of the observed targets having secure redshifts. Additionally, we\ndescribe our approach on generating angular masks and calculating the target\nselection functions, setting the stage for the impending reconstruction of the\nmatter density field.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VNRepQA2uauJ4lmbJ8FgCByxnur5JoSOTSX6nFOy2c4","pdfSize":"3087272"}
