{"id":"2408.07433","title":"MagicFace: Training-free Universal-Style Human Image Customized\n  Synthesis","authors":"Yibin Wang and Weizhong Zhang and Cheng Jin","authorsParsed":[["Wang","Yibin",""],["Zhang","Weizhong",""],["Jin","Cheng",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 10:08:46 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 15:00:39 GMT"},{"version":"v3","created":"Mon, 19 Aug 2024 14:43:24 GMT"}],"updateDate":"2024-08-20","timestamp":1723630126000,"abstract":"  Current state-of-the-art methods for human image customized synthesis\ntypically require tedious training on large-scale datasets. In such cases, they\nare prone to overfitting and struggle to personalize individuals of unseen\nstyles. Moreover, these methods extensively focus on single-concept human image\nsynthesis and lack the flexibility needed for customizing individuals with\nmultiple given concepts, thereby impeding their broader practical application.\nTo this end, we propose MagicFace, a novel training-free method for\nuniversal-style human image personalized synthesis, enabling multi-concept\ncustomization by accurately integrating reference concept features into their\nlatent generated region at the pixel level. Specifically, MagicFace introduces\na coarse-to-fine generation pipeline, involving two sequential stages: semantic\nlayout construction and concept feature injection. This is achieved by our\nReference-aware Self-Attention (RSA) and Region-grouped Blend Attention (RBA)\nmechanisms. In the first stage, RSA enables the latent image to query features\nfrom all reference concepts simultaneously, extracting the overall semantic\nunderstanding to facilitate the initial semantic layout establishment. In the\nsecond stage, we employ an attention-based semantic segmentation method to\npinpoint the latent generated regions of all concepts at each step. Following\nthis, RBA divides the pixels of the latent image into semantic groups, with\neach group querying fine-grained features from the corresponding reference\nconcept, which ensures precise attribute alignment and feature injection.\nThroughout the generation process, a weighted mask strategy is employed to\nensure the model focuses more on the reference concepts. Extensive experiments\ndemonstrate the superiority of MagicFace in both human-centric subject-to-image\nsynthesis and multi-concept human image customization.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}