{"id":"2408.05485","title":"Contrast, Imitate, Adapt: Learning Robotic Skills From Raw Human Videos","authors":"Zhifeng Qian and Mingyu You and Hongjun Zhou and Xuanhui Xu and Hao Fu\n  and Jinzhe Xue and Bin He","authorsParsed":[["Qian","Zhifeng",""],["You","Mingyu",""],["Zhou","Hongjun",""],["Xu","Xuanhui",""],["Fu","Hao",""],["Xue","Jinzhe",""],["He","Bin",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 08:27:43 GMT"}],"updateDate":"2024-08-13","timestamp":1723278463000,"abstract":"  Learning robotic skills from raw human videos remains a non-trivial\nchallenge. Previous works tackled this problem by leveraging behavior cloning\nor learning reward functions from videos. Despite their remarkable\nperformances, they may introduce several issues, such as the necessity for\nrobot actions, requirements for consistent viewpoints and similar layouts\nbetween human and robot videos, as well as low sample efficiency. To this end,\nour key insight is to learn task priors by contrasting videos and to learn\naction priors through imitating trajectories from videos, and to utilize the\ntask priors to guide trajectories to adapt to novel scenarios. We propose a\nthree-stage skill learning framework denoted as Contrast-Imitate-Adapt (CIA).\nAn interaction-aware alignment transformer is proposed to learn task priors by\ntemporally aligning video pairs. Then a trajectory generation model is used to\nlearn action priors. To adapt to novel scenarios different from human videos,\nthe Inversion-Interaction method is designed to initialize coarse trajectories\nand refine them by limited interaction. In addition, CIA introduces an\noptimization method based on semantic directions of trajectories for\ninteraction security and sample efficiency. The alignment distances computed by\nIAAformer are used as the rewards. We evaluate CIA in six real-world everyday\ntasks, and empirically demonstrate that CIA significantly outperforms previous\nstate-of-the-art works in terms of task success rate and generalization to\ndiverse novel scenarios layouts and object instances.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}