{"id":"2408.10349","title":"AIR: Analytic Imbalance Rectifier for Continual Learning","authors":"Di Fang and Yinan Zhu and Runze Fang and Cen Chen and Ziqian Zeng and\n  Huiping Zhuang","authorsParsed":[["Fang","Di",""],["Zhu","Yinan",""],["Fang","Runze",""],["Chen","Cen",""],["Zeng","Ziqian",""],["Zhuang","Huiping",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:42:00 GMT"}],"updateDate":"2024-08-21","timestamp":1724092920000,"abstract":"  Continual learning enables AI models to learn new data sequentially without\nretraining in real-world scenarios. Most existing methods assume the training\ndata are balanced, aiming to reduce the catastrophic forgetting problem that\nmodels tend to forget previously generated data. However, data imbalance and\nthe mixture of new and old data in real-world scenarios lead the model to\nignore categories with fewer training samples. To solve this problem, we\npropose an analytic imbalance rectifier algorithm (AIR), a novel online\nexemplar-free continual learning method with an analytic (i.e., closed-form)\nsolution for data-imbalanced class-incremental learning (CIL) and generalized\nCIL scenarios in real-world continual learning. AIR introduces an analytic\nre-weighting module (ARM) that calculates a re-weighting factor for each class\nfor the loss function to balance the contribution of each category to the\noverall loss and solve the problem of imbalanced training data. AIR uses the\nleast squares technique to give a non-discriminatory optimal classifier and its\niterative update method in continual learning. Experimental results on multiple\ndatasets show that AIR significantly outperforms existing methods in\nlong-tailed and generalized CIL scenarios. The source code is available at\nhttps://github.com/fang-d/AIR.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}