{"id":"2408.02207","title":"MARCO: A Memory-Augmented Reinforcement Framework for Combinatorial\n  Optimization","authors":"Andoni I. Garmendia, Quentin Cappart, Josu Ceberio, Alexander\n  Mendiburu","authorsParsed":[["Garmendia","Andoni I.",""],["Cappart","Quentin",""],["Ceberio","Josu",""],["Mendiburu","Alexander",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 03:15:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722827721000,"abstract":"  Neural Combinatorial Optimization (NCO) is an emerging domain where deep\nlearning techniques are employed to address combinatorial optimization problems\nas a standalone solver. Despite their potential, existing NCO methods often\nsuffer from inefficient search space exploration, frequently leading to local\noptima entrapment or redundant exploration of previously visited states. This\npaper introduces a versatile framework, referred to as Memory-Augmented\nReinforcement for Combinatorial Optimization (MARCO), that can be used to\nenhance both constructive and improvement methods in NCO through an innovative\nmemory module. MARCO stores data collected throughout the optimization\ntrajectory and retrieves contextually relevant information at each state. This\nway, the search is guided by two competing criteria: making the best decision\nin terms of the quality of the solution and avoiding revisiting already\nexplored solutions. This approach promotes a more efficient use of the\navailable optimization budget. Moreover, thanks to the parallel nature of NCO\nmodels, several search threads can run simultaneously, all sharing the same\nmemory module, enabling an efficient collaborative exploration. Empirical\nevaluations, carried out on the maximum cut, maximum independent set and\ntravelling salesman problems, reveal that the memory module effectively\nincreases the exploration, enabling the model to discover diverse,\nhigher-quality solutions. MARCO achieves good performance in a low\ncomputational cost, establishing a promising new direction in the field of NCO.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eDRXcT8IeCLLT8sgLoJc_Zc0NpZO3fkintM6mpAfoNc","pdfSize":"1390471","txDigest":"DyfbXgFJqPxXf5McZ4yLaYAR8jFVk27Xj7PXqnpJ7ob8","endEpoch":"1","status":"CERTIFIED"}
