{"id":"2408.09362","title":"Angle of Arrival Estimation with Transformer: A Sparse and Gridless\n  Method with Zero-Shot Capability","authors":"Zhaoxuan Zhu, Chulong Chen and Bo Yang","authorsParsed":[["Zhu","Zhaoxuan",""],["Chen","Chulong",""],["Yang","Bo",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 05:24:18 GMT"}],"updateDate":"2024-08-20","timestamp":1723958658000,"abstract":"  Automotive Multiple-Input Multiple-Output (MIMO) radars have gained\nsignificant traction in Advanced Driver Assistance Systems (ADAS) and\nAutonomous Vehicles (AV) due to their cost-effectiveness, resilience to\nchallenging operating conditions, and extended detection range. To fully\nleverage the advantages of MIMO radars, it is crucial to develop an Angle of\nArrival (AOA) algorithm that delivers high performance with reasonable\ncomputational workload. This work introduces AAETR (Angle of Arrival Estimation\nwith TRansformer) for high performance gridless AOA estimation. Comprehensive\nevaluations across various signal-to-noise ratios (SNRs) and multi-target\nscenarios demonstrate AAETR's superior performance compared to super resolution\nAOA algorithms such as Iterative Adaptive Approach (IAA). The proposed\narchitecture features efficient, scalable, sparse and gridless angle-finding\ncapability, overcoming the issues of high computational cost and straddling\nloss in SNR associated with grid-based IAA. AAETR requires fewer tunable\nhyper-parameters and is end-to-end trainable in a deep learning radar\nperception pipeline. When trained on large-scale simulated datasets then\nevaluated on real dataset, AAETR exhibits remarkable zero-shot sim-to-real\ntransferability and emergent sidelobe suppression capability. This highlights\nthe effectiveness of the proposed approach and its potential as a drop-in\nmodule in practical systems.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}