{"id":"2408.12489","title":"Scribbles for All: Benchmarking Scribble Supervised Segmentation Across\n  Datasets","authors":"Wolfgang Boettcher, Lukas Hoyer, Ozan Unal, Jan Eric Lenssen, Bernt\n  Schiele","authorsParsed":[["Boettcher","Wolfgang",""],["Hoyer","Lukas",""],["Unal","Ozan",""],["Lenssen","Jan Eric",""],["Schiele","Bernt",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:29:08 GMT"}],"updateDate":"2024-08-23","timestamp":1724340548000,"abstract":"  In this work, we introduce Scribbles for All, a label and training data\ngeneration algorithm for semantic segmentation trained on scribble labels.\nTraining or fine-tuning semantic segmentation models with weak supervision has\nbecome an important topic recently and was subject to significant advances in\nmodel quality. In this setting, scribbles are a promising label type to achieve\nhigh quality segmentation results while requiring a much lower annotation\neffort than usual pixel-wise dense semantic segmentation annotations. The main\nlimitation of scribbles as source for weak supervision is the lack of\nchallenging datasets for scribble segmentation, which hinders the development\nof novel methods and conclusive evaluations. To overcome this limitation,\nScribbles for All provides scribble labels for several popular segmentation\ndatasets and provides an algorithm to automatically generate scribble labels\nfor any dataset with dense annotations, paving the way for new insights and\nmodel advancements in the field of weakly supervised segmentation. In addition\nto providing datasets and algorithm, we evaluate state-of-the-art segmentation\nmodels on our datasets and show that models trained with our synthetic labels\nperform competitively with respect to models trained on manual labels. Thus,\nour datasets enable state-of-the-art research into methods for scribble-labeled\nsemantic segmentation. The datasets, scribble generation algorithm, and\nbaselines are publicly available at https://github.com/wbkit/Scribbles4All\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}