{"id":"2408.09343","title":"Large-Scale Pretraining and Finetuning for Efficient Jet Classification\n  in Particle Physics","authors":"Zihan Zhao, Farouk Mokhtar, Raghav Kansal, Haoyang Li, and Javier\n  Duarte","authorsParsed":[["Zhao","Zihan",""],["Mokhtar","Farouk",""],["Kansal","Raghav",""],["Li","Haoyang",""],["Duarte","Javier",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 03:31:21 GMT"}],"updateDate":"2024-08-20","timestamp":1723951881000,"abstract":"  This study introduces an innovative approach to analyzing unlabeled data in\nhigh-energy physics (HEP) through the application of self-supervised learning\n(SSL). Faced with the increasing computational cost of producing high-quality\nlabeled simulation samples at the CERN LHC, we propose leveraging large volumes\nof unlabeled data to overcome the limitations of supervised learning methods,\nwhich heavily rely on detailed labeled simulations. By pretraining models on\nthese vast, mostly untapped datasets, we aim to learn generic representations\nthat can be finetuned with smaller quantities of labeled data. Our methodology\nemploys contrastive learning with augmentations on jet datasets to teach the\nmodel to recognize common representations of jets, addressing the unique\nchallenges of LHC physics. Building on the groundwork laid by previous studies,\nour work demonstrates the critical ability of SSL to utilize large-scale\nunlabeled data effectively. We showcase the scalability and effectiveness of\nour models by gradually increasing the size of the pretraining dataset and\nassessing the resultant performance enhancements. Our results, obtained from\nexperiments on two datasets -- JetClass, representing unlabeled data, and Top\nTagging, serving as labeled simulation data -- show significant improvements in\ndata efficiency, computational efficiency, and overall performance. These\nfindings suggest that SSL can greatly enhance the adaptability of ML models to\nthe HEP domain. This work opens new avenues for the use of unlabeled data in\nHEP and contributes to a better understanding the potential of SSL for\nscientific discovery.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/Data Analysis, Statistics and Probability"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}