{"id":"2408.04105","title":"A Robust Clustering Scheme for Vehicular Communication Networks","authors":"Maryam Hosseini, Gunes Karabulut Kurt","authorsParsed":[["Hosseini","Maryam",""],["Kurt","Gunes Karabulut",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 21:45:29 GMT"}],"updateDate":"2024-08-09","timestamp":1723067129000,"abstract":"  Clustering, as a technique for grouping nodes in geographical proximity\ntogether, in vehicular communication networks, is a key technique to enhance\nnetwork robustness and scalability despite challenges such as mobility and\nrouting. This paper presents a robust clustering scheme based on cluster head\nbackup list algorithm for unmanned aerial vehicles (UAVs)-assisted vehicular\ncommunication network, where multiple UAVs act as communication base stations\nfor a vehicular network. To tackle the high mobility issues in vehicular\ncommunications, instead of allowing direct communication between all vehicles\nto the UAV, clustering methods will potentially be efficient in overcoming\ndelay limitations, excessive power consumption and resource issues. Using the\nclustering technique, neighboring vehicles are grouped into clusters with a\nspecific vehicle selected as the cluster head (CH) in each cluster. The\nselected CH connects directly to the UAV through an infrastructure-to-vehicle\n(I2V) link, subsequently establishing vehicle-to-vehicle (V2V) communications\nwith vehicles in the same cluster. To increase cluster connectivity period, the\nproposed clustering scheme is developed based on considering the vehicle\nbehavior for efficient selection of CHs and providing a CH backup list to\nmaintain the stability of the cluster structure. Numerical evaluations show\nthat the proposed system outperforms benchmark schemes in terms of clustering\nstability and reliability. It is also shown that the performance of the\nproposed scheme is not much affected by the increase in the number of vehicles.\nThis indicates that the proposed scheme can be efficient in dense vehicular\nnetworks where resource constraints pose significant challenges.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}