{"id":"2408.15808","title":"ODUSSEAS: Upgraded version with new reference scale and parameter\n  determinations for 82 planet-host M dwarf stars in SWEET-Cat","authors":"A. Antoniadis-Karnavas, S. G. Sousa, E. Delgado-Mena, N. C. Santos,\n  and D. T. Andreasen","authorsParsed":[["Antoniadis-Karnavas","A.",""],["Sousa","S. G.",""],["Delgado-Mena","E.",""],["Santos","N. C.",""],["Andreasen","D. T.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:07:18 GMT"}],"updateDate":"2024-08-29","timestamp":1724854038000,"abstract":"  Aims: Obtaining accurate derivations of stellar atmospheric parameters is\ncrucial in the fields of stellar and exoplanet characterization. We present the\nupgraded version of our computational tool ODUSSEAS with a new reference scale\napplied to derive $T_{\\mathrm{eff}}$ and [Fe/H] values for M dwarfs.\n  Methods: The new reference dataset of ODUSSEAS consists of $T_{\\mathrm{eff}}$\nvalues based on interferometry, and [Fe/H] values derived by applying updated\nvalues for the parallaxes. These reference parameters are related to the\npseudo-equivalent widths (EWs) of more than 4000 stellar absorption lines. The\nmachine learning Python \"scikit learn\" package creates models to determine the\nstellar parameters for subsequent analysis.\n  Results: We determined $T_{\\mathrm{eff}}$ and [Fe/H] values for 82\nplanet-host stars in SWEET-Cat. We demonstrate that our new version of ODUSSEAS\nis capable of determining the parameters with a greater accuracy than the\noriginal by comparing our results to other methods in literature. We also\ncompared our parameters for the same stars by measuring their spectra obtained\nfrom several instruments, showing the consistency of our determinations with\nstandard deviation of 30 K and 0.03 dex. Finally, we examined the correlation\namong planetary mass and stellar metallicity, confirming prior evidence\nindicating that massive planets mainly form around metal-rich stars in the case\nof M dwarfs as well.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}