{"id":"2408.16222","title":"Modeling magnetization reversal in multilayers with interlayer exchange\n  coupling","authors":"Elliot Wadge, Afan Terko, George Lertzman-Lepofsky, Paul Omelchenko,\n  Bret Heinrich, Manuel Rojas, Erol Girt","authorsParsed":[["Wadge","Elliot",""],["Terko","Afan",""],["Lertzman-Lepofsky","George",""],["Omelchenko","Paul",""],["Heinrich","Bret",""],["Rojas","Manuel",""],["Girt","Erol",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 02:37:44 GMT"},{"version":"v2","created":"Sat, 31 Aug 2024 02:20:52 GMT"}],"updateDate":"2024-09-04","timestamp":1724899064000,"abstract":"  Spin spirals form inside the magnetic layers of antiferromagnetic and\nnoncollinearly-coupled magnetic multilayers in the presence of an external\nmagnetic field. This spin structure can be modeled to extract the direct\nexchange stiffness of the magnetic layers and the strength of the interlayer\nexchange coupling across the spacer layer. In this article, we discuss three\nmodels to describe the evolution of the spin spiral with the strength of the\nexternal magnetic field in these coupled structures: discrete energy, discrete\ntorque, and continuous torque. These models are expanded to accommodate\nmultilayers with any number of ferromagnetic layers, any combination of\nmaterial parameters, and asymmetry. We compare their performance when fitting\nto the measured magnetization data of a range of sputtered samples with one or\nmultiple ferromagnetic layers on either side of the spacer. We find that the\ndiscrete models produce better fits than the continuous for asymmetric and\nmulti-ferromagnetic structures and exhibit much better computational scaling\nwith high numbers of atomic layers than the continuous model. For symmetric,\nsingle-layered structures, the continuous model produces the same fit\nstatistics and outperforms the discrete models. Lastly, we demonstrate the\nmethods by which one can use interfacial layers to measure the exchange\nstiffness of magnetic layers with low interlayer exchange coupling. An\nopen-access website has been provided to allow the fitting of magnetization as\na function of field in arbitrary coupled structures using the discrete energy\nmodel.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}