{"id":"2408.05005","title":"Meshfree Generalized Multiscale Exponential Integration Method for\n  Parabolic Problems","authors":"Djulustan Nikiforov, Leonardo A. Poveda, Dmitry Ammosov, Yesy\n  Sarmiento, Juan Galvis","authorsParsed":[["Nikiforov","Djulustan",""],["Poveda","Leonardo A.",""],["Ammosov","Dmitry",""],["Sarmiento","Yesy",""],["Galvis","Juan",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 11:35:44 GMT"}],"updateDate":"2024-08-12","timestamp":1723203344000,"abstract":"  This paper considers flow problems in multiscale heterogeneous porous media.\nThe multiscale nature of the modeled process significantly complicates\nnumerical simulations due to the need to compute huge and ill-conditioned\nsparse matrices, which negatively affect both the computational cost and the\nstability of the numerical solution. We propose a novel combined approach of\nthe meshfree Generalized Multiscale Finite Element Method (MFGMsFEM) and\nexponential time integration for solving such problems. MFGMsFEM provides a\nrobust and efficient spatial approximation, allowing us to consider complex\nheterogeneities without constructing a coarse computational grid. At the same\ntime, exponential integration, using the cost-effective MFGMsFEM matrix,\nprovides a robust temporal approximation for stiff multiscale problems,\nallowing larger time steps. For the proposed multiscale approach, we provide a\nrigorous convergence analysis, including the new analysis of the MFGMsFEM\nspatial approximation. We conduct numerical experiments to computationally\nverify the proposed approach by solving linear and semi-linear flow problems in\nmultiscale media. Numerical results demonstrate that the proposed multiscale\nmethod achieves significant reductions in computational cost and improved\nstability, even with larger time steps, confirming the theoretical analysis.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fk5A2RER_cubP8Lp0fImVu-bIekPc0bVzCCE89M2KL4","pdfSize":"1763823"}
