{"id":"2408.05966","title":"Freehand Sketch Generation from Mechanical Components","authors":"Zhichao Liao, Di Huang, Heming Fang, Yue Ma, Fengyuan Piao, Xinghui\n  Li, Long Zeng, Pingfa Feng","authorsParsed":[["Liao","Zhichao",""],["Huang","Di",""],["Fang","Heming",""],["Ma","Yue",""],["Piao","Fengyuan",""],["Li","Xinghui",""],["Zeng","Long",""],["Feng","Pingfa",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 07:44:19 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 10:28:18 GMT"}],"updateDate":"2024-08-22","timestamp":1723448659000,"abstract":"  Drawing freehand sketches of mechanical components on multimedia devices for\nAI-based engineering modeling has become a new trend. However, its development\nis being impeded because existing works cannot produce suitable sketches for\ndata-driven research. These works either generate sketches lacking a freehand\nstyle or utilize generative models not originally designed for this task\nresulting in poor effectiveness. To address this issue, we design a two-stage\ngenerative framework mimicking the human sketching behavior pattern, called\nMSFormer, which is the first time to produce humanoid freehand sketches\ntailored for mechanical components. The first stage employs Open CASCADE\ntechnology to obtain multi-view contour sketches from mechanical components,\nfiltering perturbing signals for the ensuing generation process. Meanwhile, we\ndesign a view selector to simulate viewpoint selection tasks during human\nsketching for picking out information-rich sketches. The second stage\ntranslates contour sketches into freehand sketches by a transformer-based\ngenerator. To retain essential modeling features as much as possible and\nrationalize stroke distribution, we introduce a novel edge-constraint stroke\ninitialization. Furthermore, we utilize a CLIP vision encoder and a new loss\nfunction incorporating the Hausdorff distance to enhance the generalizability\nand robustness of the model. Extensive experiments demonstrate that our\napproach achieves state-of-the-art performance for generating freehand sketches\nin the mechanical domain. Project page: https://mcfreeskegen.github.io .\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Graphics","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}