{"id":"2408.17037","title":"Computation of highly oscillatory integrals using a Fourier extension\n  approximation","authors":"Akash Anand, Damini Dhiman","authorsParsed":[["Anand","Akash",""],["Dhiman","Damini",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 06:14:07 GMT"}],"updateDate":"2024-09-02","timestamp":1724998447000,"abstract":"  The numerical evaluation of integrals of the form \\begin{align*}\n  \\int_a^b f(x) e^{ikg(x)}\\,dx \\end{align*} is an important problem in\nscientific computing with significant applications in many branches of applied\nmathematics, science and engineering. The numerical approximation of such\nintegrals using classical quadratures can be prohibitively expensive at high\noscillation frequency ($k \\gg 1$) as the number of quadrature points needed for\nachieving a reasonable accuracy must grow proportionally to $k$. To address\nthis significant computational challenge, starting with Filon in 1930, several\nspecialized quadratures have been developed to compute such oscillatory\nintegrals efficiently. A crucial element in such Filon-type quadrature is the\naccurate evaluation of certain moments which poses a significant challenge when\nnon-linear phase functions $g$ are involved. In this paper, we propose an\nequispaced-grid Filon-type quadrature for computing such highly oscillatory\nintegrals that utilizes a Fourier extension of the slowly varying envelope $f$.\nThis strategy is primarily aimed at significantly simplifying the moment\ncalculations, even when the phase function has stationary points. Moreover, the\nproposed approach can also handle certain integrable singularities in the\nintegrand. We analyze the scheme to theoretically establish high-order\nconvergence rates. We also include a wide variety of numerical experiments,\nincluding oscillatory integrals with algebraic and logarithmic singularities,\nto demonstrate the performance of the quadrature.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}