{"id":"2408.01981","title":"Multiview learning with twin parametric margin SVM","authors":"A. Quadir, M. Tanveer","authorsParsed":[["Quadir","A.",""],["Tanveer","M.",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 10:16:11 GMT"},{"version":"v2","created":"Sun, 11 Aug 2024 13:00:14 GMT"}],"updateDate":"2024-08-13","timestamp":1722766571000,"abstract":"  Multiview learning (MVL) seeks to leverage the benefits of diverse\nperspectives to complement each other, effectively extracting and utilizing the\nlatent information within the dataset. Several twin support vector\nmachine-based MVL (MvTSVM) models have been introduced and demonstrated\noutstanding performance in various learning tasks. However, MvTSVM-based models\nface significant challenges in the form of computational complexity due to four\nmatrix inversions, the need to reformulate optimization problems in order to\nemploy kernel-generated surfaces for handling non-linear cases, and the\nconstraint of uniform noise assumption in the training data. Particularly in\ncases where the data possesses a heteroscedastic error structure, these\nchallenges become even more pronounced. In view of the aforementioned\nchallenges, we propose multiview twin parametric margin support vector machine\n(MvTPMSVM). MvTPMSVM constructs parametric margin hyperplanes corresponding to\nboth classes, aiming to regulate and manage the impact of the heteroscedastic\nnoise structure existing within the data. The proposed MvTPMSVM model avoids\nthe explicit computation of matrix inversions in the dual formulation, leading\nto enhanced computational efficiency. We perform an extensive assessment of the\nMvTPMSVM model using benchmark datasets such as UCI, KEEL, synthetic, and\nAnimals with Attributes (AwA). Our experimental results, coupled with rigorous\nstatistical analyses, confirm the superior generalization capabilities of the\nproposed MvTPMSVM model compared to the baseline models. The source code of the\nproposed MvTPMSVM model is available at\n\\url{https://github.com/mtanveer1/MvTPMSVM}.\n","subjects":["Computing Research Repository/Machine Learning","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}