{"id":"2408.17140","title":"Filtering in Projection-based Integrators for Improved Phase\n  Characteristics","authors":"Hoang Chu, S.J.A.M van den Eijnden, M.F. Heertjes, W.P.M.H. Heemels","authorsParsed":[["Chu","Hoang",""],["Eijnden","S. J. A. M van den",""],["Heertjes","M. F.",""],["Heemels","W. P. M. H.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:29:05 GMT"}],"updateDate":"2024-09-02","timestamp":1725010145000,"abstract":"  Projection-based integrators are effectively employed in high-precision\nsystems with growing industrial success. By utilizing a projection operator,\nthe resulting projection-based integrator keeps its input-output pair within a\ndesignated sector set, leading to unique freedom in control design that can be\ndirectly translated into performance benefits. This paper aims to enhance\nprojection-based integrators by incorporating well-crafted linear filters into\nits structure, resulting in a new class of projected integrators that includes\nthe earlier ones, such as the hybrid-integrator gain systems (with and without\npre-filtering) as special cases. The extra design freedom in the form of two\nfilters in the input paths to the projection operator and the internal dynamics\nallows the controller to break away from the inherent limitations of the linear\ncontrol design. The enhanced performance properties of the proposed structure\nare formally demonstrated through a (quasi-linear) describing function\nanalysis, the absence of the gain-loss problem, and numerical case studies\nshowcasing improved time-domain properties. The describing function analysis is\nsupported by rigorously showing incremental properties of the new filtered\nprojection-based integrators thereby guaranteeing that the computed\nsteady-state responses are unique and asymptotically stable.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}