{"id":"2408.08878","title":"Knowledge Prompting: How Knowledge Engineers Use Large Language Models","authors":"Elisavet Koutsiana, Johanna Walker, Michelle Nwachukwu, Albert\n  Mero\\~no-Pe\\~nuela, Elena Simperl","authorsParsed":[["Koutsiana","Elisavet",""],["Walker","Johanna",""],["Nwachukwu","Michelle",""],["Meroño-Peñuela","Albert",""],["Simperl","Elena",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 17:42:03 GMT"}],"updateDate":"2024-08-20","timestamp":1722620523000,"abstract":"  Despite many advances in knowledge engineering (KE), challenges remain in\nareas such as engineering knowledge graphs (KGs) at scale, keeping up with\nevolving domain knowledge, multilingualism, and multimodality. Recently, KE has\nused LLMs to support semi-automatic tasks, but the most effective use of LLMs\nto support knowledge engineers across the KE activites is still in its infancy.\nTo explore the vision of LLM copilots for KE and change existing KE practices,\nwe conducted a multimethod study during a KE hackathon. We investigated\nparticipants' views on the use of LLMs, the challenges they face, the skills\nthey may need to integrate LLMs into their practices, and how they use LLMs\nresponsibly. We found participants felt LLMs could contribute to improving\nefficiency when engineering KGs, but presented increased challenges around the\nalready complex issues of evaluating the KE tasks. We discovered prompting to\nbe a useful but undervalued skill for knowledge engineers working with LLMs,\nand note that natural language processing skills may become more relevant\nacross more roles in KG construction. Integrating LLMs into KE tasks needs to\nbe mindful of potential risks and harms related to responsible AI. Given the\nlimited ethical training, most knowledge engineers receive solutions such as\nour suggested `KG cards' based on data cards could be a useful guide for KG\nconstruction. Our findings can support designers of KE AI copilots, KE\nresearchers, and practitioners using advanced AI to develop trustworthy\napplications, propose new methodologies for KE and operate new technologies\nresponsibly.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"VTz9z6rsYMvZJir7NUrTk9lzcRHjP7sYwpAjLHXmSsI","pdfSize":"783117"}
