{"id":"2408.15428","title":"HEAD: A Bandwidth-Efficient Cooperative Perception Approach for\n  Heterogeneous Connected and Autonomous Vehicles","authors":"Deyuan Qu, Qi Chen, Yongqi Zhu, Yihao Zhu, Sergei S. Avedisov, Song\n  Fu, Qing Yang","authorsParsed":[["Qu","Deyuan",""],["Chen","Qi",""],["Zhu","Yongqi",""],["Zhu","Yihao",""],["Avedisov","Sergei S.",""],["Fu","Song",""],["Yang","Qing",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 22:05:44 GMT"}],"updateDate":"2024-08-29","timestamp":1724796344000,"abstract":"  In cooperative perception studies, there is often a trade-off between\ncommunication bandwidth and perception performance. While current feature\nfusion solutions are known for their excellent object detection performance,\ntransmitting the entire sets of intermediate feature maps requires substantial\nbandwidth. Furthermore, these fusion approaches are typically limited to\nvehicles that use identical detection models. Our goal is to develop a solution\nthat supports cooperative perception across vehicles equipped with different\nmodalities of sensors. This method aims to deliver improved perception\nperformance compared to late fusion techniques, while achieving precision\nsimilar to the state-of-art intermediate fusion, but requires an order of\nmagnitude less bandwidth. We propose HEAD, a method that fuses features from\nthe classification and regression heads in 3D object detection networks. Our\nmethod is compatible with heterogeneous detection networks such as LiDAR\nPointPillars, SECOND, VoxelNet, and camera Bird's-eye View (BEV) Encoder. Given\nthe naturally smaller feature size in the detection heads, we design a\nself-attention mechanism to fuse the classification head and a complementary\nfeature fusion layer to fuse the regression head. Our experiments,\ncomprehensively evaluated on the V2V4Real and OPV2V datasets, demonstrate that\nHEAD is a fusion method that effectively balances communication bandwidth and\nperception performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}