{"id":"2408.17211","title":"Application-Driven Exascale: The JUPITER Benchmark Suite","authors":"Andreas Herten, Sebastian Achilles, Damian Alvarez, Jayesh Badwaik,\n  Eric Behle, Mathis Bode, Thomas Breuer, Daniel Caviedes-Voulli\\`eme, Mehdi\n  Cherti, Adel Dabah, Salem El Sayed, Wolfgang Frings, Ana Gonzalez-Nicolas,\n  Eric B. Gregory, Kaveh Haghighi Mood, Thorsten Hater, Jenia Jitsev, Chelsea\n  Maria John, Jan H. Meinke, Catrin I. Meyer, Pavel Mezentsev, Jan-Oliver\n  Mirus, Stepan Nassyr, Carolin Penke, Manoel R\\\"ommer, Ujjwal Sinha, Benedikt\n  von St. Vieth, Olaf Stein, Estela Suarez, Dennis Willsch, Ilya Zhukov","authorsParsed":[["Herten","Andreas",""],["Achilles","Sebastian",""],["Alvarez","Damian",""],["Badwaik","Jayesh",""],["Behle","Eric",""],["Bode","Mathis",""],["Breuer","Thomas",""],["Caviedes-Voullième","Daniel",""],["Cherti","Mehdi",""],["Dabah","Adel",""],["Sayed","Salem El",""],["Frings","Wolfgang",""],["Gonzalez-Nicolas","Ana",""],["Gregory","Eric B.",""],["Mood","Kaveh Haghighi",""],["Hater","Thorsten",""],["Jitsev","Jenia",""],["John","Chelsea Maria",""],["Meinke","Jan H.",""],["Meyer","Catrin I.",""],["Mezentsev","Pavel",""],["Mirus","Jan-Oliver",""],["Nassyr","Stepan",""],["Penke","Carolin",""],["Römmer","Manoel",""],["Sinha","Ujjwal",""],["Vieth","Benedikt von St.",""],["Stein","Olaf",""],["Suarez","Estela",""],["Willsch","Dennis",""],["Zhukov","Ilya",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 11:31:21 GMT"}],"updateDate":"2024-09-02","timestamp":1725017481000,"abstract":"  Benchmarks are essential in the design of modern HPC installations, as they\ndefine key aspects of system components. Beyond synthetic workloads, it is\ncrucial to include real applications that represent user requirements into\nbenchmark suites, to guarantee high usability and widespread adoption of a new\nsystem. Given the significant investments in leadership-class supercomputers of\nthe exascale era, this is even more important and necessitates alignment with a\nvision of Open Science and reproducibility. In this work, we present the\nJUPITER Benchmark Suite, which incorporates 16 applications from various\ndomains. It was designed for and used in the procurement of JUPITER, the first\nEuropean exascale supercomputer. We identify requirements and challenges and\noutline the project and software infrastructure setup. We provide descriptions\nand scalability studies of selected applications and a set of key takeaways.\nThe JUPITER Benchmark Suite is released as open source software with this work\nat https://github.com/FZJ-JSC/jubench.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Hardware Architecture","Computing Research Repository/Performance"],"license":"http://creativecommons.org/licenses/by/4.0/"}