{"id":"2408.08225","title":"Vortex Dynamics in Various Solar Magnetic Field Configurations","authors":"Arjun Kannan and Nitin Yadav","authorsParsed":[["Kannan","Arjun",""],["Yadav","Nitin",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 15:53:14 GMT"}],"updateDate":"2024-08-16","timestamp":1723737194000,"abstract":"  We investigate vortex dynamics in three magnetic regions, viz., Quiet Sun,\nWeak Plage, and Strong Plage, using realistic three-dimensional simulations\nfrom a comprehensive radiation-MHD code, MURaM. We find that the spatial\nextents and spatial distribution of vortices vary for different setups even\nthough the photospheric turbulence responsible for generating vortices has\nsimilar profiles for all three regions. We investigate kinetic and magnetic\nswirling strength and find them consistent with the Alfv\\'en wave propagation.\nUsing a flux tube expansion model and linear magnetohydrodynamics (MHD) wave\ntheory, we find that the deviation in kinetic swirling strength from the\ntheoretically expected value is the highest for the Strong Plage, least for the\nWeak Plage, and intermediate for the Quiet Sun at chromospheric heights. It\nsuggests that Weak Plage is the most favoured region for chromospheric swirls,\nthough they are of smaller spatial extents than in Quiet Sun. We also\nconjecture that vortex interactions within a single flux tube in Strong Plage\nlead to an energy cascade from larger to smaller vortices that further result\nin much lower values of kinetic swirling strength than other regions. Fourier\nspectra of horizontal magnetic fields at 1 Mm height also show the steep\ncascade from large to smaller scales for Strong Plage. These findings indicate\nthe potential of vortex-induced torsional Alfv\\'en waves to travel higher in\nthe atmosphere without damping for weaker magnetic regions such as the Quiet\nSun, whereas vortices would result in dissipation and heating due to the vortex\ninteractions in narrow flux tubes for the strongly magnetized regions such as\nStrong Plage.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"_LZgw_fBKAdnjStKqocsCNRvxYnm9-Ar3CAk8pM53ac","pdfSize":"15858994"}
