{"id":"2408.15940","title":"The NIRSpec Micro-Shutter Array: Operability and Operations After Two\n  Years of JWST Science","authors":"Katie Bechtold, Torsten B\\\"oker, David E. Franz, Maurice te Plate,\n  Timothy D. Rawle, Rai Wu, and Peter Zeidler","authorsParsed":[["Bechtold","Katie",""],["Böker","Torsten",""],["Franz","David E.",""],["Plate","Maurice te",""],["Rawle","Timothy D.",""],["Wu","Rai",""],["Zeidler","Peter",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:02:22 GMT"}],"updateDate":"2024-08-29","timestamp":1724864542000,"abstract":"  The Near Infrared Spectrograph (NIRSpec) on the James Webb Space Telescope\naffords the astronomical community an unprecedented space-based Multi-Object\nSpectroscopy (MOS) capability through the use of a programmable array of\nmicro-electro-mechanical shutters. Launched in December 2021 and commissioned\nalong with a suite of other observatory instruments throughout the first half\nof 2022, NIRSpec has been carrying out scientific observations since the\ncompletion of commissioning. These observations would not be possible without a\nrigorous program of engineering operations to actively monitor and maintain\nNIRSpec's hardware health and safety and enhance instrument efficiency and\nperformance. Although MOS is only one of the observing modes available to\nusers, the complexity and uniqueness of the Micro-Shutter Assembly (MSA) that\nenables it has presented a variety of engineering challenges, including the\nappearance of electrical shorts that produce contaminating glow in exposures.\nDespite these challenges, the NIRSpec Multi-Object Spectrograph continues to\nperform robustly with no discernible degradation or significant reduction in\ncapability.\n  This paper provides an overview of the NIRSpec micro-shutter subsystem's\nstate of health and operability and presents some of the developments that have\ntaken place in its operation since the completion of instrument commissioning.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"SCSArMz-gYnOb3eoXwFexZdfaqdR7OuOJ_D2ZcB_MdM","pdfSize":"18194651"}
