{"id":"2408.02563","title":"The effect of quantum decoherence on inflationary gravitational waves","authors":"Jessie de Kruijf, Nicola Bartolo","authorsParsed":[["de Kruijf","Jessie",""],["Bartolo","Nicola",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:39:51 GMT"}],"updateDate":"2024-08-12","timestamp":1722872391000,"abstract":"  The theory of inflation provides a mechanism to explain the structures we\nobserve today in the Universe, starting from quantum-mechanically generated\nfluctuations. However, this leaves the question of: how did the\nquantum-to-classical transition, occur? During inflation, tensor perturbations\ninteract (at least gravitationally) with other fields, meaning that we need to\nview these perturbations as an open system that interacts with an environment.\nIn this paper, the evolution of the system is described using a Lindblad\nequation, which describes the quantum decoherence of the system. This is a\npossible mechanism for explaining the quantum-to-classical transition. We show\nthat this quantum decoherence leads to a scale-dependent increase of the\ngravitational wave power spectrum, depending on the strength and time\ndependence of the interaction between the system and the environment. By using\ncurrent upper bounds on the gravitational wave power spectrum from inflation,\nobtained from CMB and the LIGO-Virgo-KAGRA constraints, we find an upper bound\non the interaction strength. Furthermore, we compute the decoherence criterion,\nwhich indicates the minimal interaction strength needed for a specific scale to\nhave successfully decohered by the end of inflation. Assuming that the CMB\nmodes have completely decohered, we indicate a lower bound on the interaction\nstrength. In addition, this decoherence criterion allows us to look at which\nscales might not have fully decohered and could still show some relic quantum\nsignatures. Lastly, we use sensitivity forecasts to study how future\ngravitational-wave detectors, such as LISA and ET, could constrain the\ndecoherence parameter space. Due to the scale-dependence of the power spectrum,\nLISA could only have a very small impact. However, ET will be able to\nsignificantly improve our current constraints for specific decoherence\nscenarios.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}