{"id":"2408.03083","title":"Statistical properties of filaments in the cosmic web","authors":"Youcai Zhang, Hong Guo, Xiaohu Yang, Peng Wang","authorsParsed":[["Zhang","Youcai",""],["Guo","Hong",""],["Yang","Xiaohu",""],["Wang","Peng",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 10:22:31 GMT"}],"updateDate":"2024-08-21","timestamp":1722939751000,"abstract":"  In the context of the cosmological and constrained ELUCID simulation, this\nstudy explores the statistical characteristics of filaments within the cosmic\nweb, focussing on aspects such as the distribution of filament lengths and\ntheir radial density profiles. Using the classification of the cosmic web\nenvironment through the Hessian matrix of the density field, our primary focus\nis on how cosmic structures react to the two variables $R_{\\rm s}$ and\n$\\lambda_{\\rm th}$. The findings show that the volume fractions of knots,\nfilaments, sheets, and voids are highly influenced by the threshold parameter\n$\\lambda_{\\rm th}$, with only a slight influence from the smoothing length\n$R_{\\rm s}$. The central axis of the cylindrical filament is pinpointed using\nthe medial-axis thinning algorithm of the COWS method. It is observed that\nmedian filament lengths tend to increase as the smoothing lengths increase.\nAnalysis of filament length functions at different values of $R_{\\rm s}$\nindicates a reduction in shorter filaments and an increase in longer filaments\nas $R_{\\rm s}$ increases, peaking around $2.5R_{\\rm s}$. The study also shows\nthat the radial density profiles of filaments are markedly affected by the\nparameters $R_{\\rm s}$ and $\\lambda_{\\rm th}$, showing a valley at\napproximately $2R_{\\rm s}$, with increases in the threshold leading to higher\namplitudes of the density profile. Moreover, shorter filaments tend to have\ndenser profiles than their longer counterparts.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}