{"id":"2408.10321","title":"Universal Freezing Transitions of Dipole-Conserving Chains","authors":"J. Classen-Howes and R. Senese and Abhishodh Prakash","authorsParsed":[["Classen-Howes","J.",""],["Senese","R.",""],["Prakash","Abhishodh",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 18:00:06 GMT"}],"updateDate":"2024-08-21","timestamp":1724090406000,"abstract":"  We argue for the existence of a universal phase diagram of $k$-local quantum\nchains subject to the conservation of a total charge and its dipole moment,\nwhich exhibits \"freezing\" transitions between strongly and weakly Hilbert space\nfragmented phases as charge filling $\\nu$ is varied. We show that these\ncontinuous phase transitions occur at a critical charge filling of\n$\\nu_c=(k-2)^{-1}$ independently of the on-site Hilbert space dimension $d$. To\nthis end, we analytically prove that for any $d$, any state for $\\nu<\\nu_c$\nhosts a finite density of sites belonging to \"blockages\": local regions across\nwhich transport of charge and dipole moment cannot occur. We prove that this\nimplies strong fragmentation of typical symmetry sectors into Krylov sectors\nthat each form an exponentially-vanishing fraction of the total sector. By\nstudying the distribution of blockages we analytically characterise how typical\nstates are subdivided into dynamically-disconnected local \"active bubbles\", and\nprove that typical states at these charge fillings exhibit area-law\nentanglement scaling, with rare \"inverse quantum many-body scar\" states\nfeaturing non-area-law scaling. We then numerically show that for $\\nu>\\nu_c$\nand arbitrary $d$, typical symmetry sectors are weakly fragmented, with their\ndominant Krylov sectors constituted of states that are free of blockages. We\nalso study the critical scaling of the dimensions of various Krylov sectors at\n$\\nu=\\nu_c$, as well as investigate the properties of certain special case\nmodels for which no phase transitions occur.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"oajAs0MzIT9G1fcR5eZaTvHCi2U0AX2YWg3qfI9oU0E","pdfSize":"1569641"}
