{"id":"2408.03723","title":"MS-Mapping: An Uncertainty-Aware Large-Scale Multi-Session LiDAR Mapping\n  System","authors":"Xiangcheng Hu, Jin Wu, Jianhao Jiao, Binqian Jiang, Wei Zhang, Wenshuo\n  Wang and Ping Tan","authorsParsed":[["Hu","Xiangcheng",""],["Wu","Jin",""],["Jiao","Jianhao",""],["Jiang","Binqian",""],["Zhang","Wei",""],["Wang","Wenshuo",""],["Tan","Ping",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 12:24:23 GMT"}],"updateDate":"2024-08-08","timestamp":1723033463000,"abstract":"  Large-scale multi-session LiDAR mapping is essential for a wide range of\napplications, including surveying, autonomous driving, crowdsourced mapping,\nand multi-agent navigation. However, existing approaches often struggle with\ndata redundancy, robustness, and accuracy in complex environments. To address\nthese challenges, we present MS-Mapping, an novel multi-session LiDAR mapping\nsystem that employs an incremental mapping scheme for robust and accurate map\nassembly in large-scale environments. Our approach introduces three key\ninnovations: 1) A distribution-aware keyframe selection method that captures\nthe subtle contributions of each point cloud frame to the map by analyzing the\nsimilarity of map distributions. This method effectively reduces data\nredundancy and pose graph size, while enhancing graph optimization speed; 2) An\nuncertainty model that automatically performs least-squares adjustments\naccording to the covariance matrix during graph optimization, improving mapping\nprecision, robustness, and flexibility without the need for scene-specific\nparameter tuning. This uncertainty model enables our system to monitor pose\nuncertainty and avoid ill-posed optimizations, thereby increasing adaptability\nto diverse and challenging environments. 3) To ensure fair evaluation, we\nredesign baseline comparisons and the evaluation benchmark. Direct assessment\nof map accuracy demonstrates the superiority of the proposed MS-Mapping\nalgorithm compared to state-of-the-art methods. In addition to employing public\ndatasets such as Urban-Nav, FusionPortable, and Newer College, we conducted\nextensive experiments on such a large \\SI{855}{m}$\\times$\\SI{636}{m} ground\ntruth map, collecting over \\SI{20}{km} of indoor and outdoor data across more\nthan ten sequences...\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"icOlxXnXwrhMW_PyupcXZgT5QWZVnI14HpqRd4dy_pI","pdfSize":"29134692"}
