{"id":"2408.15665","title":"Agricultural On-Demand Networks for 6G enabled by THz Communication","authors":"Daniel Lindenschmitt, Christoph Fischer, Simon Haussmann, Marc Kalter,\n  Ingmar Kallfass and Hans D. Schotten","authorsParsed":[["Lindenschmitt","Daniel",""],["Fischer","Christoph",""],["Haussmann","Simon",""],["Kalter","Marc",""],["Kallfass","Ingmar",""],["Schotten","Hans D.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 09:31:45 GMT"}],"updateDate":"2024-08-29","timestamp":1724837505000,"abstract":"  The transforming process in the scope of agriculture towards Smart\nAgriculture is an essential step to fulfill growing demands in respect to\nnourishment. Crucial challenges include establishing robust wireless\ncommunication in rural areas, enabling collaboration among agricultural\nmachines, and integrating artificial intelligence into farming practices.\nAddressing these challenges necessitates a consistent communication system,\nwith wireless communication emerging as a key enabler. Cellular technologies,\nas 5G and its successor 6G, can offer a comprehensive solution here. Leveraging\ntechnologies following the ITU-R M. 2160 recommendation like THz communication,\nlow-latency wireless AI, and embedded sensing, can provide a flexible and\nenergy-efficient infrastructure. This paper introduces on-demand networks based\non the OpenRAN approach and a 7.2 functional split. By implementing THz\nfront-hauling between components, a flexible application of 5G or future 6G\nnetworks can be realized. Experiments demonstrate that THz communication is\nsuitable for data transmission over the eCPRI interface, particularly in terms\nof data rate, thereby reducing the need for wired alternatives such as fiber\noptic cables. Furthermore, limitations such as limited range are discussed, and\npossible initial solutions are presented. The integration of the OpenRAN\nstandard further enhances flexibility, which is crucial in dynamic agricultural\nenvironments. This research contributes to the ongoing discourse on the\ntransformative potential of 6G-enabled wireless communication in shaping the\nfuture of smart agriculture.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}