{"id":"2408.13352","title":"QAdaPrune: Adaptive Parameter Pruning For Training Variational Quantum\n  Circuits","authors":"Ankit Kulshrestha, Xiaoyuan Liu, Hayato Ushijima-Mwesigwa, Bao Bach,\n  Ilya Safro","authorsParsed":[["Kulshrestha","Ankit",""],["Liu","Xiaoyuan",""],["Ushijima-Mwesigwa","Hayato",""],["Bach","Bao",""],["Safro","Ilya",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 19:57:40 GMT"}],"updateDate":"2024-08-27","timestamp":1724443060000,"abstract":"  In the present noisy intermediate scale quantum computing era, there is a\ncritical need to devise methods for the efficient implementation of gate-based\nvariational quantum circuits. This ensures that a range of proposed\napplications can be deployed on real quantum hardware. The efficiency of\nquantum circuit is desired both in the number of trainable gates and the depth\nof the overall circuit. The major concern of barren plateaus has made this need\nfor efficiency even more acute. The problem of efficient quantum circuit\nrealization has been extensively studied in the literature to reduce gate\ncomplexity and circuit depth. Another important approach is to design a method\nto reduce the \\emph{parameter complexity} in a variational quantum circuit.\nExisting methods include hyperparameter-based parameter pruning which\nintroduces an additional challenge of finding the best hyperparameters for\ndifferent applications. In this paper, we present \\emph{QAdaPrune} - an\nadaptive parameter pruning algorithm that automatically determines the\nthreshold and then intelligently prunes the redundant and non-performing\nparameters. We show that the resulting sparse parameter sets yield quantum\ncircuits that perform comparably to the unpruned quantum circuits and in some\ncases may enhance trainability of the circuits even if the original quantum\ncircuit gets stuck in a barren plateau.\\\\ \\noindent{\\bf Reproducibility}: The\nsource code and data are available at\n\\url{https://github.com/aicaffeinelife/QAdaPrune.git}\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"-hSJKD-zrLuwG29jwJr5eyuzEQFh6QJYIc1AHj37wP8","pdfSize":"842296"}
