{"id":"2408.08267","title":"Global Stellarator Coil Optimization with Quadratic Constraints and\n  Objectives","authors":"Lanke Fu, Elizabeth J. Paul, Alan A. Kaptanoglu, Amitava Bhattacharjee","authorsParsed":[["Fu","Lanke",""],["Paul","Elizabeth J.",""],["Kaptanoglu","Alan A.",""],["Bhattacharjee","Amitava",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:09:44 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 17:06:26 GMT"}],"updateDate":"2024-08-19","timestamp":1723741784000,"abstract":"  Most present stellarator designs are produced by costly two-stage\noptimization: the first for an optimized equilibrium, and the second for a coil\ndesign reproducing its magnetic configuration. Few proxies for coil complexity\nand forces exist at the equilibrium stage. Rapid initial state finding for both\nstages is a topic of active research. Most present convex coil optimization\ncodes use the least square winding surface method by Merkel (NESCOIL), with\nrecent improvement in conditioning, regularization , sparsity and physics\nobjectives. While elegant, the method is limited to modeling the norms of\nlinear functions in coil current. We present QUADCOIL, a fast, global coil\noptimization method that targets combinations of linear and quadratic functions\nof the current. It can directly constrain and/or minimize a wide range of\nphysics objectives unavailable in NESCOIL and REGCOIL, including the Lorentz\nforce, magnetic energy, curvature, field-current alignment, and the maximum\ndensity of a dipole array. QUADCOIL requires no initial guess and runs nearly\n$10^2\\times$ faster than filament optimization. Integrating it in the\nequilibrium optimization stage can potentially exclude equilibria with\ndifficult-to-design coils, without significantly increasing the computation\ntime per iteration. QUADCOIL finds the exact, global minimum in a large\nparameter space when possible, and otherwise finds a well-performing\napproximate global minimum. It supports most regularization techniques\ndeveloped for NESCOIL and REGCOIL. We demonstrate QUADCOIL's effectiveness in\ncoil topology control, minimizing non-convex penalties, and predicting filament\ncoil complexity with three numerical examples.\n","subjects":["Physics/Plasma Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g3gbE5wL6CHl4d9ElJPj1uBQtvpmFzs8rGAU3JoshpE","pdfSize":"10160296"}
