{"id":"2408.08391","title":"Flat-plane based double-counting free and parameter free many-body DFT+U","authors":"Andrew C. Burgess and David D. O'Regan","authorsParsed":[["Burgess","Andrew C.",""],["O'Regan","David D.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 19:22:18 GMT"}],"updateDate":"2024-08-19","timestamp":1723749738000,"abstract":"  Burgess et al. have recently introduced the BLOR corrective\nexchange-correlation functional that is, by construction, the unique simplified\nrotationally-invariant DFT+U functional that enforces the flat-plane condition\nseparately on each effective orbital of a localized subspace. Detached from the\nHubbard model, functionals of this type are both double-counting correction\nfree and, when optimized in situ using appropriate error quantifiers,\neffectively parameter free. In this work, the extension of the BLOR functional\nto address many-body errors (mBLOR) is derived. The mBLOR functional is built\nto enforce the flat-plane condition on the entire subspace, rather than on each\norbital individually. In this way inter-orbital errors are corrected on the\nsame footing as the single-particle ones. Focusing on exact test cases with\nstrong inter-orbital interactions, the BLOR and mBLOR functionals were\nbenchmarked against contemporary DFT+U functionals using the total energy\nextensivity condition on stretched homo-nuclear p-block dimers that represent\nvarious self-interaction and static-correlation error regimes. The BLOR\nfunctional outperformed all other DFT+$U$ functionals tested, which often act\nto increase total-energy errors, yet it still yielded large errors in some\nsystems. mBLOR instead yielded low energy errors across all four\nstrongly-correlated dimers, while being constructed using only semi-local\napproximation ingredients. As mBLOR would not otherwise introduce a band-gap\ncorrection in the manner that is a desirable feature of DFT+U, we developed a\ncost-free technique to reintroduce it automatically by moving the functional's\nunusual explicit derivative discontinuity into the potential. With this in\nplace, mBLOR is the only known DFT$+U$ functional that opens the bandgap of\nstretched neutral homo-nuclear dimers without the aid of unphysical\nspin-symmetry breaking.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Physics/Chemical Physics","Physics/Computational Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3Lxfo2TmiUj6Mi_CthY1c4oZ9u1q7utu3jXD2LnYxK8","pdfSize":"3045063"}
