{"id":"2408.14361","title":"Functional kinematic and kinetic requirements of the upper limb during\n  activities of daily living: a recommendation on necessary joint capabilities\n  for prosthetic arms","authors":"Christopher Herneth, Amartya Ganguly, and Sami Haddadin","authorsParsed":[["Herneth","Christopher",""],["Ganguly","Amartya",""],["Haddadin","Sami",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:35:44 GMT"}],"updateDate":"2024-08-27","timestamp":1724686544000,"abstract":"  Prosthetic limb abandonment remains an unsolved challenge as amputees\nconsistently reject their devices. Current prosthetic designs often fail to\nbalance human-like perfomance with acceptable device weight, highlighting the\nneed for optimised designs tailored to modern tasks. This study aims to provide\na comprehensive dataset of joint kinematics and kinetics essential for\nperforming activities of daily living (ADL), thereby informing the design of\nmore functional and user-friendly prosthetic devices. Functionally required\nRanges of Motion (ROM), velocities, and torques for the Glenohumeral\n(rotation), elbow, Radioulnar, and wrist joints were computed using motion\ncapture data from 12 subjects performing 24 ADLs. Our approach included the\ncomputation of joint torques for varying mass and inertia properties of the\nupper limb, while torques induced by the manipulation of experimental objects\nwere considered by their interaction wrench with the subjects hand. Joint\ntorques pertaining to individual ADL scaled linearly with limb and object mass\nand mass distribution, permitting their generalisation to not explicitly\nsimulated limb and object dynamics with linear regressors (LRM), exhibiting\ncoefficients of determination R = 0.99 pm 0.01. Exemplifying an application of\ndata-driven prosthesis design, we optimise wrist axes orientations for two\nserial and two differential joint configurations. Optimised axes reduced peak\npower requirements, between 22 to 38 percent compared to anatomical\nconfigurations, by exploiting high torque correlations between Ulnar deviation\nand wrist flexion/extension joints. This study offers critical insights into\nthe functional requirements of upper limb prostheses, providing a valuable\nfoundation for data-driven prosthetic design that addresses key user concerns\nand enhances device adoption.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"TgJBgSwbWTVoktFV2Rm_9oISDX72zX7cSD6p36HrOTE","pdfSize":"5166622"}
