{"id":"2408.02114","title":"Recent Advances in Multi-Choice Machine Reading Comprehension: A Survey\n  on Methods and Datasets","authors":"Shima Foolad, Kourosh Kiani, Razieh Rastgoo","authorsParsed":[["Foolad","Shima",""],["Kiani","Kourosh",""],["Rastgoo","Razieh",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 18:57:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722797841000,"abstract":"  This paper provides a thorough examination of recent developments in the\nfield of multi-choice Machine Reading Comprehension (MRC). Focused on benchmark\ndatasets, methodologies, challenges, and future trajectories, our goal is to\noffer researchers a comprehensive overview of the current landscape in\nmulti-choice MRC. The analysis delves into 30 existing cloze-style and\nmultiple-choice MRC benchmark datasets, employing a refined classification\nmethod based on attributes such as corpus style, domain, complexity, context\nstyle, question style, and answer style. This classification system enhances\nour understanding of each dataset's diverse attributes and categorizes them\nbased on their complexity. Furthermore, the paper categorizes recent\nmethodologies into Fine-tuned and Prompt-tuned methods. Fine-tuned methods\ninvolve adapting pre-trained language models (PLMs) to a specific task through\nretraining on domain-specific datasets, while prompt-tuned methods use prompts\nto guide PLM response generation, presenting potential applications in\nzero-shot or few-shot learning scenarios. By contributing to ongoing\ndiscussions, inspiring future research directions, and fostering innovations,\nthis paper aims to propel multi-choice MRC towards new frontiers of\nachievement.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"mw-wsjWewwJ-PsiW9zhnsfhgfIxABRMdgOqgH_Uw_bk","pdfSize":"1765014","txDigest":"35ob9U7cBpxUbhFE5iBAZLgbw9MwYFnWYuPMnMZXqnuz","endEpoch":"1","status":"CERTIFIED"}
