{"id":"2408.01621","title":"Managing Human-Centric Software Defects: Insights from GitHub and\n  Practitioners' Perspectives","authors":"Vedant Chauhan, Chetan Arora, Hourieh Khalajzadeh, John Grundy","authorsParsed":[["Chauhan","Vedant",""],["Arora","Chetan",""],["Khalajzadeh","Hourieh",""],["Grundy","John",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 01:08:38 GMT"}],"updateDate":"2024-08-06","timestamp":1722647318000,"abstract":"  Context: Human-centric defects (HCDs) are nuanced and subjective defects that\noften occur due to end-user perceptions or differences, such as their genders,\nages, cultures, languages, disabilities, socioeconomic status, and educational\nbackgrounds. Development teams have a limited understanding of these issues,\nwhich leads to the neglect of these defects. Defect reporting tools do not\nadequately handle the capture and fixing of HCDs.\n  Objective: This research aims to understand the current defect reporting\nprocess and tools for managing defects. Our study aims to capture process flaws\nand create a preliminary defect categorisation and practices of a\ndefect-reporting tool that can improve the reporting and fixing of HCDs in\nsoftware engineering.\n  Method: We first manually classified 1,100 open-source issues from the GitHub\ndefect reporting tool to identify human-centric defects and to understand the\ncategories of such reported defects. We then interviewed software engineering\npractitioners to elicit feedback on our findings from the GitHub defects\nanalysis and gauge their knowledge and experience of the defect-reporting\nprocess and tools for managing human-centric defects.\n  Results: We identified 176 HCDs from 1,100 open-source issues across six\ndomains: IT-Healthcare, IT-Web, IT-Spatial, IT-Manufacturing, IT-Finance, and\nIT-Gaming. Additionally, we interviewed 15 software practitioners to identify\nshortcomings in the current defect reporting process and determine practices\nfor addressing these weaknesses.\n  Conclusion: HCDs present in open-source repositories are fairly technical,\nand due to the lack of awareness and improper defect reports, they present a\nmajor challenge to software practitioners. However, the management of HCDs can\nbe enhanced by implementing the practices for an ideal defect reporting tool\ndeveloped as part of this study.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"INbRy3hSSqAbMzzcaxzGdDwLxgQND-DwkMGm_Y7oq40","pdfSize":"1564157","txDigest":"CRgnYqpxLVZbFHuwmkJ2GUTg9pmfZ4zAahv3L4XdkuKb","endEpoch":"1","status":"CERTIFIED"}
