{"id":"2408.06033","title":"Continuum and molecular emission from the inner regions of the symbiotic\n  system R Aquarii","authors":"M. G\\'omez-Garrido, V. Bujarrabal, J. Alcolea, A. Castro-Carrizo, J.\n  Miko{\\l}ajewska, M. Santander-Garc\\'ia","authorsParsed":[["Gómez-Garrido","M.",""],["Bujarrabal","V.",""],["Alcolea","J.",""],["Castro-Carrizo","A.",""],["Mikołajewska","J.",""],["Santander-García","M.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:51:52 GMT"}],"updateDate":"2024-08-13","timestamp":1723456312000,"abstract":"  Symbiotic systems often include an asymptotic giant branch (AGB) star and a\nhot compact companion, such as a white dwarf, that are in close interaction.\nDue to the intense ultraviolet emission from the hot companion, the molecular\ncontent of circumstellar envelopes in the symbiotic systems is poor. As a\nresult, the less abundant molecules have not been previously studied in detail\nin this kind of object. R Aqr is the closest and best-studied symbiotic system.\nWe obtain the spatial distribution of the recombination line H30{\\alpha} with a\nhigh and moderate angular resolution, and it is compared with the emission of\nthe continuum at 1.3 mm. High-resolution maps of several molecules are also\nobtained in the three observed ALMA bands. We study the molecular emissions\nusing a simplified model to explain the brightness distributions seen in the\ncentral position of our maps. We find that the low-resolution continuum map at\n1.3mm shows the emission of the radio photosphere of the AGB star, its\nsurroundings, and the structure of the bipolar jet launched by the companion.\nThe high-resolution continuum map at 1.3mm shows the innermost part of the jet,\nprobably revealing the position of the secondary, and suggests mass transfer\nfrom the AGB star to the white dwarf. The brightness distribution of\nH30{\\alpha} is similar but not coincident with the continuum emission. The\nbrightness distributions of the studied molecular lines show a variety of\nshapes. The emissions of the abundant molecules, CO and SiO, are relatively\nextended since they can survive far from the AGB star in spite of the intense\nultraviolet emission from the white dwarf. On the contrary, less abundant\nmolecules only survive in regions close to the AGB star, where shielding is\nstronger. From our best-fit model for these weak species, we find that these\nless abundant species are confined to the intra-orbital regions.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}