{"id":"2408.00133","title":"Ergotropy and Capacity Optimization in Heisenberg Spin Chain Quantum\n  Batteries","authors":"Asad Ali, Saif Al-Kuwari, M. I. Hussain, Tim Byrnes, M. T. Rahim,\n  James Q. Quach, Mehrdad Ghominejad, Saeed Haddadi","authorsParsed":[["Ali","Asad",""],["Al-Kuwari","Saif",""],["Hussain","M. I.",""],["Byrnes","Tim",""],["Rahim","M. T.",""],["Quach","James Q.",""],["Ghominejad","Mehrdad",""],["Haddadi","Saeed",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:48:23 GMT"}],"updateDate":"2024-08-02","timestamp":1722455303000,"abstract":"  This study examines the performance of finite spin quantum batteries (QBs)\nusing Heisenberg spin models with Dzyaloshinsky-Moriya (DM) and\nKaplan--Shekhtman--Entin-Wohlman--Aharony (KSEA) interactions. The QBs are\nmodeled as interacting quantum spins in local inhomogeneous magnetic fields,\ninducing variable Zeeman splitting. We derive analytical expressions for the\nmaximal extractable work, ergotropy and the capacity of QBs, as recently\nexamined by Yang et al. [Phys. Rev. Lett. 131, 030402 (2023)]. These quantities\nare analytically linked through certain quantum correlations, as posited in the\naforementioned study. Different Heisenberg spin chain models exhibit distinct\nbehaviors under varying conditions, emphasizing the importance of model\nselection for optimizing QB performance. In antiferromagnetic (AFM) systems,\nmaximum ergotropy occurs with a Zeeman splitting field applied to either spin,\nwhile ferromagnetic (FM) systems benefit from a uniform Zeeman field.\nTemperature significantly impacts QB performance, with ergotropy in the AFM\ncase being generally more robust against temperature increases compared to the\nFM case. Incorporating DM and KSEA couplings can significantly enhance the\ncapacity and ergotropy extraction of QBs. However, there exists a threshold\nbeyond which additional increases in these interactions cause a sharp decline\nin capacity and ergotropy. This behavior is influenced by temperature and\nquantum coherence, which signal the occurrence of a sudden phase transition.\nThe resource theory of quantum coherence proposed by Baumgratz et al. [Phys.\nRev. Lett. 113, 140401 (2014)] plays a crucial role in enhancing ergotropy and\ncapacity. However, ergotropy is limited by both the system's capacity and the\namount of coherence. These findings support the theoretical framework of\nspin-based QBs and may benefit future research on quantum energy storage\ndevices.\n","subjects":["Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tNxSB-1q9rT2S7lhYVHi40aulTxB0frtvYnuMzsm2Yg","pdfSize":"3746996"}
