{"id":"2408.01052","title":"Enhancing the MILP/MIQCP-based Automatic Search for Differential-Linear\n  Distinguishers of Simon-Like Ciphers","authors":"Siwei Chen and Zejun Xiang and Xiangyong Zeng and Guangxue Qin","authorsParsed":[["Chen","Siwei",""],["Xiang","Zejun",""],["Zeng","Xiangyong",""],["Qin","Guangxue",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 06:59:03 GMT"}],"updateDate":"2024-08-05","timestamp":1722581943000,"abstract":"  In this paper, we propose an improved method based on Mixed-Integer Linear\nProgramming/Mixed-Integer Quadratic Constraint Programming (MILP/MIQCP) to\nautomatically find better differential-linear (DL) distinguishers for the all\nmembers of Simon and Simeck block cipher families. To be specific, we first\ngive the completely precise MILP model to describe the linear part, and explain\nhow to utilize the general expressions of \\textsf{Gurobi} solver to model the\npropagation of continuous difference for the middle part in a quite easy way.\nSecondly, in order to solve the MILP/MIQCP model in a reasonable time, we\npropose two heuristic strategies based on the divide-and-conquer idea to speed\nup the search process. Thirdly, we introduce the transforming technique, which\nexploits the clustering effect on DL trails, to improve the estimated\ncorrelation of the DL approximation.\n  We apply our method to Simon and Simeck block cipher families. Consequently,\nwe find the 14/17/21/26-round theoretical DL distinguishers of\nSimon32/48/64/96, which extend the previous longest ones of Simon32/48/96 by\none round and Simon64 by two rounds, respectively. For Simeck, we do not\nexplore longer distinguishers compared to the currently best results, but\nrefresh all the results of Zhou et al. (the first work to automate finding DL\ndistinguishers for Simon-like ciphers using MILP/MIQCP). Besides, in order to\nvalidate the correctness of these distinguishers, the experimental\nverifications are conducted on Simon32/Simeck32 and Simon48/Simeck48. The\nresults show that our theoretical estimations on correlations are very close to\nthe experimental ones, which can be regarded as a concrete support for the\neffectiveness of our method.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}