{"id":"2408.14063","title":"Bridging the gap between Learning-to-plan, Motion Primitives and Safe\n  Reinforcement Learning","authors":"Piotr Kicki, Davide Tateo, Puze Liu, Jonas Guenster, Jan Peters,\n  Krzysztof Walas","authorsParsed":[["Kicki","Piotr",""],["Tateo","Davide",""],["Liu","Puze",""],["Guenster","Jonas",""],["Peters","Jan",""],["Walas","Krzysztof",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 07:44:53 GMT"}],"updateDate":"2024-08-27","timestamp":1724658293000,"abstract":"  Trajectory planning under kinodynamic constraints is fundamental for advanced\nrobotics applications that require dexterous, reactive, and rapid skills in\ncomplex environments. These constraints, which may represent task, safety, or\nactuator limitations, are essential for ensuring the proper functioning of\nrobotic platforms and preventing unexpected behaviors. Recent advances in\nkinodynamic planning demonstrate that learning-to-plan techniques can generate\ncomplex and reactive motions under intricate constraints. However, these\ntechniques necessitate the analytical modeling of both the robot and the entire\ntask, a limiting assumption when systems are extremely complex or when\nconstructing accurate task models is prohibitive. This paper addresses this\nlimitation by combining learning-to-plan methods with reinforcement learning,\nresulting in a novel integration of black-box learning of motion primitives and\noptimization. We evaluate our approach against state-of-the-art safe\nreinforcement learning methods, showing that our technique, particularly when\nexploiting task structure, outperforms baseline methods in challenging\nscenarios such as planning to hit in robot air hockey. This work demonstrates\nthe potential of our integrated approach to enhance the performance and safety\nof robots operating under complex kinodynamic constraints.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"U3JrryoerAt679fa7ReOR1OgcPgHDUWIMLfHQMxnVIg","pdfSize":"6702970"}
