{"id":"2408.15643","title":"RIDE: Boosting 3D Object Detection for LiDAR Point Clouds via\n  Rotation-Invariant Analysis","authors":"Zhaoxuan Wang, Xu Han, Hongxin Liu, Xianzhi Li","authorsParsed":[["Wang","Zhaoxuan",""],["Han","Xu",""],["Liu","Hongxin",""],["Li","Xianzhi",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 08:53:33 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 03:47:04 GMT"}],"updateDate":"2024-08-30","timestamp":1724835213000,"abstract":"  The rotation robustness property has drawn much attention to point cloud\nanalysis, whereas it still poses a critical challenge in 3D object detection.\nWhen subjected to arbitrary rotation, most existing detectors fail to produce\nexpected outputs due to the poor rotation robustness. In this paper, we present\nRIDE, a pioneering exploration of Rotation-Invariance for the 3D\nLiDAR-point-based object DEtector, with the key idea of designing\nrotation-invariant features from LiDAR scenes and then effectively\nincorporating them into existing 3D detectors. Specifically, we design a\nbi-feature extractor that extracts (i) object-aware features though sensitive\nto rotation but preserve geometry well, and (ii) rotation-invariant features,\nwhich lose geometric information to a certain extent but are robust to\nrotation. These two kinds of features complement each other to decode 3D\nproposals that are robust to arbitrary rotations. Particularly, our RIDE is\ncompatible and easy to plug into the existing one-stage and two-stage 3D\ndetectors, and boosts both detection performance and rotation robustness.\nExtensive experiments on the standard benchmarks showcase that the mean average\nprecision (mAP) and rotation robustness can be significantly boosted by\nintegrating with our RIDE, with +5.6% mAP and 53% rotation robustness\nimprovement on KITTI, +5.1% and 28% improvement correspondingly on nuScenes.\nThe code will be available soon.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}