{"id":"2408.16968","title":"On the Cosmic Variance of the Merger Rate Density of Binary Neutron\n  Stars","authors":"Zhiwei Chen, Youjun Lu, Jie Wang, Zhen Jiang, Qingbo Chu, Xianghao Ma","authorsParsed":[["Chen","Zhiwei",""],["Lu","Youjun",""],["Wang","Jie",""],["Jiang","Zhen",""],["Chu","Qingbo",""],["Ma","Xianghao",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 02:03:10 GMT"}],"updateDate":"2024-09-02","timestamp":1724983390000,"abstract":"  The cosmic variance on the star formation history may lead to bias to the\nmerger rate density estimation of binary neutron star (BNS) mergers by the\ncompact binary population synthesis. In this paper, we take the advantage of\nthe large boxsize of the Millennium Simulation combined with the semi-analytic\ngalaxy formation model GABE, and the parameterized population binary star\nevolution (BSE) model to examine how much effect will the cosmic variance\nintroduce on the estimation of merger rate density of BNS mergers. We find that\nfor sub-box size of $100\\rm Mpc$ and $200\\rm Mpc$, the variance of merger rate\ndensity $\\sigma_{\\rm R}/\\rm R$ at different redshift is about $23\\%-35\\%$ and\n$13\\%-20\\%$ respectively. On one hand, as for the variance of the detection\nrate on BNS mergers with current LIGO-Virgo-KAGRA (LVK) detector network, this\nvalue is very small $\\lesssim 10\\%$, which indicates ignoring the cosmic\nvariance is reasonable for estimating the merger rate density from current LVK\nobservation. On the other hand, with next-generation gravitational wave\ndetectors, it is possible to localize BNS mergers within sub-boxes possessing\nlength of $\\rm 40 Mpc$ for source redshift $z_{s}<0.2$. In such a small box,\nthe cosmic variance of the merger rate density is significant, i.e., the value\nof $\\sigma_{\\rm R}/\\rm R$ is about $\\sim 55\\%$. This hints that estimating the\nmerger rate density of BNS in different sky areas may provide useful\ninformation on the cosmic variance.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}