{"id":"2408.14366","title":"IQ-aware precoding for atomic MIMO receivers","authors":"Mingyao Cui, Qunsong Zeng, Kaibin Huang","authorsParsed":[["Cui","Mingyao",""],["Zeng","Qunsong",""],["Huang","Kaibin",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 15:37:14 GMT"}],"updateDate":"2024-08-27","timestamp":1724686634000,"abstract":"  Leveraging the strong atom-light interaction, Rydberg atomic receivers\nsignificantly enhance the sensitivity of electromagnetic signal measurements,\noutperforming traditional antennas. Existing research primarily focuses on\nimproving the architecture and signal detection algorithms of atomic receivers,\nwhile established signal processing schemes at the transmitter end have\nremained constant. However, these schemes fail to maximize the throughput of\natomic receivers due to the nonlinearity of transmission model. To address this\nissue, we propose to design transmitter precoding in multiple-input\nmultiple-output systems to achieve the capacity of atomic receivers. Initially,\nwe harness a strong reference approximation to convert the nonlinear\nmagnitude-detection model of atomic receivers into a linear real-part detector.\nBased on this approximation, we prove that the degree of freedom is\nmin{Nr/2,Nt} for a MIMO system comprising an Nr-antenna atomic receiver and an\nNt-antenna classic transmitter. To achieve the system capacity, we propose an\nIQ-aware fully digital precoding method. Unlike traditional complex-valued\ndigital precoders that jointly manipulate the inphase and quadrature (IQ)\nsymbols, our method employs four real matrices to independently precode the IQ\nbaseband symbols, which is shown to be optimal for atomic receivers. Then, to\neliminate the reliance on fully digital precoding architecture, we further\nexplore IQ-aware hybrid precoding techniques. Our design incorporates a\nlow-dimensional IQ-aware digital precoder and a high-dimensional complex analog\nprecoder. Alternating minimization algorithms are proposed to produce IQ-aware\nhybrid precoders, with the objective of approaching the optimal IQ-aware fully\ndigital precoder. Simulation results validate the superiority of proposed\nIQ-aware precoding methods over existing techniques in atomic MIMO\ncommunications.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}