{"id":"2408.09371","title":"Detecting the Undetectable: Combining Kolmogorov-Arnold Networks and MLP\n  for AI-Generated Image Detection","authors":"Taharim Rahman Anon, Jakaria Islam Emon","authorsParsed":[["Anon","Taharim Rahman",""],["Emon","Jakaria Islam",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 06:00:36 GMT"}],"updateDate":"2024-08-20","timestamp":1723960836000,"abstract":"  As artificial intelligence progresses, the task of distinguishing between\nreal and AI-generated images is increasingly complicated by sophisticated\ngenerative models. This paper presents a novel detection framework adept at\nrobustly identifying images produced by cutting-edge generative AI models, such\nas DALL-E 3, MidJourney, and Stable Diffusion 3. We introduce a comprehensive\ndataset, tailored to include images from these advanced generators, which\nserves as the foundation for extensive evaluation. we propose a classification\nsystem that integrates semantic image embeddings with a traditional Multilayer\nPerceptron (MLP). This baseline system is designed to effectively differentiate\nbetween real and AI-generated images under various challenging conditions.\nEnhancing this approach, we introduce a hybrid architecture that combines\nKolmogorov-Arnold Networks (KAN) with the MLP. This hybrid model leverages the\nadaptive, high-resolution feature transformation capabilities of KAN, enabling\nour system to capture and analyze complex patterns in AI-generated images that\nare typically overlooked by conventional models. In out-of-distribution\ntesting, our proposed model consistently outperformed the standard MLP across\nthree out of distribution test datasets, demonstrating superior performance and\nrobustness in classifying real images from AI-generated images with impressive\nF1 scores.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"58OZtVRffjKEj7OrX8mjtywfyyS6vrlqjhIv0dZ2ICM","pdfSize":"3616632"}
