{"id":"2408.10719","title":"Development of a Nb-based semiconductor-superconductor hybrid platform","authors":"Sjoerd Telkamp, Tommaso Antonelli, Clemens Todt, Manuel Hinderling,\n  Marco Coraiola, Daniel Haxell, Sofieke C. ten Kate, Deividas Sabonis, Peng\n  Zeng, R\\\"udiger Schott, Erik Cheah, Christian Reichl, Fabrizio Nichele, Filip\n  Krizek, Werner Wegscheider","authorsParsed":[["Telkamp","Sjoerd",""],["Antonelli","Tommaso",""],["Todt","Clemens",""],["Hinderling","Manuel",""],["Coraiola","Marco",""],["Haxell","Daniel",""],["Kate","Sofieke C. ten",""],["Sabonis","Deividas",""],["Zeng","Peng",""],["Schott","Rüdiger",""],["Cheah","Erik",""],["Reichl","Christian",""],["Nichele","Fabrizio",""],["Krizek","Filip",""],["Wegscheider","Werner",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 10:40:53 GMT"}],"updateDate":"2024-08-21","timestamp":1724150453000,"abstract":"  Semiconductor-superconductor hybrid materials are used as a platform to\nrealise Andreev bound states, which hold great promise for quantum\napplications. These states require transparent interfaces between the\nsemiconductor and superconductor, which are typically realised by in-situ\ndeposition of an Al superconducting layer. Here we present a hybrid material\nbased on an InAs two-dimensional electron gas (2DEG) combined with in-situ\ndeposited Nb and NbTi superconductors, which offer a larger operating range in\ntemperature and magnetic field due to their larger superconducting gap. We\novercome the inherent difficulty associated with the formation of an amorphous\ninterface between III-V semiconductors and Nb-based superconductors by\nintroducing a 7 nm Al interlayer. The Al interlayer provides an epitaxial\nconnection between an in-situ magnetron sputtered Nb or NbTi thin film and a\nshallow InAs 2DEG. This metal-to-metal epitaxy is achieved by optimization of\nthe material stack and results in an induced superconducting gap of\napproximately 1 meV, determined from transport measurements of\nsuperconductor-semiconductor Josephson junctions. This induced gap is\napproximately five times larger than the values reported for Al-based hybrid\nmaterials and indicates the formation of highly-transparent interfaces that are\nrequired in high-quality hybrid material platforms.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}