{"id":"2408.12762","title":"Visual Verity in AI-Generated Imagery: Computational Metrics and\n  Human-Centric Analysis","authors":"Memoona Aziz, Umair Rehman, Syed Ali Safi, Amir Zaib Abbasi","authorsParsed":[["Aziz","Memoona",""],["Rehman","Umair",""],["Safi","Syed Ali",""],["Abbasi","Amir Zaib",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 23:29:07 GMT"},{"version":"v2","created":"Sun, 1 Sep 2024 17:41:09 GMT"}],"updateDate":"2024-09-04","timestamp":1724369347000,"abstract":"  The rapid advancements in AI technologies have revolutionized the production\nof graphical content across various sectors, including entertainment,\nadvertising, and e-commerce. These developments have spurred the need for\nrobust evaluation methods to assess the quality and realism of AI-generated\nimages. To address this, we conducted three studies. First, we introduced and\nvalidated a questionnaire called Visual Verity, which measures photorealism,\nimage quality, and text-image alignment. Second, we applied this questionnaire\nto assess images from AI models (DALL-E2, DALL-E3, GLIDE, Stable Diffusion) and\ncamera-generated images, revealing that camera-generated images excelled in\nphotorealism and text-image alignment, while AI models led in image quality. We\nalso analyzed statistical properties, finding that camera-generated images\nscored lower in hue, saturation, and brightness. Third, we evaluated\ncomputational metrics' alignment with human judgments, identifying MS-SSIM and\nCLIP as the most consistent with human assessments. Additionally, we proposed\nthe Neural Feature Similarity Score (NFSS) for assessing image quality. Our\nfindings highlight the need for refining computational metrics to better\ncapture human visual perception, thereby enhancing AI-generated content\nevaluation.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"yM8D4cMOxtKFDc0kAGq54elON5wYKQ9J1ADsSBKUzWU","pdfSize":"5762013"}
