{"id":"2408.14599","title":"Anomaly Detection Within Mission-Critical Call Processing","authors":"Sean Doris, Iosif Salem, Stefan Schmid","authorsParsed":[["Doris","Sean",""],["Salem","Iosif",""],["Schmid","Stefan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 19:41:18 GMT"}],"updateDate":"2024-08-28","timestamp":1724701278000,"abstract":"  With increasingly larger and more complex telecommunication networks, there\nis a need for improved monitoring and reliability. Requirements increase\nfurther when working with mission-critical systems requiring stable operations\nto meet precise design and client requirements while maintaining high\navailability.\n  This paper proposes a novel methodology for developing a machine learning\nmodel that can assist in maintaining availability (through anomaly detection)\nfor client-server communications in mission-critical systems. To that end, we\nvalidate our methodology for training models based on data classified according\nto client performance. The proposed methodology evaluates the use of machine\nlearning to perform anomaly detection of a single virtualized server loaded\nwith simulated network traffic (using SIPp) with media calls. The collected\ndata for the models are classified based on the round trip time performance\nexperienced on the client side to determine if the trained models can detect\nanomalous client side performance only using key performance indicators\navailable on the server.\n  We compared the performance of seven different machine learning models by\ntesting different trained and untrained test stressor scenarios. In the\ncomparison, five models achieved an F1-score above 0.99 for the trained test\nscenarios. Random Forest was the only model able to attain an F1-score above\n0.9 for all untrained test scenarios with the lowest being 0.980. The results\nsuggest that it is possible to generate accurate anomaly detection to evaluate\ndegraded client-side performance.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}