{"id":"2408.16943","title":"Molecular interaction volume model of mixing enthalpy for molten salt\n  system: An integrated calorimetry-model case study of LaCl$_3$-(LiCl-KCl)","authors":"Vitaliy G. Goncharov, William Smith, Jiahong Li, Jeffrey A. Eakin,\n  Erik D. Reinhart, James Boncella, Luke D. Gibson, Vyacheslav S. Bryantsev,\n  Rushi Gong, Shun-Li Shang, Zi-Kui Liu, Hongwu Xu, Aurora Clark, Xiaofeng Guo","authorsParsed":[["Goncharov","Vitaliy G.",""],["Smith","William",""],["Li","Jiahong",""],["Eakin","Jeffrey A.",""],["Reinhart","Erik D.",""],["Boncella","James",""],["Gibson","Luke D.",""],["Bryantsev","Vyacheslav S.",""],["Gong","Rushi",""],["Shang","Shun-Li",""],["Liu","Zi-Kui",""],["Xu","Hongwu",""],["Clark","Aurora",""],["Guo","Xiaofeng",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 23:41:23 GMT"}],"updateDate":"2024-09-02","timestamp":1724974883000,"abstract":"  Calorimetric determination of enthalpies of mixing ($\\Delta$H$_{\\rm mix}$) of\nmulticomponent molten salts often employs empirical models that lack parameters\nwith clear physical interpretation (e.g., coordination numbers, molar volumes,\nand pair potentials). Although such physics informed models are not always\nneeded, a thermodynamic understanding of the relationships between excess\nenergies of mixing and local to intermediate solvation structures is\nparticularly important for pyrochemical separation, as is the case for\nlanthanides (Ln), which are common neutron poisons and critical industrial\nelements found in spent nuclear fuels. Here we implement the molecular\ninteraction volume model (MIVM) to synthesize information from experimentally\nmeasured $\\Delta$H$_{\\rm mix}$ (using high temperature melt drop calorimetry)\nand the distribution of solvation structures from ab initio molecular dynamics\n(AIMD) simulations. This was demonstrated by a case study of molten salt system\nconsisted of LaCl$_3$ mixing with a eutectic LiCl-KCl (58mol% to 42mol%) at 873\nK and 1133 K. The parameters modelled from MIVM were used to extrapolate excess\nGibbs energy ($\\Delta$G$_{\\rm mix}$), and compositional dependence of La$^{3+}$\nactivity in the LaCl$_3$-(LiCl-KCl) system. In contrast, by AIMD or polarizable\nion model (PIM) simulations, a significant deviation regarding the predicted\n$\\Delta$H$_{\\rm mix}$ was seen if computed directly from the molecular dynamic\ntrajectories. The integrated experimental and simulation data within the MIVM\nformalism are generalizable to a wide variety of molten salts and demonstrate a\nsignificant improvement over currently employed methods to study molten salts\nfor nuclear and separations sciences.\n","subjects":["Condensed Matter/Materials Science","Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}