{"id":"2408.03276","title":"Minding the gap: testing natural anomaly-mediated SUSY breaking at high\n  luminosity LHC","authors":"Howard Baer, Vernon Barger, Jessica Bolich, Juhi Dutta and Dibyashree\n  Sengupta","authorsParsed":[["Baer","Howard",""],["Barger","Vernon",""],["Bolich","Jessica",""],["Dutta","Juhi",""],["Sengupta","Dibyashree",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:18:27 GMT"}],"updateDate":"2024-08-07","timestamp":1722961107000,"abstract":"  While the minimal anomaly-mediated SUSY breaking model (mAMSB) seems ruled\nout by constraints on Higgs mass, naturalness and wino dark matter, a slightly\ngeneralized version dubbed natural AMSB (nAMSB) remains both viable and\ncompelling. Like mAMSB, nAMSB features winos as the lightest gauginos, but\nunlike mAMSB, nAMSB allows a small mu parameter so that higgsinos are the\nlightest of electroweakinos (EWinos). nAMSB spectra depend on the input value\nof gravitino mass m_{3/2}, where the lower range of m_{3/2} is excluded by LHC\ngluino pair searches while a higher m_{3/2} band is excluded by LHC limits on\nwino pair production followed by boosted hadronic wino decays. A remaining\nintermediate gap in m_{3/2} values remains allowed by present LHC searches, but\nappears to be completely explorable by high luminosity ugrades of LHC (HL-LHC).\nWe explore a variety of compelling discovery channels that may allow one to\nclose the intermediate gap in m_{3/2} values: 1. same-sign diboson +MET (SSdB)\nproduction arising from wino pair production, leading to same-sign dileptons\nplus MET, 2. trilepton production arising from wino pair production and 3. soft\ndilepton plus jet events from higgsino pair production, 4. top-squark pair\nproduction. From our signal-to-background analysis along a nAMSB model line, we\nexpect HL-LHC to either discover or rule out the nAMSB model with 3000 fb^{-1}\nof integrated luminosity.\n","subjects":["Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Idy7jenBh3utovR9hhOjsHkoxuvRflJGI4asXGtqNBo","pdfSize":"984943"}
