{"id":"2408.14169","title":"Dynamic Pricing for Electric Vehicle Charging","authors":"Arun Kumar Kalakanti, Shrisha Rao","authorsParsed":[["Kalakanti","Arun Kumar",""],["Rao","Shrisha",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 10:32:21 GMT"}],"updateDate":"2024-08-27","timestamp":1724668341000,"abstract":"  Dynamic pricing is a promising strategy to address the challenges of smart\ncharging, as traditional time-of-use (ToU) rates and stationary pricing (SP) do\nnot dynamically react to changes in operating conditions, reducing revenue for\ncharging station (CS) vendors and affecting grid stability. Previous studies\nevaluated single objectives or linear combinations of objectives for EV CS\npricing solutions, simplifying trade-offs and preferences among objectives. We\ndevelop a novel formulation for the dynamic pricing problem by addressing\nmultiple conflicting objectives efficiently instead of solely focusing on one\nobjective or metric, as in earlier works. We find optimal trade-offs or Pareto\nsolutions efficiently using Non-dominated Sorting Genetic Algorithms (NSGA) II\nand NSGA III. A dynamic pricing model quantifies the relationship between\ndemand and price while simultaneously solving multiple conflicting objectives,\nsuch as revenue, quality of service (QoS), and peak-to-average ratios (PAR). A\nsingle method can only address some of the above aspects of dynamic pricing\ncomprehensively. We present a three-part dynamic pricing approach using a\nBayesian model, multi-objective optimization, and multi-criteria\ndecision-making (MCDM) using pseudo-weight vectors. To address the research gap\nin CS pricing, our method selects solutions using revenue, QoS, and PAR metrics\nsimultaneously. Two California charging sites' real-world data validates our\napproach.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"m3fcN1-bp2KCYU83fG6EQN0u-hpuP4-6vs7Z6tq_d-k","pdfSize":"513078"}
