{"id":"2408.07217","title":"Jets from the Upper Scorpius Variable Young Star System 2MASS\n  J16075796-2040087 Via KECK/HIRES Spectro-astrometry","authors":"Emma Whelan, Miriam Keppler, Neal Turner, Ilaria Pascucci, Erika\n  Hamden, Keri Hoadley, Min Fang","authorsParsed":[["Whelan","Emma",""],["Keppler","Miriam",""],["Turner","Neal",""],["Pascucci","Ilaria",""],["Hamden","Erika",""],["Hoadley","Keri",""],["Fang","Min",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 22:05:19 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 07:50:25 GMT"}],"updateDate":"2024-08-19","timestamp":1723586719000,"abstract":"  2MASS J16075796-2040087 is a ~ 5 Myr young star in Upper Sco with evidence\nfor accretion bursts on a timescale of about 15 days and, uncommonly for its\nage, outflows traced by multi-component forbidden emission lines (FELs). The\naccretion bursts may be triggered by a companion at ~ 4.6 au. We analyze HIRES\nspectra optimised for spectro-astrometry to better understand the origin of the\nseveral FEL velocity components and determine whether a MHD disk wind is\npresent. The FEL high velocity component (HVC) traces an asymmetric, bipolar\njet ~ 700 au long. The jet's position angle (PA) ~ 277 degrees is not\nperpendicular to the disk. The lower-velocity emission, classified previously\nas a disk wind low-velocity component (LVC), is found to have more in common\nwith the HVC and overall it is not possible to identify a MHD disk wind\ncomponent. The spectro-astrometric signal of the low velocity emission\nresembles those of jets and its density and ionisation fraction fall into the\nrange of HVCs. We suggest a scenario where the accretion bursts due to the\nclose companion power the jets past the age where such activity ends around\nmost stars. The low-velocity emission here could come from a slow jet launched\nnear the close companion and this emission would be blended with emission from\nthe MHD wind.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C_Slu7PPXg7tRe_8D4kpSsnkxXX7oIo0wggQoxjDWOM","pdfSize":"8381975"}
