{"id":"2408.07165","title":"A POD-TANN approach for the multiscale modeling of materials and\n  macroelement derivation in geomechanics","authors":"Giovanni Piunno, Ioannis Stefanou, Cristina Jommi","authorsParsed":[["Piunno","Giovanni",""],["Stefanou","Ioannis",""],["Jommi","Cristina",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 19:08:56 GMT"},{"version":"v2","created":"Sun, 15 Sep 2024 09:47:29 GMT"}],"updateDate":"2024-09-17","timestamp":1723576136000,"abstract":"  This paper introduces a novel approach that combines Proper Orthogonal\nDecomposition (POD) with Thermodynamics-based Artificial Neural Networks (TANN)\nto capture the macroscopic behavior of complex inelastic systems and derive\nmacroelements in geomechanics. The methodology leverages POD to extract\nmacroscopic Internal State Variables (ISVs) from microscopic state information,\nthereby enriching the macroscopic state description used to train an energy\npotential network within the TANN framework. The thermodynamic consistency\nprovided by TANN, combined with the hierarchical nature of POD, allows for\naccurate modeling of complex, non-linear material behavior and reliable\nmacroscopic geomechanical systems responses. The effectiveness of this approach\nis validated through applications of increasing complexity, demonstrating its\ncapability to handle various material behaviors and microstructural topologies.\nThese applications include the homogenization of continuous inelastic\nrepresentative unit cells (RUCs) and the derivation of a macroelement for a\ngeotechnical system involving a monopile in a clay layer subjected to\nhorizontal loading. The results indicate that the proposed POD-TANN methodology\nnot only achieves high accuracy in reproducing stress-strain responses, but\nalso significantly reduces computational costs, making it a practical tool for\nthe multiscale modeling of heterogeneous inelastic systems, and the efficient\nderivation of macroelements for complex geomechanical problems.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}