{"id":"2408.11073","title":"Semiclassical Features of Wobbling and Chiral Properties in Nuclei","authors":"Apolodor Aristotel Raduta, Cristian Mircea Raduta and Robert Poenaru","authorsParsed":[["Raduta","Apolodor Aristotel",""],["Raduta","Cristian Mircea",""],["Poenaru","Robert",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 10:37:32 GMT"}],"updateDate":"2024-08-22","timestamp":1723977452000,"abstract":"  A semiclassical approach is used to describe the wobbling and chiral motion\nin even-even and odd-even nuclei The trial function involved in the variational\nequation for the quantal action is a coherent state for the SU(2 ) group\nassociated to a triaxial rotor for the case of an even-even system and a\ncoherent state for the group SU(2)$\\otimes$ SU(2) describing the particle-core\nsystem. Application is made for $^{158}$Er and $^{161, 163, 165,167}$Lu,\n${135}$Pr. Th parameters involved in the coherent state expression are complex\nnumbers depending on time and play the role of the phase space generalized\nconjugate coordinates whose equation of motion may be brought to the Hamilton\ncanonical form.Within a harmonic approximation one analytically obtains the\nwobbling frequencies which are further used to calculate the excitation\nenergies for the states forming a band. A new procedure to quantize the\nclassical orbitals is proposed. In the new picture the electromagnetic\ntransition probabilities are calculated both for the in-band and the intraband\ntransitions. Additionally, for odd systems, some other observable like aligned\nangular momentum, excitation energies relative to a reference spectrum, dynamic\nmoment of energies are calculated and compared with the corresponding\nexperimental data.In the parameter space one identified several nuclear phases\nwith specific properties. An example is given where the wobbling and chiral\nmotions coexist. The existence of a transversal wobbling is widely commented. A\nnew boson representation for the angular momenta is proposed. The approach was\nsuccessfully applied to $^{135}$Pr. One concludes that semiclassical\ndescription is an efficient tool to account quantitatively for the wobbling and\nchiral properties in nuclei.\n","subjects":["Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}