{"id":"2408.16611","title":"Reconciling Kubo and Keldysh Approaches to Fermi-Sea-Dependent\n  Nonequilibrium Observables: Application to Spin Hall Current and Spin-Orbit\n  Torque in Spintronics","authors":"Simao M. Joao, Marko D. Petrovic, J. M. Viana Parente Lopes, Aires\n  Ferreira, Branislav K. Nikolic","authorsParsed":[["Joao","Simao M.",""],["Petrovic","Marko D.",""],["Lopes","J. M. Viana Parente",""],["Ferreira","Aires",""],["Nikolic","Branislav K.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:19:06 GMT"}],"updateDate":"2024-08-30","timestamp":1724944746000,"abstract":"  Quantum transport studies of spin-dependent phenomena in solids commonly\nemploy the Kubo or Keldysh formulas for the steady-state density matrix in the\nlinear-response regime. Its trace with operators of interest -- such as, spin\ndensity, spin current density or spin torque -- gives expectation values of\nexperimentally accessible observables. For such local quantities, these\nformulas require summing over the manifolds of {\\em both} Fermi-surface and\nFermi-sea quantum states. However, debates have been raging in the literature\nabout vastly different physics the two formulations can apparently produce,\neven when applied to the same system. Here, we revisit this problem using a\ntestbed of infinite-size graphene with proximity-induced spin-orbit and\nmagnetic exchange effects. By splitting this system into semi-infinite leads\nand central active region, in the spirit of Landauer two-terminal setup for\nquantum transport, we prove the {\\em numerically exact equivalence} of the Kubo\nand Keldysh approaches via the computation of spin Hall current density and\nspin-orbit torque in both clean and disordered limits. The key to reconciling\nthe two approaches are the numerical frameworks we develop for: ({\\em i})\nevaluation of Kubo(-Bastin) formula for a system attached to semi-infinite\nleads, which ensure continuous energy spectrum and evade the need for\nphenomenological broadening in prior calculations; and ({\\em ii}) proper\nevaluation of Fermi-sea term in the Keldysh approach, which {\\em must} include\nthe voltage drop across the central active region even if it is disorder free.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}