{"id":"2408.01618","title":"Magnetic order-dependent giant tunneling magnetoresistance and\n  electroresistance in van der Waals antiferromagnetic-multiferroic tunnel\n  junctions","authors":"Zhi Yan, Dan Qiao, Wentian Lu, Xinlong Dong, and Xiaohong Xu","authorsParsed":[["Yan","Zhi",""],["Qiao","Dan",""],["Lu","Wentian",""],["Dong","Xinlong",""],["Xu","Xiaohong",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 01:03:09 GMT"}],"updateDate":"2024-08-06","timestamp":1722646989000,"abstract":"  Antiferromagnetic spintronics exhibits ultra-high operational speed and\nstability in a magnetic field, holding promise for the realization of\nnext-generation ultra-high-speed magnetic storage. However, theoretical\nexploration of the electronic transport properties of\nantiferromagnetic-multiferroic tunnel junction (AMFTJ) devices remains largely\nunexplored. Here, we design an antiferromagnet/ferroelectric\nbarrier/antiferromagnet van der Waals heterojunction, renamed vdW AMFTJ, using\na bilayer MnBi$_2$Te$_4$/In$_2$Se$_3$/bilayer MnBi$_2$Te$_4$ (MBT-2L/IS/MBT-2L)\nas the prototype. Based on first-principles calculations using the\nnonequilibrium Green's function method combined with density functional theory,\nwe theoretically investigate the spin-resolved electronic transport properties\nof this AMFTJ. By manipulating the various possible magnetization directions of\nthe multilayer antiferromagnetic MnBi$_2$Te$_4$ and the ferroelectric\npolarization direction of the In$_2$Se$_3$ within the junction, sixteen\ndistinct non-volatile resistance states can be revealed and manipulated by\napplying external biaxial strain and bias voltage. We predict maximum tunneling\nmagnetoresistance (electroresistance) values of $3.79\\times10^{4}$\\%\n($2.41\\times10^{5}$\\%) in the equilibrium state, which can increase up to\n$5.01\\times10^{5}$\\% ($4.97\\times10^{5}$\\%) under external bias voltage.\nFurthermore, the perfect spin filtering effect is also present in our AMFTJ.\nOur results highlight the tremendous potential of the MBT-2L/IS/MBT-2L vdW\nAMFTJ in non-volatile memory, expanding the application avenues for\nantiferromagnetic spintronic devices.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}