{"id":"2408.00516","title":"Low-Power Vibration-Based Predictive Maintenance for Industry 4.0 using\n  Neural Networks: A Survey","authors":"Alexandru Vasilache, Sven Nitzsche, Daniel Floegel, Tobias Schuermann,\n  Stefan von Dosky, Thomas Bierweiler, Marvin Mu{\\ss}ler, Florian K\\\"alber,\n  Soeren Hohmann, Juergen Becker","authorsParsed":[["Vasilache","Alexandru",""],["Nitzsche","Sven",""],["Floegel","Daniel",""],["Schuermann","Tobias",""],["von Dosky","Stefan",""],["Bierweiler","Thomas",""],["Mußler","Marvin",""],["Kälber","Florian",""],["Hohmann","Soeren",""],["Becker","Juergen",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:46:37 GMT"}],"updateDate":"2024-08-02","timestamp":1722516397000,"abstract":"  The advancements in smart sensors for Industry 4.0 offer ample opportunities\nfor low-powered predictive maintenance and condition monitoring. However,\ntraditional approaches in this field rely on processing in the cloud, which\nincurs high costs in energy and storage. This paper investigates the potential\nof neural networks for low-power on-device computation of vibration sensor data\nfor predictive maintenance. We review the literature on Spiking Neural Networks\n(SNNs) and Artificial Neuronal Networks (ANNs) for vibration-based predictive\nmaintenance by analyzing datasets, data preprocessing, network architectures,\nand hardware implementations. Our findings suggest that no satisfactory\nstandard benchmark dataset exists for evaluating neural networks in predictive\nmaintenance tasks. Furthermore frequency domain transformations are commonly\nemployed for preprocessing. SNNs mainly use shallow feed forward architectures,\nwhereas ANNs explore a wider range of models and deeper networks. Finally, we\nhighlight the need for future research on hardware implementations of neural\nnetworks for low-power predictive maintenance applications and the development\nof a standardized benchmark dataset.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}