{"id":"2408.08413","title":"Towards quantitative precision in functional QCD I","authors":"Friederike Ihssen, Jan M. Pawlowski, Franz R. Sattler, Nicolas Wink","authorsParsed":[["Ihssen","Friederike",""],["Pawlowski","Jan M.",""],["Sattler","Franz R.",""],["Wink","Nicolas",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 20:40:49 GMT"}],"updateDate":"2024-08-19","timestamp":1723754449000,"abstract":"  Functional approaches are the only first principle QCD setup that allow for\ndirect computations at finite density. Predictive power and quantitative\nreliability of the respective results can only be obtained within a systematic\nexpansion scheme with controlled systematic error estimates. Here we set up\nsuch a scheme within the functional renormalisation group (fRG) approach to\nQCD, aiming for full apparent convergence. In the current work we test this\nsetup, using correlation functions and observables in 2+1 flavour vacuum QCD as\na natural benchmark case. While the current work includes many evolutionary\nimprovements collected over the past two decades, we also report on three novel\nimportant developments: (i) A comprehensive systematic error analysis based on\nthe modular nature of the fRG approach. (ii) The introduction of a fully\nautomated computational framework, allowing for unprecedented access and\nimprovement of the fRG approach to QCD. (iii) The inclusion of the full\neffective potential of the chiral order parameter. This also gives access to\nall-order scattering events of pions and to the full momentum dependence of\ncorrelation functions, which is a first application of the automated\ncomputational framework (ii). The results compare very well to other\nstate-of-the-art results both from functional approaches and lattice\nsimulations, and provide data on general multi-scattering events of pions and\nthe sigma mode for the first time.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory","Physics/Nuclear Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"39wi-p1dLmGh-mzcTQTf1HVDlanOPvTYS_wZDyt1xBs","pdfSize":"3412580"}
