{"id":"2408.04051","title":"Strain-driven stabilization of a room-temperature chiral ferroelectric","authors":"Guodong Ren, Gwan Yeong Jung, Huandong Chen, Chong Wang, Boyang Zhao,\n  Rama K. Vasudevan, Jordan A. Hachtel, Andrew R. Lupini, Miaofang Chi, Di\n  Xiao, Jayakanth Ravichandran and Rohan Mishra","authorsParsed":[["Ren","Guodong",""],["Jung","Gwan Yeong",""],["Chen","Huandong",""],["Wang","Chong",""],["Zhao","Boyang",""],["Vasudevan","Rama K.",""],["Hachtel","Jordan A.",""],["Lupini","Andrew R.",""],["Chi","Miaofang",""],["Xiao","Di",""],["Ravichandran","Jayakanth",""],["Mishra","Rohan",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 19:15:14 GMT"}],"updateDate":"2024-08-09","timestamp":1723058114000,"abstract":"  Noncollinear ferroic materials are sought after as testbeds to explore the\nintimate connections between topology and symmetry, which result in electronic,\noptical and magnetic functionalities not observed in collinear ferroic\nmaterials. For example, ferroaxial materials have ordered rotational structural\ndistortions that break mirror symmetry and induce chirality. When ferroaxial\norder is coupled with ferroelectricity arising from a broken inversion\nsymmetry, it offers the prospect of electric-field-control of the ferroaxial\ndistortions and opens up new tunable functionalities. However, chiral\nferroelectrics, especially ones stable at room temperature, are rare. We report\nthe discovery of a strain-stabilized, room-temperature chiral ferroelectric\nphase in single crystals of BaTiS$_3$, a quasi-one-dimensional (1D) hexagonal\nchalcogenide. Using first-principles calculations, we predict the stabilization\nof this multiferroic phase having $P6_3$ space group for biaxial tensile\nstrains exceeding 1.5% applied on the basal ab-plane of the room temperature\n$P6_3cm$ phase of BaTiS$_3$. The chiral ferroelectric phase is characterized by\nrotational distortions of select TiS$_6$ octahedra around the long $c$-axis and\npolar displacement of Ti atoms along the $c$-axis. We used an innovative\napproach using focused ion beam milling to make appropriately strained samples\nof BaTiS$_3$. The ferroaxial and ferroelectric distortions, and their domains\nin $P6_3$-BaTiS$_3$ were directly resolved using atomic resolution scanning\ntransmission electron microscopy. Landau-based phenomenological modeling\npredicts a strong coupling between the ferroelectric and the ferroaxial order\nmaking $P6_3$-BaTiS$_3$ an attractive test bed for achieving electric-field\ncontrol of chirality-related phenomena such as circular photo-galvanic current\nand the Rashba effect.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}