{"id":"2408.08484","title":"An Unsupervised Learning Framework Combined with Heuristics for the\n  Maximum Minimal Cut Problem","authors":"Huaiyuan Liu, Xianzhang Liu, Donghua Yang, Hongzhi Wang, Yingchi Long,\n  Mengtong Ji, Dongjing Miao, Zhiyu Liang","authorsParsed":[["Liu","Huaiyuan",""],["Liu","Xianzhang",""],["Yang","Donghua",""],["Wang","Hongzhi",""],["Long","Yingchi",""],["Ji","Mengtong",""],["Miao","Dongjing",""],["Liang","Zhiyu",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 02:07:34 GMT"}],"updateDate":"2024-08-19","timestamp":1723774054000,"abstract":"  The Maximum Minimal Cut Problem (MMCP), a NP-hard combinatorial optimization\n(CO) problem, has not received much attention due to the demanding and\nchallenging bi-connectivity constraint. Moreover, as a CO problem, it is also a\ndaunting task for machine learning, especially without labeled instances. To\ndeal with these problems, this work proposes an unsupervised learning framework\ncombined with heuristics for MMCP that can provide valid and high-quality\nsolutions. As far as we know, this is the first work that explores machine\nlearning and heuristics to solve MMCP. The unsupervised solver is inspired by a\nrelaxation-plus-rounding approach, the relaxed solution is parameterized by\ngraph neural networks, and the cost and penalty of MMCP are explicitly written\nout, which can train the model end-to-end. A crucial observation is that each\nsolution corresponds to at least one spanning tree. Based on this finding, a\nheuristic solver that implements tree transformations by adding vertices is\nutilized to repair and improve the solution quality of the unsupervised solver.\nAlternatively, the graph is simplified while guaranteeing solution consistency,\nwhich reduces the running time. We conduct extensive experiments to evaluate\nour framework and give a specific application. The results demonstrate the\nsuperiority of our method against two techniques designed.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}