{"id":"2408.11821","title":"MIMA 2.0 -- Compact and Portable Multifunctional IoT integrated\n  Menstrual Aid","authors":"Kumar J. Jyothish, Shreya Shivangi, Amish Bibhu, Subhankar Mishra,\n  Sulagna Saha","authorsParsed":[["Jyothish","Kumar J.",""],["Shivangi","Shreya",""],["Bibhu","Amish",""],["Mishra","Subhankar",""],["Saha","Sulagna",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 10:25:44 GMT"}],"updateDate":"2024-08-23","timestamp":1722680744000,"abstract":"  The shredding intrauterine lining or the endometrium is known as\nMenstruation. It occurs every month and causes several issues like Menstrual\nCramps and aches in the abdominal region, stains, menstrual malodor, rashes in\nintimate areas, and many more. In our research, almost all of the products\navailable in the market do not cater to these problems single-handedly. There\nare few remedies available to cater to the cramps, among which heat therapy is\nthe most commonly used. Our methodology, involved surveys regarding problems\nand the solutions to these problems that are deemed optimal. This inclusive\napproach helped us infer about the gaps in available menstrual aids which has\nbecome our guide towards developing MIMA (Multifunctional IoT Integrated\nMenstrual Aid). In this paper, we have featured an IOT incorporated\nmultifunctional smart intimate wear that aims to provide for the multiple\nnecessities of women during menstruation like leakproof, antibacterial,\nanti-odor, rash-free experience along with an integrated Bluetooth-controlled\nintimate heat-pad for relieving abdominal cramps. The entire process of product\ndevelopment has been done in phases according to feedback from target users in\neach stage. This paper is an extension to our paper [1] which serves as the\nproof of concept for our approach. The development has led us towards MIMA 2.0\nfeaturing a completely concealed and integrated design that includes a safe\nBluetooth-controlled heating system for the intimate area. The product has\nreceived incredibly positive feedback from survey participants.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}