{"id":"2408.00331","title":"DECIDER: Leveraging Foundation Model Priors for Improved Model Failure\n  Detection and Explanation","authors":"Rakshith Subramanyam, Kowshik Thopalli, Vivek Narayanaswamy, Jayaraman\n  J.Thiagarajan","authorsParsed":[["Subramanyam","Rakshith",""],["Thopalli","Kowshik",""],["Narayanaswamy","Vivek",""],["Thiagarajan","Jayaraman J.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:08:11 GMT"}],"updateDate":"2024-08-02","timestamp":1722496091000,"abstract":"  Reliably detecting when a deployed machine learning model is likely to fail\non a given input is crucial for ensuring safe operation. In this work, we\npropose DECIDER (Debiasing Classifiers to Identify Errors Reliably), a novel\napproach that leverages priors from large language models (LLMs) and\nvision-language models (VLMs) to detect failures in image classification\nmodels. DECIDER utilizes LLMs to specify task-relevant core attributes and\nconstructs a ``debiased'' version of the classifier by aligning its visual\nfeatures to these core attributes using a VLM, and detects potential failure by\nmeasuring disagreement between the original and debiased models. In addition to\nproactively identifying samples on which the model would fail, DECIDER also\nprovides human-interpretable explanations for failure through a novel\nattribute-ablation strategy. Through extensive experiments across diverse\nbenchmarks spanning subpopulation shifts (spurious correlations, class\nimbalance) and covariate shifts (synthetic corruptions, domain shifts), DECIDER\nconsistently achieves state-of-the-art failure detection performance,\nsignificantly outperforming baselines in terms of the overall Matthews\ncorrelation coefficient as well as failure and success recall. Our codes can be\naccessed at~\\url{https://github.com/kowshikthopalli/DECIDER/}\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"76B9A9gKlXS6MQGmqQjBF4x_icfVuoz-xhFANQaDVlk","pdfSize":"6094312"}
