{"id":"2408.02670","title":"A Targeted Search for Variable Gravitationally Lensed Quasars","authors":"William Sheu, Xiaosheng Huang, Aleksandar Cikota, Nao Suzuki,\n  Antonella Palmese, David J. Schlegel, Christopher Storfer","authorsParsed":[["Sheu","William",""],["Huang","Xiaosheng",""],["Cikota","Aleksandar",""],["Suzuki","Nao",""],["Palmese","Antonella",""],["Schlegel","David J.",""],["Storfer","Christopher",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 17:59:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722880761000,"abstract":"  We present a pipeline to identify photometric variability within strong\ngravitationally lensing candidates, in the DESI Legacy Imaging Surveys. In our\nfirst paper (Sheu et al. 2023), we laid out our pipeline and presented seven\nnew gravitationally lensed supernovae candidates in a retrospective search. In\nthis companion paper, we apply a modified version of that pipeline to search\nfor gravitationally lensed quasars. From a sample of 5807 strong lenses, we\nhave identified 13 new gravitationally lensed quasar candidates (three of them\nquadruply-lensed). We note that our methodology differs from most lensed quasar\nsearch algorithms that solely rely on the morphology, location, and color of\nthe candidate systems. By also taking into account the temporal photometric\nvariability of the posited lensed images in our search via difference imaging,\nwe have discovered new lensed quasar candidates. While variability searches\nusing difference imaging algorithms have been done in the past, they are\ntypically preformed over vast swathes of sky, whereas we specifically target\nstrong gravitationally lensed candidates. We also have applied our pipeline to\n655 known gravitationally lensed quasar candidates from past lensed quasar\nsearches, of which we identify 13 that display significant variability (one of\nthem quadruply-lensed). This pipeline demonstrates a promising search strategy\nto discover gravitationally lensed quasars in other existing and upcoming\nsurveys.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}