{"id":"2408.05740","title":"MTSCI: A Conditional Diffusion Model for Multivariate Time Series\n  Consistent Imputation","authors":"Jianping Zhou, Junhao Li, Guanjie Zheng, Xinbing Wang, Chenghu Zhou","authorsParsed":[["Zhou","Jianping",""],["Li","Junhao",""],["Zheng","Guanjie",""],["Wang","Xinbing",""],["Zhou","Chenghu",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 10:24:53 GMT"}],"updateDate":"2024-08-13","timestamp":1723371893000,"abstract":"  Missing values are prevalent in multivariate time series, compromising the\nintegrity of analyses and degrading the performance of downstream tasks.\nConsequently, research has focused on multivariate time series imputation,\naiming to accurately impute the missing values based on available observations.\nA key research question is how to ensure imputation consistency, i.e.,\nintra-consistency between observed and imputed values, and inter-consistency\nbetween adjacent windows after imputation. However, previous methods rely\nsolely on the inductive bias of the imputation targets to guide the learning\nprocess, ignoring imputation consistency and ultimately resulting in poor\nperformance. Diffusion models, known for their powerful generative abilities,\nprefer to generate consistent results based on available observations.\nTherefore, we propose a conditional diffusion model for Multivariate Time\nSeries Consistent Imputation (MTSCI). Specifically, MTSCI employs a contrastive\ncomplementary mask to generate dual views during the forward noising process.\nThen, the intra contrastive loss is calculated to ensure intra-consistency\nbetween the imputed and observed values. Meanwhile, MTSCI utilizes a mixup\nmechanism to incorporate conditional information from adjacent windows during\nthe denoising process, facilitating the inter-consistency between imputed\nsamples. Extensive experiments on multiple real-world datasets demonstrate that\nour method achieves the state-of-the-art performance on multivariate time\nseries imputation task under different missing scenarios. Code is available at\nhttps://github.com/JeremyChou28/MTSCI.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Statistics/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}