{"id":"2408.07342","title":"Evidence of P-wave Pairing in K2Cr3As3 Superconductors from\n  Phase-sensitive Measurement","authors":"Zhiyuan Zhang, Ziwei Dou, Anqi Wang, Cuiwei Zhang, Yu Hong, Xincheng\n  Lei, Yue Pan, Zhongchen Xu, Zhipeng Xu, Yupeng Li, Guoan Li, Xiaofan Shi,\n  Xingchen Guo, Xiao Deng, Zhaozheng Lyu, Peiling Li, Faming Qu, Guangtong Liu,\n  Dong Su, Kun Jiang, Youguo Shi, Li Lu, Jie Shen, Jiangping Hu","authorsParsed":[["Zhang","Zhiyuan",""],["Dou","Ziwei",""],["Wang","Anqi",""],["Zhang","Cuiwei",""],["Hong","Yu",""],["Lei","Xincheng",""],["Pan","Yue",""],["Xu","Zhongchen",""],["Xu","Zhipeng",""],["Li","Yupeng",""],["Li","Guoan",""],["Shi","Xiaofan",""],["Guo","Xingchen",""],["Deng","Xiao",""],["Lyu","Zhaozheng",""],["Li","Peiling",""],["Qu","Faming",""],["Liu","Guangtong",""],["Su","Dong",""],["Jiang","Kun",""],["Shi","Youguo",""],["Lu","Li",""],["Shen","Jie",""],["Hu","Jiangping",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 07:34:45 GMT"}],"updateDate":"2024-08-15","timestamp":1723620885000,"abstract":"  P-wave superconductors hold immense promise for both fundamental physics and\npractical applications due to their unusual pairing symmetry and potential\ntopological superconductivity. However, the exploration of the p-wave\nsuperconductors has proved to be a complex endeavor. Not only are they rare in\nnature but also the identification of p-wave superconductors has been an\narduous task in history. For example, phase-sensitive measurement, an\nexperimental technique which can provide conclusive evidence for unconventional\npairing, has not been implemented successfully to identify p-wave\nsuperconductors. Here, we study a recently discovered family of\nsuperconductors, A2Cr3As3 (A = K, Rb, Cs), which were proposed theoretically to\nbe a candidate of p-wave superconductors. We fabricate superconducting quantum\ninterference devices (SQUIDs) on exfoliated K2Cr3As3, and perform the\nphase-sensitive measurement. We observe that such SQUIDs exhibit a pronounced\nsecond-order harmonic component sin(2{\\phi}) in the current-phase relation,\nsuggesting the admixture of 0- and {\\pi}-phase. By carefully examining the\nmagnetic field dependence of the oscillation patterns of critical current and\nShapiro steps under microwave irradiation, we reveal a crossover from 0- to\n{\\pi}-dominating phase state and conclude that the existence of the {\\pi}-phase\nis in favor of the p-wave pairing symmetry in K2Cr3As3.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"HAYqtZSJhsJzLr0NHqS-7gd0Ee4utnnz8Hz_-8ep2gE","pdfSize":"5997318"}
