{"id":"2408.08067","title":"RAGChecker: A Fine-grained Framework for Diagnosing Retrieval-Augmented\n  Generation","authors":"Dongyu Ru, Lin Qiu, Xiangkun Hu, Tianhang Zhang, Peng Shi, Shuaichen\n  Chang, Cheng Jiayang, Cunxiang Wang, Shichao Sun, Huanyu Li, Zizhao Zhang,\n  Binjie Wang, Jiarong Jiang, Tong He, Zhiguo Wang, Pengfei Liu, Yue Zhang,\n  Zheng Zhang","authorsParsed":[["Ru","Dongyu",""],["Qiu","Lin",""],["Hu","Xiangkun",""],["Zhang","Tianhang",""],["Shi","Peng",""],["Chang","Shuaichen",""],["Jiayang","Cheng",""],["Wang","Cunxiang",""],["Sun","Shichao",""],["Li","Huanyu",""],["Zhang","Zizhao",""],["Wang","Binjie",""],["Jiang","Jiarong",""],["He","Tong",""],["Wang","Zhiguo",""],["Liu","Pengfei",""],["Zhang","Yue",""],["Zhang","Zheng",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 10:20:54 GMT"},{"version":"v2","created":"Sat, 17 Aug 2024 00:30:04 GMT"}],"updateDate":"2024-08-20","timestamp":1723717254000,"abstract":"  Despite Retrieval-Augmented Generation (RAG) showing promising capability in\nleveraging external knowledge, a comprehensive evaluation of RAG systems is\nstill challenging due to the modular nature of RAG, evaluation of long-form\nresponses and reliability of measurements. In this paper, we propose a\nfine-grained evaluation framework, RAGChecker, that incorporates a suite of\ndiagnostic metrics for both the retrieval and generation modules. Meta\nevaluation verifies that RAGChecker has significantly better correlations with\nhuman judgments than other evaluation metrics. Using RAGChecker, we evaluate 8\nRAG systems and conduct an in-depth analysis of their performance, revealing\ninsightful patterns and trade-offs in the design choices of RAG architectures.\nThe metrics of RAGChecker can guide researchers and practitioners in developing\nmore effective RAG systems. This work has been open sourced at\nhttps://github.com/amazon-science/RAGChecker.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"SoRzltr_YtH7O-4cWkyys68BDGvVVZ5IWHdTPxNr0OM","pdfSize":"2553412"}
