{"id":"2408.13158","title":"Impact of HI cooling and study of accretion disks in AGB wind-companion\n  smoothed particle hydrodynamic simulations","authors":"Jolien Malfait, Lionel Siess, Mats Esseldeurs, Frederik De Ceuster,\n  Sofia H. J. Wallstr\\\"om, Alex de Koter, and Leen Decin","authorsParsed":[["Malfait","Jolien",""],["Siess","Lionel",""],["Esseldeurs","Mats",""],["De Ceuster","Frederik",""],["Wallström","Sofia H. J.",""],["de Koter","Alex",""],["Decin","Leen",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:28:46 GMT"}],"updateDate":"2024-08-30","timestamp":1724426926000,"abstract":"  High-resolution observations reveal that the outflows of evolved low- and\nintermediate-mass stars harbour complex morphological structures that are\nlinked to the presence of one or multiple companions. Hydrodynamical\nsimulations provide a way to study the impact of a companion on the shaping of\nthe AGB outflow. Using smoothed particle hydrodynamic (SPH) simulations of a\nmass losing AGB star with a binary companion, we study the impact of including\nHI atomic line cooling on the flow morphology and on the properties of\naccretion disks that form around the companion. We perform high-resolution 3D\nSPH simulations of the interaction of a solar-mass companion with the outflow\nof an AGB star using different wind velocities and eccentricities. We compare\nthe models properties computed with and without the inclusion of HI cooling.\nThe inclusion of HI cooling produces a large decrease in the temperature up to\none order of magnitude in the region closely surrounding the companion star. As\na consequence, morphological irregularities and relatively energetic outflows\nthat were obtained without HI cooling no longer appear. In case of an eccentric\norbit and low wind velocity, the morphologies are still highly asymmetric, but\nthe same structures recur at every orbital period, making the morphology more\nregular. Flared accretion disks with a (sub)-Keplerian velocity profile form\naround the companion in all models, provided the accretion radius is small\nenough. The disks have radial sizes ranging from about 0.4 to 0.9 au. For the\nconsidered wind velocities, mass accretion onto the companion is up to 2 times\nhigher than predicted by the BHL rate, and ranges between 0.04-0.21 times the\nAGB wind mass loss rate. The lower the wind velocity at the location of the\ncompanion, the larger and the more massive the disk, and the higher the mass\naccretion efficiency.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}