{"id":"2408.07755","title":"Stochastic diffusion using mean-field limits to approximate master\n  equations","authors":"Laurent H\\'ebert-Dufresne, Matthew M. Kling, Samuel F. Rosenblatt,\n  Stephanie N. Miller, P. Alexander Burnham, Nicholas W. Landry, Nicholas J.\n  Gotelli and Brian J. McGill","authorsParsed":[["Hébert-Dufresne","Laurent",""],["Kling","Matthew M.",""],["Rosenblatt","Samuel F.",""],["Miller","Stephanie N.",""],["Burnham","P. Alexander",""],["Landry","Nicholas W.",""],["Gotelli","Nicholas J.",""],["McGill","Brian J.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 18:07:21 GMT"}],"updateDate":"2024-08-16","timestamp":1723658841000,"abstract":"  Stochastic diffusion is the noisy and uncertain process through which\ndynamics like epidemics, or agents like animal species, disperse over a larger\narea. Understanding these processes is becoming increasingly important as we\nattempt to better prepare for potential pandemics and as species ranges shift\nin response to climate change. Unfortunately, modeling of stochastic diffusion\nis mostly done through inaccurate deterministic tools that fail to capture the\nrandom nature of dispersal or else through expensive computational simulations.\nIn particular, standard tools fail to fully capture the heterogeneity of the\narea over which this diffusion occurs. Rural areas with low population density\nrequire different epidemic models than urban areas; likewise, the edges of a\nspecies range require us to explicitly track low integer numbers of individuals\nrather than vague averages. In this work, we introduce a series of new tools\ncalled \"mean-FLAME\" models that track stochastic dispersion using approximate\nmaster equations that explicitly follow the probability distribution of an area\nof interest over all of its possible states, up to states that are active\nenough to be approximated using a mean-field model. In one limit, this approach\nis locally exact if we explicitly track enough states, and in the other limit\ncollapses back to traditional deterministic models if we track no state\nexplicitly. Applying this approach, we show how deterministic tools fail to\ncapture the uncertainty around the speed of nonlinear dynamical processes. This\nis especially true for marginal areas that are close to unsuitable for\ndiffusion, like the edge of a species range or epidemics in small populations.\nCapturing the uncertainty in such areas is key to producing accurate forecasts\nand guiding potential interventions.\n","subjects":["Quantitative Biology/Populations and Evolution","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}