{"id":"2408.06027","title":"A Comprehensive Survey on EEG-Based Emotion Recognition: A Graph-Based\n  Perspective","authors":"Chenyu Liu, Xinliang Zhou, Yihao Wu, Yi Ding, Liming Zhai, Kun Wang,\n  Ziyu Jia and Yang Liu","authorsParsed":[["Liu","Chenyu",""],["Zhou","Xinliang",""],["Wu","Yihao",""],["Ding","Yi",""],["Zhai","Liming",""],["Wang","Kun",""],["Jia","Ziyu",""],["Liu","Yang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 09:29:26 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 06:22:49 GMT"}],"updateDate":"2024-08-14","timestamp":1723454966000,"abstract":"  Compared to other modalities, electroencephalogram (EEG) based emotion\nrecognition can intuitively respond to emotional patterns in the human brain\nand, therefore, has become one of the most focused tasks in affective\ncomputing. The nature of emotions is a physiological and psychological state\nchange in response to brain region connectivity, making emotion recognition\nfocus more on the dependency between brain regions instead of specific brain\nregions. A significant trend is the application of graphs to encapsulate such\ndependency as dynamic functional connections between nodes across temporal and\nspatial dimensions. Concurrently, the neuroscientific underpinnings behind this\ndependency endow the application of graphs in this field with a distinctive\nsignificance. However, there is neither a comprehensive review nor a tutorial\nfor constructing emotion-relevant graphs in EEG-based emotion recognition. In\nthis paper, we present a comprehensive survey of these studies, delivering a\nsystematic review of graph-related methods in this field from a methodological\nperspective. We propose a unified framework for graph applications in this\nfield and categorize these methods on this basis. Finally, based on previous\nstudies, we also present several open challenges and future directions in this\nfield.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}