{"id":"2408.01581","title":"Huge Ensembles Part II: Properties of a Huge Ensemble of Hindcasts\n  Generated with Spherical Fourier Neural Operators","authors":"Ankur Mahesh, William Collins, Boris Bonev, Noah Brenowitz, Yair\n  Cohen, Peter Harrington, Karthik Kashinath, Thorsten Kurth, Joshua North,\n  Travis OBrien, Michael Pritchard, David Pruitt, Mark Risser, Shashank\n  Subramanian, Jared Willard","authorsParsed":[["Mahesh","Ankur",""],["Collins","William",""],["Bonev","Boris",""],["Brenowitz","Noah",""],["Cohen","Yair",""],["Harrington","Peter",""],["Kashinath","Karthik",""],["Kurth","Thorsten",""],["North","Joshua",""],["OBrien","Travis",""],["Pritchard","Michael",""],["Pruitt","David",""],["Risser","Mark",""],["Subramanian","Shashank",""],["Willard","Jared",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 21:31:34 GMT"}],"updateDate":"2024-08-06","timestamp":1722634294000,"abstract":"  In Part I, we created an ensemble based on Spherical Fourier Neural\nOperators. As initial condition perturbations, we used bred vectors, and as\nmodel perturbations, we used multiple checkpoints trained independently from\nscratch. Based on diagnostics that assess the ensemble's physical fidelity, our\nensemble has comparable performance to operational weather forecasting systems.\nHowever, it requires several orders of magnitude fewer computational resources.\nHere in Part II, we generate a huge ensemble (HENS), with 7,424 members\ninitialized each day of summer 2023. We enumerate the technical requirements\nfor running huge ensembles at this scale. HENS precisely samples the tails of\nthe forecast distribution and presents a detailed sampling of internal\nvariability. For extreme climate statistics, HENS samples events 4$\\sigma$ away\nfrom the ensemble mean. At each grid cell, HENS improves the skill of the most\naccurate ensemble member and enhances coverage of possible future trajectories.\nAs a weather forecasting model, HENS issues extreme weather forecasts with\nbetter uncertainty quantification. It also reduces the probability of outlier\nevents, in which the verification value lies outside the ensemble forecast\ndistribution.\n","subjects":["Computing Research Repository/Machine Learning","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}