{"id":"2408.14142","title":"Cosmic dance in the Shapley Concentration Core II. The uGMRT-MeerKAT\n  view of filaments in the brightest cluster galaxies and tailed radio galaxies\n  in the A3528 cluster complex","authors":"G. Di Gennaro, T. Venturi, S. Giacintucci, M. Br\\\"uggen, E. Bulbul, J.\n  Sanders, A. Liu, X. Zhang, K. Trehaeven, D. Dallacasa, P. Merluzzi, T.\n  Pasini, S. Bardelli, G. Bernardi and O. Smirnov","authorsParsed":[["Di Gennaro","G.",""],["Venturi","T.",""],["Giacintucci","S.",""],["Brüggen","M.",""],["Bulbul","E.",""],["Sanders","J.",""],["Liu","A.",""],["Zhang","X.",""],["Trehaeven","K.",""],["Dallacasa","D.",""],["Merluzzi","P.",""],["Pasini","T.",""],["Bardelli","S.",""],["Bernardi","G.",""],["Smirnov","O.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:40:12 GMT"}],"updateDate":"2024-08-27","timestamp":1724665212000,"abstract":"  Superclusters are the largest-scale environments where a number of galaxy\nclusters interact with each other through minor/major mergers and grow via\naccretion along cosmic filaments. We focus on the A3528 complex in the core of\nthe Shapley Supercluster. This system includes three clusters, A3528 (composed\nitself by two sub-clusters, namely A3528N and A3528S), A3532 and A3530, and\npresents a mildly active dynamical state. We study how minor mergers affect the\nevolution of radio galaxies and whether they are able to re-accelerate\nrelativistic electrons in the ICM. We used observations from the uGMRT (Band 3,\n4 and 5) and MeerKAT (L-band) telescopes to obtain images and spectral index\nmaps over a wide frequency band and spatial resolutions. We compare these data\nwith those from the SRG/eROSITA X-ray telescope. We detect faint diffuse radio\nemission associated with the radio galaxies. The BCGs in A3528S and A3532 show\nfilaments of diffuse radio emission which extend for $\\sim200-400$ kpc out of\nthe radio galaxy. The spectral index of these filaments is extremely steep and\nalmost constant ($\\alpha\\sim -2, -2.5$). Contrary to the radio tails in A3528N,\nthe spectral properties of these radio filaments are not consistent with\nstandard models of plasma ageing. We also detect roundish diffuse radio\nemission around the BCG in A3528S which could be classified as a radio\nmini-halo. The radio tail in this cluster appears longer that in earlier\ndetections, being $\\sim300$ kpc long at all frequencies. We linked the presence\nof extended radio emission in the form of filaments and threads in the A3528\ncomplex with the effect of minor mergers. This is reinforced by the increasing\nX-ray fluctuations in correspondence with the radio extended emission in\nA3528S. Despite the less energy involved, our findings support the hypothesis\nthat these events can re-energise plasma originating from radio galaxies.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"qgSavcJXHNakQjZK9qmUNVTeMC23lYIdfItCfAHEpQ4","pdfSize":"36607992"}
