{"id":"2408.13981","title":"ARANet: Attention-based Residual Adversarial Network with Deep\n  Supervision for Radiotherapy Dose Prediction of Cervical Cancer","authors":"Lu Wen, Wenxia Yin, Zhenghao Feng, Xi Wu, Deng Xiong, Yan Wang","authorsParsed":[["Wen","Lu",""],["Yin","Wenxia",""],["Feng","Zhenghao",""],["Wu","Xi",""],["Xiong","Deng",""],["Wang","Yan",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 02:26:09 GMT"}],"updateDate":"2024-08-27","timestamp":1724639169000,"abstract":"  Radiation therapy is the mainstay treatment for cervical cancer, and its\nultimate goal is to ensure the planning target volume (PTV) reaches the\nprescribed dose while reducing dose deposition of organs-at-risk (OARs) as much\nas possible. To achieve these clinical requirements, the medical physicist\nneeds to manually tweak the radiotherapy plan repeatedly in a trial-anderror\nmanner until finding the optimal one in the clinic. However, such\ntrial-and-error processes are quite time-consuming, and the quality of plans\nhighly depends on the experience of the medical physicist. In this paper, we\npropose an end-to-end Attentionbased Residual Adversarial Network with deep\nsupervision, namely ARANet, to automatically predict the 3D dose distribution\nof cervical cancer. Specifically, given the computer tomography (CT) images and\ntheir corresponding segmentation masks of PTV and OARs, ARANet employs a\nprediction network to generate the dose maps. We also utilize a multi-scale\nresidual attention module and deep supervision mechanism to enforce the\nprediction network to extract more valuable dose features while suppressing\nirrelevant information. Our proposed method is validated on an in-house dataset\nincluding 54 cervical cancer patients, and experimental results have\ndemonstrated its obvious superiority compared to other state-of-the-art\nmethods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"xCUTdwMkywIVYxVeVZAFVaYDwco6EJCkBjaORjjFaMw","pdfSize":"802081"}
