{"id":"2408.03704","title":"BioDeepHash: Mapping Biometrics into a Stable Code","authors":"Baogang Song and Dongdong Zhao and Jiang Yan and Huanhuan Li and Hao\n  Jiang","authorsParsed":[["Song","Baogang",""],["Zhao","Dongdong",""],["Yan","Jiang",""],["Li","Huanhuan",""],["Jiang","Hao",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 11:37:02 GMT"}],"updateDate":"2024-08-08","timestamp":1723030622000,"abstract":"  With the wide application of biometrics, more and more attention has been\npaid to the security of biometric templates. However most of existing biometric\ntemplate protection (BTP) methods have some security problems, e.g. the problem\nthat protected templates leak part of the original biometric data (exists in\nCancelable Biometrics (CB)), the use of error-correcting codes (ECC) leads to\ndecodable attack, statistical attack (exists in Biometric Cryptosystems (BCS)),\nthe inability to achieve revocability (exists in methods using Neural Network\n(NN) to learn pre-defined templates), the inability to use cryptographic hash\nto guarantee strong security (exists in CB and methods using NN to learn latent\ntemplates). In this paper, we propose a framework called BioDeepHash based on\ndeep hashing and cryptographic hashing to address the above four problems,\nwhere different biometric data of the same user are mapped to a stable code\nusing deep hashing instead of predefined binary codes thus avoiding the use of\nECC. An application-specific binary string is employed to achieve revocability.\nThen cryptographic hashing is used to get the final protected template to\nensure strong security. Ultimately our framework achieves not storing any data\nthat would leak part of the original biometric data. We also conduct extensive\nexperiments on facial and iris datasets. Our method achieves an improvement of\n10.12$\\%$ on the average Genuine Acceptance Rate (GAR) for iris data and\n3.12$\\%$ for facial data compared to existing methods. In addition, BioDeepHash\nachieves extremely low False Acceptance Rate (FAR), i.e. 0$\\%$ FAR on the iris\ndataset and the highest FAR on the facial dataset is only 0.0002$\\%$.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}