{"id":"2408.13476","title":"Photonic time-delayed reservoir computing based on lithium niobate\n  microring resonators","authors":"Yuan Wang, Ming Li, Mingyi Gao, Chang-Ling Zou, Chun-Hua Dong, Xiaoniu\n  Yang, Qi Xuan and HongLiang Ren","authorsParsed":[["Wang","Yuan",""],["Li","Ming",""],["Gao","Mingyi",""],["Zou","Chang-Ling",""],["Dong","Chun-Hua",""],["Yang","Xiaoniu",""],["Xuan","Qi",""],["Ren","HongLiang",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 05:28:35 GMT"}],"updateDate":"2024-08-27","timestamp":1724477315000,"abstract":"  On-chip micro-ring resonators (MRRs) have been proposed for constructing\ndelay reservoir computing (RC) systems, offering a highly scalable,\nhigh-density computational architecture that is easy to manufacture. However,\nmost proposed RC schemes have utilized passive integrated optical components\nbased on silicon-on-insulator (SOI), and RC systems based on lithium niobate on\ninsulator (LNOI) have not yet been reported. The nonlinear optical effects\nexhibited by lithium niobate microphotonic devices introduce new possibilities\nfor RC design. In this work, we design an RC scheme based on a series-coupled\nMRR array, leveraging the unique interplay between thermo-optic nonlinearity\nand photorefractive effects in lithium niobate. We first demonstrate the\nexistence of three regions defined by wavelength detuning between the primary\nLNOI micro-ring resonator and the coupled micro-ring array, where one region\nachieves an optimal balance between nonlinearity and high memory capacity at\nextremely low input energy, leading to superior computational performance. We\nthen discuss in detail the impact of each ring's nonlinearity and the system's\nsymbol duration on performance. Finally, we design a wavelength-division\nmultiplexing (WDM) based multi-task parallel computing scheme, showing that the\ncomputational performance for multiple tasks matches that of single-task\ncomputations.\n","subjects":["Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}