{"id":"2408.13214","title":"EUR-USD Exchange Rate Forecasting Based on Information Fusion with Large\n  Language Models and Deep Learning Methods","authors":"Hongcheng Ding, Xuanze Zhao, Zixiao Jiang, Shamsul Nahar Abdullah,\n  Deshinta Arrova Dewi","authorsParsed":[["Ding","Hongcheng",""],["Zhao","Xuanze",""],["Jiang","Zixiao",""],["Abdullah","Shamsul Nahar",""],["Dewi","Deshinta Arrova",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 16:46:36 GMT"}],"updateDate":"2024-08-26","timestamp":1724431596000,"abstract":"  Accurate forecasting of the EUR/USD exchange rate is crucial for investors,\nbusinesses, and policymakers. This paper proposes a novel framework, IUS, that\nintegrates unstructured textual data from news and analysis with structured\ndata on exchange rates and financial indicators to enhance exchange rate\nprediction. The IUS framework employs large language models for sentiment\npolarity scoring and exchange rate movement classification of texts. These\ntextual features are combined with quantitative features and input into a\nCausality-Driven Feature Generator. An Optuna-optimized Bi-LSTM model is then\nused to forecast the EUR/USD exchange rate. Experiments demonstrate that the\nproposed method outperforms benchmark models, reducing MAE by 10.69% and RMSE\nby 9.56% compared to the best performing baseline. Results also show the\nbenefits of data fusion, with the combination of unstructured and structured\ndata yielding higher accuracy than structured data alone. Furthermore, feature\nselection using the top 12 important quantitative features combined with the\ntextual features proves most effective. The proposed IUS framework and\nOptuna-Bi-LSTM model provide a powerful new approach for exchange rate\nforecasting through multi-source data integration.\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}