{"id":"2408.02081","title":"Secure and Transparent Medical Record Management System Using Python and\n  Blockchain","authors":"Atchiyya Naidu Chitikela","authorsParsed":[["Chitikela","Atchiyya Naidu",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 16:29:13 GMT"}],"updateDate":"2024-08-06","timestamp":1722788953000,"abstract":"  In this paper, we propose a robust health record storage and management\nsystem built on blockchain technology to address the challenges faced by\ntraditional healthcare record systems. The primary advantage of employing\nblockchain in healthcare record management is its ability to provide a secure\nand decentralized platform. Unlike traditional centralized databases, where a\nsingle point of failure can compromise data integrity and security, blockchain\ndistributes data across a network of nodes, ensuring redundancy and resilience\nagainst cyber-attacks. This distributed nature of blockchain enhances data\nsecurity and privacy, crucial considerations when dealing with sensitive health\ninformation. Central to our proposed system is the utilization of smart\ncontracts, which are self-executing contracts with predefined rules and\nconditions. Smart contracts automate processes related to health record\nmanagement, such as data access, sharing, and updating, based on predefined\npermissions and protocols. This automation not only streamlines administrative\ntasks but also reduces the risk of human errors and ensures data accuracy and\nconsistency. Furthermore, our system prioritizes patient empowerment by\ngranting individuals complete control over their health records. Patients can\nsecurely access and manage their data using cryptographic keys, granting\npermission to healthcare providers or other authorized entities as needed.\nOverall, our proposed health record storage and management system on the\nblockchain offer significant advantages over traditional systems, including\nenhanced security, data integrity, transparency, and patient control. By\nleveraging blockchain technology and smart contracts, healthcare organizations\ncan revolutionize their record management practices, and maintaining secure\necosystems.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}