{"id":"2408.00263","title":"Dynamical Viability Assessment for Habitable Worlds Observatory Targets","authors":"Stephen R. Kane, Zhexing Li, Margaret C. Turnbull, Courtney D.\n  Dressing, Caleb K. Harada","authorsParsed":[["Kane","Stephen R.",""],["Li","Zhexing",""],["Turnbull","Margaret C.",""],["Dressing","Courtney D.",""],["Harada","Caleb K.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 03:40:16 GMT"}],"updateDate":"2024-08-02","timestamp":1722483616000,"abstract":"  Exoplanetary science is increasingly prioritizing efforts toward direct\nimaging of planetary systems, with emphasis on those that may enable the\ndetection and characterization of potentially habitable exoplanets. The recent\n2020 Astronomy and Astrophysics decadal survey recommended the development of a\nspace-based direct imaging mission that has subsequently been referred to as\nthe Habitable Worlds Observatory (HWO). A fundamental challenge in the\npreparatory work for the HWO search for exo-Earths is the selection of suitable\nstellar targets. Much of the prior efforts regarding the HWO targets has\noccurred within the context of exoplanet surveys that have characterized the\nstellar properties for the nearest stars. The preliminary input catalog for HWO\nconsists of 164 stars, of which 30 are known exoplanet hosts to 70 planets.\nHere, we provide a dynamical analysis for these 30 systems, injecting a\nterrestrial planet mass into the Habitable Zone (HZ) and determining the\nconstraints on stable orbit locations due to the influence of the known\nplanets. For each system, we calculate the percentage of the HZ that is\ndynamically viable for the potential presence of a terrestrial planet,\nproviding an additional metric for inclusion of the stars within the HWO target\nlist. Our analysis shows that, for 11 of the systems, less than 50% of the HZ\nis dynamically viable, primarily due to the presence of giant planets whose\norbits pass near or through the HZ. These results demonstrate the impact that\nknown system architectures can have on direct imaging target selection and\noverall system habitability.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}