{"id":"2408.11450","title":"Persistent Homology via Ellipsoids","authors":"Sara Kali\\v{s}nik and Bastian Rieck and Ana \\v{Z}egarac","authorsParsed":[["Kališnik","Sara",""],["Rieck","Bastian",""],["Žegarac","Ana",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 09:10:27 GMT"}],"updateDate":"2024-08-22","timestamp":1724231427000,"abstract":"  Persistent homology is one of the most popular methods in Topological Data\nAnalysis. An initial step in any analysis with persistent homology involves\nconstructing a nested sequence of simplicial complexes, called a filtration,\nfrom a point cloud. There is an abundance of different complexes to choose\nfrom, with Rips, Alpha, and witness complexes being popular choices. In this\nmanuscript, we build a different type of a geometrically-informed simplicial\ncomplex, called an ellipsoid complex. This complex is based on the idea that\nellipsoids aligned with tangent directions better approximate the data compared\nto conventional (Euclidean) balls centered at sample points that are used in\nthe construction of Rips and Alpha complexes, for instance. We use Principal\nComponent Analysis to estimate tangent spaces directly from samples and present\nalgorithms as well as an implementation for computing ellipsoid barcodes, i.e.,\ntopological descriptors based on ellipsoid complexes. Furthermore, we conduct\nextensive experiments and compare ellipsoid barcodes with standard Rips\nbarcodes. Our findings indicate that ellipsoid complexes are particularly\neffective for estimating homology of manifolds and spaces with bottlenecks from\nsamples. In particular, the persistence intervals corresponding to a\nground-truth topological feature are longer compared to the intervals obtained\nwhen using the Rips complex of the data. Furthermore, ellipsoid barcodes lead\nto better classification results in sparsely-sampled point clouds. Finally, we\ndemonstrate that ellipsoid barcodes outperform Rips barcodes in classification\ntasks.\n","subjects":["Mathematics/Algebraic Topology","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}