{"id":"2408.09780","title":"Volatile MoS${_2}$ Memristors with Lateral Silver Ion Migration for\n  Artificial Neuron Applications","authors":"Sofia Cruces, Mohit D. Ganeriwala, Jimin Lee, Lukas V\\\"olkel, Dennis\n  Braun, Annika Grundmann, Ke Ran, Enrique G. Mar\\'in, Holger Kalisch, Michael\n  Heuken, Andrei Vescan, Joachim Mayer, Andr\\'es Godoy, Alwin Daus, Max C.\n  Lemme","authorsParsed":[["Cruces","Sofia",""],["Ganeriwala","Mohit D.",""],["Lee","Jimin",""],["Völkel","Lukas",""],["Braun","Dennis",""],["Grundmann","Annika",""],["Ran","Ke",""],["Marín","Enrique G.",""],["Kalisch","Holger",""],["Heuken","Michael",""],["Vescan","Andrei",""],["Mayer","Joachim",""],["Godoy","Andrés",""],["Daus","Alwin",""],["Lemme","Max C.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 08:11:45 GMT"}],"updateDate":"2024-08-20","timestamp":1724055105000,"abstract":"  Layered two-dimensional (2D) semiconductors have shown enhanced ion migration\ncapabilities along their van der Waals (vdW) gaps and on their surfaces. This\neffect can be employed for resistive switching (RS) in devices for emerging\nmemories, selectors, and neuromorphic computing. To date, all lateral\nmolybdenum disulfide (MoS${_2}$)-based volatile RS devices with silver (Ag) ion\nmigration have been demonstrated using exfoliated, single-crystal MoS${_2}$\nflakes requiring a forming step to enable RS. Here, we present volatile RS with\nmultilayer MoS${_2}$ grown by metal-organic chemical vapor deposition (MOCVD)\nwith repeatable forming-free operation. The devices show highly reproducible\nvolatile RS with low operating voltages of approximately 2 V and fast switching\ntimes down to 130 ns considering their micrometer scale dimensions. We\ninvestigate the switching mechanism based on Ag ion surface migration through\ntransmission electron microscopy, electronic transport modeling, and density\nfunctional theory. Finally, we develop a physics-based compact model and\nexplore the implementation of our volatile memristors as artificial neurons in\nneuromorphic systems.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"53kXWTIehr7qvhgwidvV4fnOopZfxgUclBv6lB5f7mY","pdfSize":"2415653"}
