{"id":"2408.16992","title":"Exaptation: Academic mentees' career pathway to be independent and\n  impactful","authors":"Yanmeng Xing, Ye Sun, Tongxin Pan, Xianglong Liang, Giacomo Livan,\n  Yifang Ma","authorsParsed":[["Xing","Yanmeng",""],["Sun","Ye",""],["Pan","Tongxin",""],["Liang","Xianglong",""],["Livan","Giacomo",""],["Ma","Yifang",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 03:43:23 GMT"}],"updateDate":"2024-09-02","timestamp":1724989403000,"abstract":"  In science, mentees often follow their mentors' career paths, but exceptional\nmentees frequently break from this routine, sometimes even outperforming their\nmentors. However, the pathways to independence for these excellent mentees and\ntheir interactions with mentors remain unclear. We analyzed the careers of over\n500,000 mentees in Chemistry, Neuroscience, and Physics over the past 60 years\nto examine the strategies mentees employ in selecting research topics relative\nto their mentors, how these strategies evolve, and their resulting impact.\nUtilizing co-citation network analysis and a topic-specific impact allocation\nalgorithm, we mapped the topic territory for each mentor-mentee pair and\nquantified their academic impact accrued within the topic. Our findings reveal\nmentees tend to engage with their mentors' less-dominated topics and explore\nnew topics at the same time, and through this exaptive process, they begin to\nprogressively establish their own research territories. This trend is\nparticularly pronounced among those who outperform their mentors. Moreover, we\nidentified an inverted U-shaped curve between the extent of topic divergence\nand the mentees' long-term impact, suggesting a moderate divergence from the\nmentors' research focus optimizes the mentees' academic impact. Finally, along\nthe path to independence, increased coauthorship with mentors impedes the\nmentees' impact, whereas extending their collaboration networks with the\nmentors' former collaborators proves beneficial. These findings fill a crucial\ngap in understanding how mentees' research topic selection strategies affect\nacademic success and offer valuable guidance for early-career researchers on\npursuing independent research paths.\n","subjects":["Computing Research Repository/Digital Libraries","Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}