{"id":"2408.02576","title":"Nanoscale Engineering of Wurtzite Ferroelectrics: Unveiling Phase\n  Transition and Ferroelectric Switching in ScAlN Nanowires","authors":"Ding Wang, Ping Wang, Shubham Mondal, Mingtao Hu, Yuanpeng Wu, Danhao\n  Wang, Kai Sun, and Zetian Mi","authorsParsed":[["Wang","Ding",""],["Wang","Ping",""],["Mondal","Shubham",""],["Hu","Mingtao",""],["Wu","Yuanpeng",""],["Wang","Danhao",""],["Sun","Kai",""],["Mi","Zetian",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 15:49:54 GMT"}],"updateDate":"2024-08-06","timestamp":1722872994000,"abstract":"  The pursuit of extreme device miniaturization and the exploration of novel\nphysical phenomena have spurred significant interest in crystallographic phase\ncontrol and ferroelectric switching in reduced dimensions. Recently, wurtzite\nferroelectrics have emerged as a new class of functional materials, offering\nintriguing piezoelectric and ferroelectric properties, CMOS compatibility, and\nseamless integration with mainstream semiconductor technology. However, the\nexploration of crystallographic phase and ferroelectric switching in reduced\ndimensions, especially in nanostructures, has remained a largely uncharted\nterritory. In this study, we present the first comprehensive investigation into\nthe crystallographic phase transition of ScAlN nanowires across the full Sc\ncompositional range. While a gradual transition from wurtzite to cubic phase\nwas observed with increasing Sc composition, we further demonstrated that a\nhighly ordered wurtzite phase ScAlN could be confined at the ScAlN/GaN\ninterface for Sc contents surpassing what is possible in conventional films,\nholding great potential to addressing the fundamental high coercive field of\nwurtzite ferroelectrics. In addition, we provide the first evidence of\nferroelectric switching in ScAlN nanowires, a result that holds significant\nimplications for future device miniaturization. Our demonstration of tunable\nferroelectric ScAlN nanowires opens new possibilities for nanoscale, domain,\nalloy, strain, and quantum engineering of wurtzite ferroelectrics, representing\na significant stride towards the development of next-generation, miniaturized\ndevices based on wurtzite ferroelectrics.\n","subjects":["Condensed Matter/Materials Science","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"6_taEHbahxU1agBjvMS5mFGu2YPKYoCKZVItI1ioOCw","pdfSize":"2057123","txDigest":"EbadN83X2WeZxgi8EwRbHJ9CwMkxhokht2kKqh43284v","endEpoch":"1","status":"CERTIFIED"}
