{"id":"2408.07837","title":"Regimes of rotating convection in an experimental model of the Earth's\n  tangent cylinder","authors":"Rishav Agrawal, Martin Holdsworth and Alban Poth\\'erat","authorsParsed":[["Agrawal","Rishav",""],["Holdsworth","Martin",""],["Pothérat","Alban",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 22:22:44 GMT"}],"updateDate":"2024-08-16","timestamp":1723674164000,"abstract":"  Earth's fast rotation imposes the Taylor-Proudman Constraint that opposes\nfluid motion across an imaginary cylindrical surface called the Tangent\nCylinder (TC) obtained by extruding the equatorial perimeter of the solid inner\ncore along the rotation direction, and up to the core-mantle boundary (CMB). To\ndate however, the influence of this boundary is unknown and this impedes our\nunderstanding of the flow in the polar regions of the core. We reproduce the TC\ngeometry experimentally, where the CMB is modelled as a cold, cylindrical\nvessel, with a hot cylinder inside it acting as the inner solid core. The\nvessel is filled with water so as to optically map the velocity field in\nregimes of criticality and rotational constraint consistent with those of the\nEarth. We find that the main new mechanism arises out of the baroclinicity near\nthe cold lateral boundary of the vessel, which drives inertia at the outer\nboundary of the TC, as convection in the equatorial regions of the Earth's core\ndoes. The baroclinicity just outside the TC suppresses the classical wall modes\nfound in solid cylinder and the inertia there causes an early breakup of the\nTPC at the TC boundary. The flow remains dominated by the Coriolis force even\nup to criticality $\\Rt=191$, but because of inertia near the TC boundary,\ngeostrophic turbulence appears at much lower criticality than in other\nsettings. The heat flux escapes increasingly through the TC boundary as the TPC\nbecomes weaker. Hence inertia driven by baroclinicity outside the TC provides a\nconvenient shortcut to geostrophic turbulence, which is otherwise difficult to\nreach in experiments. These results also highlight a process whereby the\nconvection outside the TC may control turbulence inside it and bypass the axial\nheat transfer. We finally discuss how Earth's conditions, especially its\nmagnetic field may change how this process acts within the Earth's core.\n","subjects":["Physics/Geophysics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/"}