{"id":"2408.05386","title":"Debiased Estimating Equation Method for Versatile and Efficient\n  Mendelian Randomization Using Large Numbers of Correlated Weak and Invalid\n  Instruments","authors":"Ruoyu Wang, Haoyu Zhang, Xihong Lin","authorsParsed":[["Wang","Ruoyu",""],["Zhang","Haoyu",""],["Lin","Xihong",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 23:51:06 GMT"}],"updateDate":"2024-08-13","timestamp":1723247466000,"abstract":"  Mendelian randomization (MR) is a widely used tool for causal inference in\nthe presence of unobserved confounders, which uses single nucleotide\npolymorphisms (SNPs) as instrumental variables (IVs) to estimate causal\neffects. However, SNPs often have weak effects on complex traits, leading to\nbias and low statistical efficiency in existing MR analysis due to weak\ninstruments that are often used. The linkage disequilibrium (LD) among SNPs\nposes additional statistical hurdles. Specifically, existing MR methods often\nrestrict analysis to independent SNPs via LD clumping and result in efficiency\nloss in estimating the causal effect. To address these issues, we propose the\nDebiased Estimating Equation Method (DEEM), a summary statistics-based MR\napproach that incorporates a large number of correlated weak-effect and invalid\nSNPs. DEEM not only effectively eliminates the weak IV bias but also improves\nthe statistical efficiency of the causal effect estimation by leveraging\ninformation from many correlated SNPs. DEEM is a versatile method that allows\nfor pleiotropic effects, adjusts for Winner's curse, and is applicable to both\ntwo-sample and one-sample MR analyses. Asymptotic analyses of the DEEM\nestimator demonstrate its attractive theoretical properties. Through extensive\nsimulations and two real data examples, we demonstrate that DEEM improves the\nefficiency and robustness of MR analysis compared with existing methods.\n","subjects":["Statistics/Methodology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}