{"id":"2408.13694","title":"Giant enhancement of bacterial upstream swimming in macromolecular flows","authors":"Ding Cao, Ran Tao, Albane Th\\'ery, Song Liu, Arnold J. T. M.\n  Mathijssen, Yilin Wu","authorsParsed":[["Cao","Ding",""],["Tao","Ran",""],["Théry","Albane",""],["Liu","Song",""],["Mathijssen","Arnold J. T. M.",""],["Wu","Yilin",""]],"versions":[{"version":"v1","created":"Sun, 25 Aug 2024 00:03:57 GMT"}],"updateDate":"2024-08-27","timestamp":1724544237000,"abstract":"  Many bacteria live in natural and clinical environments with abundant\nmacromolecular polymers. Macromolecular fluids commonly display viscoelasticity\nand non-Newtonian rheological behavior; it is unclear how these complex-fluid\nproperties affect bacterial transport in flows. Here we combine high-resolution\nmicroscopy and numerical simulations to study bacterial response to shear flows\nof various macromolecular fluids. In stark contrast to the case in Newtonian\nshear flows, we found that flagellated bacteria in macromolecular flows display\na giant capacity of upstream swimming (a behavior resembling fish swimming\nagainst current) near solid surfaces: The cells can counteract flow washing at\nshear rates up to ~65 $s^{-1}$, one order of magnitude higher than the limit\nfor cells swimming in Newtonian flows. The significant enhancement of upstream\nswimming depends on two characteristic complex-fluid properties, namely\nviscoelasticity and shear-thinning viscosity; meanwhile, increasing the\nviscosity with a Newtonian polymer can prevent upstream motion. By visualizing\nflagellar bundles and modeling bacterial swimming in complex fluids, we explain\nthe phenomenon as primarily arising from the augmentation of a \"weathervane\neffect\" in macromolecular flows due to the presence of a viscoelastic lift\nforce and a shear-thinning induced azimuthal torque promoting the alignment of\nbacteria against the flow direction. Our findings shed light on bacterial\ntransport and surface colonization in macromolecular environments, and may\ninform the design of artificial helical microswimmers for biomedical\napplications in physiological conditions.\n","subjects":["Condensed Matter/Soft Condensed Matter","Physics/Biological Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}