{"id":"2408.03585","title":"Hierarchical Neural Constructive Solver for Real-world TSP Scenarios","authors":"Yong Liang Goh, Zhiguang Cao, Yining Ma, Yanfei Dong, Mohammed Haroon\n  Dupty, Wee Sun Lee","authorsParsed":[["Goh","Yong Liang",""],["Cao","Zhiguang",""],["Ma","Yining",""],["Dong","Yanfei",""],["Dupty","Mohammed Haroon",""],["Lee","Wee Sun",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 06:44:47 GMT"}],"updateDate":"2024-08-08","timestamp":1723013087000,"abstract":"  Existing neural constructive solvers for routing problems have predominantly\nemployed transformer architectures, conceptualizing the route construction as a\nset-to-sequence learning task. However, their efficacy has primarily been\ndemonstrated on entirely random problem instances that inadequately capture\nreal-world scenarios. In this paper, we introduce realistic Traveling Salesman\nProblem (TSP) scenarios relevant to industrial settings and derive the\nfollowing insights: (1) The optimal next node (or city) to visit often lies\nwithin proximity to the current node, suggesting the potential benefits of\nbiasing choices based on current locations. (2) Effectively solving the TSP\nrequires robust tracking of unvisited nodes and warrants succinct grouping\nstrategies. Building upon these insights, we propose integrating a learnable\nchoice layer inspired by Hypernetworks to prioritize choices based on the\ncurrent location, and a learnable approximate clustering algorithm inspired by\nthe Expectation-Maximization algorithm to facilitate grouping the unvisited\ncities. Together, these two contributions form a hierarchical approach towards\nsolving the realistic TSP by considering both immediate local neighbourhoods\nand learning an intermediate set of node representations. Our hierarchical\napproach yields superior performance compared to both classical and recent\ntransformer models, showcasing the efficacy of the key designs.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"An-Yt4fzHmZ86nHKvXuAjke4LN6afhKUB7nMH1E7Dy4","pdfSize":"2879280"}
