{"id":"2408.05407","title":"Impact of Majorana fermions on the Kondo state in the carbon nanotube\n  quantum dot","authors":"D. Krychowski","authorsParsed":[["Krychowski","D.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 02:17:32 GMT"}],"updateDate":"2024-08-13","timestamp":1723256252000,"abstract":"  We have studied the quantum conductance of the Kondo state in the carbon\nnanotube quantum dot (CNTQD) with side-attached multi-Majorana fermion states\nin topological superconductors (TSCs). The zero-energy Majorana fermions\ninterfere with the fourfold degenerate states of the CNTQD in the spin-orbital\nKondo regime. Using the extended Kotliar-Ruckenstein slave-boson mean-field\napproach, we have analyzed the symmetry reduction of the SU(4) Kondo effect to\nthe SU$^{\\star}$(3) Kondo state with a fractional charge in the system by\nincreasing the tunneling strength to a single Majorana fermion (TSC). We\nobserved the fractional quantum conductance, the residual impurity entropy, the\nenhancement of the thermoelectric power with two compensation points, the\nfractional linear and nonlinear Fano factor ($F_{K}$) and the spin polarization\nof the conductance. Two Majoranas (2TSC) in conjunction with the CNTQD have\nreduced the spin-orbital Kondo effect to the SU$^{\\star}$(2) Kondo state with\n2e in the system. $F_{K}$ contains information about the effective charge and\nthe interaction between the quasiparticles, two- and three-body correlators and\nidentifies the broken symmetry of the Kondo state. We discussed the local\nquadratic Casimir operator separately for the states associated with the Kondo\neffect and the Majorana fermion state to show the difference between the\nfluctuations of the pseudospin in both quantum channels. We have shown that the\ndevice coupled with three Majorana fermions (3TSC) achieves a quantized\nconductance $5/2(e^{2}/h)$, conserves the U$^{\\star}$(1) charge symmetry at the\nelectron-hole symmetry point and manifests the increase in nonlinear current\nand shot noise due to the entanglement in octuplets with opposite\ncharge-leaking states. Furthermore, we have investigated the influence of the\nspin-orbit interaction in the CNTQD-TSC device on the quantum transport\nproperties.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}