{"id":"2408.04880","title":"Computational Realization of Popping Impinging Sprays of Hypergolic\n  Bipropellants by a Eulerian-Lagrangian Approach","authors":"Jinyang Wang, Kai Sun, Tianyou Wang, Peng Zhang","authorsParsed":[["Wang","Jinyang",""],["Sun","Kai",""],["Wang","Tianyou",""],["Zhang","Peng",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 06:04:07 GMT"}],"updateDate":"2024-08-12","timestamp":1723183447000,"abstract":"  This work adopts a Eulerian-Lagrangian approach to numerically simulate the\nspray impingement of MMH (Monomethyl hydrazine)/NTO (nitrogen tetroxide), which\nare prevalent rocket engine bipropellants for deep space missions and satellite\norbital maneuvers. The emphasis of the work is to computationally realize the\npopping phenomenon and to study its parametric dependence on liquid and\ngas-phase reaction rates. The liquid-phase reaction of MMH/NTO is realized\nbased on the extended spray equation, incorporating the additional independent\nvariable, propellant mass fraction, to account for the mixing of droplets. The\nspray popping can be computationally reproduced over wide ranges of Damk\\\"ohler\nnumbers for both liquid- and gas-phase reactions. Furthermore, the\ncomputational results have been validated through qualitative comparison with\nexperimental images and quantitative comparison with experimental frequencies.\nThe present results verify our hypothesis that the heat release from the\nliquid-phase reaction enhances the evaporation of MMH and NTO so that the\nintense gas-phase reaction zone around the spray impingement point periodically\nseparates the MMH and NTO impinging sprays to cause the popping phenomenon.\nFurthermore, it was found that the popping phenomenon can be suppressed by\nreducing the Damk\\\"ohler numbers of liquid-phase reaction and therefore to\nsuppress the evaporation of the propellants. This work is believed to provide\nvaluable understanding for avoiding the off-design popping phenomenon that may\nreduce combustion efficiency and increase the risk of combustion instability in\nrocket engines.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}