{"id":"2408.06350","title":"Predicting cognitive load in immersive driving scenarios with a hybrid\n  CNN-RNN model","authors":"Mehshan Ahmed Khan, Houshyar Asadi, Mohammad Reza Chalak Qazani,\n  Adetokunbo Arogbonlo, Saeid Nahavandi, Chee Peng Lim","authorsParsed":[["Khan","Mehshan Ahmed",""],["Asadi","Houshyar",""],["Qazani","Mohammad Reza Chalak",""],["Arogbonlo","Adetokunbo",""],["Nahavandi","Saeid",""],["Lim","Chee Peng",""]],"versions":[{"version":"v1","created":"Wed, 24 Jul 2024 04:08:59 GMT"}],"updateDate":"2024-08-14","timestamp":1721794139000,"abstract":"  One debatable issue in traffic safety research is that cognitive load from\nsec-ondary tasks reduces primary task performance, such as driving. Although\nphysiological signals have been extensively used in driving-related research to\nassess cognitive load, only a few studies have specifically focused on high\ncognitive load scenarios. Most existing studies tend to examine moderate or low\nlevels of cognitive load In this study, we adopted an auditory version of the\nn-back task of three levels as a cognitively loading secondary task while\ndriving in a driving simulator. During the simultaneous execution of driving\nand the n-back task, we recorded fNIRS, eye-tracking, and driving behavior data\nto predict cognitive load at three different levels. To the best of our\nknowledge, this combination of data sources has never been used before. Un-like\nmost previous studies that utilize binary classification of cognitive load and\ndriving in conditions without traffic, our study involved three levels of\ncognitive load, with drivers operating in normal traffic conditions under low\nvisibility, specifically during nighttime and rainy weather. We proposed a\nhybrid neural network combining a 1D Convolutional Neural Network and a\nRecurrent Neural Network to predict cognitive load. Our experimental re-sults\ndemonstrate that the proposed model, with fewer parameters, increases accuracy\nfrom 99.82% to 99.99% using physiological data, and from 87.26% to 92.02% using\ndriving behavior data alone. This significant improvement highlights the\neffectiveness of our hybrid neural network in accurately pre-dicting cognitive\nload during driving under challenging conditions.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}