{"id":"2408.14249","title":"Beyond Few-shot Object Detection: A Detailed Survey","authors":"Vishal Chudasama, Hiran Sarkar, Pankaj Wasnik, Vineeth N\n  Balasubramanian, Jayateja Kalla","authorsParsed":[["Chudasama","Vishal",""],["Sarkar","Hiran",""],["Wasnik","Pankaj",""],["Balasubramanian","Vineeth N",""],["Kalla","Jayateja",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 13:09:23 GMT"}],"updateDate":"2024-08-27","timestamp":1724677763000,"abstract":"  Object detection is a critical field in computer vision focusing on\naccurately identifying and locating specific objects in images or videos.\nTraditional methods for object detection rely on large labeled training\ndatasets for each object category, which can be time-consuming and expensive to\ncollect and annotate. To address this issue, researchers have introduced\nfew-shot object detection (FSOD) approaches that merge few-shot learning and\nobject detection principles. These approaches allow models to quickly adapt to\nnew object categories with only a few annotated samples. While traditional FSOD\nmethods have been studied before, this survey paper comprehensively reviews\nFSOD research with a specific focus on covering different FSOD settings such as\nstandard FSOD, generalized FSOD, incremental FSOD, open-set FSOD, and domain\nadaptive FSOD. These approaches play a vital role in reducing the reliance on\nextensive labeled datasets, particularly as the need for efficient machine\nlearning models continues to rise. This survey paper aims to provide a\ncomprehensive understanding of the above-mentioned few-shot settings and\nexplore the methodologies for each FSOD task. It thoroughly compares\nstate-of-the-art methods across different FSOD settings, analyzing them in\ndetail based on their evaluation protocols. Additionally, it offers insights\ninto their applications, challenges, and potential future directions in the\nevolving field of object detection with limited data.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}