{"id":"2408.02121","title":"Non-invasive imaging assisted CFD simulation of 4D multi-modal fluid\n  flow using In-situ adaptor","authors":"Vaishali Sharma, Arpit Kumar, Snehlata Shakya, and Mayank Goswami","authorsParsed":[["Sharma","Vaishali",""],["Kumar","Arpit",""],["Shakya","Snehlata",""],["Goswami","Mayank",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 19:28:28 GMT"}],"updateDate":"2024-08-06","timestamp":1722799708000,"abstract":"  X-ray Computed Tomography (CT) is used to recover the true surfaces of fluid\nchannels and fed to simulation tool (ANSYS) to create accurate cyber\nenvironment. The simulation tool also receives CT-assisted multiphase fluid\nprofiles (belonging to the instance just before the flow starts) as an initial\ncondition.\n  This unique methodology is made possible by using a novel in-situ compact\nadaptor design is used to create fluid channels that can be placed inside any\nindustrial X-ray CT and fulfill the above objective. It is integrated with an\nandroid based App to control the flow once placed inside CT. It is portable and\ncompact enough: (a) to be placed inside various experimental environments, and\n(b) modular enough to be mounted with multi-modal systems simultaneously.\n  Two key parameters, (a) spatial distribution and (b) the air volume fraction,\nare measured using two different non-invasive imaging modalities: (a)\nElectrical Impedance Tomography (EIT) and (d) X-ray Computed Tomography (CT).\nSimulated outcomes are correlated with the experimental outcomes from both EIT\nand X-ray CT, showing an agreement of 85 to 98 percent, respectively.\nTime-averaged electrically conductive fluid flow profile obtained by EIT shows\na match with mass mass-attenuated fluid profile obtained by X-ray CT,\njustifying the utility of an in-situ adaptor. CT assistance for CFD studies can\nbe replaced by EIT assistance as former techniques: (a) scanning time may be\nrelatively slower than the latter, (b) it does not require rotations, (c)\neconomical, and (d) fluid channels need not be placed inside of shielded\ncompartment thus improving practicality. The data of analysis is shared in this\nwork.\n  Multimodal non-invasive imaging provides multiphase flow information, it also\ndifferentiates conductive, and mass-attenuated multiphase profiles at common\ncross-sections.\n","subjects":["Physics/Fluid Dynamics","Physics/Applied Physics","Physics/Computational Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}