{"id":"2408.07728","title":"Moderator: Moderating Text-to-Image Diffusion Models through\n  Fine-grained Context-based Policies","authors":"Peiran Wang, Qiyu Li, Longxuan Yu, Ziyao Wang, Ang Li, Haojian Jin","authorsParsed":[["Wang","Peiran",""],["Li","Qiyu",""],["Yu","Longxuan",""],["Wang","Ziyao",""],["Li","Ang",""],["Jin","Haojian",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 16:44:46 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 02:39:27 GMT"}],"updateDate":"2024-09-13","timestamp":1723653886000,"abstract":"  We present Moderator, a policy-based model management system that allows\nadministrators to specify fine-grained content moderation policies and modify\nthe weights of a text-to-image (TTI) model to make it significantly more\nchallenging for users to produce images that violate the policies. In contrast\nto existing general-purpose model editing techniques, which unlearn concepts\nwithout considering the associated contexts, Moderator allows admins to specify\nwhat content should be moderated, under which context, how it should be\nmoderated, and why moderation is necessary. Given a set of policies, Moderator\nfirst prompts the original model to generate images that need to be moderated,\nthen uses these self-generated images to reverse fine-tune the model to compute\ntask vectors for moderation and finally negates the original model with the\ntask vectors to decrease its performance in generating moderated content. We\nevaluated Moderator with 14 participants to play the role of admins and found\nthey could quickly learn and author policies to pass unit tests in\napproximately 2.29 policy iterations. Our experiment with 32 stable diffusion\nusers suggested that Moderator can prevent 65% of users from generating\nmoderated content under 15 attempts and require the remaining users an average\nof 8.3 times more attempts to generate undesired content.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}