{"id":"2408.11727","title":"Efficient Detection of Toxic Prompts in Large Language Models","authors":"Yi Liu, Junzhe Yu, Huijia Sun, Ling Shi, Gelei Deng, Yuqi Chen, Yang\n  Liu","authorsParsed":[["Liu","Yi",""],["Yu","Junzhe",""],["Sun","Huijia",""],["Shi","Ling",""],["Deng","Gelei",""],["Chen","Yuqi",""],["Liu","Yang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:54:04 GMT"},{"version":"v2","created":"Sat, 14 Sep 2024 02:04:15 GMT"}],"updateDate":"2024-09-17","timestamp":1724255644000,"abstract":"  Large language models (LLMs) like ChatGPT and Gemini have significantly\nadvanced natural language processing, enabling various applications such as\nchatbots and automated content generation. However, these models can be\nexploited by malicious individuals who craft toxic prompts to elicit harmful or\nunethical responses. These individuals often employ jailbreaking techniques to\nbypass safety mechanisms, highlighting the need for robust toxic prompt\ndetection methods. Existing detection techniques, both blackbox and whitebox,\nface challenges related to the diversity of toxic prompts, scalability, and\ncomputational efficiency. In response, we propose ToxicDetector, a lightweight\ngreybox method designed to efficiently detect toxic prompts in LLMs.\nToxicDetector leverages LLMs to create toxic concept prompts, uses embedding\nvectors to form feature vectors, and employs a Multi-Layer Perceptron (MLP)\nclassifier for prompt classification. Our evaluation on various versions of the\nLLama models, Gemma-2, and multiple datasets demonstrates that ToxicDetector\nachieves a high accuracy of 96.39\\% and a low false positive rate of 2.00\\%,\noutperforming state-of-the-art methods. Additionally, ToxicDetector's\nprocessing time of 0.0780 seconds per prompt makes it highly suitable for\nreal-time applications. ToxicDetector achieves high accuracy, efficiency, and\nscalability, making it a practical method for toxic prompt detection in LLMs.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"wSutmYVD-LyiGO2vGJBQIM46GxjPNNDmpEgBd9A4jUo","pdfSize":"2182533"}
