{"id":"2408.09651","title":"Data-driven Conditional Instrumental Variables for Debiasing Recommender\n  Systems","authors":"Zhirong Huang, Shichao Zhang, Debo Cheng, Jiuyong Li, Lin Liu,\n  Guangquan Lu","authorsParsed":[["Huang","Zhirong",""],["Zhang","Shichao",""],["Cheng","Debo",""],["Li","Jiuyong",""],["Liu","Lin",""],["Lu","Guangquan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:17:22 GMT"}],"updateDate":"2024-08-20","timestamp":1724033842000,"abstract":"  In recommender systems, latent variables can cause user-item interaction data\nto deviate from true user preferences. This biased data is then used to train\nrecommendation models, further amplifying the bias and ultimately compromising\nboth recommendation accuracy and user satisfaction. Instrumental Variable (IV)\nmethods are effective tools for addressing the confounding bias introduced by\nlatent variables; however, identifying a valid IV is often challenging. To\novercome this issue, we propose a novel data-driven conditional IV (CIV)\ndebiasing method for recommender systems, called CIV4Rec. CIV4Rec automatically\ngenerates valid CIVs and their corresponding conditioning sets directly from\ninteraction data, significantly reducing the complexity of IV selection while\neffectively mitigating the confounding bias caused by latent variables in\nrecommender systems. Specifically, CIV4Rec leverages a variational autoencoder\n(VAE) to generate the representations of the CIV and its conditional set from\ninteraction data, followed by the application of least squares to derive causal\nrepresentations for click prediction. Extensive experiments on two real-world\ndatasets, Movielens-10M and Douban-Movie, demonstrate that our CIV4Rec\nsuccessfully identifies valid CIVs, effectively reduces bias, and consequently\nimproves recommendation accuracy.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}