{"id":"2408.09001","title":"Testing the sources of the peculiar abundances in globular clusters","authors":"Ricardo J. Vaca, Ivan Cabrera-Ziri, Gladis Magris C., Nate Bastian,\n  Maurizio Salaris","authorsParsed":[["Vaca","Ricardo J.",""],["Cabrera-Ziri","Ivan",""],["C.","Gladis Magris",""],["Bastian","Nate",""],["Salaris","Maurizio",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 20:01:39 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 11:05:31 GMT"}],"updateDate":"2024-08-27","timestamp":1723838499000,"abstract":"  This work aims to analyze some of the polluters proposed in the\nself-enrichment scenarios put forward to explain the multiple populations in\nglobular clusters (GCs), extending previous studies. Three scenarios with\ndifferent polluter stars were tested: asymptotic giant branch stars, high-mass\ninteracting binaries, and fast rotating massive stars. With abundance data\navailable from the APOGEE survey and $\\Delta Y$ estimates from precise HST\nphotometry, twenty-six clusters were studied. We also included the study of the\nabundances of N, C, Mg and Al, extending previous studies that focused mainly\non the abundances of He, O and Na. In addition, we constructed an empirical\nmodel to test whether one could explain the chemical signatures of the\n'enriched' population of GC stars with a fixed source and dilution process\nbased on empirical data. In agreement with work by other authors, we found that\nthe proposed polluters can generally predict the qualitative abundance patterns\nin GC stars and in some cases quantitatively predict some elements, but in most\ncases when we compare the model yields with the observations, we find that they\ncan not explain the entire set of observed abundance patterns. The empirical\nmodel succeeds in reproducing the abundances of Al for a given $\\Delta Y$ (and\nvice versa), showing that there is a direct relationship between Al and He,\nwith one increasing proportionally to the other. However, the empirical model\nfails to reproduce the observed abundances of Na and N, in agreement with the\nresults of previous works. The observed decoupling between the maximum\nabundances of CNO-cycle elements like N and Na with those of Al and He provides\nnew information and constraints for future models and could take us a step\ncloser to understanding the origin of the peculiar abundance variations of\nglobular cluster stars.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}