{"id":"2408.14930","title":"CMTA: Cross-Modal Temporal Alignment for Event-guided Video Deblurring","authors":"Taewoo Kim, Hoonhee Cho, and Kuk-Jin Yoon","authorsParsed":[["Kim","Taewoo",""],["Cho","Hoonhee",""],["Yoon","Kuk-Jin",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:09:17 GMT"},{"version":"v2","created":"Wed, 28 Aug 2024 09:50:00 GMT"}],"updateDate":"2024-08-29","timestamp":1724753357000,"abstract":"  Video deblurring aims to enhance the quality of restored results in\nmotion-blurred videos by effectively gathering information from adjacent video\nframes to compensate for the insufficient data in a single blurred frame.\nHowever, when faced with consecutively severe motion blur situations,\nframe-based video deblurring methods often fail to find accurate temporal\ncorrespondence among neighboring video frames, leading to diminished\nperformance. To address this limitation, we aim to solve the video deblurring\ntask by leveraging an event camera with micro-second temporal resolution. To\nfully exploit the dense temporal resolution of the event camera, we propose two\nmodules: 1) Intra-frame feature enhancement operates within the exposure time\nof a single blurred frame, iteratively enhancing cross-modality features in a\nrecurrent manner to better utilize the rich temporal information of events, 2)\nInter-frame temporal feature alignment gathers valuable long-range temporal\ninformation to target frames, aggregating sharp features leveraging the\nadvantages of the events. In addition, we present a novel dataset composed of\nreal-world blurred RGB videos, corresponding sharp videos, and event data. This\ndataset serves as a valuable resource for evaluating event-guided deblurring\nmethods. We demonstrate that our proposed methods outperform state-of-the-art\nframe-based and event-based motion deblurring methods through extensive\nexperiments conducted on both synthetic and real-world deblurring datasets. The\ncode and dataset are available at https://github.com/intelpro/CMTA.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"QJGoDN9mCUudDVQm6kpPcgH38HE_lg-TdIsjGTik7hM","pdfSize":"1624640"}
