{"id":"2408.06416","title":"The Molecular Cloud Lifecycle I: Constraining H2 formation and\n  dissociation rates with observations","authors":"Shmuel Bialy, Blakesley Burkhart, Daniel Seifried, Amiel Sternberg,\n  Benjamin Godard, Mark R. Krumholz, Stefanie Walch, Erika Hamden, Thomas J.\n  Haworth, Neal J. Turner, Min-Young Lee, Shuo Kong","authorsParsed":[["Bialy","Shmuel",""],["Burkhart","Blakesley",""],["Seifried","Daniel",""],["Sternberg","Amiel",""],["Godard","Benjamin",""],["Krumholz","Mark R.",""],["Walch","Stefanie",""],["Hamden","Erika",""],["Haworth","Thomas J.",""],["Turner","Neal J.",""],["Lee","Min-Young",""],["Kong","Shuo",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-14","timestamp":1723485603000,"abstract":"  Molecular clouds (MCs) are the birthplaces of new stars in galaxies. A key\ncomponent of MCs are photodissociation regions (PDRs), where far-ultraviolet\nradiation plays a crucial role in determining the gas's physical and chemical\nstate. Traditional PDR models assume chemical steady state (CSS), where the\nrates of H$_2$ formation and photodissociation are balanced. However, real MCs\nare dynamic and can be out of CSS. In this study, we demonstrate that combining\nH$_2$ emission lines observed in the far-ultraviolet or infrared with column\ndensity observations can be used to derive the rates of H$_2$ formation and\nphotodissociation. We derive analytical formulae that relate these rates to\nobservable quantities, which we validate using synthetic H$_2$ line emission\nmaps derived from the SILCC-Zoom hydrodynamical simulation. Our method\nestimates integrated H$_2$ formation and dissociation rates to within 29\\%\naccuracy. Our simulations cover a wide dynamic range in H$_2$ formation and\nphotodissociation rates, showing significant deviations from CSS, with 74\\% of\nthe MC's mass deviating from CSS by a factor greater than 2. Our analytical\nformulae can effectively distinguish between regions in and out of CSS. When\napplied to actual H$_2$ line observations, our method can assess the chemical\nstate of MCs, providing insights into their evolutionary stages and lifetimes.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"GZ1bYsVUYwkXs7K8sJI3GgU9eNrjlyWipUcos4ubGOA","pdfSize":"6740386"}
