{"id":"2408.04515","title":"Saliency Detection in Educational Videos: Analyzing the Performance of\n  Current Models, Identifying Limitations and Advancement Directions","authors":"Evelyn Navarrete, Ralph Ewerth, Anett Hoppe","authorsParsed":[["Navarrete","Evelyn",""],["Ewerth","Ralph",""],["Hoppe","Anett",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 15:15:48 GMT"}],"updateDate":"2024-08-09","timestamp":1723130148000,"abstract":"  Identifying the regions of a learning resource that a learner pays attention\nto is crucial for assessing the material's impact and improving its design and\nrelated support systems. Saliency detection in videos addresses the automatic\nrecognition of attention-drawing regions in single frames. In educational\nsettings, the recognition of pertinent regions in a video's visual stream can\nenhance content accessibility and information retrieval tasks such as video\nsegmentation, navigation, and summarization. Such advancements can pave the way\nfor the development of advanced AI-assisted technologies that support learning\nwith greater efficacy. However, this task becomes particularly challenging for\neducational videos due to the combination of unique characteristics such as\ntext, voice, illustrations, animations, and more. To the best of our knowledge,\nthere is currently no study that evaluates saliency detection approaches in\neducational videos. In this paper, we address this gap by evaluating four\nstate-of-the-art saliency detection approaches for educational videos. We\nreproduce the original studies and explore the replication capabilities for\ngeneral-purpose (non-educational) datasets. Then, we investigate the\ngeneralization capabilities of the models and evaluate their performance on\neducational videos. We conduct a comprehensive analysis to identify common\nfailure scenarios and possible areas of improvement. Our experimental results\nshow that educational videos remain a challenging context for generic video\nsaliency detection models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}