{"id":"2408.08962","title":"A Dusty Dawn: Galactic Dust Buildup at $z\\gtrsim5$","authors":"Caleb R. Choban, Samir Salim, Du\\v{s}an Kere\\v{s}, Christopher C.\n  Hayward, and Karin M. Sandstrom","authorsParsed":[["Choban","Caleb R.",""],["Salim","Samir",""],["Kereš","Dušan",""],["Hayward","Christopher C.",""],["Sandstrom","Karin M.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:20:46 GMT"}],"updateDate":"2024-08-20","timestamp":1723832446000,"abstract":"  Over the last decade, the Atacama Large Millimeter Array (ALMA) has revealed\nmassive, extremely dusty star-forming galaxies at $z\\gtrsim5$, and the James\nWebb Space Telescope (JWST) is primed to uncover even more information about\nthem. These extreme observations both need dust evolution theory to provide\ncontext and are excellent benchmarks to test this theory. Here, we investigate\nthe evolution of galactic dust populations at cosmic dawn using a suite of\ncosmological zoom-in simulations of moderately massive, high-redshift\n($M_*\\gtrsim10^9 M_{\\odot}$; $z\\gtrsim5$) galaxies from the Feedback in\nRealistic Environments (FIRE) project, the highest resolution of such\nsimulations to date. Our simulations incorporate a dust evolution model that\naccounts for the dominant sources of dust production, growth, and destruction\nand follows the evolution of specific dust species, allowing it to replicate a\nwide range of present-day observations. We find, similar to other theoretical\nworks, that dust growth via gas-dust accretion is the dominant producer of dust\nmass for these galaxies. However, our fiducial model produces $M_{\\rm dust}$\nthat fall ${\\gtrsim}1$ dex below observations at any given $M_*$, which we\nattribute to reduced accretion efficiencies caused by a combination of low\nmetallicities and extremely bursty star formation in these galaxies. Modest\nenhancements (i.e., within observational/theoretical uncertainties) to\naccretion and SNe II dust creation raise $M_{\\rm dust}$ by ${\\lesssim}1$ dex,\nbut this still falls below observations which assume $T_{\\rm dust}\\sim25$ K.\nOne possibility is that inferred dust masses for $z\\gtrsim4$ galaxies are\noverestimated, and recent observational works that find $T_{\\rm dust}\\sim50$ K\nalong with metallicity constraints tentatively support this.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}