{"id":"2408.02070","title":"The traveling-PWN modeling attempt on several mysterious $>$ 25 TeV\n  LHAASO sources","authors":"Caijin Xie, Yihan Liu, Chengyu Shao, Yudong Cui and Lili Yang","authorsParsed":[["Xie","Caijin",""],["Liu","Yihan",""],["Shao","Chengyu",""],["Cui","Yudong",""],["Yang","Lili",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 15:45:19 GMT"}],"updateDate":"2024-08-06","timestamp":1722786319000,"abstract":"  The first LHAASO catalog presents six mysterious Ultra-High-Energy (UHE)\n$\\gamma$-ray sources -- 1LHAASO J0007$+$5659u, 1LHAASO J0206$+$4302u, 1LHAASO\nJ0212$+$4254u, 1LHAASO J0216$+$4237u, 1LHAASO J1740$+$0948u and 1LHAASO\nJ1959$+$1129u, which have emission only detected by LHAASO-KM2A (energy $>$ 25\nTeV). No significant counterparts of these six sources are observed, except the\ntwo pulsars PSR J0218$+$4232 and PSR J1740$+$1000. All the six sources are out\nof Galactic plane with galactic latitudes (absolute value) over 5$^{\\circ}$.\nThree of them -- 1LHAASO J0206$+$4302u, 1LHAASO J0212$+$4254u and 1LHAASO\nJ0216$+$4237u are connected on the significance map and forming a dumbbell-like\nstructure. They are close in position and show a similar spectral shape,\nsuggesting a physical association among them. In this work, we first present a\nmulti-wavelength and multi-messenger study of these six sources based on the\nFermi-LAT, Swift-XRT, Planck and LAMBDA datasets as well as the data of\nIceCube. The corresponding leptonic and hadronic modeling results are also\nprovided. To explain the interesting dumbbell-like structure, we established a\ntraveling Pulsar Wind Nebula (PWN) model. Our model has the ability to explain\nboth the morphology and spectrum of KM2A. However, both a high proper-motion\nspeed $>$ 1000 km s$^{-1}$ and a short distance $<$ 1 kpc are required in our\nmodel, which contradict the parameters of the only known nearby pulsar - PSR\nJ0218+4232. For more detailed researches on this structure, we intend to\nutilize XMM-Newton to acquire X-ray data with higher sensitivity.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}