{"id":"2408.01057","title":"Supporting Industry Computing Researchers in Assessing, Articulating,\n  and Addressing the Potential Negative Societal Impact of Their Work","authors":"Wesley Hanwen Deng, Solon Barocas, Jennifer Wortman Vaughan","authorsParsed":[["Deng","Wesley Hanwen",""],["Barocas","Solon",""],["Vaughan","Jennifer Wortman",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 07:10:11 GMT"},{"version":"v2","created":"Mon, 12 Aug 2024 10:10:25 GMT"}],"updateDate":"2024-08-13","timestamp":1722582611000,"abstract":"  Recent years have witnessed increasing calls for computing researchers to\ngrapple with the societal impacts of their work. Tools such as impact\nassessments have gained prominence as a method to uncover potential impacts,\nand a number of publication venues now encourage authors to include an impact\nstatement in their submissions. Despite this push, little is known about the\nway researchers assess, articulate, and address the potential negative societal\nimpact of their work -- especially in industry settings, where research\noutcomes are often quickly integrated into products. In addition, while there\nare nascent efforts to support researchers in this task, there remains a dearth\nof empirically-informed tools and processes. Through interviews with 25\nindustry computing researchers across different companies and research areas,\nwe first identify four key factors that influence how they grapple with (or\nchoose not to grapple with) the societal impact of their research. To develop\nan effective impact assessment template tailored to industry computing\nresearchers' needs, we conduct an iterative co-design process with these 25\nindustry researchers and an additional 16 researchers and practitioners with\nprior experience and expertise in reviewing and developing impact assessments\nor broad responsible computing practices. Through the co-design process, we\ndevelop 10 design considerations to facilitate the effective design,\ndevelopment, and adaptation of an impact assessment template for use in\nindustry research settings and beyond, as well as our own ``Societal Impact\nAssessment'' template with concrete scaffolds. We explore the effectiveness of\nthis template through a user study with 15 industry research interns, revealing\nboth its strengths and limitations. Finally, we discuss the implications for\nfuture researchers and organizations seeking to foster more responsible\nresearch practices.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}