{"id":"2408.10387","title":"Neural Infalling Cloud Equations (NICE): Increasing the Efficacy of\n  Subgrid Models and Scientific Equation Discovery using Neural ODEs and\n  Symbolic Regression","authors":"Zun Yi Brent Tan","authorsParsed":[["Tan","Zun Yi Brent",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 20:09:46 GMT"}],"updateDate":"2024-08-21","timestamp":1724098186000,"abstract":"  It is now well established that galactic systems are inherently multiphase,\nand that understanding the roles and interactions of the various phases is key\ntowards a more complete picture of galaxy formation and evolution. For example,\nthese interactions play a pivotal role in the cycling of baryons which fuels\nstar formation. It remains a challenge that the transport and dynamics of cold\nclouds in their surrounding hot environment are governed by complex small scale\nprocesses (such as the interplay of turbulence and radiative cooling) that\ndetermine how the phases exchange mass, momentum and energy. Large scale models\nthus require subgrid prescriptions in the form of models validated on small\nscale simulations, which can take the form of a system of coupled differential\nequations. In this work, we explore using neural ordinary differential\nequations which embed a neural network as a term in the subgrid model to\ncapture an uncertain physical process. We then apply Symbolic Regression on the\nlearned model to potentially discover new insights into the physics of\ncloud-environment interactions. We test this on both generated mock data and\nactual simulation data. We also extend the neural ODE to include a secondary\nneural term. We show that neural ODEs in tandem with Symbolic Regression can be\nused to enhance the accuracy and efficiency of subgrid models, and/or discover\nthe underlying equations to improve generality and scientific understanding. We\nhighlight the potential of this scientific machine learning approach as a\nnatural extension to the traditional modelling paradigm, both for the\ndevelopment of semi-analytic models and for physically interpretable equation\ndiscovery in complex non-linear systems.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}