{"id":"2408.09660","title":"Analytical Study of a Monolayered Vibroacoustic Metamaterial","authors":"Majdi O. Gzal, Lawrence A. Bergman, Kathryn H. Matlack, Alexander F.\n  Vakakis","authorsParsed":[["Gzal","Majdi O.",""],["Bergman","Lawrence A.",""],["Matlack","Kathryn H.",""],["Vakakis","Alexander F.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:44:33 GMT"}],"updateDate":"2024-08-20","timestamp":1724035473000,"abstract":"  This study investigates a vibroacoustic phononic metamaterial system composed\nof repeated monolayered membrane-air cavity unit-cells to assess its efficacy\nin controlling sound waves. Assuming low-frequency axisymmetric modes, the\ncoupled membrane-cavity vibroacoustic system for a representative unit-cell is\nsolved entirely analytically. Unlike previous research that relied on an\ninfinite series of eigenfunctions, our analysis offers a single-term exact\nsolution for the membrane's displacement field, fully accounting for coupling\nwith the acoustic cavities. Utilizing the transfer matrix method and the\nBloch-Floquet theorem, we offer a comprehensive analytical characterization of\nthe band structure, including closed-form analytical expressions for\ndetermining the bounding frequencies of the bandgaps and the dispersion\nbranches. Interaction between Bragg and local resonance bandgaps is examined by\nadjusting Bragg bandgap positions, with detailed mathematical descriptions\nprovided for their overlapping and transition. Additionally, a \"plasma bandgap\"\nanalogous to metallic plasma oscillations is identified, with a derived\nanalytical expression for its frequency. First two passbands remain robust\nagainst cavity depth variations, limiting wave manipulation capabilities.\nAnalysis of the finite phononic system involves constructing the global\ntransfer matrix to study natural frequencies and scattering coefficients.\nInteraction between Bragg and local resonance bandgaps in finite systems\nresults in ultra-narrow passbands, creating transparency windows analogous to\nelectromagnetically induced transparency by quantum interference. This\ntheoretical framework enables precise characterization and engineering of\nbandgaps in the monolayered vibroacoustic phononic metamaterial, highlighting\nits potential for controlling low-frequency sound wave propagation across\nmultiple frequencies.\n","subjects":["Physics/Applied Physics","Physics/Classical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}