{"id":"2408.05694","title":"ICSFuzz: Collision Detector Bug Discovery in Autonomous Driving\n  Simulators","authors":"Weiwei Fu, Heqing Huang, Yifan Zhang, Ke Zhang, Jin Huang, Wei-Bin\n  Lee, Jianping Wang","authorsParsed":[["Fu","Weiwei",""],["Huang","Heqing",""],["Zhang","Yifan",""],["Zhang","Ke",""],["Huang","Jin",""],["Lee","Wei-Bin",""],["Wang","Jianping",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 04:48:54 GMT"}],"updateDate":"2024-08-13","timestamp":1723351734000,"abstract":"  With the increasing adoption of autonomous vehicles, ensuring the reliability\nof autonomous driving systems (ADSs) deployed on autonomous vehicles has become\na significant concern. Driving simulators have emerged as crucial platforms for\ntesting autonomous driving systems, offering realistic, dynamic, and\nconfigurable environments. However, existing simulation-based ADS testers have\nlargely overlooked the reliability of the simulators, potentially leading to\noverlooked violation scenarios and subsequent safety security risks during\nreal-world deployment. In our investigations, we identified that collision\ndetectors in simulators could fail to detect and report collisions in certain\ncollision scenarios, referred to as ignored collision scenarios.\n  This paper aims to systematically discover ignored collision scenarios to\nimprove the reliability of autonomous driving simulators. To this end, we\npresent ICSFuzz, a black-box fuzzing approach to discover ignored collision\nscenarios efficiently. Drawing upon the fact that the ignored collision\nscenarios are a sub-type of collision scenarios, our approach starts with the\ndetermined collision scenarios. Following the guidance provided by empirically\nstudied factors contributing to collisions, we selectively mutate arbitrary\ncollision scenarios in a step-wise manner toward the ignored collision\nscenarios and effectively discover them.\n  We compare ICSFuzz with DriveFuzz, a state-of-the-art simulation-based ADS\ntesting method, by replacing its oracle with our ignored-collision-aware\noracle. The evaluation demonstrates that ICSFuzz outperforms DriveFuzz by\nfinding 10-20x more ignored collision scenarios with a 20-70x speedup. All the\ndiscovered ignored collisions have been confirmed by developers with one CVE ID\nassigned.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}