{"id":"2408.00089","title":"The extremes of AGN variability: outbursts, deep fades, changing looks,\n  exceptional spectral states, and semi-periodicities","authors":"S. Komossa, D. Grupe, P. Marziani, L.C. Popovic, S. Marceta-Mandic, E.\n  Bon, D. Ilic, A.B. Kovacevic, A. Kraus, Z. Haiman, V. Petrecca, D. De Cicco,\n  M.S. Dimitrijevic, V.A. Sreckovic, J. Kovacevic Dojcinovic, M. Pannikkote, N.\n  Bon, K.K. Gupta, F. Iacob","authorsParsed":[["Komossa","S.",""],["Grupe","D.",""],["Marziani","P.",""],["Popovic","L. C.",""],["Marceta-Mandic","S.",""],["Bon","E.",""],["Ilic","D.",""],["Kovacevic","A. B.",""],["Kraus","A.",""],["Haiman","Z.",""],["Petrecca","V.",""],["De Cicco","D.",""],["Dimitrijevic","M. S.",""],["Sreckovic","V. A.",""],["Dojcinovic","J. Kovacevic",""],["Pannikkote","M.",""],["Bon","N.",""],["Gupta","K. K.",""],["Iacob","F.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:06:11 GMT"}],"updateDate":"2024-08-02","timestamp":1722449171000,"abstract":"  The extremes of Active Galactic Nuclei (AGN) variability offer valuable new\ninsights into the drivers and physics of AGN. We discuss some of the most\nextreme cases of AGN variability; the highest amplitudes, deep minima states,\nextreme spectral states, Seyfert-type changes, and semi-periodic signals,\nincluding new X-ray observations. The properties of changing-look (CL) AGN are\nbriefly reviewed and a classification scheme is proposed which encompasses the\nvariety of CL phenomena; distinguishing slow and fast events, repeat events,\nand frozen-look AGN which do not show any emission-line response. Long-term\nlight curves that are densely covered over multiple years, along with follow-up\nspectroscopy, are utilized to gain insight into the underlying variability\nmechanisms including accretion disk and broad-line region physics. Remarkable\ndifferences are seen, for instance, in the optical spectral response to extreme\noutbursts, implying distinct intrinsic variability mechanisms. Furthermore, we\ndiscuss methods for distinguishing between CL AGN and CL look-alike events\n(tidal disruption events or supernovae in dense media). Finally, semi-periodic\nlight curve variability is addressed and the latest multiwavelength (MWL) light\ncurve of the binary supermassive black hole (SMBH) candidate OJ 287 from the\nMOMO project is presented. Recent results from that project have clearly\nestablished the need for new binary SMBH modelling matching the tight new\nconstraints from observations, including the measurement of a low (primary)\nSMBH mass of ~10^8 Msun which also implies that OJ 287 is no longer in the\nregime of near-future pulsar timing arrays.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena","Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}