{"id":"2408.00493","title":"Explainable Emotion Decoding for Human and Computer Vision","authors":"Alessio Borriero, Martina Milazzo, Matteo Diano, Davide Orsenigo,\n  Maria Chiara Villa, Chiara Di Fazio, Marco Tamietto and Alan Perotti","authorsParsed":[["Borriero","Alessio",""],["Milazzo","Martina",""],["Diano","Matteo",""],["Orsenigo","Davide",""],["Villa","Maria Chiara",""],["Di Fazio","Chiara",""],["Tamietto","Marco",""],["Perotti","Alan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 11:53:44 GMT"}],"updateDate":"2024-08-02","timestamp":1722513224000,"abstract":"  Modern Machine Learning (ML) has significantly advanced various research\nfields, but the opaque nature of ML models hinders their adoption in several\ndomains. Explainable AI (XAI) addresses this challenge by providing additional\ninformation to help users understand the internal decision-making process of ML\nmodels. In the field of neuroscience, enriching a ML model for brain decoding\nwith attribution-based XAI techniques means being able to highlight which brain\nareas correlate with the task at hand, thus offering valuable insights to\ndomain experts. In this paper, we analyze human and Computer Vision (CV)\nsystems in parallel, training and explaining two ML models based respectively\non functional Magnetic Resonance Imaging (fMRI) and movie frames. We do so by\nleveraging the \"StudyForrest\" dataset, which includes functional Magnetic\nResonance Imaging (fMRI) scans of subjects watching the \"Forrest Gump\" movie,\nemotion annotations, and eye-tracking data. For human vision the ML task is to\nlink fMRI data with emotional annotations, and the explanations highlight the\nbrain regions strongly correlated with the label. On the other hand, for\ncomputer vision, the input data is movie frames, and the explanations are\npixel-level heatmaps. We cross-analyzed our results, linking human attention\n(obtained through eye-tracking) with XAI saliency on CV models and brain region\nactivations. We show how a parallel analysis of human and computer vision can\nprovide useful information for both the neuroscience community (allocation\ntheory) and the ML community (biological plausibility of convolutional models).\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Electrical Engineering and Systems Science/Image and Video Processing","Quantitative Biology/Neurons and Cognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}