{"id":"2408.13360","title":"Symbolic dynamics of joint brain states during dyadic coordination","authors":"Italo Ivo Lima Dias Pinto, Zhibin Zhou, Javier O. Garcia, Ramesh\n  Srinivasan","authorsParsed":[["Pinto","Italo Ivo Lima Dias",""],["Zhou","Zhibin",""],["Garcia","Javier O.",""],["Srinivasan","Ramesh",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 20:28:57 GMT"}],"updateDate":"2024-08-27","timestamp":1724444937000,"abstract":"  We propose a novel approach to investigate the brain mechanisms that support\ncoordination of behavior between individuals. Brain states in single\nindividuals defined by the patterns of functional connectivity between brain\nregions are used to create joint symbolic representations of the evolution of\nbrain states in two or more individuals performing a task together. These\nsymbolic dynamics can be analyzed to reveal aspects of the dynamics of joint\nbrain states that are related to coordination or other interactive behaviors.\nWe apply this approach to simultaneous electroencephalographic (EEG) data from\npairs of subjects engaged in two different modes of finger-tapping coordination\ntasks (synchronization and syncopation) under different interaction conditions\n(Uncoupled, Leader-Follower, and Mutual) to explore the neural mechanisms of\nmulti-person motor coordination. Our results reveal that the dyads exhibit\nmostly the same joint symbols in different interaction conditions - the most\nimportant differences are reflected in the symbolic dynamics. Recurrence\nanalysis shows that interaction influences the dwell time in specific joint\nsymbols and the structure of joint symbol sequences (motif length). In\nsynchronization, increasing feedback promotes stability with longer dwell times\nand motif length. In syncopation, Leader-Follower interactions enhance\nstability (increase dwell time and motif length), but Mutual feedback\ndramatically reduces stability. Network analysis reveals distinct topological\nchanges with task and feedback. In synchronization, stronger coupling\nstabilizes a few states restricting the pattern of flow between states,\npreserving a core-periphery structure of the joint brain states. In\nsyncopation, a more distributed flow amongst a larger set of joint brain states\nreduces the dominance of core joint brain states.\n","subjects":["Quantitative Biology/Neurons and Cognition","Nonlinear Sciences/Adaptation and Self-Organizing Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2XT2iv_BzSjLBJFNVM93AZvwQpjkaYD3CgjRHw4uQH0","pdfSize":"8829158"}
