{"id":"2408.05629","title":"Quantum-secure multiparty deep learning","authors":"Kfir Sulimany, Sri Krishna Vadlamani, Ryan Hamerly, Prahlad Iyengar,\n  Dirk Englund","authorsParsed":[["Sulimany","Kfir",""],["Vadlamani","Sri Krishna",""],["Hamerly","Ryan",""],["Iyengar","Prahlad",""],["Englund","Dirk",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 20:48:40 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 10:49:21 GMT"}],"updateDate":"2024-09-16","timestamp":1723322920000,"abstract":"  Secure multiparty computation enables the joint evaluation of multivariate\nfunctions across distributed users while ensuring the privacy of their local\ninputs. This field has become increasingly urgent due to the exploding demand\nfor computationally intensive deep learning inference. These computations are\ntypically offloaded to cloud computing servers, leading to vulnerabilities that\ncan compromise the security of the clients' data. To solve this problem, we\nintroduce a linear algebra engine that leverages the quantum nature of light\nfor information-theoretically secure multiparty computation using only\nconventional telecommunication components. We apply this linear algebra engine\nto deep learning and derive rigorous upper bounds on the information leakage of\nboth the deep neural network weights and the client's data via the Holevo and\nthe Cram\\'er-Rao bounds, respectively. Applied to the MNIST classification\ntask, we obtain test accuracies exceeding $96\\%$ while leaking less than $0.1$\nbits per weight symbol and $0.01$ bits per data symbol. This weight leakage is\nan order of magnitude below the minimum bit precision required for accurate\ndeep learning using state-of-the-art quantization techniques. Our work lays the\nfoundation for practical quantum-secure computation and unlocks secure cloud\ndeep learning as a field.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Theory","Computing Research Repository/Machine Learning","Mathematics/Information Theory","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}