{"id":"2408.10666","title":"Accelerating the Surrogate Retraining for Poisoning Attacks against\n  Recommender Systems","authors":"Yunfan Wu, Qi Cao, Shuchang Tao, Kaike Zhang, Fei Sun, Huawei Shen","authorsParsed":[["Wu","Yunfan",""],["Cao","Qi",""],["Tao","Shuchang",""],["Zhang","Kaike",""],["Sun","Fei",""],["Shen","Huawei",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:08:13 GMT"}],"updateDate":"2024-08-21","timestamp":1724144893000,"abstract":"  Recent studies have demonstrated the vulnerability of recommender systems to\ndata poisoning attacks, where adversaries inject carefully crafted fake user\ninteractions into the training data of recommenders to promote target items.\nCurrent attack methods involve iteratively retraining a surrogate recommender\non the poisoned data with the latest fake users to optimize the attack.\nHowever, this repetitive retraining is highly time-consuming, hindering the\nefficient assessment and optimization of fake users. To mitigate this\ncomputational bottleneck and develop a more effective attack in an affordable\ntime, we analyze the retraining process and find that a change in the\nrepresentation of one user/item will cause a cascading effect through the\nuser-item interaction graph. Under theoretical guidance, we introduce\n\\emph{Gradient Passing} (GP), a novel technique that explicitly passes\ngradients between interacted user-item pairs during backpropagation, thereby\napproximating the cascading effect and accelerating retraining. With just a\nsingle update, GP can achieve effects comparable to multiple original training\niterations. Under the same number of retraining epochs, GP enables a closer\napproximation of the surrogate recommender to the victim. This more accurate\napproximation provides better guidance for optimizing fake users, ultimately\nleading to enhanced data poisoning attacks. Extensive experiments on real-world\ndatasets demonstrate the efficiency and effectiveness of our proposed GP.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}