{"id":"2408.03174","title":"Joint Transmission and Compression Optimization for Networked Sensing\n  with Limited-Capacity Fronthaul Links","authors":"Weifeng Zhu and Shuowen Zhang and Liang Liu","authorsParsed":[["Zhu","Weifeng",""],["Zhang","Shuowen",""],["Liu","Liang",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:16:47 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 01:36:20 GMT"},{"version":"v3","created":"Fri, 6 Sep 2024 05:44:06 GMT"}],"updateDate":"2024-09-09","timestamp":1722950207000,"abstract":"  This paper considers networked sensing in cellular network, where multiple\nbase stations (BSs) first compress their received echo signals from multiple\ntargets and then forward the quantized signals to the central unit (CU) via\nlimited-capacity fronthaul links, such that the CU can leverage all useful echo\nsignals to perform high-resolution localization. Under this setup, we manage to\ncharacterize the posterior Cramer-Rao Bound (PCRB) for localizing all the\ntargets with random positions as a function of the transmit covariance matrix\nand the compression noise covariance matrix of each BS. Then, a PCRB\nminimization problem subject to the transmit power constraints and the\nfronthaul capacity constraints is formulated to jointly design the BSs'\ntransmission and compression strategies. We propose an efficient algorithm to\nsolve this problem based on the alternating optimization technique.\nSpecifically, it is shown that when either the transmit covariance matrices or\nthe compression noise covariance matrices are fixed, the successive convex\napproximation (SCA) technique can be leveraged to optimize the other type of\ncovariance matrices locally optimally. Moreover, we also propose a novel\nestimate-then-beamform-then-compress strategy for the massive receive antenna\nscenario, under which each BS first estimates targets' angle-of-arrivals (AOAs)\nlocally, then beamforms its high-dimension received signals into low-dimension\nones based on the estimated AOAs, and last compresses the beamformed signals\nfor fronthaul transmission. An efficient beamforming and compression design\nmethod is devised under this strategy. Numerical results are provided to verify\nthe effectiveness of our proposed algorithms.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}