{"id":"2408.01900","title":"Quantifying gendered citation imbalance in computer science conferences","authors":"Kazuki Nakajima, Yuya Sasaki, Sohei Tokuno, George Fletcher","authorsParsed":[["Nakajima","Kazuki",""],["Sasaki","Yuya",""],["Tokuno","Sohei",""],["Fletcher","George",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 02:04:15 GMT"}],"updateDate":"2024-08-06","timestamp":1722737055000,"abstract":"  The number of citations received by papers often exhibits imbalances in terms\nof author attributes such as country of affiliation and gender. While recent\nstudies have quantified citation imbalance in terms of the authors' gender in\njournal papers, the computer science discipline, where researchers frequently\npresent their work at conferences, may exhibit unique patterns in gendered\ncitation imbalance. Additionally, understanding how network properties in\ncitations influence citation imbalances remains challenging due to a lack of\nsuitable reference models. In this paper, we develop a family of reference\nmodels for citation networks and investigate gender imbalance in citations\nbetween papers published in computer science conferences. By deploying these\nreference models, we found that homophily in citations is strongly associated\nwith gendered citation imbalance in computer science, whereas heterogeneity in\nthe number of citations received per paper has a relatively minor association\nwith it. Furthermore, we found that the gendered citation imbalance is most\npronounced in papers published in the highest-ranked conferences, is present\nacross different subfields, and extends to citation-based rankings of papers.\nOur study provides a framework for investigating associations between network\nproperties and citation imbalances, aiming to enhance our understanding of the\nstructure and dynamics of citations between research publications.\n","subjects":["Computing Research Repository/Social and Information Networks","Computing Research Repository/Digital Libraries"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}