{"id":"2408.15557","title":"Generalization Capabilities of Neural Cellular Automata for Medical\n  Image Segmentation: A Robust and Lightweight Approach","authors":"Steven Korevaar, Ruwan Tennakoon, Alireza Bab-Hadiashar","authorsParsed":[["Korevaar","Steven",""],["Tennakoon","Ruwan",""],["Bab-Hadiashar","Alireza",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 06:18:55 GMT"}],"updateDate":"2024-08-29","timestamp":1724825935000,"abstract":"  In the field of medical imaging, the U-Net architecture, along with its\nvariants, has established itself as a cornerstone for image segmentation tasks,\nparticularly due to its strong performance when trained on limited datasets.\nDespite its impressive performance on identically distributed (in-domain) data,\nU-Nets exhibit a significant decline in performance when tested on data that\ndeviates from the training distribution, out-of-distribution (out-of-domain)\ndata. Current methodologies predominantly address this issue by employing\ngeneralization techniques that hinge on various forms of regularization, which\nhave demonstrated moderate success in specific scenarios. This paper, however,\nventures into uncharted territory by investigating the implications of\nutilizing models that are smaller by three orders of magnitude (i.e., x1000)\ncompared to a conventional U-Net. A reduction of this size in U-net parameters\ntypically adversely affects both in-domain and out-of-domain performance,\npossibly due to a significantly reduced receptive field. To circumvent this\nissue, we explore the concept of Neural Cellular Automata (NCA), which, despite\nits simpler model structure, can attain larger receptive fields through\nrecursive processes. Experimental results on two distinct datasets reveal that\nNCA outperforms traditional methods in terms of generalization, while still\nmaintaining a commendable IID performance.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"3XBXcPI-Rb9rz4PZKalkD7VNK144L_36cg7ssIQoUpc","pdfSize":"765116"}
