{"id":"2408.15197","title":"A Deep Dive into the NGC 741 Galaxy Group: Insights into a Spectacular\n  Head-Tail Radio Galaxy from VLA, MeerKAT, uGMRT and LOFAR","authors":"K. Rajpurohit, E. O'Sullivan, G. Schellenberger, M. Brienza, J. M.\n  Vrtilek, W. Forman, L. P. David, T. Clarke, A. Botteon, F. Vazza, S.\n  Giacintucci, C. Jones, M. Br\\\"uggen, T. W. Shimwell, A. Drabent, F. Loi, S.\n  I. Loubser, K. Kolokythas, I. Babyk, and H. J. A. R\\\"ottgering","authorsParsed":[["Rajpurohit","K.",""],["O'Sullivan","E.",""],["Schellenberger","G.",""],["Brienza","M.",""],["Vrtilek","J. M.",""],["Forman","W.",""],["David","L. P.",""],["Clarke","T.",""],["Botteon","A.",""],["Vazza","F.",""],["Giacintucci","S.",""],["Jones","C.",""],["Brüggen","M.",""],["Shimwell","T. W.",""],["Drabent","A.",""],["Loi","F.",""],["Loubser","S. I.",""],["Kolokythas","K.",""],["Babyk","I.",""],["Röttgering","H. J. A.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 16:55:39 GMT"}],"updateDate":"2024-08-28","timestamp":1724777739000,"abstract":"  We present deep, wideband multifrequency radio observations (144 MHz$-$8 GHz)\nof the remarkable galaxy group NGC 741, which yield crucial insights into the\ninteraction between the infalling head-tail radio galaxy (NGC 742) and the main\ngroup. Our new data provide an unprecedentedly detailed view of the NGC 741-742\nsystem, including the shock cone, disrupted jets from NGC 742, the long ($\\sim$\n255 kpc) braided southern radio tail, and eastern lobe-like structure, and\nreveal, for the first time, complex radio filaments throughout the tail and\nlobe, and a likely vortex ring behind the shock cone. The cone traces the bow\nshock caused by the supersonic ($\\mathcal{M}\\sim2$) interaction between the\nhead-tail radio galaxy NGC 742 and the intragroup medium (IGrM) while the ring\nmay have been formed by interaction between the NGC 742 shock and a previously\nexisting lobe associated with NGC 741. This interaction plausibly compressed\nand re-accelerated the radio plasma. We estimate that shock-heating by NGC 742\nhas likely injected $\\sim$2-5$\\times$10$^{57}$ erg of thermal energy into the\ncentral 10 kpc cooling region of the IGrM, potentially affecting the cooling\nand feedback cycle of NGC 741. A comparison with Chandra X-ray images shows\nthat some of the previously detected thermal filaments align with radio edges,\nsuggesting compression of the IGrM as the relativistic plasma of the NGC 742\ntail interacts with the surrounding medium. Our results highlight that\nmulti-frequency observations are key to disentangling the complex, intertwined\norigins of the variety of radio features seen in the galaxy group NGC 741, and\nthe need for simulations to reproduce all the detected features.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}