{"id":"2408.09340","title":"Improvement of Bayesian PINN Training Convergence in Solving Multi-scale\n  PDEs with Noise","authors":"Yilong Hou, Xi'an Li, Jinran Wu","authorsParsed":[["Hou","Yilong",""],["Li","Xi'an",""],["Wu","Jinran",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 03:20:16 GMT"}],"updateDate":"2024-08-20","timestamp":1723951216000,"abstract":"  Bayesian Physics Informed Neural Networks (BPINN) have received considerable\nattention for inferring differential equations' system states and physical\nparameters according to noisy observations. However, in practice, Hamiltonian\nMonte Carlo (HMC) used to estimate the internal parameters of BPINN often\nencounters troubles, including poor performance and awful convergence for a\ngiven step size used to adjust the momentum of those parameters. To improve the\nefficacy of HMC convergence for the BPINN method and extend its application\nscope to multi-scale partial differential equations (PDE), we developed a\nrobust multi-scale Bayesian PINN (dubbed MBPINN) method by integrating\nmulti-scale deep neural networks (MscaleDNN) and Bayesian inference. In this\nnewly proposed MBPINN method, we reframe HMC with Stochastic Gradient Descent\n(SGD) to ensure the most ``likely'' estimation is always provided, and we\nconfigure its solver as a Fourier feature mapping-induced MscaleDNN. The MBPINN\nmethod offers several key advantages: (1) it is more robust than HMC, (2) it\nincurs less computational cost than HMC, and (3) it is more flexible for\ncomplex problems. We demonstrate the applicability and performance of the\nproposed method through general Poisson and multi-scale elliptic problems in\none- to three-dimensional spaces. Our findings indicate that the proposed\nmethod can avoid HMC failures and provide valid results. Additionally, our\nmethod can handle complex PDE and produce comparable results for general PDE.\nThese findings suggest that our proposed approach has excellent potential for\nphysics-informed machine learning for parameter estimation and solution\nrecovery in the case of ill-posed problems.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ruXxtuDkzUUnOZifoWPmfJhgnoP3NuNKenorAAxWA9o","pdfSize":"526996"}
