{"id":"2408.01210","title":"From Problem to Solution: Bio-inspired 3D Printing for Bonding Soft and\n  Rigid Materials via Underextrusions","authors":"Arman Goshtasbi, Luca Grignaffini, Ali Sadeghi","authorsParsed":[["Goshtasbi","Arman",""],["Grignaffini","Luca",""],["Sadeghi","Ali",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 11:46:32 GMT"}],"updateDate":"2024-08-05","timestamp":1722599192000,"abstract":"  Vertebrate animals benefit from a combination of rigidity for structural\nsupport and softness for adaptation. Similarly, integrating rigidity and\nsoftness can enhance the versatility of soft robotics. However, the challenges\nassociated with creating durable bonding interfaces between soft and rigid\nmaterials have limited the development of hybrid robots. Existing solutions\nrequire specialized machinery, such as polyjet 3D printers, which are not\ncommonly available. In response to these challenges, we have developed a 3D\nprinting technique that can be used with almost all commercially available FDM\nprinters. This technique leverages the common issue of underextrusion to create\na strong bond between soft and rigid materials. Underextrusion generates a\nporous structure, similar to fibrous connective tissues, that provides a robust\ninterface with the rigid part through layer fusion, while the porosity enables\ninterlocking with the soft material. Our experiments demonstrated that this\nmethod outperforms conventional adhesives commonly used in soft robotics,\nachieving nearly 200\\% of the bonding strength in both lap shear and peeling\ntests. Additionally, we investigated how different porosity levels affect\nbonding strength. We tested the technique under pressure scenarios critical to\nsoft and hybrid robots and achieved three times more pressure than the current\nadhesion solution. Finally, we fabricated various hybrid robots using this\ntechnique to demonstrate the wide range of capabilities this approach and\nhybridity can bring to soft robotics. has context menu\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9Vb2TiLYAqQTpoA8Siqc-1pfmZ5ps2s7KctcTG9Lw30","pdfSize":"10989326"}
