{"id":"2408.00898","title":"Investigating the hyperfine systematic error and relative phase in low\n  spin-polarization alkali FID magnetometers","authors":"D. P. Hewatt, M. Ellmeier, C. Kiehl, T. S. Menon, J. W. Pollock, C. A.\n  Regal, and S. Knappe","authorsParsed":[["Hewatt","D. P.",""],["Ellmeier","M.",""],["Kiehl","C.",""],["Menon","T. S.",""],["Pollock","J. W.",""],["Regal","C. A.",""],["Knappe","S.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 20:31:11 GMT"}],"updateDate":"2024-08-05","timestamp":1722544271000,"abstract":"  Alkali-metal optically-pumped magnetometers are prone to inaccuracies arising\nfrom the overlap of the average F = I + 1/2 and F = I - 1/2 ground-state Zeeman\nresonances. We employ density-matrix simulations and experiments to investigate\nhow this hyperfine systematic error varies with spin polarization in a\n$^{87}$Rb free-induction-decay (FID) magnetometer. At low spin polarizations,\n($P \\leq 0.5$), this effect causes single-frequency magnetic-field extraction\ntechniques to exhibit inaccuracies up to approximately 3.5 nT. Density-matrix\nsimulations reveal that this bias can be traced to the relative amplitude and\nphase between the F = I $\\pm$ 1/2 hyperfine ground-state manifolds in the FID\nspin precession signal. We show that this systematic error can be mitigated\nusing either a double-frequency fitting model that accounts for the relative\namplitude and phase or synchronous-pulse pumping, that minimizes the F = 1\ncontribution to the FID signal. Theoretical simulations predict accuracies\nwithin 0.5 nT for both techniques across a wide range of spin polarizations,\nsuggesting a sevenfold enhancement over single-frequency extraction methods.\nOur experiments validate this, showcasing a variation in the extracted field\nbelow 1 nT, a 3.5-fold improvement compared to single-frequency extraction\nmethods. Furthermore, the mitigation techniques demonstrate agreement of the\nextracted magnetic field within 1.5 nT.\n","subjects":["Physics/Atomic Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}