{"id":"2408.08109","title":"Hearing Your Blood Sugar: Non-Invasive Glucose Measurement Through\n  Simple Vocal Signals, Transforming any Speech into a Sensor with Machine\n  Learning","authors":"Nihat Ahmadli, Mehmet Ali Sarsil, Onur Ergen","authorsParsed":[["Ahmadli","Nihat",""],["Sarsil","Mehmet Ali",""],["Ergen","Onur",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:13:23 GMT"}],"updateDate":"2024-08-16","timestamp":1723724003000,"abstract":"  Effective diabetes management relies heavily on the continuous monitoring of\nblood glucose levels, traditionally achieved through invasive and uncomfortable\nmethods. While various non-invasive techniques have been explored, such as\noptical, microwave, and electrochemical approaches, none have effectively\nsupplanted these invasive technologies due to issues related to complexity,\naccuracy, and cost. In this study, we present a transformative and\nstraightforward method that utilizes voice analysis to predict blood glucose\nlevels. Our research investigates the relationship between fluctuations in\nblood glucose and vocal characteristics, highlighting the influence of blood\nvessel dynamics during voice production. By applying advanced machine learning\nalgorithms, we analyzed vocal signal variations and established a significant\ncorrelation with blood glucose levels. We developed a predictive model using\nartificial intelligence, based on voice recordings and corresponding glucose\nmeasurements from participants, utilizing logistic regression and Ridge\nregularization. Our findings indicate that voice analysis may serve as a viable\nnon-invasive alternative for glucose monitoring. This innovative approach not\nonly has the potential to streamline and reduce the costs associated with\ndiabetes management but also aims to enhance the quality of life for\nindividuals living with diabetes by providing a painless and user-friendly\nmethod for monitoring blood sugar levels.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/publicdomain/zero/1.0/","blobId":"sU8OZsnnNlEpr6fHzNZRogLJ2rQki7rJYeBjrECxpPE","pdfSize":"751768"}
