{"id":"2408.07067","title":"Asymptotic quantification of entanglement with a single copy","authors":"Ludovico Lami, Mario Berta, Bartosz Regula","authorsParsed":[["Lami","Ludovico",""],["Berta","Mario",""],["Regula","Bartosz",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:57:59 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 13:29:05 GMT"}],"updateDate":"2024-09-20","timestamp":1723571879000,"abstract":"  Despite the central importance of quantum entanglement in fueling many\nquantum technologies, the understanding of the optimal ways to exploit it is\nstill beyond our reach, and even measuring entanglement in an operationally\nmeaningful way is prohibitively difficult. This is due to the need to precisely\ncharacterise many-copy, asymptotic protocols for entanglement processing. Here\nwe overcome these issues by introducing a new way of benchmarking the\nfundamental protocol of entanglement distillation (purification), where instead\nof measuring its asymptotic yield, we focus on the best achievable error. We\nconnect this formulation of the task with an information-theoretic problem in\ncomposite quantum hypothesis testing known as generalised Sanov's theorem. By\nsolving the latter problem -- which had no previously known solution even in\nclassical information theory -- we thus compute the optimal asymptotic error\nexponent of entanglement distillation. We show this asymptotic solution to be\ngiven by the reverse relative entropy of entanglement, a single-letter quantity\nthat can be evaluated using only a single copy of a quantum state, which is a\nunique feature among operational measures of entanglement. Altogether, we thus\ndemonstrate a measure of entanglement that admits a direct operational\ninterpretation as the optimal asymptotic rate of an important entanglement\nmanipulation protocol while enjoying an exact, single-letter formula.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Information Theory","Physics/Mathematical Physics","Mathematics/Information Theory","Mathematics/Mathematical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}