{"id":"2408.11639","title":"Capture Rates of Highly Degenerate Neutrons","authors":"B. Knight, O. L. Caballero, H. Schatz","authorsParsed":[["Knight","B.",""],["Caballero","O. L.",""],["Schatz","H.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:09:06 GMT"}],"updateDate":"2024-08-22","timestamp":1724249346000,"abstract":"  At the low temperature and high density conditions of a neutron star crust\nneutrons are degenerate. In this work, we study the effect of this degeneracy\non the capture rates of neutrons on neutron rich nuclei in accreted crusts. We\nuse a statistical Hauser-Feshbach model to calculate neutron capture rates and\nfind that neutron degeneracy can increase rates significantly. Changes increase\nfrom a factor of a few to many orders of magnitude near the neutron drip line.\nWe also quantify uncertainties due to model inputs for masses,\n$\\gamma$-strength functions, and level densities. We find that uncertainties\nincrease dramatically away from stability and that degeneracy tends to increase\nthese uncertainties further, except for cases near the neutron drip line where\ndegeneracy leads to more robustness. As in the case of capture of classically\ndistributed neutrons, variations in the mass model have the strongest impact.\nCorresponding variations in the reaction rates can be as high as 3 to 4 orders\nof magnitude, and be more than 5 times larger than under classical conditions.\nTo ease the incorporation of neutron degeneracy in nucleosynthesis networks, we\nprovide tabulated results of capture rates as well as analytical expressions as\nfunction of temperature and neutron chemical potential, for proton numbers\nbetween $3 \\le Z \\le 85$, derived from fits to our numerical results. Fits are\nbased on a new parametrization that complements previously employed power law\napproximations with additional Lorentzian terms that account for low energy\nresonances, significantly improving accuracy.\n","subjects":["Physics/Nuclear Theory","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}