{"id":"2408.02687","title":"Compositional Physical Reasoning of Objects and Events from Videos","authors":"Zhenfang Chen, Shilong Dong, Kexin Yi, Yunzhu Li, Mingyu Ding, Antonio\n  Torralba, Joshua B. Tenenbaum, Chuang Gan","authorsParsed":[["Chen","Zhenfang",""],["Dong","Shilong",""],["Yi","Kexin",""],["Li","Yunzhu",""],["Ding","Mingyu",""],["Torralba","Antonio",""],["Tenenbaum","Joshua B.",""],["Gan","Chuang",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 15:19:55 GMT"}],"updateDate":"2024-08-07","timestamp":1722611995000,"abstract":"  Understanding and reasoning about objects' physical properties in the natural\nworld is a fundamental challenge in artificial intelligence. While some\nproperties like colors and shapes can be directly observed, others, such as\nmass and electric charge, are hidden from the objects' visual appearance. This\npaper addresses the unique challenge of inferring these hidden physical\nproperties from objects' motion and interactions and predicting corresponding\ndynamics based on the inferred physical properties. We first introduce the\nCompositional Physical Reasoning (ComPhy) dataset. For a given set of objects,\nComPhy includes limited videos of them moving and interacting under different\ninitial conditions. The model is evaluated based on its capability to unravel\nthe compositional hidden properties, such as mass and charge, and use this\nknowledge to answer a set of questions. Besides the synthetic videos from\nsimulators, we also collect a real-world dataset to show further test physical\nreasoning abilities of different models. We evaluate state-of-the-art video\nreasoning models on ComPhy and reveal their limited ability to capture these\nhidden properties, which leads to inferior performance. We also propose a novel\nneuro-symbolic framework, Physical Concept Reasoner (PCR), that learns and\nreasons about both visible and hidden physical properties from question\nanswering. After training, PCR demonstrates remarkable capabilities. It can\ndetect and associate objects across frames, ground visible and hidden physical\nproperties, make future and counterfactual predictions, and utilize these\nextracted representations to answer challenging questions.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n3Bswa-SQ_QQkc8eyiADBCzhVU7KZl6KIkym9qMxYnw","pdfSize":"3378013","txDigest":"2r8qMsCKtFxSNzW7Hmk41MMWaS3DM3FHk3jRjpExwkyP","endEpoch":"1","status":"CERTIFIED"}
