{"id":"2408.03873","title":"A Reproducible Analysis of Sequential Recommender Systems","authors":"Filippo Betello, Antonio Purificato, Federico Siciliano, Giovanni\n  Trappolini, Andrea Bacciu, Nicola Tonellotto, Fabrizio Silvestri","authorsParsed":[["Betello","Filippo",""],["Purificato","Antonio",""],["Siciliano","Federico",""],["Trappolini","Giovanni",""],["Bacciu","Andrea",""],["Tonellotto","Nicola",""],["Silvestri","Fabrizio",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 16:23:29 GMT"}],"updateDate":"2024-08-08","timestamp":1723047809000,"abstract":"  Sequential Recommender Systems (SRSs) have emerged as a highly efficient\napproach to recommendation systems. By leveraging sequential data, SRSs can\nidentify temporal patterns in user behaviour, significantly improving\nrecommendation accuracy and relevance.Ensuring the reproducibility of these\nmodels is paramount for advancing research and facilitating comparisons between\nthem. Existing works exhibit shortcomings in reproducibility and replicability\nof results, leading to inconsistent statements across papers. Our work fills\nthese gaps by standardising data pre-processing and model implementations,\nproviding a comprehensive code resource, including a framework for developing\nSRSs and establishing a foundation for consistent and reproducible\nexperimentation. We conduct extensive experiments on several benchmark\ndatasets, comparing various SRSs implemented in our resource. We challenge\nprevailing performance benchmarks, offering new insights into the SR domain.\nFor instance, SASRec does not consistently outperform GRU4Rec. On the contrary,\nwhen the number of model parameters becomes substantial, SASRec starts to\nclearly dominate all the other SRSs. This discrepancy underscores the\nsignificant impact that experimental configuration has on the outcomes and the\nimportance of setting it up to ensure precise and comprehensive results.\nFailure to do so can lead to significantly flawed conclusions, highlighting the\nneed for rigorous experimental design and analysis in SRS research. Our code is\navailable at https://github.com/antoniopurificato/recsys_repro_conf.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"pj4NoMhBEdESFiEHahS-t-Hs8964V3K_WuuxqeM__4s","pdfSize":"830346"}
