{"id":"2408.15615","title":"Narrow line AGN selection in CEERS: spectroscopic selection, physical\n  properties, X-ray and radio analysis","authors":"Giovanni Mazzolari, Jan Scholtz, Roberto Maiolino, Roberto Gilli,\n  Alberto Traina, Ivan E. L\\'opez, Hannah \\\"Ubler, Bartolomeo Trefoloni,\n  Francesco D'Eugenio, Xihan Ji, Marco Mignoli, Fabio Vito, Marcella Brusa","authorsParsed":[["Mazzolari","Giovanni",""],["Scholtz","Jan",""],["Maiolino","Roberto",""],["Gilli","Roberto",""],["Traina","Alberto",""],["López","Ivan E.",""],["Übler","Hannah",""],["Trefoloni","Bartolomeo",""],["D'Eugenio","Francesco",""],["Ji","Xihan",""],["Mignoli","Marco",""],["Vito","Fabio",""],["Brusa","Marcella",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 08:14:19 GMT"}],"updateDate":"2024-08-29","timestamp":1724832859000,"abstract":"  In this work, we spectroscopically select narrow-line AGN (NLAGN) among the\n$\\sim 300$ publicly available medium-resolution spectra of the CEERS Survey.\nUsing both traditional and newly identified emission line NLAGN diagnostics\ndiagrams, we identified 52 NLAGN at $2\\lesssim z\\lesssim 9$ on which we\nperformed a detailed multiwavelength analysis. We also identified 4 new\n$z\\lesssim 2$ broad-line AGN (BLAGN), in addition to the 8 previously reported\nhigh-$z$ BLAGN. We found that the traditional BPT diagnostic diagrams are not\nsuited to identify high-$z$ AGN, while most of the high-$z$ NLAGN are selected\nusing the recently proposed AGN diagnostic diagrams based on the\n[OIII]$\\lambda$4363 auroral line or high-ionization emission lines. We compared\nthe emission line velocity dispersion and the obscuration of the sample of\nNLAGN with those of the parent sample without finding significant differences\nbetween the two distributions, suggesting a population of AGN heavily buried\nand not significantly impacting the host galaxies' physical properties, as\nfurther confirmed by SED-fitting. The bolometric luminosities of the high-$z$\nNLAGNs selected in this work are well below those sampled by surveys before\nJWST, potentially explaining the weak impact of these AGN. Finally, we\ninvestigate the X-ray properties of the selected NLAGN and of the sample of\nhigh-$z$ BLAGN. We find that all but 4 NLAGN are undetected in the deep X-ray\nimage of the field, as well as all the high-$z$ BLAGN. We do not obtain a\ndetection even by stacking the undetected sources, resulting in an X-ray\nweakness of $\\sim 1-2$ dex from what is expected based on their bolometric\nluminosities. To discriminate between a heavily obscured AGN scenario or an\nintrinsic X-ray weakness of these sources, we performed a radio stacking\nanalysis, which did not reveal any detection leaving open the questions about\nthe origin of the X-ray weakness.\n","subjects":["Astrophysics/Astrophysics of Galaxies","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}