{"id":"2408.09369","title":"Flemme: A Flexible and Modular Learning Platform for Medical Images","authors":"Guoqing Zhang and Jingyun Yang and Yang Li","authorsParsed":[["Zhang","Guoqing",""],["Yang","Jingyun",""],["Li","Yang",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 05:47:33 GMT"}],"updateDate":"2024-08-20","timestamp":1723960053000,"abstract":"  As the rapid development of computer vision and the emergence of powerful\nnetwork backbones and architectures, the application of deep learning in\nmedical imaging has become increasingly significant. Unlike natural images,\nmedical images lack huge volumes of data but feature more modalities, making it\ndifficult to train a general model that has satisfactory performance across\nvarious datasets. In practice, practitioners often suffer from manually\ncreating and testing models combining independent backbones and architectures,\nwhich is a laborious and time-consuming process. We propose Flemme, a FLExible\nand Modular learning platform for MEdical images. Our platform separates\nencoders from the model architectures so that different models can be\nconstructed via various combinations of supported encoders and architectures.\nWe construct encoders using building blocks based on convolution, transformer,\nand state-space model (SSM) to process both 2D and 3D image patches. A base\narchitecture is implemented following an encoder-decoder style, with several\nderived architectures for image segmentation, reconstruction, and generation\ntasks. In addition, we propose a general hierarchical architecture\nincorporating a pyramid loss to optimize and fuse vertical features.\nExperiments demonstrate that this simple design leads to an average improvement\nof 5.60% in Dice score and 7.81% in mean interaction of units (mIoU) for\nsegmentation models, as well as an enhancement of 5.57% in peak signal-to-noise\nratio (PSNR) and 8.22% in structural similarity (SSIM) for reconstruction\nmodels. We further utilize Flemme as an analytical tool to assess the\neffectiveness and efficiency of various encoders across different tasks. Code\nis available at https://github.com/wlsdzyzl/flemme.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}