{"id":"2408.14905","title":"A nonlinear phase-field model of corrosion with charging kinetics of\n  electric double layer","authors":"M. Makuch, S. Kovacevic, M.R. Wenman, E. Mart\\'inez-Pa\\~neda","authorsParsed":[["Makuch","M.",""],["Kovacevic","S.",""],["Wenman","M. R.",""],["Martínez-Pañeda","E.",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:33:07 GMT"}],"updateDate":"2024-08-28","timestamp":1724751187000,"abstract":"  A nonlinear phase-field model is developed to simulate corrosion damage. The\nmotion of the electrode$-$ electrolyte interface follows the usual kinetic rate\ntheory for chemical reactions based on the Butler-Volmer equation. The model\nlinks the surface polarization variation associated with the charging kinetics\nof an electric double layer (EDL) to the mesoscale transport. The effects of\nthe EDL are integrated as a boundary condition on the solution potential\nequation. The boundary condition controls the magnitude of the solution\npotential at the electrode-electrolyte interface. The ion concentration field\noutside the EDL is obtained by solving the electro-diffusion equation and Ohm's\nlaw for the solution potential. The model is validated against the classic\nbenchmark pencil electrode test. The framework developed reproduces\nexperimental measurements of both pit kinetics and transient current density\nresponse. The model enables more accurate information on corrosion damage,\ncurrent density, and environmental response in terms of the distribution of\nelectric potential and charged species. The sensitivity analysis for different\nproperties of the EDL is performed to investigate their role in the\nelectrochemical response of the system. Simulation results show that the\nproperties of the EDL significantly influence the transport of ionic species in\nthe electrolyte.\n","subjects":["Physics/Chemical Physics","Computing Research Repository/Computational Engineering, Finance, and Science","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}