{"id":"2408.11313","title":"Unlocking Adversarial Suffix Optimization Without Affirmative Phrases:\n  Efficient Black-box Jailbreaking via LLM as Optimizer","authors":"Weipeng Jiang, Zhenting Wang, Juan Zhai, Shiqing Ma, Zhengyu Zhao,\n  Chao Shen","authorsParsed":[["Jiang","Weipeng",""],["Wang","Zhenting",""],["Zhai","Juan",""],["Ma","Shiqing",""],["Zhao","Zhengyu",""],["Shen","Chao",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:35:24 GMT"}],"updateDate":"2024-08-22","timestamp":1724211324000,"abstract":"  Despite prior safety alignment efforts, mainstream LLMs can still generate\nharmful and unethical content when subjected to jailbreaking attacks. Existing\njailbreaking methods fall into two main categories: template-based and\noptimization-based methods. The former requires significant manual effort and\ndomain knowledge, while the latter, exemplified by Greedy Coordinate Gradient\n(GCG), which seeks to maximize the likelihood of harmful LLM outputs through\ntoken-level optimization, also encounters several limitations: requiring\nwhite-box access, necessitating pre-constructed affirmative phrase, and\nsuffering from low efficiency. In this paper, we present ECLIPSE, a novel and\nefficient black-box jailbreaking method utilizing optimizable suffixes. Drawing\ninspiration from LLMs' powerful generation and optimization capabilities, we\nemploy task prompts to translate jailbreaking goals into natural language\ninstructions. This guides the LLM to generate adversarial suffixes for\nmalicious queries. In particular, a harmfulness scorer provides continuous\nfeedback, enabling LLM self-reflection and iterative optimization to\nautonomously and efficiently produce effective suffixes. Experimental results\ndemonstrate that ECLIPSE achieves an average attack success rate (ASR) of 0.92\nacross three open-source LLMs and GPT-3.5-Turbo, significantly surpassing GCG\nin 2.4 times. Moreover, ECLIPSE is on par with template-based methods in ASR\nwhile offering superior attack efficiency, reducing the average attack overhead\nby 83%.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q_JyPCu-y8JXISv4UgREtVUbQrO4uIRsspjW1Qwtmrk","pdfSize":"5601457"}
