{"id":"2408.04081","title":"A Framework for Assessing Cumulative Exposure to Extreme Temperatures\n  During Transit Trip","authors":"Huiying Fan, Hongyu Lu, Geyu Lyu, Angshuman Guin, Randall Guensler","authorsParsed":[["Fan","Huiying",""],["Lu","Hongyu",""],["Lyu","Geyu",""],["Guin","Angshuman",""],["Guensler","Randall",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 20:47:39 GMT"}],"updateDate":"2024-08-09","timestamp":1723063659000,"abstract":"  The combined influence of urban heat islands, climate change, and extreme\ntemperature events are increasingly impacting transit travelers, especially\nvulnerable populations such as older adults, people with disabilities, and\nthose with chronic diseases. Previous studies have generally attempted to\naddress this issue at either the micro- or macro-level, but each approach\npresents different limitations in modeling the impacts on transit trips. Other\nresearch proposes a meso-level approach to address some of these gaps, but the\nuse of additive exposure calculation and spatial shortest path routing poses\nconstraints meso-modeling accuracy. This study introduces HeatPath Analyzer, a\nframework to assess the exposure of transit riders to extreme temperatures,\nusing TransitSim 4.0 to generate second-by-second spatio-temporal trip\ntrajectories, the traveler activity profiles, and thermal comfort levels along\nthe entire journey. The approach uses heat stress combines the standards\nproposed by the NWS and CDC to estimate cumulative exposure for transit riders,\nwith specific parameters tailored to the elderly and people with disabilities.\nThe framework assesses the influence of extreme heat and winter chill. A case\nstudy in Atlanta, GA, reveals that 10.2% of trips on an average summer weekday\nin 2019 were at risk of extreme heat. The results uncover exposure disparities\nacross different transit trip mode segments, and across mitigation-based and\nadaptation-based strategies. While the mitigation-based strategy highlights\nhigh-exposure segments such as long ingress and egress, adaptation should be\nprioritized toward the middle or second half of the trip when a traveler is\nwaiting for transit or transferring between routes. A comparison between the\ntraditional additive approach and the dynamic approach presented also shows\nsignificant disparities, which, if overlooked, can mislead policy decisions.\n","subjects":["Statistics/Applications","Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1kWmGLdyKxFvwI6JO4xOtFAO9WGwRBP9NzDw88NVkJ4","pdfSize":"3557652"}
