{"id":"2408.11987","title":"SimBench: A Rule-Based Multi-Turn Interaction Benchmark for Evaluating\n  an LLM's Ability to Generate Digital Twins","authors":"Jingquan Wang, Harry Zhang, Huzaifa Mustafa Unjhawala, Peter Negrut,\n  Shu Wang, Khailanii Slaton, Radu Serban, Jin-Long Wu, Dan Negrut","authorsParsed":[["Wang","Jingquan",""],["Zhang","Harry",""],["Unjhawala","Huzaifa Mustafa",""],["Negrut","Peter",""],["Wang","Shu",""],["Slaton","Khailanii",""],["Serban","Radu",""],["Wu","Jin-Long",""],["Negrut","Dan",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 20:52:32 GMT"}],"updateDate":"2024-08-23","timestamp":1724273552000,"abstract":"  We introduce SimBench, a benchmark designed to evaluate the proficiency of\nstudent large language models (S-LLMs) in generating digital twins (DTs) that\ncan be used in simulators for virtual testing. Given a collection of S-LLMs,\nthis benchmark enables the ranking of the S-LLMs based on their ability to\nproduce high-quality DTs. We demonstrate this by comparing over 20 open- and\nclosed-source S-LLMs. Using multi-turn interactions, SimBench employs a\nrule-based judge LLM (J-LLM) that leverages both predefined rules and\nhuman-in-the-loop guidance to assign scores for the DTs generated by the S-LLM,\nthus providing a consistent and expert-inspired evaluation protocol. The J-LLM\nis specific to a simulator, and herein the proposed benchmarking approach is\ndemonstrated in conjunction with the Chrono multi-physics simulator. Chrono\nprovided the backdrop used to assess an S-LLM in relation to the latter's\nability to create digital twins for multibody dynamics, finite element\nanalysis, vehicle dynamics, robotic dynamics, and sensor simulations. The\nproposed benchmarking principle is broadly applicable and enables the\nassessment of an S-LLM's ability to generate digital twins for other simulation\npackages. All code and data are available at\nhttps://github.com/uwsbel/SimBench.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}