{"id":"2408.14127","title":"Rate-Distortion-Perception Controllable Joint Source-Channel Coding for\n  High-Fidelity Generative Communications","authors":"Kailin Tan, Jincheng Dai, Zhenyu Liu, Sixian Wang, Xiaoqi Qin, Wenjun\n  Xu, Kai Niu, Ping Zhang","authorsParsed":[["Tan","Kailin",""],["Dai","Jincheng",""],["Liu","Zhenyu",""],["Wang","Sixian",""],["Qin","Xiaoqi",""],["Xu","Wenjun",""],["Niu","Kai",""],["Zhang","Ping",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 09:20:13 GMT"}],"updateDate":"2024-08-27","timestamp":1724664013000,"abstract":"  End-to-end image transmission has recently become a crucial trend in\nintelligent wireless communications, driven by the increasing demand for high\nbandwidth efficiency. However, existing methods primarily optimize the\ntrade-off between bandwidth cost and objective distortion, often failing to\ndeliver visually pleasing results aligned with human perception. In this paper,\nwe propose a novel rate-distortion-perception (RDP) jointly optimized joint\nsource-channel coding (JSCC) framework to enhance perception quality in human\ncommunications. Our RDP-JSCC framework integrates a flexible plug-in\nconditional Generative Adversarial Networks (GANs) to provide detailed and\nrealistic image reconstructions at the receiver, overcoming the limitations of\ntraditional rate-distortion optimized solutions that typically produce blurry\nor poorly textured images. Based on this framework, we introduce a\ndistortion-perception controllable transmission (DPCT) model, which addresses\nthe variation in the perception-distortion trade-off. DPCT uses a lightweight\nspatial realism embedding module (SREM) to condition the generator on a realism\nmap, enabling the customization of appearance realism for each image region at\nthe receiver from a single transmission. Furthermore, for scenarios with scarce\nbandwidth, we propose an interest-oriented content-controllable transmission\n(CCT) model. CCT prioritizes the transmission of regions that attract user\nattention and generates other regions from an instance label map, ensuring both\ncontent consistency and appearance realism for all regions while proportionally\nreducing channel bandwidth costs.\n  Comprehensive experiments demonstrate the superiority of our RDP-optimized\nimage transmission framework over state-of-the-art engineered image\ntransmission systems and advanced perceptual methods.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}