{"id":"2408.14870","title":"Towards Safe Autonomous Intersection Management: Temporal Logic-based\n  Safety Filters for Vehicle Coordination","authors":"Kaj Munhoz Arfvidsson, Frank J. Jiang, Karl H. Johansson, Jonas\n  M{\\aa}rtensson","authorsParsed":[["Arfvidsson","Kaj Munhoz",""],["Jiang","Frank J.",""],["Johansson","Karl H.",""],["Mårtensson","Jonas",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 08:40:34 GMT"}],"updateDate":"2024-08-28","timestamp":1724748034000,"abstract":"  In this paper, we introduce a temporal logic-based safety filter for\nAutonomous Intersection Management (AIM), an emerging infrastructure technology\nfor connected vehicles to coordinate traffic flow through intersections.\nDespite substantial work on AIM systems, the balance between intersection\nsafety and efficiency persists as a significant challenge. Building on recent\ndevelopments in formal methods that now have become computationally feasible\nfor AIM applications, we introduce an approach that starts with a temporal\nlogic specification for the intersection and then uses reachability analysis to\ncompute safe time-state corridors for the connected vehicles that pass through\nthe intersection. By analyzing these corridors, in contrast to single\ntrajectories, we can make explicit design decisions regarding safety-efficiency\ntrade-offs while taking each vehicle's decision uncertainty into account.\nAdditionally, we compute safe driving limits to ensure that vehicles remain\nwithin their designated safe corridors. Combining these elements, we develop a\nservice that provides safety filters for AIM coordination of connected\nvehicles. We evaluate the practical feasibility of our safety framework using a\nsimulated 4-way intersection, showing that our approach performs in real-time\nfor multiple scenarios.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}