{"id":"2408.06488","title":"Interference detection in radio astronomy applying Shapiro-Wilks\n  normality test, spectral entropy, and spectral relative entropy","authors":"Zhicheng Cao, Natalia A. Schmid, Kevin Bandura, Duncan R. Lorimer,\n  Morgan Dameron, Katelyn Crockett, Clayton Grubick, Andreas Schmid and Shaonan\n  Zheng","authorsParsed":[["Cao","Zhicheng",""],["Schmid","Natalia A.",""],["Bandura","Kevin",""],["Lorimer","Duncan R.",""],["Dameron","Morgan",""],["Crockett","Katelyn",""],["Grubick","Clayton",""],["Schmid","Andreas",""],["Zheng","Shaonan",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 20:49:57 GMT"}],"updateDate":"2024-08-14","timestamp":1723495797000,"abstract":"  Radio-frequency interference (RFI) is becoming an increasingly significant\nproblem for most radio telescopes. Working with Green Bank Telescope data from\nPSR J1730+0747 in the form of complex-valued channelized voltages and their\nrespective high-resolution power spectral densities, we evaluate a variety of\nstatistical measures to characterize RFI. As a baseline for performance\ncomparison, we use median absolute deviation (MAD) in complex channelized\nvoltage data and spectral kurtosis (SK) in power spectral density data to\ncharacterize and filter out RFI. From a new perspective, we implement the\nShapiro-Wilks (SW) test for normality and two information theoretical measures,\nspectral entropy (SE) and spectral relative entropy (SRE), and apply them to\nmitigate RFI. The baseline RFI mitigation algorithms are compared against our\nnovel RFI detection algorithms to determine how effective and robust the\nperformance is. Except for MAD, we find significant improvements in\nsignal-to-noise ratio through the application of SE, symmetrical SRE,\nasymmetrical SRE, SK, and SW. These algorithms also do a good job of\ncharacterizing broadband RFI. Time- and frequency-variable RFI signals are best\ndetected by SK and SW tests.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Prjmxbx49U8werD8ndw4liXdbk-sTbSd8B6pScyejWs","pdfSize":"2126926"}
