{"id":"2408.08280","title":"Local divergence-free velocity interpolation for the immersed boundary\n  method using composite B-splines","authors":"Cole Gruninger and Boyce E. Griffith","authorsParsed":[["Gruninger","Cole",""],["Griffith","Boyce E.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 17:25:15 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 22:37:08 GMT"}],"updateDate":"2024-08-20","timestamp":1723742715000,"abstract":"  This paper introduces an approach to improve volume conservation in the\nimmersed boundary (IB) method using regularized delta functions derived from\ncomposite B-splines. These delta functions employ tensor product kernels using\nB-splines, whose polynomial degrees vary in normal and tangential directions\nbased on the corresponding velocity component. Our method addresses the\nlong-standing volume conservation issues in the conventional IB method,\nparticularly evident in simulations of pressurized, closed membranes. We\ndemonstrate that our approach significantly enhances volume conservation,\nrivaling the performance of the non-local Divergence-Free Immersed Boundary\n(DFIB) method introduced by Bao et al. while maintaining the local nature of\nthe classical IB method. This avoids the computational overhead associated with\nthe DFIB method's construction of an explicit velocity potential which requires\nadditional Poisson solves. Numerical experiments show that sufficiently regular\ncomposite B-spline kernels can maintain initial volumes to within machine\nprecision. We analyze the relationship between kernel regularity and the\naccuracy of force spreading and velocity interpolation operations. Our findings\nindicate that composite B-splines of at least $C^1$ regularity produce results\ncomparable to the DFIB method in dynamic simulations, with volume conservation\nerrors primarily dominated by the time-stepping scheme's truncation error. This\nwork offers a computationally efficient alternative for improving volume\nconservation in IB methods, particularly beneficial for large-scale,\nthree-dimensional simulations. The proposed approach requires minimal\nmodifications to an existing IB code, making it an accessible improvement for a\nwide range of applications in computational fluid dynamics and fluid-structure\ninteraction.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Physics/Computational Physics","Physics/Fluid Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}