{"id":"2408.11095","title":"Anomalously low-mass core-He-burning star in NGC 6819 as a\n  post-common-envelope phase product","authors":"Massimiliano Matteuzzi, David Hendriks, Robert G. Izzard, Andrea\n  Miglio, Karsten Brogaard, Josefina Montalb\\'an, Marco Tailo, and Alessandro\n  Mazzi","authorsParsed":[["Matteuzzi","Massimiliano",""],["Hendriks","David",""],["Izzard","Robert G.",""],["Miglio","Andrea",""],["Brogaard","Karsten",""],["Montalbán","Josefina",""],["Tailo","Marco",""],["Mazzi","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 18:00:02 GMT"}],"updateDate":"2024-08-22","timestamp":1724176802000,"abstract":"  Precise masses of red-giant stars enable a robust inference of their ages,\nbut there are cases where these age estimates are highly precise yet very\ninaccurate. Examples are core-helium-burning (CHeB) stars that have lost more\nmass than predicted by standard single-star evolutionary models. Members of\nstar clusters in the ${\\it Kepler}$ database represent a unique opportunity to\nidentify such stars, because they combine exquisite asteroseismic constraints\nwith independent age information. In this work we focus on the single,\nmetal-rich, Li-rich, low-mass, CHeB star KIC4937011, which is a member of the\nopen cluster NGC 6819 (turn-off mass of $\\approx 1.6 \\, M_\\odot$, i.e. age of\n$\\approx 2.4$ Gyr). This star has $\\approx 1 \\, M_\\odot$ less mass than\nexpected for its age and metallicity, which could be explained by binary\ninteractions or mass-loss along the red-giant branch (RGB). To infer formation\nscenarios for this object, we perform a Bayesian analysis by combining the\nbinary stellar evolutionary framework $\\texttt{binary_c v2.2.3}$ with the\ndynamic nested sampling approach contained in the $\\texttt{dynesty v2.1.1}$\npackage. We find that this star is likely the result of a common-envelope\nevolution (CEE) phase during the RGB stage of the primary star in which the\nlow-mass ($<0.71 \\, M_\\odot$) main sequence companion does not survive. During\nthe CEE phase $\\approx 1 \\, M_\\odot$ of material is ejected from the system,\nand the final star reaches the CHeB stage after helium flashes as if it were a\nsingle star of mass $\\approx 0.7 \\, M_\\odot$, which is what we observe today.\nAlthough the proposed scenario is consistent with photometric and spectroscopic\nobservations, a quantitative comparison with detailed stellar evolution\ncalculations is needed to quantify the systematic skewness of radius,\nluminosity, and effective temperature distributions towards higher values than\nobservations.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}