{"id":"2408.06457","title":"Advanced Vision Transformers and Open-Set Learning for Robust Mosquito\n  Classification: A Novel Approach to Entomological Studies","authors":"Ahmed Akib Jawad Karim, Muhammad Zawad Mahmud, Riasat Khan","authorsParsed":[["Karim","Ahmed Akib Jawad",""],["Mahmud","Muhammad Zawad",""],["Khan","Riasat",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:17:57 GMT"}],"updateDate":"2024-08-14","timestamp":1723490277000,"abstract":"  Mosquito-related diseases pose a significant threat to global public health,\nnecessitating efficient and accurate mosquito classification for effective\nsurveillance and control. This work presents an innovative approach to mosquito\nclassification by leveraging state-of-the-art vision transformers and open-set\nlearning techniques. A novel framework has been introduced that integrates\nTransformer-based deep learning models with comprehensive data augmentation and\npreprocessing methods, enabling robust and precise identification of ten\nmosquito species. The Swin Transformer model achieves the best performance for\ntraditional closed-set learning with 99.80\\% accuracy and 0.998 F1 score. The\nlightweight MobileViT technique attains an almost similar accuracy of 98.90\\%\nwith significantly reduced parameters and model complexities. Next, the applied\ndeep learning models' adaptability and generalizability in a static environment\nhave been enhanced by using new classes of data samples during the inference\nstage that have not been included in the training set. The proposed framework's\nability to handle unseen classes like insects similar to mosquitoes, even\nhumans, through open-set learning further enhances its practical applicability\nemploying the OpenMax technique and Weibull distribution. The traditional CNN\nmodel, Xception, outperforms the latest transformer with higher accuracy and F1\nscore for open-set learning. The study's findings highlight the transformative\npotential of advanced deep-learning architectures in entomology, providing a\nstrong groundwork for future research and development in mosquito surveillance\nand vector control. The implications of this work extend beyond mosquito\nclassification, offering valuable insights for broader ecological and\nenvironmental monitoring applications.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}