{"id":"2408.09227","title":"FEDMEKI: A Benchmark for Scaling Medical Foundation Models via Federated\n  Knowledge Injection","authors":"Jiaqi Wang, Xiaochen Wang, Lingjuan Lyu, Jinghui Chen, Fenglong Ma","authorsParsed":[["Wang","Jiaqi",""],["Wang","Xiaochen",""],["Lyu","Lingjuan",""],["Chen","Jinghui",""],["Ma","Fenglong",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 15:18:56 GMT"}],"updateDate":"2024-08-20","timestamp":1723907936000,"abstract":"  This study introduces the Federated Medical Knowledge Injection (FEDMEKI)\nplatform, a new benchmark designed to address the unique challenges of\nintegrating medical knowledge into foundation models under privacy constraints.\nBy leveraging a cross-silo federated learning approach, FEDMEKI circumvents the\nissues associated with centralized data collection, which is often prohibited\nunder health regulations like the Health Insurance Portability and\nAccountability Act (HIPAA) in the USA. The platform is meticulously designed to\nhandle multi-site, multi-modal, and multi-task medical data, which includes 7\nmedical modalities, including images, signals, texts, laboratory test results,\nvital signs, input variables, and output variables. The curated dataset to\nvalidate FEDMEKI covers 8 medical tasks, including 6 classification tasks (lung\nopacity detection, COVID-19 detection, electrocardiogram (ECG) abnormal\ndetection, mortality prediction, sepsis prediction, and enlarged\ncardiomediastinum detection) and 2 generation tasks (medical visual question\nanswering (MedVQA) and ECG noise clarification). This comprehensive dataset is\npartitioned across several clients to facilitate the decentralized training\nprocess under 16 benchmark approaches. FEDMEKI not only preserves data privacy\nbut also enhances the capability of medical foundation models by allowing them\nto learn from a broader spectrum of medical knowledge without direct data\nexposure, thereby setting a new benchmark in the application of foundation\nmodels within the healthcare sector.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"XljzD0We63KPnSTpG7Glt01uUcputVzPiOLaamM5EJg","pdfSize":"4715135"}
