{"id":"2408.00451","title":"Acceptor and donor impurity levels in hexagonal-diamond silicon","authors":"Marc T\\'unica, Alberto Zobelli and Michele Amato","authorsParsed":[["Túnica","Marc",""],["Zobelli","Alberto",""],["Amato","Michele",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 10:43:31 GMT"}],"updateDate":"2024-08-02","timestamp":1722509011000,"abstract":"  Recent advances in the characterization of hexagonal-diamond silicon (2H-Si)\nhave shown that this material possesses remarkably different structural,\nelectronic, and optical properties as compared to the common cubic-diamond (3C)\npolytype. Interestingly, despite the wide range of physical properties\nanalyzed, to date no study has investigated impurity energy levels in 2H-Si.\nHere, we present results of ab initio DFT simulations to describe the effect of\np- and n-type substitutional doping on the structural and electronic properties\nof hexagonal-diamond Si (2H-Si). We first provide a detailed analysis of how a\ngiven impurity can assume a different local symmetry depending on the host\ncrystal phase. Then, by studying neutral and charged dopants, we carefully\nestimate donors and acceptors transition energy levels in 2H-Si and compare\nthem with the cubic-diamond (3C) case. In the case of acceptors, the formation\nenergy is always lower in 2H-Si and is associated with a shallower charge\ntransition level with respect to 3C-Si. On the other hand, donors prefer the\ncubic phase and have transition energies smaller with respect to 2H-Si.\nFinally, by employing a simple model based on the 2H/3C band offset diagram, we\nprove the physical validity of our findings and we show how holes can be used\nto stabilize the 2H-Si phase.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"7G8uoydKq5eFvYDzQKjICcM_3lntN-mLDnxgZEw_iKQ","pdfSize":"338323","txDigest":"8f9TPMkmRtdwymb3JhzuZHMVUbGBNXU9W5A5cR6sGhjv","endEpoch":"1","status":"CERTIFIED"}
