{"id":"2408.09278","title":"Cross-Species Data Integration for Enhanced Layer Segmentation in Kidney\n  Pathology","authors":"Junchao Zhu, Mengmeng Yin, Ruining Deng, Yitian Long, Yu Wang, Yaohong\n  Wang, Shilin Zhao, Haichun Yang, Yuankai Huo","authorsParsed":[["Zhu","Junchao",""],["Yin","Mengmeng",""],["Deng","Ruining",""],["Long","Yitian",""],["Wang","Yu",""],["Wang","Yaohong",""],["Zhao","Shilin",""],["Yang","Haichun",""],["Huo","Yuankai",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 19:30:40 GMT"}],"updateDate":"2024-08-20","timestamp":1723923040000,"abstract":"  Accurate delineation of the boundaries between the renal cortex and medulla\nis crucial for subsequent functional structural analysis and disease diagnosis.\nTraining high-quality deep-learning models for layer segmentation relies on the\navailability of large amounts of annotated data. However, due to the patient's\nprivacy of medical data and scarce clinical cases, constructing pathological\ndatasets from clinical sources is relatively difficult and expensive. Moreover,\nusing external natural image datasets introduces noise during the domain\ngeneralization process. Cross-species homologous data, such as mouse kidney\ndata, which exhibits high structural and feature similarity to human kidneys,\nhas the potential to enhance model performance on human datasets. In this\nstudy, we incorporated the collected private Periodic Acid-Schiff (PAS) stained\nmouse kidney dataset into the human kidney dataset for joint training. The\nresults showed that after introducing cross-species homologous data, the\nsemantic segmentation models based on CNN and Transformer architectures\nachieved an average increase of 1.77% and 1.24% in mIoU, and 1.76% and 0.89% in\nDice score for the human renal cortex and medulla datasets, respectively. This\napproach is also capable of enhancing the model's generalization ability. This\nindicates that cross-species homologous data, as a low-noise trainable data\nsource, can help improve model performance under conditions of limited clinical\nsamples. Code is available at https://github.com/hrlblab/layer_segmentation.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}