{"id":"2408.13659","title":"Reactzyme: A Benchmark for Enzyme-Reaction Prediction","authors":"Chenqing Hua, Bozitao Zhong, Sitao Luan, Liang Hong, Guy Wolf, Doina\n  Precup, Shuangjia Zheng","authorsParsed":[["Hua","Chenqing",""],["Zhong","Bozitao",""],["Luan","Sitao",""],["Hong","Liang",""],["Wolf","Guy",""],["Precup","Doina",""],["Zheng","Shuangjia",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 19:19:33 GMT"}],"updateDate":"2024-08-27","timestamp":1724527173000,"abstract":"  Enzymes, with their specific catalyzed reactions, are necessary for all\naspects of life, enabling diverse biological processes and adaptations.\nPredicting enzyme functions is essential for understanding biological pathways,\nguiding drug development, enhancing bioproduct yields, and facilitating\nevolutionary studies. Addressing the inherent complexities, we introduce a new\napproach to annotating enzymes based on their catalyzed reactions. This method\nprovides detailed insights into specific reactions and is adaptable to newly\ndiscovered reactions, diverging from traditional classifications by protein\nfamily or expert-derived reaction classes. We employ machine learning\nalgorithms to analyze enzyme reaction datasets, delivering a much more refined\nview on the functionality of enzymes. Our evaluation leverages the largest\nenzyme-reaction dataset to date, derived from the SwissProt and Rhea databases\nwith entries up to January 8, 2024. We frame the enzyme-reaction prediction as\na retrieval problem, aiming to rank enzymes by their catalytic ability for\nspecific reactions. With our model, we can recruit proteins for novel reactions\nand predict reactions in novel proteins, facilitating enzyme discovery and\nfunction annotation.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Quantitative Biology/Quantitative Methods"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}