{"id":"2408.00171","title":"SU(2) gauge theory with one and two adjoint fermions towards the\n  continuum limit","authors":"Andreas Athenodorou, Ed Bennett, Georg Bergner, Pietro Butti, Julian\n  Lenz, Biagio Lucini","authorsParsed":[["Athenodorou","Andreas",""],["Bennett","Ed",""],["Bergner","Georg",""],["Butti","Pietro",""],["Lenz","Julian",""],["Lucini","Biagio",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 21:51:47 GMT"}],"updateDate":"2024-08-02","timestamp":1722462707000,"abstract":"  We provide an extended lattice study of the SU(2) gauge theory coupled to one\nDirac fermion flavour ($N_{\\mathrm{f}} =1$) transforming in the adjoint\nrepresentation as the continuum limit is approached. This investigation is\nsupplemented by numerical results obtained for the SU(2) gauge theory with two\nDirac fermion flavours ($N_{\\mathrm{f}} =2$) transforming in the adjoint\nrepresentation, for which we perform numerical investigations at a single\nlattice spacing value, which is analysed together with earlier calculations.\nThe purpose of our study is to advance the characterisation of the infrared\nproperties of both theories, which previous investigations have concluded to be\nin the conformal window. For both, we determine the mass spectrum and the\nanomalous dimension of the fermion condensate using finite-size hyperscaling of\nthe spectrum, mode number analysis of the Dirac operator (for which we improve\non our previous proposal) and the ratio of masses of the lightest spin-2\nparticle over the lightest scalar. All methods provide a consistent picture,\nwith the anomalous dimension of the condensate $\\gamma_*$ decreasing\nsignificantly as one approaches the continuum limit for the $N_{\\mathrm{f}} =\n1$ theory towards a value consistent with $\\gamma_* = 0.174(6)$, while for\n$N_{\\mathrm{f}} = 2$ the anomalous dimension decreases more slowly with\n$\\beta$. A chiral perturbation theory analysis show that the infrared behaviour\nof both theories is incompatible with the breaking of chiral symmetry.\n","subjects":["Physics/High Energy Physics - Lattice"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"g-ZSl_rT2ZEDfJVa76pFy0nYzE2V5HPRre3fBYmM89Y","pdfSize":"1996377","txDigest":"HsyDe85Uo89dPC7CtD9CkgbBJibx4aEcP2djfgpvqmzi","endEpoch":"1","status":"CERTIFIED"}
