{"id":"2408.03917","title":"Fluctuation of coherences in noisy mesoscopic quantum systems with\n  diffusive transport","authors":"Ludwig Hruza","authorsParsed":[["Hruza","Ludwig",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 17:22:17 GMT"}],"updateDate":"2024-08-08","timestamp":1723051337000,"abstract":"  The motivation for this thesis is to find a fluctuating hydrodynamic\ndescription of quantum coherent effects in mesoscopic quantum systems with\ndiffusive transport properties. Coherent effects are inscribed into the\ncoherences (two-point Green's function) on which we focus as the building\nblocks of such a theory. Our approach is rather mathematical and not related to\nconcrete experiments. We study the quantum symmetric simple exclusion process\n(QSSEP), a potentially iconic model describing transport of noisy free fermions\non a 1D lattice, which has the minimal structure to capture what we are\ninterested in: Long-ranged coherences and diffusive transport. In mean, QSSEP\nreduces to the symmetric simple exclusion process (SSEP), a classical toy model\nthat was important in the development of the macroscopic fluctuation theory, a\nfluctuating hydrodynamic description of diffusive transport in classical\nsystems. Studying QSSEP we hope to make progress towards a quantum coherent\nextension of the macroscopic fluctuation theory.\n  The thesis summarizes many results we have obtained about QSSEP in the last\nthree years, such as the dynamical equation and an exact stationary solution\nfor correlation functions of coherences at hydrodynamic scales, the\ndistribution of entanglement in QSSEP and an argument why QSSEP might be an\neffective noisy description for more generic mesoscopic quantum systems. Many\nof these results are due to a relation between the statistical properties of\ncoherences in QSSEP and free probability theory. We devote a whole chapter to\nthis relation and present, as a by-product, a method to characterize the\nspectrum of subblocks of a large class of structured random matrices.\n","subjects":["Physics/Mathematical Physics","Condensed Matter/Statistical Mechanics","Mathematics/Mathematical Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"OO1zgdiWG4UM8wdBzCzTHL5L1Os9jpV-J6-BeQD5S9Y","pdfSize":"5382478"}
