{"id":"2408.00509","title":"Advanced pure tilt actuator for testing tilt-to-length coupling in\n  space-based gravitational wave detection","authors":"Xiang Lin, Qi Xia, Peng Qiu, Yurong Liang, Hao Yan","authorsParsed":[["Lin","Xiang",""],["Xia","Qi",""],["Qiu","Peng",""],["Liang","Yurong",""],["Yan","Hao",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 12:32:10 GMT"},{"version":"v2","created":"Fri, 2 Aug 2024 01:58:34 GMT"}],"updateDate":"2024-08-05","timestamp":1722515530000,"abstract":"  Tilt-to-length (TTL) coupling, caused by the jitter of test masses or\nsatellites, is a significant noise source in space-based gravitational wave\ndetection. Calibrating and suppressing TTL coupling noise at the sub-nanometer\nlevel is essential. One main challenge in current ground-based TTL coupling\ntesting is the residual translational movement of the tilt actuator. This paper\nintroduces the development of an advanced pure tilt actuator (APTA)\nspecifically designed for testing TTL coupling. The APTA provides precise tilt\nmotion and is monitored by a four-beam interferometer, which measures the\ndisplacement of attached array pyramids. We present a detailed theoretical\nmodel and experimental setup. Experimental results demonstrate that this\noptical test bed, equipped with the APTA, can achieve subnanometer-level TTL\ncoupling calibration. In addition, a typical heterodyne interferometer was\ntested using the APTA test bed. Comparative testing demonstrated that the\nimaging system is capable of effectively suppressing TTL coupling errors. The\nTTL coupling coefficients were reduced from over plus-minus 30 micrometers per\nradian to within plus-minus 5 micrometers per radian across a range of\nplus-minus 200 microradians, meeting the preliminary requirements for the\nTianQin mission. This APTA test platform has the potential to be widely\nutilized for ground-based TTL coupling inspection.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Physics/Instrumentation and Detectors","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}