{"id":"2408.03166","title":"CADRL: Category-aware Dual-agent Reinforcement Learning for Explainable\n  Recommendations over Knowledge Graphs","authors":"Shangfei Zheng, Hongzhi Yin, Tong Chen, Xiangjie Kong, Jian Hou,\n  Pengpeng Zhao","authorsParsed":[["Zheng","Shangfei",""],["Yin","Hongzhi",""],["Chen","Tong",""],["Kong","Xiangjie",""],["Hou","Jian",""],["Zhao","Pengpeng",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 13:07:08 GMT"}],"updateDate":"2024-08-07","timestamp":1722949628000,"abstract":"  Knowledge graphs (KGs) have been widely adopted to mitigate data sparsity and\naddress cold-start issues in recommender systems. While existing KGs-based\nrecommendation methods can predict user preferences and demands, they fall\nshort in generating explicit recommendation paths and lack explainability. As a\nstep beyond the above methods, recent advancements utilize reinforcement\nlearning (RL) to find suitable items for a given user via explainable\nrecommendation paths. However, the performance of these solutions is still\nlimited by the following two points. (1) Lack of ability to capture contextual\ndependencies from neighboring information. (2) The excessive reliance on short\nrecommendation paths due to efficiency concerns. To surmount these challenges,\nwe propose a category-aware dual-agent reinforcement learning (CADRL) model for\nexplainable recommendations over KGs. Specifically, our model comprises two\ncomponents: (1) a category-aware gated graph neural network that jointly\ncaptures context-aware item representations from neighboring entities and\ncategories, and (2) a dual-agent RL framework where two agents efficiently\ntraverse long paths to search for suitable items. Finally, experimental results\nshow that CADRL outperforms state-of-the-art models in terms of both\neffectiveness and efficiency on large-scale datasets.\n","subjects":["Computing Research Repository/Information Retrieval"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}