{"id":"2408.08654","title":"Accelerating ab initio melting property calculations with machine\n  learning: Application to the high entropy alloy TaVCrW","authors":"Li-Fang Zhu and Fritz Koermann and Qing Chen and Malin Selleby and\n  Joerg Neugebauer and and Blazej Grabowski","authorsParsed":[["Zhu","Li-Fang",""],["Koermann","Fritz",""],["Chen","Qing",""],["Selleby","Malin",""],["Neugebauer","Joerg",""],["Grabowski","and Blazej",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 10:42:09 GMT"}],"updateDate":"2024-08-19","timestamp":1723804929000,"abstract":"  Melting properties are critical for designing novel materials, especially for\ndiscovering high-performance, high-melting refractory materials. Experimental\nmeasurements of these properties are extremely challenging due to their high\nmelting temperatures. Complementary theoretical predictions are, therefore,\nindispensable. The conventional free energy approach using density functional\ntheory (DFT) has been a gold standard for such purposes because of its high\naccuracy. However,it generally involves expensive thermodynamic integration\nusing ab initio molecular dynamic simulations. The high computational cost\nmakes high-throughput calculations infeasible. Here, we propose a highly\nefficient DFT-based method aided by a specially designed machine learning\npotential. As the machine learning potential can closely reproduce the ab\ninitio phase space, even for multi-component alloys, the costly thermodynamic\nintegration can be fully substituted with more efficient free energy\nperturbation calculations. The method achieves overall savings of computational\nresources by 80% compared to current alternatives. We apply the method to the\nhigh-entropy alloy TaVCrW and calculate its melting properties, including\nmelting temperature, entropy and enthalpy of fusion, and volume change at the\nmelting point. Additionally, the heat capacities of solid and liquid TaVCrW are\ncalculated. The results agree reasonably with the calphad extrapolated values.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}