{"id":"2408.16870","title":"Analyzing Errors in Controlled Turret System","authors":"Matthew Karlson, Heng Ban, Daniel G. Cole, Mai Abdelhakim, Jennifer\n  Forsythe, John T. Fitzgibbons","authorsParsed":[["Karlson","Matthew",""],["Ban","Heng",""],["Cole","Daniel G.",""],["Abdelhakim","Mai",""],["Forsythe","Jennifer",""],["Fitzgibbons","John T.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 19:35:11 GMT"}],"updateDate":"2024-09-02","timestamp":1724960111000,"abstract":"  The purpose of this paper is to characterize aiming errors in controlled\nweapon systems given target location as input. To achieve this objective, we\nanalyze the accuracy of a controlled weapon system model for stationary and\nmoving targets under different error sources and firing times. First, we\ndevelop a mathematical model of a gun turret and use it to design two\ncontrollers, a Proportional-Integral-Derivative controller and a Model\nPredictive controller, which accept the target location input and move the\nturret to the centroid of the target in simulations. For stationary targets, we\nanalyze the impact of errors in estimating the system's parameters and\nuncertainty in the aim point measurement. Our results indicate that turret\nmovement is more sensitive to errors in the moment of inertia than the damping\ncoefficient, which could lead to incorrect simulations of controlled turret\nsystem accuracy. The results also support the hypothesis that turret movement\nerrors are larger over longer distances of gun turret movement and, assuming no\ntime constraints, accuracy improves the longer one waits to fire; though this\nmay not always be practical in a combat scenario. Additionally, we demonstrate\nthat the integral control component is needed for high accuracy in moving\ntarget scenarios.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}