{"id":"2408.02013","title":"Blockchain-Enabled Dynamic Spectrum Sharing for Satellite and\n  Terrestrial Communication Networks","authors":"Zixin Wang, Mingrui Cao, Hao Jiang, Bin Cao, Shuo Wang, Chen Sun, and\n  Mugen Peng","authorsParsed":[["Wang","Zixin",""],["Cao","Mingrui",""],["Jiang","Hao",""],["Cao","Bin",""],["Wang","Shuo",""],["Sun","Chen",""],["Peng","Mugen",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 12:49:02 GMT"}],"updateDate":"2024-08-06","timestamp":1722775742000,"abstract":"  Dynamic spectrum sharing (DSS) between satellite and terrestrial networks has\nincreasingly engaged the academic and industrial sectors. Nevertheless,\nfacilitating secure, efficient and scalable sharing continues to pose a pivotal\nchallenge. Emerging as a promising technology to bridge the trust gap among\nmultiple participants, blockchain has been envisioned to enable DSS in a\ndecentralized manner. However, satellites with limited resources may struggle\nto support the frequent interactions required by blockchain networks.\nAdditionally,given the extensive coverage of satellites, spectrum sharing needs\nvary by regions, challenging traditional blockchain approaches to accommodate\ndifferences. In this work, a partitioned, self-governed, and customized dynamic\nspectrum sharing approach (PSC-DSS) is proposed for spectrum sharing between\nsatellite access networks and terrestrial access networks. This approach\nestablishes a sharded and tiered architecture which allows various regions to\nmanage spectrum autonomously while jointly maintaining a single blockchain\nledger. Moreover, a spectrum-consensus integrated mechanism, which decouples\nDSS process and couples it with blockchain consensus protocol, is designed to\nenable regions to conduct DSS transactions in parallel and dynamically innovate\nspectrum sharing schemes without affecting others. Furthermore, a theoretical\nframework is derived to justify the stability performance of PSC-DSS. Finally,\nsimulations and experiments are conducted to validate the advantageous\nperformance of PSC-DSS in terms of low-overhead, high efficiency, and robust\nstability.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}