{"id":"2408.05526","title":"CryoBench: Diverse and challenging datasets for the heterogeneity\n  problem in cryo-EM","authors":"Minkyu Jeon, Rishwanth Raghu, Miro Astore, Geoffrey Woollard, Ryan\n  Feathers, Alkin Kaz, Sonya M. Hanson, Pilar Cossio, and Ellen D. Zhong","authorsParsed":[["Jeon","Minkyu",""],["Raghu","Rishwanth",""],["Astore","Miro",""],["Woollard","Geoffrey",""],["Feathers","Ryan",""],["Kaz","Alkin",""],["Hanson","Sonya M.",""],["Cossio","Pilar",""],["Zhong","Ellen D.",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 11:48:14 GMT"}],"updateDate":"2024-08-13","timestamp":1723290494000,"abstract":"  Cryo-electron microscopy (cryo-EM) is a powerful technique for determining\nhigh-resolution 3D biomolecular structures from imaging data. As this technique\ncan capture dynamic biomolecular complexes, 3D reconstruction methods are\nincreasingly being developed to resolve this intrinsic structural\nheterogeneity. However, the absence of standardized benchmarks with ground\ntruth structures and validation metrics limits the advancement of the field.\nHere, we propose CryoBench, a suite of datasets, metrics, and performance\nbenchmarks for heterogeneous reconstruction in cryo-EM. We propose five\ndatasets representing different sources of heterogeneity and degrees of\ndifficulty. These include conformational heterogeneity generated from simple\nmotions and random configurations of antibody complexes and from tens of\nthousands of structures sampled from a molecular dynamics simulation. We also\ndesign datasets containing compositional heterogeneity from mixtures of\nribosome assembly states and 100 common complexes present in cells. We then\nperform a comprehensive analysis of state-of-the-art heterogeneous\nreconstruction tools including neural and non-neural methods and their\nsensitivity to noise, and propose new metrics for quantitative comparison of\nmethods. We hope that this benchmark will be a foundational resource for\nanalyzing existing methods and new algorithmic development in both the cryo-EM\nand machine learning communities.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science","Computing Research Repository/Machine Learning","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/"}