{"id":"2408.14911","title":"Quasistatic evolution of Orlicz-Sobolev nematic elastomers","authors":"Marco Bresciani, Bianca Stroffolini","authorsParsed":[["Bresciani","Marco",""],["Stroffolini","Bianca",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:38:14 GMT"}],"updateDate":"2024-08-28","timestamp":1724751494000,"abstract":"  We investigate the variational model for nematic elastomer proposed by\nBarchiesi and DeSimone with the director field defined on the deformed\nconfiguration under general growth conditions on the elastic density. This\nleads us to consider deformations in Orlicz-Sobolev spaces. Our work builds\nupon a previous paper by Henao and the Second Author, and extends their\nanalysis to the quasistatic setting. The overall strategy parallels the one\ndevised by the First author in the case of Sobolev deformations for a similar\nmodel in magnetoelasticity. We prove two existence results for energetic\nsolutions in the rate-independent setting. The first result concerns\nquasistatic evolutions driven by time-dependent applied loads. For this\nproblem, we establish suitable Poincar\\'{e} and trace inequalities in modular\nform to recover the coercivity of the total energy. The second result ensures\nthe existence of quasistatic evolution for both time-depend applied loads and\nboundary conditions under physical confinement. In its proof, we follow the\napproach advanced by Francfort and Mielke based on a multiplicative\ndecomposition of the deformation gradient and we implement it for energies\ncomprising terms defined on the deformed configuration. Both existence results\nrely on a compactness theorem for sequences of admissible states with uniformly\nbounded energy which yields the strong convergence of the composition of the\nnematic fields with the corresponding deformations. While proving it, we show\nthe regular approximate differentiability of Orlicz-Sobolev maps with suitable\nintegrability, thus generalizing a classical result for Sobolev maps due to\nGoffman and Ziemer.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}