{"id":"2408.10024","title":"Towards Robust Federated Image Classification: An Empirical Study of\n  Weight Selection Strategies in Manufacturing","authors":"Vinit Hegiste and Tatjana Legler and Martin Ruskowski","authorsParsed":[["Hegiste","Vinit",""],["Legler","Tatjana",""],["Ruskowski","Martin",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 14:18:21 GMT"},{"version":"v2","created":"Wed, 21 Aug 2024 07:58:02 GMT"}],"updateDate":"2024-08-22","timestamp":1724077101000,"abstract":"  In the realm of Federated Learning (FL), particularly within the\nmanufacturing sector, the strategy for selecting client weights for server\naggregation is pivotal for model performance. This study investigates the\ncomparative effectiveness of two weight selection strategies: Final Epoch\nWeight Selection (FEWS) and Optimal Epoch Weight Selection (OEWS). Designed for\nmanufacturing contexts where collaboration typically involves a limited number\nof partners (two to four clients), our research focuses on federated image\nclassification tasks. We employ various neural network architectures, including\nEfficientNet, ResNet, and VGG, to assess the impact of these weight selection\nstrategies on model convergence and robustness. Our research aims to determine\nwhether FEWS or OEWS enhances the global FL model's performance across\ncommunication rounds (CRs). Through empirical analysis and rigorous\nexperimentation, we seek to provide valuable insights for optimizing FL\nimplementations in manufacturing, ensuring that collaborative efforts yield the\nmost effective and reliable models with a limited number of participating\nclients. The findings from this study are expected to refine FL practices\nsignificantly in manufacturing, thereby enhancing the efficiency and\nperformance of collaborative machine learning endeavors in this vital sector.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/"}