{"id":"2408.11647","title":"Microscopic Theory of the Elastic Shear Modulus and\n  Length-Scale-Dependent Dynamic Re-Entrancy Phenomena in Very Dense Sticky\n  Particle Fluids","authors":"Anoop Mutneja and Kenneth S Schweizer","authorsParsed":[["Mutneja","Anoop",""],["Schweizer","Kenneth S",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:17:51 GMT"}],"updateDate":"2024-08-22","timestamp":1724249871000,"abstract":"  We apply the hybrid Projectionless Dynamic Theory (hybrid PDT) formulation of\nthe Elastically Collective Nonlinear Langevin Equation (ECNLE) activated\ndynamics approach to study dense fluids of sticky spheres with short range\nattractions. Of special interest is the problem of non-monotonic evolution with\nattraction strength of the elastic modulus (\"re-entrancy\") at high packing\nfractions far beyond the ideal mode coupling theory (MCT) nonergodicity\nboundary. The dynamic force constraints explicitly treat the bare attractive\nforces that drive transient physical bond formation, while a projection\napproximation is employed for the singular hard-sphere potential. The resultant\ninterference between repulsive and attractive forces contribution to the\ndynamic vertex results in the prediction of localization length and elastic\nmodulus re-entrancy, qualitatively consistent with experiments. The\nnon-monotonic evolution of the alpha time predicted by ECNLE theory with the\nhybrid PDT approach is explored in depth as a function of packing fraction,\nattraction strength, and range. Isochronal dynamic arrest boundaries based on\nactivated relaxation display the classic non-monotonic glass melting form.\nComparisons of these results with the corresponding predictions of ideal MCT\nand the ECNLE and NLE activated theories based on projection reveal large\nqualitative differences. The consequences of stochastic trajectory fluctuations\non intra-cage single particle dynamics with variable attraction strengths are\nalso studied. Large dynamical heterogeneity effects in attractive glasses are\nproperly captured. These include a rapidly increasing non-Gaussian parameter\nwith packing fraction and a non-monotonic evolution with attraction strength,\nin accord with recent simulations. Extension of the microscopic theoretical\napproach to treat double yielding in attractive glass nonlinear rheology is\npossible.\n","subjects":["Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3FYhDiUOGHUfQj3Ok_SBXBqmpsBIXQCj37iO61CZrew","pdfSize":"2622010"}
