{"id":"2408.11623","title":"End-to-End Cost-Effective Incentive Recommendation under Budget\n  Constraint with Uplift Modeling","authors":"Zexu Sun and Hao Yang and Dugang Liu and Yunpeng Weng and Xing Tang\n  and Xiuqiang He","authorsParsed":[["Sun","Zexu",""],["Yang","Hao",""],["Liu","Dugang",""],["Weng","Yunpeng",""],["Tang","Xing",""],["He","Xiuqiang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:48:00 GMT"},{"version":"v2","created":"Sat, 24 Aug 2024 20:24:42 GMT"}],"updateDate":"2024-08-27","timestamp":1724248080000,"abstract":"  In modern online platforms, incentives are essential factors that enhance\nuser engagement and increase platform revenue. Over recent years, uplift\nmodeling has been introduced as a strategic approach to assign incentives to\nindividual customers. Especially in many real-world applications, online\nplatforms can only incentivize customers with specific budget constraints. This\nproblem can be reformulated as the multi-choice knapsack problem. This\noptimization aims to select the optimal incentive for each customer to maximize\nthe return on investment. Recent works in this field frequently tackle the\nbudget allocation problem using a two-stage approach. However, this solution is\nconfronted with the following challenges: (1) The causal inference methods\noften ignore the domain knowledge in online marketing, where the expected\nresponse curve of a customer should be monotonic and smooth as the incentive\nincreases. (2) An optimality gap between the two stages results in inferior\nsub-optimal allocation performance due to the loss of the incentive\nrecommendation information for the uplift prediction under the limited budget\nconstraint. To address these challenges, we propose a novel End-to-End\nCost-Effective Incentive Recommendation (E3IR) model under budget constraints.\nSpecifically, our methods consist of two modules, i.e., the uplift prediction\nmodule and the differentiable allocation module. In the uplift prediction\nmodule, we construct prediction heads to capture the incremental improvement\nbetween adjacent treatments with the marketing domain constraints (i.e.,\nmonotonic and smooth). We incorporate integer linear programming (ILP) as a\ndifferentiable layer input in the allocation module. Furthermore, we conduct\nextensive experiments on public and real product datasets, demonstrating that\nour E3IR improves allocation performance compared to existing two-stage\napproaches.\n","subjects":["Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}