{"id":"2408.09658","title":"Sensitivity of WIMP bounds on the velocity distribution in the limit of\n  a massless mediator","authors":"Koun Choi (IBS, Daejeon), Injun Jeong (CQUeST and Sogang U.), Sunghyun\n  Kang (CQUeST and Sogang U.), Arpan Kar (CQUeST and Sogang U.), Stefano Scopel\n  (CQUeST and Sogang U.)","authorsParsed":[["Choi","Koun","","IBS, Daejeon"],["Jeong","Injun","","CQUeST and Sogang U."],["Kang","Sunghyun","","CQUeST and Sogang U."],["Kar","Arpan","","CQUeST and Sogang U."],["Scopel","Stefano","","CQUeST and Sogang U."]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:41:21 GMT"}],"updateDate":"2024-08-20","timestamp":1724035281000,"abstract":"  We discuss the sensitivity of the bounds on the spin-independent (SI) and\nspin-dependent (SD) WIMP-proton and WIMP-neutron interaction couplings\n$\\alpha_{SI, SD}^{p,n}$ on the WIMP velocity distribution for a massless\nmediator in the propagator by combining direct detection and the neutrino\nsignal from WIMP annihilation in the Sun (fixing the annihilation channel to\n$b\\bar{b}$). We update the bounds in the Standard Halo Model (SHM) and using\nthe halo-independent single-stream method. In the case of a massless mediator\nthe SHM capture rate in the Sun diverges and is regularized by removing the\ncontribution of WIMPs locked into orbits that extend beyond the Sun-Jupiter\ndistance. We discuss the dependence of the SHM bounds on the Jupiter cut\nshowing that it can be sizeable for $\\alpha_{\\rm SD}^p$ and a WIMP mass\n$m_\\chi$ exceeding 1 TeV. Our updated SHM bounds show an improvement between\nabout two and three orders of magnitude compared to the previous ones in the\nliterature. Our halo-independent analysis shows that, with the exception of\n$\\alpha_{\\rm SD}^p$ at large $m_\\chi$, the relaxation of the bounds compared to\nthe SHM is of the same order of that for contact interactions, i.e. relatively\nmoderate in the low and high WIMP mass regimes and as large as a few\n$\\times\\sim 10^2$ for $m_\\chi\\simeq$ 30 GeV. On the other hand, the exact\ndetermination of the relaxation of the bound becomes not reliable for\n$\\alpha_{\\rm SD}^p$ and $m_\\chi\\gtrsim$ 1 TeV due to the sensitivity of the SHM\ncapture rate in the Sun to the details of the Maxwellian velocity distribution\nat low incoming WIMP speeds. The halo-independent bounds do not depend on the\nJupiter cut needed to regularize the calculation of the capture rate.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}