{"id":"2408.05303","title":"Swift-XRT follow-up analysis of unidentified hard X-ray sources","authors":"M. Kosiba, F. Massaro, A. Paggi, H. A. Pe\\~na-Herazo, N. Masetti, V.\n  Chavushyan, E. Bottacini, and N. Werner","authorsParsed":[["Kosiba","M.",""],["Massaro","F.",""],["Paggi","A.",""],["Peña-Herazo","H. A.",""],["Masetti","N.",""],["Chavushyan","V.",""],["Bottacini","E.",""],["Werner","N.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:00:24 GMT"}],"updateDate":"2024-08-13","timestamp":1723230024000,"abstract":"  It is currently established that the sources contributing to the cosmic X-ray\nbackground (CXB) emission are mainly nearby active galactic nuclei (AGN), in\nparticular those that are obscured. Thus, it is important to fully identify the\nhard X-ray sky source population to accurately characterize the individual\ncontribution of different AGNs to the overall CXB emission. We present a\nfollow-up analysis of all the 218 sources marked as unidentified in our\nprevious revision of the third release of the Palermo Swift-BAT hard X-ray\ncatalog (3PBC) based on our multifrequency classification scheme. These 218\nsources were classified as unidentified in our previous analyses because they\nlack an assigned low-energy counterpart. We searched for soft X-ray\ncounterparts of these 218 3PBC sources in archival Swift-XRT observations\nobtained between 2005 January 1st and 2018 August 1st. In particular, we found\n1213 archival Swift-XRT observations for 192 of the 218 unidentified sources.\nWe found 93 possible Swift-XRT counterparts inside of the Swift-BAT positional\nuncertainty regions. These correspond to 73 3PBC sources, where 60 have only a\nsingle Swift-XRT detection, and 13 sources have multiple detections. We present\na catalog of all the detected possible counterparts of the yet unidentified\nhard X-ray sources to the community as a catalog for future spectroscopic\nfollow-up targets, together with a short catalog of our classification of the\nten sources for which we found available spectra.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}