{"id":"2408.15838","title":"EdgeLinker: Practical Blockchain-based Framework for Healthcare Fog\n  Applications to Enhance Security in Edge-IoT Data Communications","authors":"Mahdi Akbari Zarkesh, Ehsan Dastani, Bardia Safaei, and Ali Movaghar","authorsParsed":[["Zarkesh","Mahdi Akbari",""],["Dastani","Ehsan",""],["Safaei","Bardia",""],["Movaghar","Ali",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:52:37 GMT"}],"updateDate":"2024-08-29","timestamp":1724856757000,"abstract":"  The pervasive adoption of Internet of Things (IoT) has significantly advanced\nhealthcare digitization and modernization. Nevertheless, the sensitive nature\nof medical data presents security and privacy challenges. On the other hand,\nresource constraints of IoT devices often necessitates cloud services for data\nhandling, introducing single points of failure, processing delays, and security\nvulnerabilities. Meanwhile, the blockchain technology offers potential\nsolutions for enhancing security, decentralization, and data ownership. An\nideal solution should ensure confidentiality, access control, and data\nintegrity while being scalable, cost-effective, and integrable with the\nexisting systems. However, current blockchain-based studies only address some\nof these requirements. Accordingly, this paper proposes EdgeLinker; a\ncomprehensive solution incorporating Proof-of-Authority consensus, integrating\nsmart contracts on the Ethereum blockchain for access control, and advanced\ncryptographic algorithms for secure data communication between IoT edge devices\nand the fog layer in healthcare fog applications. This novel framework has been\nimplemented in a real-world fog testbed, using COTS fog devices. Based on a\ncomprehensive set of evaluations, EdgeLinker demonstrates significant\nimprovements in security and privacy with reasonable costs, making it an\naffordable and practical system for healthcare fog applications. Compared with\nthe state-of-the-art, without significant changes in the write-time to the\nblockchain, EdgeLinker achieves a 35% improvement in data read time.\nAdditionally, it is able to provide better throughput in both reading and\nwriting transactions compared to the existing studies. EdgeLinker has been also\nexamined in terms of energy, resource consumption and channel latency in both\nsecure and non-secure modes, which has shown remarkable improvements.\n","subjects":["Computing Research Repository/Distributed, Parallel, and Cluster Computing","Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}