{"id":"2408.11308","title":"EEG-Defender: Defending against Jailbreak through Early Exit Generation\n  of Large Language Models","authors":"Chongwen Zhao, Zhihao Dou, Kaizhu Huang","authorsParsed":[["Zhao","Chongwen",""],["Dou","Zhihao",""],["Huang","Kaizhu",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:25:31 GMT"}],"updateDate":"2024-08-22","timestamp":1724210731000,"abstract":"  Large Language Models (LLMs) are increasingly attracting attention in various\napplications. Nonetheless, there is a growing concern as some users attempt to\nexploit these models for malicious purposes, including the synthesis of\ncontrolled substances and the propagation of disinformation. In an effort to\nmitigate such risks, the concept of \"Alignment\" technology has been developed.\nHowever, recent studies indicate that this alignment can be undermined using\nsophisticated prompt engineering or adversarial suffixes, a technique known as\n\"Jailbreak.\" Our research takes cues from the human-like generate process of\nLLMs. We identify that while jailbreaking prompts may yield output logits\nsimilar to benign prompts, their initial embeddings within the model's latent\nspace tend to be more analogous to those of malicious prompts. Leveraging this\nfinding, we propose utilizing the early transformer outputs of LLMs as a means\nto detect malicious inputs, and terminate the generation immediately. Built\nupon this idea, we introduce a simple yet significant defense approach called\nEEG-Defender for LLMs. We conduct comprehensive experiments on ten jailbreak\nmethods across three models. Our results demonstrate that EEG-Defender is\ncapable of reducing the Attack Success Rate (ASR) by a significant margin,\nroughly 85\\% in comparison with 50\\% for the present SOTAs, with minimal impact\non the utility and effectiveness of LLMs.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2Al_PgPicxIyl9pOO1S3Dt6123SomjEF6lLldgsR1K0","pdfSize":"7677935"}
