{"id":"2408.15884","title":"Magnetism in the Dilute Electron Gas of Rhombohedral Multilayer Graphene","authors":"Tobias Wolf, Nemin Wei, Haoxin Zhou, Chunli Huang","authorsParsed":[["Wolf","Tobias",""],["Wei","Nemin",""],["Zhou","Haoxin",""],["Huang","Chunli",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:57:11 GMT"}],"updateDate":"2024-08-29","timestamp":1724860631000,"abstract":"  Lightly-doped rhombohedral multilayer graphene has recently emerged as one of\nthe most promising material platforms for exploring electronic phases driven by\nstrong Coulomb interactions and non-trivial band topology. This review\nhighlights recent advancements in experimental techniques that deepen our\nunderstanding of the electronic properties of these systems, especially through\nthe application of weak-field magnetic oscillations for studying phase\ntransitions and Fermiology. Theoretically, we advocate modeling these systems\nusing an electron gas framework, influenced primarily by two major energy\nscales: the long-range Coulomb potential and band energy. The interplay between\nthese energies drives transitions between paramagnetic and ferromagnetic\nstates, while smaller energy scales like spin-orbit coupling and\nsublattice-valley-dependent interactions at the atomic lattice scale shape the\n(magnetic anisotropic energy) differences between distinct symmetry-broken\nstates. We provide first-principles estimates of lattice-scale coupling\nconstants for Bernal bilayer graphene under strong displacement field,\nidentifying the on-site inter-valley scattering repulsion, with a strength of\n$g_{\\perp \\perp}=269\\text{meV nm}^2$ as the most significant short-range\ninteraction. The mean-field phase diagram is analyzed and compared with\nexperimental phase diagrams. New results on spin and valley paramagnons are\npresented, highlighting enhanced paramagnetic susceptibility at finite\nwavevectors and predicting valley and spin density-wave instabilities. The\ninterplay between superconductivity and magnetism, particularly under the\ninfluence of spin-orbit coupling, is critically assessed. The review concludes\nwith a summary of key findings and potential directions for future research.\n","subjects":["Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}