{"id":"2408.01933","title":"DiReCT: Diagnostic Reasoning for Clinical Notes via Large Language\n  Models","authors":"Bowen Wang, Jiuyang Chang, Yiming Qian, Guoxin Chen, Junhao Chen,\n  Zhouqiang Jiang, Jiahao Zhang, Yuta Nakashima, Hajime Nagahara","authorsParsed":[["Wang","Bowen",""],["Chang","Jiuyang",""],["Qian","Yiming",""],["Chen","Guoxin",""],["Chen","Junhao",""],["Jiang","Zhouqiang",""],["Zhang","Jiahao",""],["Nakashima","Yuta",""],["Nagahara","Hajime",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 05:15:02 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 04:28:01 GMT"}],"updateDate":"2024-08-07","timestamp":1722748502000,"abstract":"  Large language models (LLMs) have recently showcased remarkable capabilities,\nspanning a wide range of tasks and applications, including those in the medical\ndomain. Models like GPT-4 excel in medical question answering but may face\nchallenges in the lack of interpretability when handling complex tasks in real\nclinical settings. We thus introduce the diagnostic reasoning dataset for\nclinical notes (DiReCT), aiming at evaluating the reasoning ability and\ninterpretability of LLMs compared to human doctors. It contains 511 clinical\nnotes, each meticulously annotated by physicians, detailing the diagnostic\nreasoning process from observations in a clinical note to the final diagnosis.\nAdditionally, a diagnostic knowledge graph is provided to offer essential\nknowledge for reasoning, which may not be covered in the training data of\nexisting LLMs. Evaluations of leading LLMs on DiReCT bring out a significant\ngap between their reasoning ability and that of human doctors, highlighting the\ncritical need for models that can reason effectively in real-world clinical\nscenarios.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ArXjT22LL_t1IWj5jqsekyvLhLYYPvb05rDTESrV8dQ","pdfSize":"1085169","txDigest":"3FoCnnkqwQ65BMJ8z5hbH4wQbBwxryYpwSJC28uYhWHt","endEpoch":"1","status":"CERTIFIED"}
