{"id":"2408.07793","title":"A Multilevel Approach For Solving Large-Scale QUBO Problems With Noisy\n  Hybrid Quantum Approximate Optimization","authors":"Filip B. Maciejewski and Bao Gia Bach and Maxime Dupont and P. Aaron\n  Lott and Bhuvanesh Sundar and David E. Bernal Neira and Ilya Safro and Davide\n  Venturelli","authorsParsed":[["Maciejewski","Filip B.",""],["Bach","Bao Gia",""],["Dupont","Maxime",""],["Lott","P. Aaron",""],["Sundar","Bhuvanesh",""],["Neira","David E. Bernal",""],["Safro","Ilya",""],["Venturelli","Davide",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 20:06:32 GMT"}],"updateDate":"2024-08-16","timestamp":1723665992000,"abstract":"  Quantum approximate optimization is one of the promising candidates for\nuseful quantum computation, particularly in the context of finding approximate\nsolutions to Quadratic Unconstrained Binary Optimization (QUBO) problems.\nHowever, the existing quantum processing units (QPUs) are relatively small, and\ncanonical mappings of QUBO via the Ising model require one qubit per variable,\nrendering direct large-scale optimization infeasible. In classical\noptimization, a general strategy for addressing many large-scale problems is\nvia multilevel/multigrid methods, where the large target problem is iteratively\ncoarsened, and the global solution is constructed from multiple small-scale\noptimization runs. In this work, we experimentally test how existing QPUs\nperform as a sub-solver within such a multilevel strategy. We combine and\nextend (via additional classical processing) the recent Noise-Directed Adaptive\nRemapping (NDAR) and Quantum Relax $\\&$ Round (QRR) algorithms. We first\ndemonstrate the effectiveness of our heuristic extensions on Rigetti's transmon\ndevice Ankaa-2. We find approximate solutions to $10$ instances of fully\nconnected $82$-qubit Sherrington-Kirkpatrick graphs with random integer-valued\ncoefficients obtaining normalized approximation ratios (ARs) in the range $\\sim\n0.98-1.0$, and the same class with real-valued coefficients (ARs $\\sim\n0.94-1.0$). Then, we implement the extended NDAR and QRR algorithms as\nsubsolvers in the multilevel algorithm for $6$ large-scale graphs with at most\n$\\sim 27,000$ variables. The QPU (with classical post-processing steps) is used\nto find approximate solutions to dozens of problems, at most $82$-qubit, which\nare iteratively used to construct the global solution. We observe that quantum\noptimization results are competitive regarding the quality of solutions\ncompared to classical heuristics used as subsolvers within the multilevel\napproach.\n","subjects":["Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}