{"id":"2408.00012","title":"Full Inverse Compton Scattering: Total Transfer of Energy and Momentum\n  from Electrons to Photons","authors":"Luca Serafini, Vittoria Petrillo, Sanae Samsam","authorsParsed":[["Serafini","Luca",""],["Petrillo","Vittoria",""],["Samsam","Sanae",""]],"versions":[{"version":"v1","created":"Fri, 26 Jul 2024 08:16:54 GMT"}],"updateDate":"2024-08-02","timestamp":1721981814000,"abstract":"  In this article we discuss a peculiar regime of Compton Scattering that\nassures the maximum transfer of energy and momentum from free electrons\npropagating in vacuum to the scattered photons. We name this regime Full\nInverse Compton Scattering (FICS) because it is characterized by the maximum\nand full energy loss of the electrons in collision with photons: up to 100 % of\nthe electron kinetic energy is indeed transferred to the photon. In the case of\nrelativistic electrons, characterized by a large Lorentz factor (gamma >> 1),\nFICS regime corresponds to an incident photon energy equal to mec^2/2 . We\ninterpret such an astonishing result as FICS being the time reversal of direct\nCompton Scattering of very energetic photons (of energy much greater than mec2)\nonto atomic electrons. Although the cross section of Compton scattering is\ndecreasing with the energy of the incident photon, making the process less\nprobable with respect to other reactions (pair production, nuclear reactions,\netc) when high energetic photons are bombarding a target, the kinematics\nstraightforwardly implies that the back-scattered photons would have an energy\nreaching asymptotically me^2c^2 . FICS is instead the unique suitable working\npoint in Compton scattering for achieving the total transfer of (kinetic)\nenergy exactly from the electron to the photon. Experiencing transitions from\nthe initial momentum to zero in the laboratory system, in FICS the electron is\nalso subject to very large negative acceleration; this fact can lead to\npossible experiments of sensing the Unruh temperature and related photon bath.\nOn the other side of the energy dynamic range, low relativistic electrons can\nbe completely stopped by moderate energy photons (tens of keV), leading to full\nexchange of temperature between electron clouds and photon baths.\n","subjects":["Physics/General Physics","Physics/Accelerator Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}