{"id":"2408.01783","title":"The charge and magnetic radii of the nucleons from the generalized\n  parton distributions","authors":"The MMGPDs Collaboration, Muhammad Goharipour, Fatemeh Irani, Hadi\n  Hashamipour, K. Azizi","authorsParsed":[["The MMGPDs Collaboration","",""],["Goharipour","Muhammad",""],["Irani","Fatemeh",""],["Hashamipour","Hadi",""],["Azizi","K.",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 13:35:05 GMT"}],"updateDate":"2024-08-06","timestamp":1722692105000,"abstract":"  The proton-radius puzzle refers to the discrepancy observed in measurements\nof the proton's charge radius when using different methods. This inconsistency\nhas prompted extensive research and debate within the physics community, as it\nchallenges the understanding of quantum electrodynamics and the fundamental\nproperties of protons. In the present study, we determine the charge and\nmagnetic radii of the proton and neutron through a global analysis of the\ngeneralized parton distributions (GPDs) at zero skewness for the first time.\nOur results challenge the measurements or analyses in which the nucleon's radii\nare extracted considering just a particular experiment or observable, or using\nonly data points covering particular kinematic regions. We emphasize that\nsimultaneous analysis of all available experimental data related to the radii\nof the nucleons would be preferable to determine their exact values. The final\nresults obtained from our analysis by this way are: $ r_{pE} = 0.8558 \\pm\n0.0135~\\textrm{fm} $, $ r_{pM} = 0.8268 \\pm 0.0533~\\textrm{fm} $, $\n\\left<r_{nE}^2\\right> = -0.1181 \\pm 0.0270~\\textrm{fm}^2 $, and $ r_{nM} =\n0.8367 \\pm 0.0845~\\textrm{fm} $.\n","subjects":["Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Lattice"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RJoZ5bJ_u9pE_m5GPy8jd40xN-dMG8Bc9WH64iX-fLs","pdfSize":"470117","txDigest":"CdBerdeVGKRM7bkzDaGMb3oj6hCct8NYXUDzgkdF8VLb","endEpoch":"1","status":"CERTIFIED"}
