{"id":"2408.05416","title":"High-fidelity and Lip-synced Talking Face Synthesis via Landmark-based\n  Diffusion Model","authors":"Weizhi Zhong, Junfan Lin, Peixin Chen, Liang Lin, Guanbin Li","authorsParsed":[["Zhong","Weizhi",""],["Lin","Junfan",""],["Chen","Peixin",""],["Lin","Liang",""],["Li","Guanbin",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 02:58:28 GMT"}],"updateDate":"2024-08-13","timestamp":1723258708000,"abstract":"  Audio-driven talking face video generation has attracted increasing attention\ndue to its huge industrial potential. Some previous methods focus on learning a\ndirect mapping from audio to visual content. Despite progress, they often\nstruggle with the ambiguity of the mapping process, leading to flawed results.\nAn alternative strategy involves facial structural representations (e.g.,\nfacial landmarks) as intermediaries. This multi-stage approach better preserves\nthe appearance details but suffers from error accumulation due to the\nindependent optimization of different stages. Moreover, most previous methods\nrely on generative adversarial networks, prone to training instability and mode\ncollapse. To address these challenges, our study proposes a novel\nlandmark-based diffusion model for talking face generation, which leverages\nfacial landmarks as intermediate representations while enabling end-to-end\noptimization. Specifically, we first establish the less ambiguous mapping from\naudio to landmark motion of lip and jaw. Then, we introduce an innovative\nconditioning module called TalkFormer to align the synthesized motion with the\nmotion represented by landmarks via differentiable cross-attention, which\nenables end-to-end optimization for improved lip synchronization. Besides,\nTalkFormer employs implicit feature warping to align the reference image\nfeatures with the target motion for preserving more appearance details.\nExtensive experiments demonstrate that our approach can synthesize\nhigh-fidelity and lip-synced talking face videos, preserving more subject\nappearance details from the reference image.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multimedia"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}