{"id":"2408.06930","title":"Diagnosis extraction from unstructured Dutch echocardiogram reports\n  using span- and document-level characteristic classification","authors":"Bauke Arends, Melle Vessies, Dirk van Osch, Arco Teske, Pim van der\n  Harst, Ren\\'e van Es, Bram van Es","authorsParsed":[["Arends","Bauke",""],["Vessies","Melle",""],["van Osch","Dirk",""],["Teske","Arco",""],["van der Harst","Pim",""],["van Es","René",""],["van Es","Bram",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:33:32 GMT"},{"version":"v2","created":"Thu, 15 Aug 2024 12:42:12 GMT"}],"updateDate":"2024-08-16","timestamp":1723559612000,"abstract":"  Clinical machine learning research and AI driven clinical decision support\nmodels rely on clinically accurate labels. Manually extracting these labels\nwith the help of clinical specialists is often time-consuming and expensive.\nThis study tests the feasibility of automatic span- and document-level\ndiagnosis extraction from unstructured Dutch echocardiogram reports. We\nincluded 115,692 unstructured echocardiogram reports from the UMCU a large\nuniversity hospital in the Netherlands. A randomly selected subset was manually\nannotated for the occurrence and severity of eleven commonly described cardiac\ncharacteristics. We developed and tested several automatic labelling techniques\nat both span and document levels, using weighted and macro F1-score, precision,\nand recall for performance evaluation. We compared the performance of span\nlabelling against document labelling methods, which included both direct\ndocument classifiers and indirect document classifiers that rely on span\nclassification results. The SpanCategorizer and MedRoBERTa$.$nl models\noutperformed all other span and document classifiers, respectively. The\nweighted F1-score varied between characteristics, ranging from 0.60 to 0.93 in\nSpanCategorizer and 0.96 to 0.98 in MedRoBERTa$.$nl. Direct document\nclassification was superior to indirect document classification using span\nclassifiers. SetFit achieved competitive document classification performance\nusing only 10% of the training data. Utilizing a reduced label set yielded\nnear-perfect document classification results. We recommend using our published\nSpanCategorizer and MedRoBERTa$.$nl models for span- and document-level\ndiagnosis extraction from Dutch echocardiography reports. For settings with\nlimited training data, SetFit may be a promising alternative for document\nclassification.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"yOQBh86nGKZ9vMkjsoo9fpqb0cWSBuUFWvAujCHs_RE","pdfSize":"1074563"}
