{"id":"2408.14933","title":"Enhancement of the sound absorption of closed-cell mineral foams by\n  perforations: Manufacturing process and model-supported adaptation","authors":"Bart Van Damme, Th\\'eo Cavalieri, Cong-Truc Nguyen, Camille Perrot","authorsParsed":[["Van Damme","Bart",""],["Cavalieri","Théo",""],["Nguyen","Cong-Truc",""],["Perrot","Camille",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 10:14:12 GMT"}],"updateDate":"2024-08-28","timestamp":1724753652000,"abstract":"  Thin low-frequency acoustic absorbers that are economical to produce in large\nquantities are scarce, and their efficiency is often limited to a narrow\nfrequency range. In this paper, we present opportunities to use highly porous\nmineral foams, in particular optimally designed gypsum foams, to achieve high\nabsorption levels for layers of less than 1/10 of a wavelength thick. To reach\nthis goal, we perforate a fraction of the initially closed pores using thin\nneedles. Finite element simulations of the fluid flow in a representative\nvolume element show how the combination of foam properties (cell size and wall\nthickness) and perforation pattern (hole diameter and perforation distance) can\nbe chosen such that sub-wavelength absorption is obtained. In particular two\ntransport parameters used in the approximate but robust Johnson-Champoux-Allard\nmodel for porous media have to be optimized: the flow resistivity and\nhigh-frequency tortuosity. The fluid flow modeling results are successfully\ncompared with sound absorption measurements, showing indeed that the proposed\nmaterial, once appropriately perforated, yields a remarkable low-frequency\nsound absorption peak. On a more fundamental level, this paper shows how the\nmultiporosity, the presence of microcracks, and the material's surface\nroughness can be exploited to enhance its acoustic absorption at very low\nfrequencies.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"6keFxALMWL8haP30oCgzLILsE6ihFs0BnABektFFsa8","pdfSize":"14762870"}
