{"id":"2408.10072","title":"FFAA: Multimodal Large Language Model based Explainable Open-World Face\n  Forgery Analysis Assistant","authors":"Zhengchao Huang, Bin Xia, Zicheng Lin, Zhun Mou, Wenming Yang","authorsParsed":[["Huang","Zhengchao",""],["Xia","Bin",""],["Lin","Zicheng",""],["Mou","Zhun",""],["Yang","Wenming",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:15:20 GMT"}],"updateDate":"2024-08-20","timestamp":1724080520000,"abstract":"  The rapid advancement of deepfake technologies has sparked widespread public\nconcern, particularly as face forgery poses a serious threat to public\ninformation security. However, the unknown and diverse forgery techniques,\nvaried facial features and complex environmental factors pose significant\nchallenges for face forgery analysis. Existing datasets lack descriptions of\nthese aspects, making it difficult for models to distinguish between real and\nforged faces using only visual information amid various confounding factors. In\naddition, existing methods do not yield user-friendly and explainable results,\ncomplicating the understanding of the model's decision-making process. To\naddress these challenges, we introduce a novel Open-World Face Forgery Analysis\nVQA (OW-FFA-VQA) task and the corresponding benchmark. To tackle this task, we\nfirst establish a dataset featuring a diverse collection of real and forged\nface images with essential descriptions and reliable forgery reasoning. Base on\nthis dataset, we introduce FFAA: Face Forgery Analysis Assistant, consisting of\na fine-tuned Multimodal Large Language Model (MLLM) and Multi-answer\nIntelligent Decision System (MIDS). By integrating hypothetical prompts with\nMIDS, the impact of fuzzy classification boundaries is effectively mitigated,\nenhancing the model's robustness. Extensive experiments demonstrate that our\nmethod not only provides user-friendly explainable results but also\nsignificantly boosts accuracy and robustness compared to previous methods.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}