{"id":"2408.06769","title":"Joint model for interval-censored semi-competing events and longitudinal\n  data with subject-specific within and between visits variabilities","authors":"L\\'eonie Courcoul, Catherine Helmer, Antoine Barbieri and H\\'el\\`ene\n  Jacqmin-Gadda","authorsParsed":[["Courcoul","Léonie",""],["Helmer","Catherine",""],["Barbieri","Antoine",""],["Jacqmin-Gadda","Hélène",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 09:49:51 GMT"}],"updateDate":"2024-08-14","timestamp":1723542591000,"abstract":"  Dementia currently affects about 50 million people worldwide, and this number\nis rising. Since there is still no cure, the primary focus remains on\npreventing modifiable risk factors such as cardiovascular factors. It is now\nrecognized that high blood pressure is a risk factor for dementia. An\nincreasing number of studies suggest that blood pressure variability may also\nbe a risk factor for dementia. However, these studies have significant\nmethodological weaknesses and fail to distinguish between long-term and\nshort-term variability. The aim of this work was to propose a new joint model\nthat combines a mixed-effects model, which handles the residual variance\ndistinguishing inter-visit variability from intra-visit variability, and an\nillness-death model that allows for interval censoring and semi-competing\nrisks. A subject-specific random effect is included in the model for both\nvariances. Risks can simultaneously depend on the current value and slope of\nthe marker, as well as on each of the two components of the residual variance.\nThe model estimation is performed by maximizing the likelihood function using\nthe Marquardt-Levenberg algorithm. A simulation study validates the estimation\nprocedure, which is implemented in an R package. The model was estimated using\ndata from the Three-City (3C) cohort to study the impact of intra- and\ninter-visits blood pressure variability on the risk of dementia and death.\n","subjects":["Statistics/Methodology","Statistics/Applications"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}