{"id":"2408.09290","title":"Optical Two-Tone Time Transfer","authors":"Jonathan D. Roslund, Abijith S. Kowligy, Junichiro Fujita, Micah P.\n  Ledbetter, Akash V. Rakholia, Martin M. Boyd, Jamil R. Abo-Shaeer, and Arman\n  Cing\\\"oz","authorsParsed":[["Roslund","Jonathan D.",""],["Kowligy","Abijith S.",""],["Fujita","Junichiro",""],["Ledbetter","Micah P.",""],["Rakholia","Akash V.",""],["Boyd","Martin M.",""],["Abo-Shaeer","Jamil R.",""],["Cingöz","Arman",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 20:34:34 GMT"}],"updateDate":"2024-08-20","timestamp":1723926874000,"abstract":"  Sub-picosecond timing synchronization can enable future optical timekeeping\nnetworks, including coherent phased array radar imaging at GHz levels,\nintercontinental clock comparisons for the redefinition of the second,\nchronometric leveling, and synchronization of remote assets, including future\nsatellite-based optical time standards. With optical clocks now operating on\nmobile platforms, free-space synchronization networks with compatible\nperformance and the ability to operate under platform motion are essential to\nexpand the reach of precision timing. Recently, femtosecond (fs)-level optical\ntime-transfer techniques have been developed that can operate over hundreds of\nkilometers despite atmospheric turbulence, signal fade, and dropouts. Here we\nreport a two-tone optical time transfer scheme with comparable performance that\nreduces hardware requirements and can support both fiber and free-space\nnetworks. Using this technique, sub-fs synchronization was demonstrated over a\n$\\sim$100 m free-space link for several hours. In addition, the link was used\nto syntonize two iodine optical clocks and then compare them over four days.\nThe set-up employs an integrated photonics transceiver and telecom-band lasers\nthat are compatible with full photonic integration.\n","subjects":["Physics/Optics","Physics/Atomic Physics","Physics/Instrumentation and Detectors"],"license":"http://creativecommons.org/licenses/by/4.0/"}