{"id":"2408.11604","title":"On the distribution of non-rigid families in the moduli spaces","authors":"Ke Chen, Tianzhi Hu, Ruiran Sun and Kang Zuo","authorsParsed":[["Chen","Ke",""],["Hu","Tianzhi",""],["Sun","Ruiran",""],["Zuo","Kang",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 13:23:05 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 00:29:14 GMT"}],"updateDate":"2024-09-04","timestamp":1724246585000,"abstract":"  Motivated by the Shafarevich conjecture, we introduce the notions of very\ngeneral rigidity and generic rigidity to characterize the distribution of\nnon-rigid families in the corresponding moduli space. Our main results focus on\nmoduli spaces of polarized manifolds where the infinitesimal Torelli theorem\nholds. We show that if the derived Mumford-Tate group of the associated\npolarized $\\mathbb{Z}$-variation of Hodge structures is absolutely simple, then\nthe moduli space $\\mathcal{M}$ has the very general rigidity property, meaning\nall non-rigid families are contained within a countable union of closed strict\nirreducible subschemes of $\\mathcal{M}$. If, in addition, the associated\nMumford-Tate domain is not a bounded symmetric domain of rank greater than one,\nthen the moduli space exhibits a stronger rigidity property, generic rigidity,\nwhere the countable union in the definition of very general rigidity is\nreplaced by a finite union. As a corollary of the generic rigidity, we\nestablish a geometric version of the Bombieri-Lang-type finiteness result. Many\nexamples of moduli spaces, such as those of projective hypersurfaces of certain\ndegrees, satisfy the conditions of our main theorems. We also explore the\nrelationship between the bases of maximally non-rigid families and special\nsubvarieties in the moduli spaces of Calabi-Yau manifolds, inspired by a\ndetailed analysis of Viehweg-Zuo's example of maximally non-rigid families of\nCalabi-Yau quintics in $\\mathbb{P}^4$.\n","subjects":["Mathematics/Algebraic Geometry"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}