{"id":"2408.09849","title":"Importance Weighting Can Help Large Language Models Self-Improve","authors":"Chunyang Jiang, Chi-min Chan, Wei Xue, Qifeng Liu, Yike Guo","authorsParsed":[["Jiang","Chunyang",""],["Chan","Chi-min",""],["Xue","Wei",""],["Liu","Qifeng",""],["Guo","Yike",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:51:02 GMT"}],"updateDate":"2024-08-20","timestamp":1724061062000,"abstract":"  Large language models (LLMs) have shown remarkable capability in numerous\ntasks and applications. However, fine-tuning LLMs using high-quality datasets\nunder external supervision remains prohibitively expensive. In response, LLM\nself-improvement approaches have been vibrantly developed recently. The typical\nparadigm of LLM self-improvement involves training LLM on self-generated data,\npart of which may be detrimental and should be filtered out due to the unstable\ndata quality. While current works primarily employs filtering strategies based\non answer correctness, in this paper, we demonstrate that filtering out correct\nbut with high distribution shift extent (DSE) samples could also benefit the\nresults of self-improvement. Given that the actual sample distribution is\nusually inaccessible, we propose a new metric called DS weight to approximate\nDSE, inspired by the Importance Weighting methods. Consequently, we integrate\nDS weight with self-consistency to comprehensively filter the self-generated\nsamples and fine-tune the language model. Experiments show that with only a\ntiny valid set (up to 5\\% size of the training set) to compute DS weight, our\napproach can notably promote the reasoning ability of current LLM\nself-improvement methods. The resulting performance is on par with methods that\nrely on external supervision from pre-trained reward models.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}