{"id":"2408.09645","title":"[O II] as an Effective Indicator of the Dependence Between the\n  Standardised Luminosities of Type Ia Supernovae and the Properties of their\n  Host Galaxies","authors":"B. Martin, C. Lidman, D. Brout, B. E. Tucker, M. Dixon, P. Armstrong","authorsParsed":[["Martin","B.",""],["Lidman","C.",""],["Brout","D.",""],["Tucker","B. E.",""],["Dixon","M.",""],["Armstrong","P.",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:07:51 GMT"}],"updateDate":"2024-09-06","timestamp":1724033271000,"abstract":"  We have obtained IFU spectra of 75 SN Ia host galaxies from the Foundation\nSupernova survey to search for correlations between the properties of\nindividual galaxies and SN Hubble residuals. After standard corrections for\nlight-curve width and SN colour have been applied, we find correlations between\nHubble residuals and the equivalent width of the [O II] $\\lambda\\lambda$ 3727,\n3729 doublet (2.3$\\sigma$), an indicator of the specific star formation rate\n(sSFR). When splitting our sample by SN colour, we find no colour dependence\nimpacting the correlation between EW[O II] and Hubble residual. However, when\nsplitting by colour, we reveal a correlation between the Hubble residuals of\nblue SNe Ia and the Balmer decrement (2.2$\\sigma$), an indicator of dust\nattenuation. These correlations remain after applying a mass-step correction,\nsuggesting that the mass-step correction does not fully account for the\nlimitations of the colour correction used to standardise SNe Ia. Rather than a\nmass correction, we apply a correction to SNe from star forming galaxies based\non their measurable EW[O II]. We find that this correction also removes the\nhost galaxy mass step, while also greatly reducing the significance of the\ncorrelation with the Balmer decrement for blue SNe Ia. We find that correcting\nfor EW[O II], in addition to or in place of the mass-step, may further reduce\nthe scatter in the Hubble diagram.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}