{"id":"2408.09410","title":"BernGraph: Probabilistic Graph Neural Networks for EHR-based Medication\n  Recommendations","authors":"Xihao Piao, Pei Gao, Zheng Chen, Lingwei Zhu, Yasuko Matsubara,\n  Yasushi Sakurai, Jimeng Sun","authorsParsed":[["Piao","Xihao",""],["Gao","Pei",""],["Chen","Zheng",""],["Zhu","Lingwei",""],["Matsubara","Yasuko",""],["Sakurai","Yasushi",""],["Sun","Jimeng",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 08:52:27 GMT"},{"version":"v2","created":"Sun, 8 Sep 2024 09:08:57 GMT"},{"version":"v3","created":"Wed, 11 Sep 2024 02:12:44 GMT"}],"updateDate":"2024-09-12","timestamp":1723971147000,"abstract":"  The medical community believes binary medical event outcomes in EHR data\ncontain sufficient information for making a sensible recommendation. However,\nthere are two challenges to effectively utilizing such data: (1) modeling the\nrelationship between massive 0,1 event outcomes is difficult, even with expert\nknowledge; (2) in practice, learning can be stalled by the binary values since\nthe equally important 0 entries propagate no learning signals. Currently, there\nis a large gap between the assumed sufficient information and the reality that\nno promising results have been shown by utilizing solely the binary data:\nvisiting or secondary information is often necessary to reach acceptable\nperformance. In this paper, we attempt to build the first successful binary EHR\ndata-oriented drug recommendation system by tackling the two difficulties,\nmaking sensible drug recommendations solely using the binary EHR medical\nrecords. To this end, we take a statistical perspective to view the EHR data as\na sample from its cohorts and transform them into continuous Bernoulli\nprobabilities. The transformed entries not only model a deterministic binary\nevent with a distribution but also allow reflecting \\emph{event-event}\nrelationship by conditional probability. A graph neural network is learned on\ntop of the transformation. It captures event-event correlations while\nemphasizing \\emph{event-to-patient} features. Extensive results demonstrate\nthat the proposed method achieves state-of-the-art performance on large-scale\ndatabases, outperforming baseline methods that use secondary information by a\nlarge margin. The source code is available at\n\\url{https://github.com/chenzRG/BEHRMecom}\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}