{"id":"2408.09318","title":"Practical security of twin-field quantum key distribution under\n  wavelength-switching attack","authors":"Qingquan Peng, Jiu-Peng Chen, Tianyi Xing, Dongyang Wang, Yizhi Wang,\n  Yang Liu and Anqi Huang","authorsParsed":[["Peng","Qingquan",""],["Chen","Jiu-Peng",""],["Xing","Tianyi",""],["Wang","Dongyang",""],["Wang","Yizhi",""],["Liu","Yang",""],["Huang","Anqi",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 00:38:13 GMT"}],"updateDate":"2024-08-20","timestamp":1723941493000,"abstract":"  The twin-field class quantum key distribution (TF-class QKD) has\nexperimentally demonstrated the ability to surpass the fundamental\nrate-distance limit without requiring a quantum repeater, as a revolutional\nmilestone. In TF-class QKD implementation, an optical phase-locked loop (OPLL)\nstructure is commonly employed to generate a reference light with correlated\nphase, ensuring coherence of optical fields between Alice and Bob. In this\nconfiguration, the reference light, typically located in the untrusted station\nCharlie, solely provides wavelength reference for OPLL and does not participate\nin quantum-state encoding. However, the reference light may open a door for Eve\nto enter the source stations that are supposed to be well protected. Here, by\nidentifying vulnerabilities in the OPLL scheme, we propose and demonstrate a\nwavelength-switching attack on a TF-class QKD system. This attack involves Eve\ndeliberately manipulating the wavelength of the reference light to increase\nmean photon number of prepared quantum states, while maintaining stable\ninterference between Alice and Bob as required by TF-class QKD protocols. The\nmaximum observed increase in mean photon number is 8.7%, which has been\ntheoretically proven to compromise the security of a TF-class QKD system.\nMoreover, we have shown that with well calibration of the modulators, the\nattack can be eliminated. Through this study, we highlight the importance of\nsystem calibration in the practical security in TF-class QKD implementation.\n","subjects":["Physics/Quantum Physics","Physics/Optics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}