{"id":"2408.03638","title":"Superdiffusion of energetic particles at shocks: A L\\'evy Flight model\n  for acceleration","authors":"Sophie Aerdker, Lukas Merten, Frederic Effenberger, Horst Fichtner,\n  Julia Becker Tjus","authorsParsed":[["Aerdker","Sophie",""],["Merten","Lukas",""],["Effenberger","Frederic",""],["Fichtner","Horst",""],["Tjus","Julia Becker",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 08:54:13 GMT"}],"updateDate":"2024-08-08","timestamp":1723020853000,"abstract":"  In the Heliosphere, power-law particle distributions are observed e.g.\nupstream of interplanetary shocks, which can result from superdiffusive\ntransport. This non-Gaussian transport regime may result from intermittent\nmagnetic field structures. Recently, we showed that a L\\'evy flight model\nreproduces the observed features at shocks: power-law distributions upstream\nand enhanced intensities at the shock. We extend the L\\'evy flight model to\nstudy the impact of superdiffusive transport on particle acceleration at\nshocks. The acceleration time scale and spectral slope are compared to Gaussian\ndiffusion and a L\\'evy walk model. The fractional transport equation is solved\nby sampling the number density with the corresponding stochastic differential\nequation that is driven by an alpha-stable L\\'evy distribution. For both\nGaussian and superdiffusive transport we use a modified version of CRPropa 3.2.\nWe obtain the number density and energy spectra for constant and\nenergy-dependent anomalous diffusion and find, compared to the case of Gaussian\ndiffusion, harder energy spectra at the shock as well as faster acceleration.\nThe spectral slope is even harder than predicted for L\\'evy walks. L\\'evy\nflight models of superdiffusive transport lead to observed features in the\nHeliosphere. We further show that superdiffusive transport impacts the\nacceleration process by changing the probability to escape the shock. The\nflexibility of the L\\'evy flight model allows for further studies in the\nfuture, taking the shock geometry and magnetic field structure into account.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/"}