{"id":"2408.09674","title":"Implicit Grid Convolution for Multi-Scale Image Super-Resolution","authors":"Dongheon Lee, Seokju Yun, Youngmin Ro","authorsParsed":[["Lee","Dongheon",""],["Yun","Seokju",""],["Ro","Youngmin",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 03:30:15 GMT"}],"updateDate":"2024-08-20","timestamp":1724038215000,"abstract":"  Recently, Super-Resolution (SR) achieved significant performance improvement\nby employing neural networks. Most SR methods conventionally train a single\nmodel for each targeted scale, which increases redundancy in training and\ndeployment in proportion to the number of scales targeted. This paper\nchallenges this conventional fixed-scale approach. Our preliminary analysis\nreveals that, surprisingly, encoders trained at different scales extract\nsimilar features from images. Furthermore, the commonly used scale-specific\nupsampler, Sub-Pixel Convolution (SPConv), exhibits significant inter-scale\ncorrelations. Based on these observations, we propose a framework for training\nmultiple integer scales simultaneously with a single model. We use a single\nencoder to extract features and introduce a novel upsampler, Implicit Grid\nConvolution~(IGConv), which integrates SPConv at all scales within a single\nmodule to predict multiple scales. Our extensive experiments demonstrate that\ntraining multiple scales with a single model reduces the training budget and\nstored parameters by one-third while achieving equivalent inference latency and\ncomparable performance. Furthermore, we propose IGConv$^{+}$, which addresses\nspectral bias and input-independent upsampling and uses ensemble prediction to\nimprove performance. As a result, SRFormer-IGConv$^{+}$ achieves a remarkable\n0.25dB improvement in PSNR at Urban100$\\times$4 while reducing the training\nbudget, stored parameters, and inference cost compared to the existing\nSRFormer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"28wj6zXumIxlsxnKSFhpZmxoBt9p6tkgtfWkryPHPV0","pdfSize":"6783873"}
