{"id":"2408.00695","title":"Accelerating Full Waveform Inversion By Transfer Learning","authors":"Divya Shyam Singh, Leon Herrmann, Qing Sun, Tim B\\\"urchner, Felix\n  Dietrich, Stefan Kollmannsberger","authorsParsed":[["Singh","Divya Shyam",""],["Herrmann","Leon",""],["Sun","Qing",""],["Bürchner","Tim",""],["Dietrich","Felix",""],["Kollmannsberger","Stefan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 16:39:06 GMT"}],"updateDate":"2024-08-02","timestamp":1722530346000,"abstract":"  Full waveform inversion (FWI) is a powerful tool for reconstructing material\nfields based on sparsely measured data obtained by wave propagation. For\nspecific problems, discretizing the material field with a neural network (NN)\nimproves the robustness and reconstruction quality of the corresponding\noptimization problem. We call this method NN-based FWI. Starting from an\ninitial guess, the weights of the NN are iteratively updated to fit the\nsimulated wave signals to the sparsely measured data set. For gradient-based\noptimization, a suitable choice of the initial guess, i.e., a suitable NN\nweight initialization, is crucial for fast and robust convergence.\n  In this paper, we introduce a novel transfer learning approach to further\nimprove NN-based FWI. This approach leverages supervised pretraining to provide\na better NN weight initialization, leading to faster convergence of the\nsubsequent optimization problem. Moreover, the inversions yield physically more\nmeaningful local minima. The network is pretrained to predict the unknown\nmaterial field using the gradient information from the first iteration of\nconventional FWI. In our computational experiments on two-dimensional domains,\nthe training data set consists of reference simulations with arbitrarily\npositioned elliptical voids of different shapes and orientations. We compare\nthe performance of the proposed transfer learning NN-based FWI with three other\nmethods: conventional FWI, NN-based FWI without pretraining and conventional\nFWI with an initial guess predicted from the pretrained NN. Our results show\nthat transfer learning NN-based FWI outperforms the other methods in terms of\nconvergence speed and reconstruction quality.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"tQLIPI95Dt8SJQNd-dv3nmSXYF3fzoeq5BJDVBQFlk0","pdfSize":"6864871","txDigest":"D9h3pARqPbVd3UftkKmwq9MRtAa1D2csEJrCDhHS7eK","endEpoch":"1","status":"CERTIFIED"}
