{"id":"2408.08668","title":"Robust Stochastic Shortest-Path Planning via Risk-Sensitive Incremental\n  Sampling","authors":"Clinton Enwerem, Erfaun Noorani, John S. Baras, and Brian M. Sadler","authorsParsed":[["Enwerem","Clinton",""],["Noorani","Erfaun",""],["Baras","John S.",""],["Sadler","Brian M.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 11:21:52 GMT"}],"updateDate":"2024-08-19","timestamp":1723807312000,"abstract":"  With the pervasiveness of Stochastic Shortest-Path (SSP) problems in\nhigh-risk industries, such as last-mile autonomous delivery and supply chain\nmanagement, robust planning algorithms are crucial for ensuring successful task\ncompletion while mitigating hazardous outcomes. Mainstream chance-constrained\nincremental sampling techniques for solving SSP problems tend to be overly\nconservative and typically do not consider the likelihood of undesirable tail\nevents. We propose an alternative risk-aware approach inspired by the\nasymptotically-optimal Rapidly-Exploring Random Trees (RRT*) planning\nalgorithm, which selects nodes along path segments with minimal Conditional\nValue-at-Risk (CVaR). Our motivation rests on the step-wise coherence of the\nCVaR risk measure and the optimal substructure of the SSP problem. Thus,\noptimizing with respect to the CVaR at each sampling iteration necessarily\nleads to an optimal path in the limit of the sample size. We validate our\napproach via numerical path planning experiments in a two-dimensional grid\nworld with obstacles and stochastic path-segment lengths. Our simulation\nresults show that incorporating risk into the tree growth process yields paths\nwith lengths that are significantly less sensitive to variations in the noise\nparameter, or equivalently, paths that are more robust to environmental\nuncertainty. Algorithmic analyses reveal similar query time and memory space\ncomplexity to the baseline RRT* procedure, with only a marginal increase in\nprocessing time. This increase is offset by significantly lower noise\nsensitivity and reduced planner failure rates.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Robotics","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/"}