{"id":"2408.08346","title":"SCUBADive I: JWST+ALMA Analysis of 289 sub-millimeter galaxies in\n  COSMOS-Web","authors":"Jed McKinney, Caitlin M. Casey, Arianna S. Long, Olivia R. Cooper,\n  Sinclaire M. Manning, Maximilien Franco, Hollis Akin, Erini Lambrides, Elaine\n  Gammon, Camila Silva, Fabrizio Gentile, Jorge A. Zavala, Aristeidis\n  Amvrosiadis, Irma Andika, Malte Brinch, Jaclyn B. Champagne, Nima Chartab,\n  Nicole E. Drakos, Andreas L. Faisst, Seiji Fujimoto, Steven Gillman, Ghassem\n  Gozaliasl, Thomas R. Greve, Santosh Harish, Christopher C. Hayward, Michaela\n  Hirschmann, Olivier Ilbert, Boris S. Kalita, Jeyhan S. Kartaltepe, Anton M.\n  Koekemoer, Vasily Kokorev, Daizhong Liu, Georgios Magdis, Henry Joy\n  McCracken, Jason Rhodes, Brant E. Robertson, Margherita Talia, Francesco\n  Valentino, Aswin P. Vijayan","authorsParsed":[["McKinney","Jed",""],["Casey","Caitlin M.",""],["Long","Arianna S.",""],["Cooper","Olivia R.",""],["Manning","Sinclaire M.",""],["Franco","Maximilien",""],["Akin","Hollis",""],["Lambrides","Erini",""],["Gammon","Elaine",""],["Silva","Camila",""],["Gentile","Fabrizio",""],["Zavala","Jorge A.",""],["Amvrosiadis","Aristeidis",""],["Andika","Irma",""],["Brinch","Malte",""],["Champagne","Jaclyn B.",""],["Chartab","Nima",""],["Drakos","Nicole E.",""],["Faisst","Andreas L.",""],["Fujimoto","Seiji",""],["Gillman","Steven",""],["Gozaliasl","Ghassem",""],["Greve","Thomas R.",""],["Harish","Santosh",""],["Hayward","Christopher C.",""],["Hirschmann","Michaela",""],["Ilbert","Olivier",""],["Kalita","Boris S.",""],["Kartaltepe","Jeyhan S.",""],["Koekemoer","Anton M.",""],["Kokorev","Vasily",""],["Liu","Daizhong",""],["Magdis","Georgios",""],["McCracken","Henry Joy",""],["Rhodes","Jason",""],["Robertson","Brant E.",""],["Talia","Margherita",""],["Valentino","Francesco",""],["Vijayan","Aswin P.",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-19","timestamp":1723744800000,"abstract":"  JWST has enabled detecting and spatially resolving the heavily\ndust-attenuated stellar populations of sub-millimeter galaxies, revealing\ndetail that was previously inaccessible. In this work we construct a sample of\n289 sub-millimeter galaxies with detailed joint ALMA and JWST constraints in\nthe COSMOS field. Sources are originally selected using the SCUBA-2 instrument\nand have archival ALMA observations from various programs. Their JWST NIRCam\nimaging is from COSMOS-Web and PRIMER. We extract multi-wavelength photometry\nin a manner that leverages the unprecedented near-infrared spatial resolution\nof JWST, and fit the data with spectral energy distribution models to derive\nphotometric redshifts, stellar masses, star-formation rates and optical\nattenuation. The sample has an average z=2.6, A_V=2.5, SFR=270 and\nlog(M*)=11.1. There are 81 (30%) galaxies that have no previous\noptical/near-infrared detections, including 75% of the z>4 sub-sample (n=28).\nThe faintest observed near-infrared sources have the highest redshifts and\nlargest A_V=4. In a preliminary morphology analysis we find that ~10% of our\nsample exhibit spiral arms and 5% host stellar bars, with one candidate bar\nfound at z>3. Finally, we find that the clustering of JWST galaxies within 10\narcseconds of a sub-mm galaxy is a factor of 2 greater than what is expected\nbased on either random clustering or the distribution of sources around any red\ngalaxy irrespective of a sub-mm detection.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}