{"id":"2408.02446","title":"Second 6G life Workshop on Post Shannon Theory","authors":"Yaning Zhao and Christian Deppe","authorsParsed":[["Zhao","Yaning",""],["Deppe","Christian",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:13:17 GMT"}],"updateDate":"2024-08-06","timestamp":1722863597000,"abstract":"  The one-day workshop, held prior to the \"ZIF Workshop on Information Theory\nand Related Fields\", provided an excellent opportunity for in-depth discussions\non several topics within the field of post-Shannon theory. The agenda covered\ndeterministic and randomized identification, focusing on various methods and\nalgorithms for identifying data or signals deterministically and through\nrandomized processes. It explored the theoretical foundations and practical\napplications of these techniques. The session on resources for increasing\nidentification capacity examined the different resources and strategies that\ncan be utilized to boost the capacity for identifying information. This\nincluded discussions on both hardware and software solutions, as well as\ninnovative approaches to resource allocation and optimization. Participants\ndelved into common randomness generation, essential for various cryptographic\nprotocols and communication systems. The session highlighted recent\nadvancements and practical implementations of common randomness in secure\ncommunications. The workshop concluded with a detailed look at the development\nand practical deployment of identification codes. Experts shared insights on\ncode construction techniques, implementation challenges, and real-world\napplications in various communication systems. We extend our thanks to the\nesteemed speakers for their valuable contributions: Caspar von Lengerke, Wafa\nLabidi, Ilya Vorobyev, Johannes Rosenberger, Jonathan Huffmann, and Pau\nColomer. Their presentations and insights significantly enriched the workshop.\nAdditionally, we are grateful to all the participants whose active engagement,\nconstructive comments, and stimulating discussions made the event a success.\nYour involvement was crucial in fostering a collaborative and intellectually\nvibrant environment.\n","subjects":["Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}