{"id":"2408.02619","title":"Mastering Agile Jumping Skills from Simple Practices with Iterative\n  Learning Control","authors":"Chuong Nguyen, Lingfan Bao, Quan Nguyen","authorsParsed":[["Nguyen","Chuong",""],["Bao","Lingfan",""],["Nguyen","Quan",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 16:43:11 GMT"}],"updateDate":"2024-08-06","timestamp":1722876191000,"abstract":"  Achieving precise target jumping with legged robots poses a significant\nchallenge due to the long flight phase and the uncertainties inherent in\ncontact dynamics and hardware. Forcefully attempting these agile motions on\nhardware could result in severe failures and potential damage. Motivated by\nthese challenging problems, we propose an Iterative Learning Control (ILC)\napproach that aims to learn and refine jumping skills from easy to difficult,\ninstead of directly learning these challenging tasks. We verify that learning\nfrom simplicity can enhance safety and target jumping accuracy over trials.\nCompared to other ILC approaches for legged locomotion, our method can tackle\nthe problem of a long flight phase where control input is not available. In\naddition, our approach allows the robot to apply what it learns from a simple\njumping task to accomplish more challenging tasks within a few trials directly\nin hardware, instead of learning from scratch. We validate the method via\nextensive experiments in the A1 model and hardware for various jumping tasks.\nStarting from a small jump (e.g., a forward leap of 40cm), our learning\napproach empowers the robot to accomplish a variety of challenging targets,\nincluding jumping onto a 20cm high box, jumping to a greater distance of up to\n60cm, as well as performing jumps while carrying an unknown payload of 2kg. Our\nframework can allow the robot to reach the desired position and orientation\ntargets with approximate errors of 1cm and 1 degree within a few trials.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}