{"id":"2408.09509","title":"High-Capacity Metasurface at Limits of Polarization and Wavelength\n  Multiplexing","authors":"Yanjun Bao, Hongsheng Shi, Rui Wei, Boyou Wang, Zhou Zhou, Cheng-Wei\n  Qiu and Baojun Li","authorsParsed":[["Bao","Yanjun",""],["Shi","Hongsheng",""],["Wei","Rui",""],["Wang","Boyou",""],["Zhou","Zhou",""],["Qiu","Cheng-Wei",""],["Li","Baojun",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 15:18:00 GMT"}],"updateDate":"2024-08-20","timestamp":1723994280000,"abstract":"  Polarization and wavelength multiplexing are the two most widely employed\ntechniques to improve the capacity in the metasurfaces. Existing works have\npushed each technique to its individual limits. For example, the polarization\nmultiplexing channels working at a single wavelength have been significantly\nincreased by using noise engineering. However, it is still challenging to\nachieve the multiplexing limits of wavelength and polarization simultaneously.\nBesides, such multiplexing methods suffer from computational inefficiencies,\nhindering their application in tasks like image recognition that require\nextensive training computation. In this work, we introduce a gradient-based\noptimization algorithm using deep neural network (DNN) to achieve the limits of\nboth polarization and wavelength multiplexing with high computational\nefficiency. We experimentally demonstrate this capability, achieving a\nrecord-breaking capacity of 15 holographic images across five wavelengths and\nthe maximum of three independent polarization channels, as well as 18\nholographic images across three wavelengths and six corelated polarization\nchannels. Moreover, leveraging the high computational efficiency of our\nDNN-based method, which is well-suited for processing large datasets, we\nimplement large-scale image recognition tasks across 36 classes encoded in a\nrecord of nine multiplexed channels (three wavelengths * three polarizations),\nachieving 96% classification accuracy in calculations and 91.5% in experiments.\nThis work sets a new benchmark for high-capacity multiplexing with metasurfaces\nand demonstrates the power of gradient-based inverse design for realizing\nmulti-functional optical elements.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}