{"id":"2408.01681","title":"Detecting ionized bubbles around luminous sources during the\n  reionization era using HI 21-cm signal","authors":"Arnab Mishra, Chandra Shekhar Murmu, Kanan K. Datta, Samir Choudhuri,\n  Suman Majumdar, Iffat Nasreen, Sk. Saiyad Ali","authorsParsed":[["Mishra","Arnab",""],["Murmu","Chandra Shekhar",""],["Datta","Kanan K.",""],["Choudhuri","Samir",""],["Majumdar","Suman",""],["Nasreen","Iffat",""],["Ali","Sk. Saiyad",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 06:38:21 GMT"}],"updateDate":"2024-08-06","timestamp":1722667101000,"abstract":"  Measuring the properties of the intergalactic medium (IGM) and sources during\nthe Epoch of Reionization (EoR) is of immense importance. We explore the\nprospects of probing the IGM and sources through redshifted 21-cm observations\nof individual ionized bubbles surrounding known luminous sources during the\nEoR. Accordingly, we simulate HI 21-cm maps, foreground contaminants and system\nnoise which are specific to the uGMRT and SKA1-Low observations. Following the\nsubtraction of the foreground from the total visibility, we employ a\nvisibility-based matched filter technique to optimally combine the desired HI\n21-cm signal while minimizing the system noise. Our analysis suggests that\nthese ionized bubbles can be detected with more than $5 \\sigma$ significance\nusing approximately $\\sim 2000$ and $\\sim 3000$ hours of observation time with\nthe uGMRT at redshift $7.1$ and $8.3$ respectively. The SKA1-Low should be able\nto detect these with more than $8 \\sigma$ significance using just $\\sim 100$\nhrs of observations. Further, we investigate the impact of the foreground\nsubtraction on the detectability and find the signal-to-noise ratio decreases\nwhen smaller bandwidth is used. More importantly, we show that the matched\nfiltering method can measure ionized bubble radius and constrain HI-neutral\nfraction reasonably well, helping deeper insights into source properties and\nthe intergalactic medium.\n","subjects":["Astrophysics/Cosmology and Nongalactic Astrophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}