{"id":"2408.02182","title":"In-depth Understanding of the Band Alignment and Interface States\n  Scenario in Bi$_2$O$_2$Se/SrTiO$_3$ Ultrathin Heterojunction","authors":"Ke Zhang, Yusen Feng, Lei Hao, Jing Mi, Miao Du, Minghui Xu, Yan Zhao,\n  Jianping Meng and Liang Qiao","authorsParsed":[["Zhang","Ke",""],["Feng","Yusen",""],["Hao","Lei",""],["Mi","Jing",""],["Du","Miao",""],["Xu","Minghui",""],["Zhao","Yan",""],["Meng","Jianping",""],["Qiao","Liang",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 02:01:11 GMT"}],"updateDate":"2024-08-07","timestamp":1722823271000,"abstract":"  Bismuth oxyselenide (Bi$_2$O$_2$Se), a novel quasi-2D charge-carrying\nsemiconductor, is hailed as one of the best emerging platforms for the next\ngeneration semiconductor devices. Recent efforts on developing diverse\nBi$_2$O$_2$Se heterojunctions have produced extensive potential applications in\nelectronics and optoelectronics. In-depth understanding of the band alignment\nand especially interface dynamics is, however, still challenging. In this work,\na comprehensive experimental investigation on the band alignment is performed\nby a high-resolution X-ray photoelectron spectrometer (HRXPS), and the\nproperties of interface states are also fully discussed. The results show that\nthe ultrathin film Bi$_2$O$_2$Se grown on SrTiO$_3$ (TiO$_2$ (001) termination)\nexhibits Type-I (straddling gap) band alignment with a valence band offset\n(VBO) of about 1.77\\pm0.04 eV and conduction band offset (CBO) of about\n0.68\\pm0.04 eV. However, further considering the contribution of the interface\nstates, the bands on the interface present a herringbone configuration due to\nsizable build-in electric fields, which is significantly different from the\nconventional band alignment. In this sense, our results provide an insightful\nguidance to the development of high-efficiency electronic and optoelectronic\ndevices, specifically of the devices where the charge transfer is highly\nsensitive to interface states.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cFfuOrrG1EiHrlEqjL0T13mSgupsOd8c3DKA2mMPa8s","pdfSize":"1082081"}
