{"id":"2408.03455","title":"Bayesian learning with Gaussian processes for low-dimensional\n  representations of time-dependent nonlinear systems","authors":"Shane A. McQuarrie, Anirban Chaudhuri, Karen E. Willcox, and Mengwu\n  Guo","authorsParsed":[["McQuarrie","Shane A.",""],["Chaudhuri","Anirban",""],["Willcox","Karen E.",""],["Guo","Mengwu",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 21:25:42 GMT"}],"updateDate":"2024-08-08","timestamp":1722979542000,"abstract":"  This work presents a data-driven method for learning low-dimensional\ntime-dependent physics-based surrogate models whose predictions are endowed\nwith uncertainty estimates. We use the operator inference approach to model\nreduction that poses the problem of learning low-dimensional model terms as a\nregression of state space data and corresponding time derivatives by minimizing\nthe residual of reduced system equations. Standard operator inference models\nperform well with accurate training data that are dense in time, but producing\nstable and accurate models when the state data are noisy and/or sparse in time\nremains a challenge. Another challenge is the lack of uncertainty estimation\nfor the predictions from the operator inference models. Our approach addresses\nthese challenges by incorporating Gaussian process surrogates into the operator\ninference framework to (1) probabilistically describe uncertainties in the\nstate predictions and (2) procure analytical time derivative estimates with\nquantified uncertainties. The formulation leads to a generalized least-squares\nregression and, ultimately, reduced-order models that are described\nprobabilistically with a closed-form expression for the posterior distribution\nof the operators. The resulting probabilistic surrogate model propagates\nuncertainties from the observed state data to reduced-order predictions. We\ndemonstrate the method is effective for constructing low-dimensional models of\ntwo nonlinear partial differential equations representing a compressible flow\nand a nonlinear diffusion-reaction process, as well as for estimating the\nparameters of a low-dimensional system of nonlinear ordinary differential\nequations representing compartmental models in epidemiology.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/"}