{"id":"2408.03589","title":"Deep-learning-based electrode action potential mapping (DEAP Mapping)\n  from annotation-free unipolar electrogram","authors":"Hiroshi Seno, Toshiya Kojima, Masatoshi Yamazaki, Ichiro Sakuma,\n  Katsuhito Fujiu, and Naoki Tomii","authorsParsed":[["Seno","Hiroshi",""],["Kojima","Toshiya",""],["Yamazaki","Masatoshi",""],["Sakuma","Ichiro",""],["Fujiu","Katsuhito",""],["Tomii","Naoki",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 07:05:32 GMT"}],"updateDate":"2024-08-08","timestamp":1723014332000,"abstract":"  Catheter ablation has limited therapeutic efficacy against non-paroxysmal\natrial fibrillation (AF), and electrophysiological studies using mapping\ncatheters have been applied to evaluate the AF substrate. However, many of\nthese approaches rely on detecting excitation timing from electrograms (ECGs),\npotentially compromising their effectiveness in complex AF scenarios. Herein,\nwe introduce Deep-learning-based Electrode Action Potential Mapping (DEAP\nMapping), a deep learning model designed to reconstruct membrane potential\nimages from annotation-free unipolar ECG signals. We conducted ex vivo\nexperiments using porcine hearts (N = 6) to evaluate the accuracy of DEAP\nMapping by simultaneously performing fluorescence measurement of membrane\npotentials and measurements of epicardial unipolar ECGs. Membrane potentials\nestimated via DEAP Mapping were compared with those measured via optical\nmapping. We assessed the clinical applicability of DEAP Mapping by comparing\nthe DEAP Mapping's estimations from clinically measured catheter electrode\nsignals with those from established electrode-mapping techniques. DEAP Mapping\naccurately estimated conduction delays and blocks in ex vivo experiments. Phase\nvariance analysis, an AF substrate evaluation method, revealed that the\nsubstrate identified from optical mapping closely resembled that identified\nfrom DEAP Mapping estimations (structural similarity index of >0.8). In\nclinical evaluations, DEAP Mapping estimation observed several conduction\ndelays and blocks that were not observed with existing methods, indicating that\nDEAP Mapping can estimate excitation patterns with higher spatiotemporal\nresolution. DEAP Mapping has a potential to derive detailed changes in membrane\npotential from intra-operative catheter electrode signals, offering enhanced\nvisualisation of the AF substrate from the estimated membrane potentials.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Electrical Engineering and Systems Science/Image and Video Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}