{"id":"2408.09315","title":"Unpaired Volumetric Harmonization of Brain MRI with Conditional Latent\n  Diffusion","authors":"Mengqi Wu, Minhui Yu, Shuaiming Jing, Pew-Thian Yap, Zhengwu Zhang,\n  Mingxia Liu","authorsParsed":[["Wu","Mengqi",""],["Yu","Minhui",""],["Jing","Shuaiming",""],["Yap","Pew-Thian",""],["Zhang","Zhengwu",""],["Liu","Mingxia",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 00:13:48 GMT"}],"updateDate":"2024-08-20","timestamp":1723940028000,"abstract":"  Multi-site structural MRI is increasingly used in neuroimaging studies to\ndiversify subject cohorts. However, combining MR images acquired from various\nsites/centers may introduce site-related non-biological variations.\nRetrospective image harmonization helps address this issue, but current methods\nusually perform harmonization on pre-extracted hand-crafted radiomic features,\nlimiting downstream applicability. Several image-level approaches focus on 2D\nslices, disregarding inherent volumetric information, leading to suboptimal\noutcomes. To this end, we propose a novel 3D MRI Harmonization framework\nthrough Conditional Latent Diffusion (HCLD) by explicitly considering image\nstyle and brain anatomy. It comprises a generalizable 3D autoencoder that\nencodes and decodes MRIs through a 4D latent space, and a conditional latent\ndiffusion model that learns the latent distribution and generates harmonized\nMRIs with anatomical information from source MRIs while conditioned on target\nimage style. This enables efficient volume-level MRI harmonization through\nlatent style translation, without requiring paired images from target and\nsource domains during training. The HCLD is trained and evaluated on 4,158\nT1-weighted brain MRIs from three datasets in three tasks, assessing its\nability to remove site-related variations while retaining essential biological\nfeatures. Qualitative and quantitative experiments suggest the effectiveness of\nHCLD over several state-of-the-arts\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}