{"id":"2408.00392","title":"Polynomial quasi-Trefftz DG for PDEs with smooth coefficients: elliptic\n  problems","authors":"Lise-Marie Imbert-G\\'erard, Andrea Moiola, Chiara Perinati, Paul\n  Stocker","authorsParsed":[["Imbert-Gérard","Lise-Marie",""],["Moiola","Andrea",""],["Perinati","Chiara",""],["Stocker","Paul",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:01:33 GMT"}],"updateDate":"2024-08-02","timestamp":1722502893000,"abstract":"  Trefftz schemes are high-order Galerkin methods whose discrete spaces are\nmade of elementwise exact solutions of the underlying PDE. Trefftz basis\nfunctions can be easily computed for many PDEs that are linear, homogeneous,\nand have piecewise-constant coefficients. However, if the equation has variable\ncoefficients, exact solutions are generally unavailable. Quasi-Trefftz methods\novercome this limitation relying on elementwise \"approximate solutions\" of the\nPDE, in the sense of Taylor polynomials.\n  We define polynomial quasi-Trefftz spaces for general linear PDEs with smooth\ncoefficients and source term, describe their approximation properties and,\nunder a non-degeneracy condition, provide a simple algorithm to compute a\nbasis. We then focus on a quasi-Trefftz DG method for variable-coefficient\nelliptic diffusion-advection-reaction problems, showing stability and\nhigh-order convergence of the scheme. The main advantage over standard DG\nschemes is the higher accuracy for comparable numbers of degrees of freedom.\nFor non-homogeneous problems with piecewise-smooth source term we propose to\nconstruct a local quasi-Trefftz particular solution and then solve for the\ndifference. Numerical experiments in 2 and 3 space dimensions show the\nexcellent properties of the method both in diffusion-dominated and\nadvection-dominated problems.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"__WMKUAmzv5tv8OyDYotqA1suUMBWAr23cbIwvZvJaE","pdfSize":"1659306","txDigest":"ESY69ArP9JJ5gk1AhjRNz1mSTgRCncukMRw8Ama5SPsM","endEpoch":"1","status":"CERTIFIED"}
