{"id":"2408.04021","title":"Superradiant Interactions of the Cosmic Neutrino Background, Axions,\n  Dark Matter, and Reactor Neutrinos","authors":"Asimina Arvanitaki and Savas Dimopoulos and Marios Galanis","authorsParsed":[["Arvanitaki","Asimina",""],["Dimopoulos","Savas",""],["Galanis","Marios",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 18:08:31 GMT"}],"updateDate":"2024-08-09","timestamp":1723054111000,"abstract":"  In this paper we do three things. First, we outline the conditions under\nwhich the interaction rate of inelastic processes that change the internal\nstate of a system of $N$ targets scales as $N^2$. This is an effect distinct\nfrom coherent elastic scattering, but with the same scaling. Second, we compute\nexample rates for such processes for various weakly interacting particles.\nFinally, we point to potential quantum observables for these processes that go\nbeyond traditional energy exchange.\n  Maximal coherence in inelastic processes is achieved when the targets are\nplaced in an equal superposition of the ground and excited states. These\ncoherent inelastic processes are analogous to Dicke superradiance, and we thus\nrefer to them as superradiant interactions.\n  We compute the superradiant interaction rates for the C$\\nu$B, dark matter\nscattering and absorption, and late-universe particles, such as reactor\nneutrinos, when the two-level system is realized by nuclear or electron spins\nin a magnetic field. The rates we find can be quite sizable on macroscopic yet\nsmall targets. For example, the C$\\nu$B interacts with a rate of\n$\\mathcal{O}(\\text{Hz})$ when scattering off a 10~cm liquid or solid-state\ndensity spin-polarized sphere. For QCD axion dark matter, similar rates can be\nachieved with much smaller samples, $N \\sim\n\\mathcal{O}(10^{15})\\left(\\frac{m}{2\\times 10^{-8}~\\text{eV}}\\right)^{-1/2}$,\nwhere $m$ is the axion mass.\n  Using the Lindblad formalism for open quantum systems, we show that these\nsuperradiant interactions can manifest as a source of noise on the system. This\npoints to new observables, sensitive to the sum of the excitation and\nde-excitation rates, and can be viewed as introducing diffusion and decoherence\nto the system. The effects presented in this paper may point to a new class of\nultra-low threshold detectors.\n","subjects":["Physics/High Energy Physics - Phenomenology","Astrophysics/Cosmology and Nongalactic Astrophysics","Physics/High Energy Physics - Theory","Physics/Quantum Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}