{"id":"2408.09675","title":"Multi-Agent Reinforcement Learning for Autonomous Driving: A Survey","authors":"Ruiqi Zhang, Jing Hou, Florian Walter, Shangding Gu, Jiayi Guan,\n  Florian R\\\"ohrbein, Yali Du, Panpan Cai, Guang Chen and Alois Knoll","authorsParsed":[["Zhang","Ruiqi",""],["Hou","Jing",""],["Walter","Florian",""],["Gu","Shangding",""],["Guan","Jiayi",""],["Röhrbein","Florian",""],["Du","Yali",""],["Cai","Panpan",""],["Chen","Guang",""],["Knoll","Alois",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 03:31:20 GMT"}],"updateDate":"2024-08-20","timestamp":1724038280000,"abstract":"  Reinforcement Learning (RL) is a potent tool for sequential decision-making\nand has achieved performance surpassing human capabilities across many\nchallenging real-world tasks. As the extension of RL in the multi-agent system\ndomain, multi-agent RL (MARL) not only need to learn the control policy but\nalso requires consideration regarding interactions with all other agents in the\nenvironment, mutual influences among different system components, and the\ndistribution of computational resources. This augments the complexity of\nalgorithmic design and poses higher requirements on computational resources.\nSimultaneously, simulators are crucial to obtain realistic data, which is the\nfundamentals of RL. In this paper, we first propose a series of metrics of\nsimulators and summarize the features of existing benchmarks. Second, to ease\ncomprehension, we recall the foundational knowledge and then synthesize the\nrecently advanced studies of MARL-related autonomous driving and intelligent\ntransportation systems. Specifically, we examine their environmental modeling,\nstate representation, perception units, and algorithm design. Conclusively, we\ndiscuss open challenges as well as prospects and opportunities. We hope this\npaper can help the researchers integrate MARL technologies and trigger more\ninsightful ideas toward the intelligent and autonomous driving.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Multiagent Systems","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}