{"id":"2408.12695","title":"Learning Valid Dual Bounds in Constraint Programming: Boosted Lagrangian\n  Decomposition with Self-Supervised Learning","authors":"Swann Bessa, Darius Dabert, Max Bourgeat, Louis-Martin Rousseau,\n  Quentin Cappart","authorsParsed":[["Bessa","Swann",""],["Dabert","Darius",""],["Bourgeat","Max",""],["Rousseau","Louis-Martin",""],["Cappart","Quentin",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 19:26:29 GMT"}],"updateDate":"2024-08-26","timestamp":1724354789000,"abstract":"  Lagrangian decomposition (LD) is a relaxation method that provides a dual\nbound for constrained optimization problems by decomposing them into more\nmanageable sub-problems. This bound can be used in branch-and-bound algorithms\nto prune the search space effectively. In brief, a vector of Lagrangian\nmultipliers is associated with each sub-problem, and an iterative procedure\n(e.g., a sub-gradient optimization) adjusts these multipliers to find the\ntightest bound. Initially applied to integer programming, Lagrangian\ndecomposition also had success in constraint programming due to its versatility\nand the fact that global constraints provide natural sub-problems. However, the\nnon-linear and combinatorial nature of sub-problems in constraint programming\nmakes it computationally intensive to optimize the Lagrangian multipliers with\nsub-gradient methods at each node of the tree search. This currently limits the\npracticality of LD as a general bounding mechanism for constraint programming.\nTo address this challenge, we propose a self-supervised learning approach that\nleverages neural networks to generate multipliers directly, yielding tight\nbounds. This approach significantly reduces the number of sub-gradient\noptimization steps required, enhancing the pruning efficiency and reducing the\nexecution time of constraint programming solvers. This contribution is one of\nthe few that leverage learning to enhance bounding mechanisms on the dual side,\na critical element in the design of combinatorial solvers. To our knowledge,\nthis work presents the first generic method for learning valid dual bounds in\nconstraint programming.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}