{"id":"2408.10565","title":"Impurities induced vortex lattice melting and turbulence in rotating\n  Bose-Einstein condensates","authors":"Rony Boral, Swarup K. Sarkar, Paulsamy Muruganandam and Pankaj K.\n  Mishra","authorsParsed":[["Boral","Rony",""],["Sarkar","Swarup K.",""],["Muruganandam","Paulsamy",""],["Mishra","Pankaj K.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 06:05:49 GMT"}],"updateDate":"2024-08-21","timestamp":1724133949000,"abstract":"  We investigate the impact of various impurities on rotating Bose-Einstein\ncondensates confined within two-dimensional harmonic and optical lattice\npotentials. Without impurities, the rotating condensates display an organized\nsquare lattice pattern of vortices due to the influence of a square optical\nlattice. The introduction of impurity potentials disrupts this lattice\nstructure, inducing a phase transition from an ordered state to a disordered\nstate. Our analysis encompasses both static and dynamic types of impurities.\nThe static impurities are implemented using a randomly varying potential with a\nspatially random amplitude. The transformation of the vortex lattice structure,\nin this case, relies on the strength and lattice constant of the impurity\npotential. For dynamical impurities, we employ a Gaussian obstacle that orbits\naround the condensate at a specific distance from its center. In this scenario,\nthe vortex lattice melting occurs beyond a certain threshold radius and\nfrequency of oscillation of the rotating obstacle. We characterize the melting\nof the vortex lattice due to impurities using various quantities, such as the\nstructure factor and angular momentum. Notably, in the vortex-melted state, the\nangular momentum follows a power-law dependence with an exponent of\napproximately $1.73$, regardless of the type of impurity. Finally, we\ndemonstrate the signature of the presence of a turbulent state within the\nvortex-melted state generated by both static and dynamical impurities.\n","subjects":["Condensed Matter/Quantum Gases"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"U_vCY18E3UFrh6GOlq9Qc-fpIP6a-2nLXtwK24FzpmA","pdfSize":"5893336"}
