{"id":"2408.14543","title":"A recipe for local simulation of strongly-correlated fermionic matter on\n  quantum computers: the 2D Fermi-Hubbard model","authors":"Arash Jafarizadeh, Frank Pollmann, Adam Gammon-Smith","authorsParsed":[["Jafarizadeh","Arash",""],["Pollmann","Frank",""],["Gammon-Smith","Adam",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:00:07 GMT"}],"updateDate":"2024-08-28","timestamp":1724695207000,"abstract":"  The simulation of quantum many-body systems, relevant for quantum chemistry\nand condensed matter physics, is one of the most promising applications of\nnear-term quantum computers before fault-tolerance. However, since the vast\nmajority of quantum computing technologies are built around qubits and discrete\ngate-based operations, the translation of the physical problem into this\nframework is a crucial step. This translation will often be device specific,\nand a suboptimal implementation will be punished by the exponential compounding\nof errors on real devices. The importance of an efficient mapping is already\nrevealed for models of spinful fermions in two or three dimensions, which\nnaturally arise when the relevant physics relates to electrons. Using the most\ndirect and well-known mapping, the Jordan-Wigner transformation, leads to a\nnon-local representation of local degrees of freedom, and necessities efficient\ndecompositions of non-local unitary gates into a sequence of hardware\naccessible local gates. In this paper, we provide a step-by-step recipe for\nsimulating the paradigmatic two-dimensional Fermi-Hubbard model on a quantum\ncomputer using only local operations. To provide the ingredients for such a\nrecipe, we briefly review the plethora of different approaches that have\nemerged recently but focus on the Derby-Klassen compact fermion mapping in\norder to make our discussion concrete. We provide a detailed recipe for an\nend-to-end simulation including embedding on a physical device, preparing\ninitial states such as ground states, simulation of unitary time evolution, and\nmeasurement of observables and spectral functions. We explicitly compute the\nresource requirements for simulating a global quantum quench and conclude by\ndiscussing the challenges and future directions for simulating\nstrongly-correlated fermionic matter on quantum computers.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}