{"id":"2408.05305","title":"Differences in the Physical Properties of Satellite Galaxies within\n  Relaxed and Disturbed Galaxy Groups and Clusters","authors":"F. Ald\\'as, Facundo A. G\\'omez, C. Vega-Mart\\'inez, A. Zenteno,\n  Eleazar R. Carrasco","authorsParsed":[["Aldás","F.",""],["Gómez","Facundo A.",""],["Vega-Martínez","C.",""],["Zenteno","A.",""],["Carrasco","Eleazar R.",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 19:02:32 GMT"}],"updateDate":"2024-08-13","timestamp":1723230152000,"abstract":"  Galaxy groups and clusters are the most massive collapsed structures in the\nUniverse. Those structures are formed by collapsing with other smaller\nstructures. Groups and cluster mergers provide an appropriate environment for\nthe evolution and transformation of their galaxies. The merging process of\ngroups and clusters can affect the properties of their galaxy populations. Our\naim is to characterise the distribution of galaxies' colour, specific star\nformation rate, quenched galaxy fraction, and gas availability in galaxies\nbounded to groups and clusters and to examine how these properties relate to\nthe dynamical state of their host environments. We used the most massive halos\n($M > 10^{13} M_{\\odot}$) in Illustris TNG100 simulations and separated the\nsample into two categories: relaxed and disturbed halos. This classification\nwas done based on the offset between the position of the Brightest Cluster\nGalaxy (BCG) and the centre of mass of the gas. Subsequently, we classified\ntheir galaxy populations into red and blue galaxies using a threshold derived\nfrom a double Gaussian fit to their colour distribution. Our findings reveal\ndifferences in physical properties such as colour, star formation rates, and\ngas availability among satellite galaxies bound to interacting clusters\ncompared to relaxed clusters. Disturbed clusters exhibit more blue,\nstar-forming galaxies than their relaxed counterparts. This discrepancy in the\nfraction of blue and star-forming galaxies can be attributed to higher gas\navailability, including hot, diffuse, and condensed gas in satellite galaxies\nin disturbed clusters compared to relaxed ones. Furthermore, our study shows\nthat during cluster mergers, there are two crucial phases; at the beginning of\nthe interaction, there is an important boost in the star formation rate\nfollowed by suppression as the cluster reaches the equilibrium state.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}