{"id":"2408.07126","title":"Improving Radial Velocities by Marginalizing over Stars and Sky:\n  Achieving 30 m/s RV Precision for APOGEE in the Plate Era","authors":"Andrew K. Saydjari, Douglas P. Finkbeiner, Adam J. Wheeler, Jon A.\n  Holtzman, John C. Wilson, Andrew R. Casey, Sophia S\\'anchez-Maes, Joel R.\n  Brownstein, David W. Hogg, Michael R. Blanton","authorsParsed":[["Saydjari","Andrew K.",""],["Finkbeiner","Douglas P.",""],["Wheeler","Adam J.",""],["Holtzman","Jon A.",""],["Wilson","John C.",""],["Casey","Andrew R.",""],["Sánchez-Maes","Sophia",""],["Brownstein","Joel R.",""],["Hogg","David W.",""],["Blanton","Michael R.",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 18:00:01 GMT"}],"updateDate":"2024-08-15","timestamp":1723572001000,"abstract":"  The radial velocity catalog from the Apache Point Observatory Galactic\nEvolution Experiment (APOGEE) is unique in its simultaneously large volume and\nhigh precision as a result of its decade-long survey duration, multiplexing\n(600 fibers), and spectral resolution of $R \\sim 22,500$. However, previous\ndata reductions of APOGEE have not fully realized the potential radial velocity\n(RV) precision of the instrument. Here we present an RV catalog based on a new\nreduction of all 2.6 million visits of APOGEE DR17 and validate it against\nimproved estimates for the theoretical RV performance. The core ideas of the\nnew reduction are the simultaneous modeling of all components in the spectra,\nrather than a separate subtraction of point estimates for the sky, and a\nmarginalization over stellar types, rather than a grid search for an optimum.\nWe show that this catalog, when restricted to RVs measured with the same fiber,\nachieves noise-limited precision down to 30 m/s and delivers well-calibrated\nuncertainties. We also introduce a general method for calibrating\nfiber-to-fiber constant RV offsets and demonstrate its importance for high RV\nprecision work in multi-fiber spectrographs. After calibration, we achieve 47\nm/s RV precision on the combined catalog with RVs measured with different\nfibers. This degradation in precision relative to measurements with only a\nsingle fiber suggests that refining line spread function models should be a\nfocus in SDSS-V to improve the fiber-unified RV catalog.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}