{"id":"2408.15587","title":"Exponential stability of a free boundary problem with spherical symmetry\n  for a gas bubble immersed in a bounded incompressible liquid","authors":"Chengchun Hao, Tao Luo and Siqi Yang","authorsParsed":[["Hao","Chengchun",""],["Luo","Tao",""],["Yang","Siqi",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 07:22:00 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 12:59:17 GMT"}],"updateDate":"2024-08-30","timestamp":1724829720000,"abstract":"  This paper is mainly concerned with the free boundary problem for an\napproximate model (for example, arising from the study of sonoluminescence) of\na gas bubble of finite mass enclosed within a bounded incompressible viscous\nliquid, accounting for surface tensions at both the gas-liquid interface and\nthe external free surface of the entire gas-liquid region. It is found that any\nregular spherically symmetric steady-state solution is characterized by a\npositive root of a ninth-degree polynomial for which the existence and\nuniqueness are proved and a one-to-one correspondence between equilibria and\npairs of gas mass and liquid volume is established. We prove that these\nequilibria exhibit nonlinear and exponential asymptotic stability under small\nperturbations that conserve gas mass and liquid volume, and an equilibrium\nsolution acts as a local minimizer of the energy functional, even under\nrelatively large perturbations, with the proportionality constant determined by\nthe adiabatic constant. Moreover, we construct a global center manifold to\napply the center manifold theory. Our results apply to gases and liquids of all\nsizes. Furthermore, we derive the optimal exponential decay rate for small\nliquid volumes by analyzing the spectrum bounds of the associated linear\noperator and show that decreasing the gas mass or increasing the temperature\ncan accelerate the convergence rate, a behavior not seen in unbounded liquid\nscenarios.\n","subjects":["Mathematics/Analysis of PDEs"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}