{"id":"2408.00137","title":"Correcting Negative Bias in Large Language Models through Negative\n  Attention Score Alignment","authors":"Sangwon Yu, Jongyoon Song, Bongkyu Hwang, Hoyoung Kang, Sooah Cho,\n  Junhwa Choi, Seongho Joe, Taehee Lee, Youngjune L. Gwon, Sungroh Yoon","authorsParsed":[["Yu","Sangwon",""],["Song","Jongyoon",""],["Hwang","Bongkyu",""],["Kang","Hoyoung",""],["Cho","Sooah",""],["Choi","Junhwa",""],["Joe","Seongho",""],["Lee","Taehee",""],["Gwon","Youngjune L.",""],["Yoon","Sungroh",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 19:50:57 GMT"}],"updateDate":"2024-08-02","timestamp":1722455457000,"abstract":"  A binary decision task, like yes-no questions or answer verification,\nreflects a significant real-world scenario such as where users look for\nconfirmation about the correctness of their decisions on specific issues. In\nthis work, we observe that language models exhibit a negative bias in the\nbinary decisions of complex reasoning tasks. Based on our observations and the\nrationale about attention-based model dynamics, we propose a negative attention\nscore (NAS) to systematically and quantitatively formulate negative bias. Based\non NAS, we identify attention heads that attend to negative tokens provided in\nthe instructions as answer candidate of binary decisions, regardless of the\nquestion in the prompt, and validate their association with the negative bias.\nAdditionally, we propose the negative attention score alignment (NASA) method,\nwhich is a parameter-efficient fine-tuning technique to address the extracted\nnegatively biased attention heads. Experimental results from various domains of\nreasoning tasks and large model search space demonstrate that NASA\nsignificantly reduces the gap between precision and recall caused by negative\nbias while preserving their generalization abilities. Our codes are available\nat \\url{https://github.com/ysw1021/NASA}.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}