{"id":"2408.09043","title":"Improving VTE Identification through Language Models from Radiology\n  Reports: A Comparative Study of Mamba, Phi-3 Mini, and BERT","authors":"Jamie Deng, Yusen Wu, Yelena Yesha, Phuong Nguyen","authorsParsed":[["Deng","Jamie",""],["Wu","Yusen",""],["Yesha","Yelena",""],["Nguyen","Phuong",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 22:51:56 GMT"}],"updateDate":"2024-08-20","timestamp":1723848716000,"abstract":"  Venous thromboembolism (VTE) is a critical cardiovascular condition,\nencompassing deep vein thrombosis (DVT) and pulmonary embolism (PE). Accurate\nand timely identification of VTE is essential for effective medical care. This\nstudy builds upon our previous work, which addressed VTE detection using deep\nlearning methods for DVT and a hybrid approach combining deep learning and\nrule-based classification for PE. Our earlier approaches, while effective, had\ntwo major limitations: they were complex and required expert involvement for\nfeature engineering of the rule set. To overcome these challenges, we utilize\nthe Mamba architecture-based classifier. This model achieves remarkable\nresults, with a 97\\% accuracy and F1 score on the DVT dataset and a 98\\%\naccuracy and F1 score on the PE dataset. In contrast to the previous hybrid\nmethod on PE identification, the Mamba classifier eliminates the need for\nhand-engineered rules, significantly reducing model complexity while\nmaintaining comparable performance. Additionally, we evaluated a lightweight\nLarge Language Model (LLM), Phi-3 Mini, in detecting VTE. While this model\ndelivers competitive results, outperforming the baseline BERT models, it proves\nto be computationally intensive due to its larger parameter set. Our evaluation\nshows that the Mamba-based model demonstrates superior performance and\nefficiency in VTE identification, offering an effective solution to the\nlimitations of previous approaches.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9mRul8bwdv37rLpHk-hG7IxUmB-BW2Nm5zgt-vX73to","pdfSize":"437324"}
