{"id":"2408.06567","title":"AquilaMoE: Efficient Training for MoE Models with Scale-Up and Scale-Out\n  Strategies","authors":"Bo-Wen Zhang, Liangdong Wang, Ye Yuan, Jijie Li, Shuhao Gu, Mengdi\n  Zhao, Xinya Wu, Guang Liu, Chengwei Wu, Hanyu Zhao, Li Du, Yiming Ju, Quanyue\n  Ma, Yulong Ao, Yingli Zhao, Songhe Zhu, Zhou Cao, Dong Liang, Yonghua Lin,\n  Ming Zhang, Shunfei Wang, Yanxin Zhou, Min Ye, Xuekai Chen, Xinyang Yu,\n  Xiangjun Huang, Jian Yang","authorsParsed":[["Zhang","Bo-Wen",""],["Wang","Liangdong",""],["Yuan","Ye",""],["Li","Jijie",""],["Gu","Shuhao",""],["Zhao","Mengdi",""],["Wu","Xinya",""],["Liu","Guang",""],["Wu","Chengwei",""],["Zhao","Hanyu",""],["Du","Li",""],["Ju","Yiming",""],["Ma","Quanyue",""],["Ao","Yulong",""],["Zhao","Yingli",""],["Zhu","Songhe",""],["Cao","Zhou",""],["Liang","Dong",""],["Lin","Yonghua",""],["Zhang","Ming",""],["Wang","Shunfei",""],["Zhou","Yanxin",""],["Ye","Min",""],["Chen","Xuekai",""],["Yu","Xinyang",""],["Huang","Xiangjun",""],["Yang","Jian",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 02:07:00 GMT"}],"updateDate":"2024-08-14","timestamp":1723514820000,"abstract":"  In recent years, with the rapid application of large language models across\nvarious fields, the scale of these models has gradually increased, and the\nresources required for their pre-training have grown exponentially. Training an\nLLM from scratch will cost a lot of computation resources while scaling up from\na smaller model is a more efficient approach and has thus attracted significant\nattention. In this paper, we present AquilaMoE, a cutting-edge bilingual 8*16B\nMixture of Experts (MoE) language model that has 8 experts with 16 billion\nparameters each and is developed using an innovative training methodology\ncalled EfficientScale. This approach optimizes performance while minimizing\ndata requirements through a two-stage process. The first stage, termed\nScale-Up, initializes the larger model with weights from a pre-trained smaller\nmodel, enabling substantial knowledge transfer and continuous pretraining with\nsignificantly less data. The second stage, Scale-Out, uses a pre-trained dense\nmodel to initialize the MoE experts, further enhancing knowledge transfer and\nperformance. Extensive validation experiments on 1.8B and 7B models compared\nvarious initialization schemes, achieving models that maintain and reduce loss\nduring continuous pretraining. Utilizing the optimal scheme, we successfully\ntrained a 16B model and subsequently the 8*16B AquilaMoE model, demonstrating\nsignificant improvements in performance and training efficiency.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xJqGPTNiHm72EcHaD5GWgf0mX_1fsRbD4bs3qhHeReo","pdfSize":"539415"}
