{"id":"2408.10106","title":"Edge detection imaging by quasi-bound states in the continuum","authors":"Tingting Liu, Jumin Qiu, Lei Xu, Meibao Qin, Lipeng Wan, Tianbao Yu,\n  Qiegen Liu, Lujun Huang, Shuyuan Xiao","authorsParsed":[["Liu","Tingting",""],["Qiu","Jumin",""],["Xu","Lei",""],["Qin","Meibao",""],["Wan","Lipeng",""],["Yu","Tianbao",""],["Liu","Qiegen",""],["Huang","Lujun",""],["Xiao","Shuyuan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 15:50:16 GMT"}],"updateDate":"2024-08-20","timestamp":1724082616000,"abstract":"  Optical metasurfaces have revolutionized analog computing and image\nprocessing at sub-wavelength scales with faster speed and lower power\nconsumption. They typically involve spatial differentiation with engineered\nangular dispersion. Quasi-bound states in the continuum (quasi-BICs) have\nrecently emerged as a powerful tool for tailoring properties of optical\nresonances. While quasi-BICs have been explored in various applications that\nrequire high $Q$-factors and enhanced field confinement, their full potential\nin image processing remains unexplored. Here, we demonstrate edge detection\nimaging by leveraging a quasi-BIC in an all-dielectric metasurface. This\nmetasurface, composed of four nanodisks per unit cell, supports a\npolarization-independent quasi-BIC through structural perturbations, allowing\nsimultaneously engineering $Q$-factor and angular dispersion. Importantly, we\nfind that with suitable parameters, this quasi-BIC metasurface can perform\nisotropic two-dimensional spatial differentiation, which is the core element\nfor realizing edge detection. Following the theoretical design, we fabricate\nthe metasurfaces on the silicon-on-insulator platform and experimentally\nvalidate their capability of high-quality, efficient, and uniform edge\ndetection imaging under different incident polarizations. Our results\nilluminate the mechanisms of edge detection with quasi-BIC metasurfaces and\nhighlight new opportunities for their application in ultra-compact, low-power\noptical computing devices.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}