{"id":"2408.10275","title":"FedKBP: Federated dose prediction framework for knowledge-based planning\n  in radiation therapy","authors":"Jingyun Chen, Martin King, Yading Yuan","authorsParsed":[["Chen","Jingyun",""],["King","Martin",""],["Yuan","Yading",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 14:57:14 GMT"}],"updateDate":"2024-08-21","timestamp":1723906634000,"abstract":"  Dose prediction plays a key role in knowledge-based planning (KBP) by\nautomatically generating patient-specific dose distribution. Recent advances in\ndeep learning-based dose prediction methods necessitates collaboration among\ndata contributors for improved performance. Federated learning (FL) has emerged\nas a solution, enabling medical centers to jointly train deep-learning models\nwithout compromising patient data privacy. We developed the FedKBP framework to\nevaluate the performances of centralized, federated, and individual (i.e.\nseparated) training of dose prediction model on the 340 plans from OpenKBP\ndataset. To simulate FL and individual training, we divided the data into 8\ntraining sites. To evaluate the effect of inter-site data variation on model\ntraining, we implemented two types of case distributions: 1) Independent and\nidentically distributed (IID), where the training and validating cases were\nevenly divided among the 8 sites, and 2) non-IID, where some sites have more\ncases than others. The results show FL consistently outperforms individual\ntraining on both model optimization speed and out-of-sample testing scores,\nhighlighting the advantage of FL over individual training. Under IID data\ndivision, FL shows comparable performance to centralized training, underscoring\nFL as a promising alternative to traditional pooled-data training. Under\nnon-IID division, larger sites outperformed smaller sites by up to 19% on\ntesting scores, confirming the need of collaboration among data owners to\nachieve better prediction accuracy. Meanwhile, non-IID FL showed reduced\nperformance as compared to IID FL, posing the need for more sophisticated FL\nmethod beyond mere model averaging to handle data variation among participating\nsites.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"c6iyQiy-E7AKsL-yZEn42lsEbjvoXBvpAIfPOyrlG10","pdfSize":"304018"}
