{"id":"2408.08382","title":"Improved Approximation Algorithms for Index Coding","authors":"Dror Chawin and Ishay Haviv","authorsParsed":[["Chawin","Dror",""],["Haviv","Ishay",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 18:58:00 GMT"}],"updateDate":"2024-08-19","timestamp":1723748280000,"abstract":"  The index coding problem is concerned with broadcasting encoded information\nto a collection of receivers in a way that enables each receiver to discover\nits required data based on its side information, which comprises the data\nrequired by some of the others. Given the side information map, represented by\na graph in the symmetric case and by a digraph otherwise, the goal is to devise\na coding scheme of minimum broadcast length.\n  We present a general method for developing efficient algorithms for\napproximating the index coding rate for prescribed families of instances. As\napplications, we obtain polynomial-time algorithms that approximate the index\ncoding rate of graphs and digraphs on $n$ vertices to within factors of\n$O(n/\\log^2 n)$ and $O(n/\\log n)$ respectively. This improves on the\napproximation factors of $O(n/\\log n)$ for graphs and $O(n \\cdot \\log \\log\nn/\\log n)$ for digraphs achieved by Blasiak, Kleinberg, and Lubetzky (IEEE\nTrans. Inform. Theory, 2013). For the family of quasi-line graphs, we exhibit a\npolynomial-time algorithm that approximates the index coding rate to within a\nfactor of $2$. This improves on the approximation factor of $O(n^{2/3})$\nachieved by Arbabjolfaei and Kim (ISIT, 2016) for graphs on $n$ vertices taken\nfrom certain sub-families of quasi-line graphs.\n  Our approach is applicable for approximating a variety of additional graph\nand digraph quantities to within the same approximation factors. Specifically,\nit captures every graph quantity sandwiched between the independence number and\nthe clique cover number and every digraph quantity sandwiched between the\nmaximum size of an acyclic induced sub-digraph and the directed clique cover\nnumber.\n","subjects":["Computing Research Repository/Data Structures and Algorithms","Computing Research Repository/Information Theory","Mathematics/Information Theory"],"license":"http://creativecommons.org/licenses/by/4.0/"}