{"id":"2408.09819","title":"CMoralEval: A Moral Evaluation Benchmark for Chinese Large Language\n  Models","authors":"Linhao Yu, Yongqi Leng, Yufei Huang, Shang Wu, Haixin Liu, Xinmeng Ji,\n  Jiahui Zhao, Jinwang Song, Tingting Cui, Xiaoqing Cheng, Tao Liu, Deyi Xiong","authorsParsed":[["Yu","Linhao",""],["Leng","Yongqi",""],["Huang","Yufei",""],["Wu","Shang",""],["Liu","Haixin",""],["Ji","Xinmeng",""],["Zhao","Jiahui",""],["Song","Jinwang",""],["Cui","Tingting",""],["Cheng","Xiaoqing",""],["Liu","Tao",""],["Xiong","Deyi",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 09:15:35 GMT"}],"updateDate":"2024-08-20","timestamp":1724058935000,"abstract":"  What a large language model (LLM) would respond in ethically relevant\ncontext? In this paper, we curate a large benchmark CMoralEval for morality\nevaluation of Chinese LLMs. The data sources of CMoralEval are two-fold: 1) a\nChinese TV program discussing Chinese moral norms with stories from the society\nand 2) a collection of Chinese moral anomies from various newspapers and\nacademic papers on morality. With these sources, we aim to create a moral\nevaluation dataset characterized by diversity and authenticity. We develop a\nmorality taxonomy and a set of fundamental moral principles that are not only\nrooted in traditional Chinese culture but also consistent with contemporary\nsocietal norms. To facilitate efficient construction and annotation of\ninstances in CMoralEval, we establish a platform with AI-assisted instance\ngeneration to streamline the annotation process. These help us curate\nCMoralEval that encompasses both explicit moral scenarios (14,964 instances)\nand moral dilemma scenarios (15,424 instances), each with instances from\ndifferent data sources. We conduct extensive experiments with CMoralEval to\nexamine a variety of Chinese LLMs. Experiment results demonstrate that\nCMoralEval is a challenging benchmark for Chinese LLMs. The dataset is publicly\navailable at \\url{https://github.com/tjunlp-lab/CMoralEval}.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}