{"id":"2408.12803","title":"Multi-Treatment Multi-Task Uplift Modeling for Enhancing User Growth","authors":"Yuxiang Wei, Zhaoxin Qiu, Yingjie Li, Yuke Sun, Xiaoling Li","authorsParsed":[["Wei","Yuxiang",""],["Qiu","Zhaoxin",""],["Li","Yingjie",""],["Sun","Yuke",""],["Li","Xiaoling",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 02:44:08 GMT"}],"updateDate":"2024-08-26","timestamp":1724381048000,"abstract":"  As a key component in boosting online user growth, uplift modeling aims to\nmeasure individual user responses (e.g., whether to play the game) to various\ntreatments, such as gaming bonuses, thereby enhancing business outcomes.\nHowever, previous research typically considers a single-task, single-treatment\nsetting, where only one treatment exists and the overall treatment effect is\nmeasured by a single type of user response. In this paper, we propose a\nMulti-Treatment Multi-Task (MTMT) uplift network to estimate treatment effects\nin a multi-task scenario. We identify the multi-treatment problem as a causal\ninference problem with a tiered response, comprising a base effect (from\noffering a treatment) and an incremental effect (from offering a specific type\nof treatment), where the base effect can be numerically much larger than the\nincremental effect. Specifically, MTMT separately encodes user features and\ntreatments. The user feature encoder uses a multi-gate mixture of experts\n(MMOE) network to encode relevant user features, explicitly learning inter-task\nrelations. The resultant embeddings are used to measure natural responses per\ntask. Furthermore, we introduce a treatment-user feature interaction module to\nmodel correlations between each treatment and user feature. Consequently, we\nseparately measure the base and incremental treatment effect for each task\nbased on the produced treatment-aware representations. Experimental results\nbased on an offline public dataset and an online proprietary dataset\ndemonstrate the effectiveness of MTMT in single/multi-treatment and\nsingle/multi-task settings. Additionally, MTMT has been deployed in our gaming\nplatform to improve user experience.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zeUVLdCEniYPHJSsVLuXMp_CeqTUl-5Aw3S1kRAS01c","pdfSize":"701870"}
