{"id":"2408.08765","title":"Rethinking Generative Semantic Communication for Multi-User Systems with\n  Multi-Modal LLM","authors":"Wanting Yang, Zehui Xiong, Shiwen Mao, Tony Q. S. Quek, Ping Zhang,\n  Merouane Debbah, Rahim Tafazolli","authorsParsed":[["Yang","Wanting",""],["Xiong","Zehui",""],["Mao","Shiwen",""],["Quek","Tony Q. S.",""],["Zhang","Ping",""],["Debbah","Merouane",""],["Tafazolli","Rahim",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:18:37 GMT"}],"updateDate":"2024-08-19","timestamp":1723817917000,"abstract":"  The surge in connected devices in 6G with typical massive access scenarios,\nsuch as smart agriculture, and smart cities, poses significant challenges to\nunsustainable traditional communication with limited radio resources and\nalready high system complexity. Fortunately, the booming artificial\nintelligence technology and the growing computational power of devices offer a\npromising 6G enabler: semantic communication (SemCom). However, existing deep\nlearning-based SemCom paradigms struggle to extend to multi-user scenarios due\nto their rigid end-to-end training approach. Consequently, to truly empower 6G\nnetworks with this critical technology, this article rethinks generative SemCom\nfor multi-user system with multi-modal large language model (MLLM), and propose\na novel framework called \"M2GSC\". In this framework, the MLLM, which serves as\nshared knowledge base (SKB), plays three critical roles for complex tasks,\nspawning a series of benefits such as semantic encoding standardization and\nsemantic decoding personalization. Meanwhile, to enhance the performance of\nM2GSC framework and to advance its implementation in 6G, we highlight three\nresearch directions on M2GSC framework, namely, upgrading SKB to closed loop\nagent, adaptive semantic encoding offloading, and streamlined semantic decoding\noffloading. Finally, a case study is conducted to demonstrate the preliminary\nvalidation on the effectiveness of the M2GSC framework in terms of streamlined\ndecoding offloading.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}