{"id":"2408.15684","title":"A quasi-ohmic back contact achieved by inserting single-crystal graphene\n  in flexible Kesterite solar cells","authors":"Yixiong Ji, Wentong Yang, Di Yan, Wei Luo, Jialu Li, Shi Tang, Jintao\n  Fu, James Bullock, Mei Gao, Xin Li, Zhancheng Li, Jun Yang, Xingzhan Wei,\n  Haofei Shi, Fangyang Liu, Paul Mulvaney","authorsParsed":[["Ji","Yixiong",""],["Yang","Wentong",""],["Yan","Di",""],["Luo","Wei",""],["Li","Jialu",""],["Tang","Shi",""],["Fu","Jintao",""],["Bullock","James",""],["Gao","Mei",""],["Li","Xin",""],["Li","Zhancheng",""],["Yang","Jun",""],["Wei","Xingzhan",""],["Shi","Haofei",""],["Liu","Fangyang",""],["Mulvaney","Paul",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 10:18:29 GMT"}],"updateDate":"2024-08-29","timestamp":1724840309000,"abstract":"  Flexible photovoltaics with a lightweight and adaptable nature that allows\nfor deployment on curved surfaces and in building facades have always been a\ngoal vigorously pursued by researchers in thin-film solar cell technology. The\nrecent strides made in improving the sunlight-to-electricity conversion\nefficiency of kesterite Cu$_{2}$ZnSn(S, Se)$_{4}$ (CZTSSe) suggest it to be a\nperfect candidate. However, making use of rare Mo foil in CZTSSe solar cells\ncauses severe problems in thermal expansion matching, uneven grain growth, and\nsevere problems at the back contact of the devices. Herein, a strategy\nutilizing single-crystal graphene to modify the back interface of flexible\nCZTSSe solar cells is proposed. It will be shown that the insertion of graphene\nat the Mo foil/CZTSSe interface provides strong physical support for the\nsubsequent deposition of the CZTSSe absorber layer, improving the adhesion\nbetween the absorber layer and the Mo foil substrate. Additionally, the\ngraphene passivates the rough sites on the surface of the Mo foil, enhancing\nthe chemical homogeneity of the substrate, and resulting in a more crystalline\nand homogeneous CZTSSe absorber layer on the Mo foil substrate. The detrimental\nreaction between Mo and CZTSSe has also been eliminated. Through an analysis of\nthe electrical properties, it is found that the introduction of graphene at the\nback interface promotes the formation of a quasi-ohmic contact at the back\ncontact, decreasing the back contact barrier of the solar cell, and leading to\nefficient collection of charges at the back interface. This investigation\ndemonstrates that solution-based CZTSSe photovoltaic devices could form the\nbasis of cheap and flexible solar cells.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"3hpYpL4VNd0kND-CIBaapDB0xeZ8_UZrkz8aFxquU9w","pdfSize":"15644387"}
