{"id":"2408.01172","title":"Cascading failures with group support in interdependent hypergraphs","authors":"Lei Chen, Chunxiao Jia, Run-Ran Liu, Fanyuan Meng","authorsParsed":[["Chen","Lei",""],["Jia","Chunxiao",""],["Liu","Run-Ran",""],["Meng","Fanyuan",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 10:45:39 GMT"}],"updateDate":"2024-08-05","timestamp":1722595539000,"abstract":"  The functionality of an entity frequently necessitates the support of a group\nsituated in another layer of the system. To unravel the profound impact of such\ngroup support on a system's resilience against cascading failures, we devise a\nframework comprising a double-layer interdependent hypergraph system, wherein\nnodes are capable of receiving support via hyperedges. Our central hypothesis\nposits that the failure may transcend to another layer when all support groups\nof each dependent node fail, thereby initiating a potentially iterative cascade\nacross layers. Through rigorous analytical methods, we derive the critical\nthreshold for the initial node survival probability that marks the second-order\nphase transition point. A salient discovery is that as the prevalence of\ndependent nodes escalates, the system dynamics shift from a second-order to a\nfirst-order phase transition. Notably, irrespective of the collapse pattern,\nsystems characterized by scale-free hyperdegree distributions within both\nhypergraph layers consistently demonstrate superior robustness compared to\nthose adhering to Poisson hyperdegree distributions. In summary, our research\nunderscores the paramount significance of group support mechanisms and\nintricate network topologies in determining the resilience of interconnected\nsystems against the propagation of cascading failures. By exploring the\ninterplay between these factors, we have gained insights into how systems can\nbe designed or optimized to mitigate the risk of widespread disruptions,\nensuring their continued functionality and stability in the face of adverse\nevents.\n","subjects":["Physics/Physics and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}