{"id":"2408.12564","title":"Factor Adjusted Spectral Clustering for Mixture Models","authors":"Shange Tang, Soham Jana and Jianqing Fan","authorsParsed":[["Tang","Shange",""],["Jana","Soham",""],["Fan","Jianqing",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:31:21 GMT"}],"updateDate":"2024-08-23","timestamp":1724347881000,"abstract":"  This paper studies a factor modeling-based approach for clustering\nhigh-dimensional data generated from a mixture of strongly correlated\nvariables. Statistical modeling with correlated structures pervades modern\napplications in economics, finance, genomics, wireless sensing, etc., with\nfactor modeling being one of the popular techniques for explaining the common\ndependence. Standard techniques for clustering high-dimensional data, e.g.,\nnaive spectral clustering, often fail to yield insightful results as their\nperformances heavily depend on the mixture components having a weakly\ncorrelated structure. To address the clustering problem in the presence of a\nlatent factor model, we propose the Factor Adjusted Spectral Clustering (FASC)\nalgorithm, which uses an additional data denoising step via eliminating the\nfactor component to cope with the data dependency. We prove this method\nachieves an exponentially low mislabeling rate, with respect to the signal to\nnoise ratio under a general set of assumptions. Our assumption bridges many\nclassical factor models in the literature, such as the pervasive factor model,\nthe weak factor model, and the sparse factor model. The FASC algorithm is also\ncomputationally efficient, requiring only near-linear sample complexity with\nrespect to the data dimension. We also show the applicability of the FASC\nalgorithm with real data experiments and numerical studies, and establish that\nFASC provides significant results in many cases where traditional spectral\nclustering fails.\n","subjects":["Mathematics/Statistics Theory","Statistics/Methodology","Statistics/Machine Learning","Statistics/Statistics Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}