{"id":"2408.02688","title":"A probabilistic framework for learning non-intrusive corrections to\n  long-time climate simulations from short-time training data","authors":"Benedikt Barthel Sorensen, Leonardo Zepeda-N\\'u\\~nez, Ignacio\n  Lopez-Gomez, Zhong Yi Wan, Rob Carver, Fei Sha, Themistoklis Sapsis","authorsParsed":[["Sorensen","Benedikt Barthel",""],["Zepeda-Núñez","Leonardo",""],["Lopez-Gomez","Ignacio",""],["Wan","Zhong Yi",""],["Carver","Rob",""],["Sha","Fei",""],["Sapsis","Themistoklis",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:34:30 GMT"}],"updateDate":"2024-08-07","timestamp":1722623670000,"abstract":"  Chaotic systems, such as turbulent flows, are ubiquitous in science and\nengineering. However, their study remains a challenge due to the large range\nscales, and the strong interaction with other, often not fully understood,\nphysics. As a consequence, the spatiotemporal resolution required for accurate\nsimulation of these systems is typically computationally infeasible,\nparticularly for applications of long-term risk assessment, such as the\nquantification of extreme weather risk due to climate change. While data-driven\nmodeling offers some promise of alleviating these obstacles, the scarcity of\nhigh-quality simulations results in limited available data to train such\nmodels, which is often compounded by the lack of stability for long-horizon\nsimulations. As such, the computational, algorithmic, and data restrictions\ngenerally imply that the probability of rare extreme events is not accurately\ncaptured. In this work we present a general strategy for training neural\nnetwork models to non-intrusively correct under-resolved long-time simulations\nof chaotic systems. The approach is based on training a post-processing\ncorrection operator on under-resolved simulations nudged towards a\nhigh-fidelity reference. This enables us to learn the dynamics of the\nunderlying system directly, which allows us to use very little training data,\neven when the statistics thereof are far from converged. Additionally, through\nthe use of probabilistic network architectures we are able to leverage the\nuncertainty due to the limited training data to further improve extrapolation\ncapabilities. We apply our framework to severely under-resolved simulations of\nquasi-geostrophic flow and demonstrate its ability to accurately predict the\nanisotropic statistics over time horizons more than 30 times longer than the\ndata seen in training.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Dynamical Systems","Physics/Atmospheric and Oceanic Physics","Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"QIE-X6YrS8q6NfJxUeD11AJ67f8lKmuhsLc2xsXQQJ0","pdfSize":"15307928","txDigest":"2xcoCTgKPKrkrHfkwMX6da9mAxGEfRDTv9dMFz6J9iun","endEpoch":"1","status":"CERTIFIED"}
