{"id":"2408.05944","title":"Uncertainty Quantification of Spectral Estimator and MLE for Orthogonal\n  Group Synchronization","authors":"Ziliang Samuel Zhong, Shuyang Ling","authorsParsed":[["Zhong","Ziliang Samuel",""],["Ling","Shuyang",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 06:45:06 GMT"}],"updateDate":"2024-08-13","timestamp":1723445106000,"abstract":"  Orthogonal group synchronization aims to recover orthogonal group elements\nfrom their noisy pairwise measurements. It has found numerous applications\nincluding computer vision, imaging science, and community detection. Due to the\northogonal constraints, it is often challenging to find the least squares\nestimator in presence of noise. In the recent years, semidefinite relaxation\n(SDR) and spectral methods have proven to be powerful tools in recovering the\ngroup elements. In particular, under additive Gaussian noise, the SDR exactly\nproduces the maximum likelihood estimator (MLE), and both MLE and spectral\nmethods are able to achieve near-optimal statistical error. In this work, we\ntake one step further to quantify the uncertainty of the MLE and spectral\nestimators by considering their distributions. By leveraging the orthogonality\nconstraints in the likelihood function, we obtain a second-order expansion of\nthe MLE and spectral estimator with the leading terms as an anti-symmetric\nGaussian random matrix that is on the tangent space of the orthogonal matrix.\nThis also implies state-of-the-art min-max risk bounds as a by-product. Our\nworks provide a general theoretical framework that is potentially useful to\nfind an approximate distribution of the estimators arising from many\nstatistical inference problems with manifold constraints. The numerical\nexperiments confirm our theoretical contribution.\n","subjects":["Mathematics/Statistics Theory","Computing Research Repository/Information Theory","Mathematics/Information Theory","Mathematics/Optimization and Control","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"1JKAPl2xwd4RwPloAwyrmWLkkmmSPPcpRJ9zZcQ6hxU","pdfSize":"805816"}
