{"id":"2408.11346","title":"Non-verbal Hands-free Control for Smart Glasses using Teeth Clicks","authors":"Payal Mohapatra, Ali Aroudi, Anurag Kumar, Morteza Khaleghimeybodi","authorsParsed":[["Mohapatra","Payal",""],["Aroudi","Ali",""],["Kumar","Anurag",""],["Khaleghimeybodi","Morteza",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 05:21:20 GMT"}],"updateDate":"2024-08-22","timestamp":1724217680000,"abstract":"  Smart glasses are emerging as a popular wearable computing platform\npotentially revolutionizing the next generation of human-computer interaction.\nThe widespread adoption of smart glasses has created a pressing need for\ndiscreet and hands-free control methods. Traditional input techniques, such as\nvoice commands or tactile gestures, can be intrusive and non-discreet.\nAdditionally, voice-based control may not function well in noisy acoustic\nconditions. We propose a novel, discreet, non-verbal, and non-tactile approach\nto controlling smart glasses through subtle vibrations on the skin induced by\nteeth clicking. We demonstrate that these vibrations can be sensed by\naccelerometers embedded in the glasses with a low-footprint predictive model.\nOur proposed method, called STEALTHsense, utilizes a temporal\nbroadcasting-based neural network architecture with just 88K trainable\nparameters and 7.14M Multiply and Accumulate (MMAC) per inference unit. We\nbenchmark our proposed STEALTHsense against state-of-the-art deep learning\napproaches and traditional low-footprint machine learning approaches. We\nconducted a study across 21 participants to collect representative samples for\ntwo distinct teeth-clicking patterns and many non-patterns for robust training\nof STEALTHsense, achieving an average cross-person accuracy of 0.93. Field\ntesting confirmed its effectiveness, even in noisy conditions, underscoring\nSTEALTHsense's potential for real-world applications, offering a promising\nsolution for smart glasses interaction.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://creativecommons.org/licenses/by/4.0/"}