{"id":"2408.00413","title":"Joint Antenna Position and Beamforming Optimization with\n  Self-Interference Mitigation in MA-ISAC System","authors":"Size Peng, Cixiao Zhang, Yin Xu, Qingqing Wu, Xiaowu Ou, and Dazhi He","authorsParsed":[["Peng","Size",""],["Zhang","Cixiao",""],["Xu","Yin",""],["Wu","Qingqing",""],["Ou","Xiaowu",""],["He","Dazhi",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 09:29:51 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 12:34:06 GMT"}],"updateDate":"2024-08-12","timestamp":1722504591000,"abstract":"  Movable antennas (MAs) have demonstrated significant potential in enhancing\nthe performance of integrated sensing and communication (ISAC) systems.\nHowever, the application in the integrated and cost-effective full-duplex (FD)\nmonostatic systems remains underexplored. To address this research gap, we\ndevelop an MA-ISAC model within a monostatic framework, where the\nself-interference channel is modeled in the near field and characterized by\nantenna position vectors. This model allows us to investigate the use of MAs\nwith the goal of maximizing the weighted sum of communication capacity and\nsensing mutual information. The resulting optimization problem is non-convex\nmaking it challenging to solve optimally. To overcome this, we employ\nfractional programming (FP) to propose an alternating optimization (AO)\nalgorithm that jointly optimizes the beamforming and antenna positions for both\ntransceivers. Specifically, closed-form solutions for the transmit and receive\nbeamforming matrices are derived using the Karush-Kuhn-Tucker (KKT) conditions,\nand a novel coarse-to-fine grained search (CFGS) approach is employed to\ndetermine the high-quality sub-optimal antenna positions. Numerical results\ndemonstrate that with strong self-interference cancellation (SIC) capabilities,\nMAs significantly enhance the overall performance and reliability of the ISAC\nsystem when utilizing our proposed algorithm, compared to conventional\nfixed-position antenna designs.\n","subjects":["Computing Research Repository/Information Theory","Electrical Engineering and Systems Science/Signal Processing","Mathematics/Information Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}