{"id":"2408.07509","title":"$\\texttt{AXP4}$, a Numerical Simulator of Pulse Profiles for Binary\n  Accreting X-ray Pulsars $-$ I: Beam Geometries","authors":"Parisee S. Shirke","authorsParsed":[["Shirke","Parisee S.",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 12:37:15 GMT"}],"updateDate":"2024-08-15","timestamp":1723639035000,"abstract":"  The paper presents model pulse profiles from binary accreting X-ray pulsars\nusing high-resolution numerical simulations for pencil and fan emission beam\ngeometries, each with two different optical depths obtained using a new\nnumerical code $\\texttt{AXP4}$ developed in this work. Sharp, pointed-peak\nimprovements are obtained in the known flat-top pulse profiles by extrapolating\nthe model emission functions available in the literature over the full range of\nemission angles for a realistic description. The effect of general relativistic\nbending of light due to the strong gravity near the neutron star is taken into\naccount, updating previous attempts with new analytic approximations for photon\ntrajectories in curved space-time reported in the literature (including\nadditional flux contribution from the dark unseen face of the pulsar).\nIncorporating the other general relativistic effect of gravitational red-shift\nis seen to redden the pulsar beam to increasingly lower energies along the\nX-ray observing band. Integrating this emission over a circular slab geometry\nfor two antipodal hotspots lying flush at the neutron star polar caps presents\nsmoothened, composite gravitationally bent pulse profiles to the observer. A\ncomparison between the corresponding non-normalized flux profiles is included.\nFor theoretical completeness and reference base, this treatment is applied to\nisotropic emitters with uniform injection and limb-darkened beams, as well. The\npossibility of the production of Einstein rings around a pulsar for a limiting\nvalue of the compactness parameter is a distinctive feature.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}