{"id":"2408.00719","title":"Hybrid electroluminescence device for on-demand single photon generation\n  at room temperature","authors":"Aleksander Rodek, Mateusz Hajdel, Kacper Oreszczuk, Anna Kafar,\n  Muhammed Aktas, Lucja Marona, Marek Potemski, Czeslaw Skierbiszewski, Piotr\n  Kossacki","authorsParsed":[["Rodek","Aleksander",""],["Hajdel","Mateusz",""],["Oreszczuk","Kacper",""],["Kafar","Anna",""],["Aktas","Muhammed",""],["Marona","Lucja",""],["Potemski","Marek",""],["Skierbiszewski","Czeslaw",""],["Kossacki","Piotr",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 17:03:10 GMT"},{"version":"v2","created":"Mon, 5 Aug 2024 13:26:11 GMT"}],"updateDate":"2024-08-06","timestamp":1722531790000,"abstract":"  Recent research focused on single photon emitters (SPEs) hosted by layered\nsemiconductors, particularly hexagonal boron nitride (hBN), has revealed a\npromising alternative to quantum dots (QDs) for generating single,\nindistinguishable photons. hBN-based SPEs offer lower material costs, room\ntemperature emission, and easy integration into potential optoelectronic\ndevices due to the layered structure of the host crystal. This work presents\ncompact hybrid electroluminescence devices, in which GaN laser diodes (LDs) are\nused for bottom-to-top excitation of hBN nanoflakes deposited on the laser\nfacets. Our approach circumvents the issue of electroluminescence generation\nfrom hBN and provides access to the SPE's signal without optical driving by an\nexternal laser. Using laser diodes upgraded with Bragg reflectors a\nroom-temperature generation of single photons from hBN is confirmed by an\n80%-dip in their g(2) second-order correlation. The on-demand emission of\nsingle photons at room temperature is demonstrated by driving the laser diodes\nin pulsed operation, with confidence supported by a measured g(2)(0) value of\n0.37.\n","subjects":["Physics/Optics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"obibluPF_Sh7WfcLRXAMLbUjAz4-eLgZoeSXp0d18f8","pdfSize":"14582474","txDigest":"AJd93zo1dvDdiZQLYGxFzmSg3BvNjwE3vyHpz89j7tP2","endEpoch":"1","status":"CERTIFIED"}
