{"id":"2408.14494","title":"Knowledge Graph Modeling-Driven Large Language Model Operating System\n  (LLM OS) for Task Automation in Process Engineering Problem-Solving","authors":"Sakhinana Sagar Srinivas, Vijay Sri Vaikunth, Venkataramana Runkana","authorsParsed":[["Srinivas","Sakhinana Sagar",""],["Vaikunth","Vijay Sri",""],["Runkana","Venkataramana",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 13:52:47 GMT"}],"updateDate":"2024-08-28","timestamp":1724421167000,"abstract":"  We present the Process Engineering Operations Assistant (PEOA), an AI-driven\nframework designed to solve complex problems in the chemical and process\nindustries. The framework employs a modular architecture orchestrated by a\nmeta-agent, which serves as the central coordinator, managing an action\ngenerator and instruction-tuned small-scale language models (expert models).\nThe action generator decomposes complex problems into sub-tasks and identifies\nsuitable expert models to execute each, delivering precise solutions for\nmulti-step problem-solving. Key techniques include advanced knowledge modeling\nusing property graphs for improved information retrieval, facilitating more\naccurate and contextually relevant solutions. Additionally, the framework\nutilizes a teacher-student transfer-learning approach with GPT-4 (Omni) to\nfine-tune the action generator and expert models for domain adaptation,\nalongside an iterative problem-solving mechanism with sophisticated error\nhandling. Custom datasets were developed to evaluate the framework against\nleading proprietary language models on various engineering tasks. The results\ndemonstrate the framework effectiveness in automating calculations,\naccelerating prototyping, and providing AI-augmented decision support for\nindustrial processes, marking a significant advancement in process engineering\ncapabilities.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"kBu_jgfHcI_NsNSW6CnEYS7iUy2ICZrw_f6S6P_SJnM","pdfSize":"528449"}
