{"id":"2408.02496","title":"Automatic rating of incomplete hippocampal inversions evaluated across\n  multiple cohorts","authors":"Lisa Hemforth, Baptiste Couvy-Duchesne, Kevin De Matos, Camille\n  Brianceau, Matthieu Joulot, Tobias Banaschewski, Arun L.W. Bokde, Sylvane\n  Desrivi\\`eres, Herta Flor, Antoine Grigis, Hugh Garavan, Penny Gowland,\n  Andreas Heinz, R\\\"udiger Br\\\"uhl, Jean-Luc Martinot, Marie-Laure Paill\\`ere\n  Martinot, Eric Artiges, Dimitri Papadopoulos, Herve Lemaitre, Tomas Paus,\n  Luise Poustka, Sarah Hohmann, Nathalie Holz, Juliane H. Fr\\\"ohner, Michael N.\n  Smolka, Nilakshi Vaidya, Henrik Walter, Robert Whelan, Gunter Schumann,\n  Christian B\\\"uchel, JB Poline, Bernd Itterman, Vincent Frouin, Alexandre\n  Martin, IMAGEN study group, Claire Cury and Olivier Colliot","authorsParsed":[["Hemforth","Lisa",""],["Couvy-Duchesne","Baptiste",""],["De Matos","Kevin",""],["Brianceau","Camille",""],["Joulot","Matthieu",""],["Banaschewski","Tobias",""],["Bokde","Arun L. W.",""],["Desrivières","Sylvane",""],["Flor","Herta",""],["Grigis","Antoine",""],["Garavan","Hugh",""],["Gowland","Penny",""],["Heinz","Andreas",""],["Brühl","Rüdiger",""],["Martinot","Jean-Luc",""],["Martinot","Marie-Laure Paillère",""],["Artiges","Eric",""],["Papadopoulos","Dimitri",""],["Lemaitre","Herve",""],["Paus","Tomas",""],["Poustka","Luise",""],["Hohmann","Sarah",""],["Holz","Nathalie",""],["Fröhner","Juliane H.",""],["Smolka","Michael N.",""],["Vaidya","Nilakshi",""],["Walter","Henrik",""],["Whelan","Robert",""],["Schumann","Gunter",""],["Büchel","Christian",""],["Poline","JB",""],["Itterman","Bernd",""],["Frouin","Vincent",""],["Martin","Alexandre",""],["group","IMAGEN study",""],["Cury","Claire",""],["Colliot","Olivier",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 14:19:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722867543000,"abstract":"  Incomplete Hippocampal Inversion (IHI), sometimes called hippocampal\nmalrotation, is an atypical anatomical pattern of the hippocampus found in\nabout 20% of the general population. IHI can be visually assessed on coronal\nslices of T1 weighted MR images, using a composite score that combines four\nanatomical criteria. IHI has been associated with several brain disorders\n(epilepsy, schizophrenia). However, these studies were based on small samples.\nFurthermore, the factors (genetic or environmental) that contribute to the\ngenesis of IHI are largely unknown. Large-scale studies are thus needed to\nfurther understand IHI and their potential relationships to neurological and\npsychiatric disorders. However, visual evaluation is long and tedious,\njustifying the need for an automatic method. In this paper, we propose, for the\nfirst time, to automatically rate IHI. We proceed by predicting four anatomical\ncriteria, which are then summed up to form the IHI score, providing the\nadvantage of an interpretable score. We provided an extensive experimental\ninvestigation of different machine learning methods and training strategies. We\nperformed automatic rating using a variety of deep learning models (conv5-FC3,\nResNet and SECNN) as well as a ridge regression. We studied the generalization\nof our models using different cohorts and performed multi-cohort learning. We\nrelied on a large population of 2,008 participants from the IMAGEN study, 993\nand 403 participants from the QTIM/QTAB studies as well as 985 subjects from\nthe UKBiobank. We showed that deep learning models outperformed a ridge\nregression. We demonstrated that the performances of the conv5-FC3 network were\nat least as good as more complex networks while maintaining a low complexity\nand computation time. We showed that training on a single cohort may lack in\nvariability while training on several cohorts improves generalization.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning","Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"TzS6eCSaYNUOf6YKWfRWbJNhBAoxoDbp2GNNxMIlUkg","pdfSize":"1188338"}
