{"id":"2408.02094","title":"Superconducting thin films of (Cu,C)Ba$_2$Ca$_2$Cu$_3$O$_{9+\\delta}$\n  with zero resistance transition temperature close to 100 K","authors":"Meng-Jun Ou, Yuecong Liu, Yi Wang, Hai-Hu Wen","authorsParsed":[["Ou","Meng-Jun",""],["Liu","Yuecong",""],["Wang","Yi",""],["Wen","Hai-Hu",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 17:27:04 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 08:55:36 GMT"}],"updateDate":"2024-08-15","timestamp":1722792424000,"abstract":"  High superconducting transition temperature is favorable for the applications\nof superconductors. Some cuprate superconductors have the transition\ntemperatures above 100 K, such as the Hg- or Tl-based 1223 and 1234 phases, but\nmany of them contain the toxic elements, like Hg and Tl. Meanwhile, the high\nanisotropy makes the vortices easy to move, thus the irreversibility magnetic\nfield is very low in the liquid nitrogen temperature region. Here we report the\nsuccessful synthesis of superconducting thin films\n(Cu,C)Ba$_{2}$Ca$_{2}$Cu$_3$O$_{9+\\delta}$ with the zero-resistance transition\ntemperature reaching 99.7 K. The film shows a very good crystallinity with\n(00l) orientation. The superconducting transitions are rather sharp as revealed\nby both resistivity and magnetization measurements. Temperature dependent\nresistivity has been measured under different magnetic fields along c-axis and\nab-plane, and the irreversibility lines have been achieved. The resistivity was\nalso measured at different temperatures with the magnetic field rotated in the\nac-plane, and the data can be nicely scaled by using the anisotropic\nGinzburg-Landau model, yielding a temperature dependent anisotropy which varies\nfrom 17 at 110 K to 4 at 77 K. We also measured the\nmagnetization-hysteresis-loops and calculated the critical current density\nthrough the Bean critical state model. The critical current density at 77 K is\nabout 6$\\times$10$^5$ A/cm$^2$ (zero field), thus the film may be a good\ncandidate for the applications of superconducting cables or the high frequency\nsuperconducting filters.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}