{"id":"2408.10514","title":"Folded multistability and hidden critical point in microwave-driven\n  Rydberg atoms","authors":"Yu Ma, Bang Liu, Li-Hua Zhang, Ya-Jun Wang, Zheng-Yuan Zhang, Shi-Yao\n  Shao, Qing Li, Han-Chao Chen, Jun Zhang, Tian-Yu Han, Qi-Feng Wang, Jia-Dou\n  Nan, Yi-Ming Yin, Dong-Yang Zhu, Bao-Sen Shi, Dong-Sheng Ding","authorsParsed":[["Ma","Yu",""],["Liu","Bang",""],["Zhang","Li-Hua",""],["Wang","Ya-Jun",""],["Zhang","Zheng-Yuan",""],["Shao","Shi-Yao",""],["Li","Qing",""],["Chen","Han-Chao",""],["Zhang","Jun",""],["Han","Tian-Yu",""],["Wang","Qi-Feng",""],["Nan","Jia-Dou",""],["Yin","Yi-Ming",""],["Zhu","Dong-Yang",""],["Shi","Bao-Sen",""],["Ding","Dong-Sheng",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 03:28:35 GMT"},{"version":"v2","created":"Mon, 9 Sep 2024 15:01:12 GMT"}],"updateDate":"2024-09-10","timestamp":1724124515000,"abstract":"  The interactions between Rydberg atoms and microwave fields provide a\nvaluable framework for studying the complex dynamics out of equilibrium, exotic\nphases, and critical phenomena in many-body physics. This unique interplay\nallows us to explore various regimes of nonlinearity and phase transitions.\nHere, we observe a phase transition from the state in the regime of bistability\nto that in multistability in strongly interacting Rydberg atoms by varying the\nmicrowave field intensity, accompanying with the breaking of Z3-symmetry.\nDuring the phase transition, the system experiences a hidden critical point, in\nwhich the multistable states are difficult to be identified. Through changing\nthe initial state of system, we can identify a hidden multistable state and\nreveal a hidden trajectory of phase transition, allowing us to track to a\nhidden critical point. In addition, we observe multiple phase transitions in\nspectra, suggesting higher-order symmetry breaking. The reported results shed\nlight on manipulating multistability in dissipative Rydberg atoms systems and\nhold promise in the applications of non-equilibrium many-body physics.\n","subjects":["Condensed Matter/Quantum Gases","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}