{"id":"2408.02928","title":"PGB: Benchmarking Differentially Private Synthetic Graph Generation\n  Algorithms","authors":"Shang Liu, Hao Du, Yang Cao, Bo Yan, Jinfei Liu, and Masatoshi\n  Yoshikawa","authorsParsed":[["Liu","Shang",""],["Du","Hao",""],["Cao","Yang",""],["Yan","Bo",""],["Liu","Jinfei",""],["Yoshikawa","Masatoshi",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 03:22:24 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 10:55:38 GMT"}],"updateDate":"2024-09-13","timestamp":1722914544000,"abstract":"  Differentially private graph analysis is a powerful tool for deriving\ninsights from diverse graph data while protecting individual information.\nDesigning private analytic algorithms for different graph queries often\nrequires starting from scratch. In contrast, differentially private synthetic\ngraph generation offers a general paradigm that supports one-time generation\nfor multiple queries. Although a rich set of differentially private graph\ngeneration algorithms has been proposed, comparing them effectively remains\nchallenging due to various factors, including differing privacy definitions,\ndiverse graph datasets, varied privacy requirements, and multiple utility\nmetrics.\n  To this end, we propose PGB (Private Graph Benchmark), a comprehensive\nbenchmark designed to enable researchers to compare differentially private\ngraph generation algorithms fairly. We begin by identifying four essential\nelements of existing works as a 4-tuple: mechanisms, graph datasets, privacy\nrequirements, and utility metrics. We discuss principles regarding these\nelements to ensure the comprehensiveness of a benchmark. Next, we present a\nbenchmark instantiation that adheres to all principles, establishing a new\nmethod to evaluate existing and newly proposed graph generation algorithms.\nThrough extensive theoretical and empirical analysis, we gain valuable insights\ninto the strengths and weaknesses of prior algorithms. Our results indicate\nthat there is no universal solution for all possible cases. Finally, we provide\nguidelines to help researchers select appropriate mechanisms for various\nscenarios.\n","subjects":["Computing Research Repository/Databases"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}