{"id":"2408.03657","title":"PHOCUS: Physics-Based Deconvolution for Ultrasound Resolution\n  Enhancement","authors":"Felix Duelmer, Walter Simson, Mohammad Farid Azampour, Magdalena\n  Wysocki, Angelos Karlas and Nassir Navab","authorsParsed":[["Duelmer","Felix",""],["Simson","Walter",""],["Azampour","Mohammad Farid",""],["Wysocki","Magdalena",""],["Karlas","Angelos",""],["Navab","Nassir",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 09:52:30 GMT"}],"updateDate":"2024-08-08","timestamp":1723024350000,"abstract":"  Ultrasound is widely used in medical diagnostics allowing for accessible and\npowerful imaging but suffers from resolution limitations due to diffraction and\nthe finite aperture of the imaging system, which restricts diagnostic use. The\nimpulse function of an ultrasound imaging system is called the point spread\nfunction (PSF), which is convolved with the spatial distribution of reflectors\nin the image formation process. Recovering high-resolution reflector\ndistributions by removing image distortions induced by the convolution process\nimproves image clarity and detail. Conventionally, deconvolution techniques\nattempt to rectify the imaging system's dependent PSF, working directly on the\nradio-frequency (RF) data. However, RF data is often not readily accessible.\nTherefore, we introduce a physics-based deconvolution process using a modeled\nPSF, working directly on the more commonly available B-mode images. By\nleveraging Implicit Neural Representations (INRs), we learn a continuous\nmapping from spatial locations to their respective echogenicity values,\neffectively compensating for the discretized image space. Our contribution\nconsists of a novel methodology for retrieving a continuous echogenicity map\ndirectly from a B-mode image through a differentiable physics-based rendering\npipeline for ultrasound resolution enhancement. We qualitatively and\nquantitatively evaluate our approach on synthetic data, demonstrating\nimprovements over traditional methods in metrics such as PSNR and SSIM.\nFurthermore, we show qualitative enhancements on an ultrasound phantom and an\nin-vivo acquisition of a carotid artery.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}