{"id":"2408.00560","title":"Highly-efficient electron ponderomotive acceleration in underdense\n  plasmas","authors":"Lorenzo Martelli, Olena Kononenko, Igor Andriyash, Jonathan Wheeler,\n  Julien Gautier, Jean-Philippe Goddet, Amar Tafzi, Ronan Lahaye, Camilla\n  Giaccaglia, Alessandro Flacco, Vidmantas Tomkus, Migle Mackevi\\v{c}i\\=ut\\.e,\n  Juozas Dudutis, Valdemar Stankevic, Paulius Ge\\v{c}ys, Gediminas\n  Ra\\v{c}iukaitis, Henri Kraft, Xuan Quyen Dinh and C\\'edric Thaury","authorsParsed":[["Martelli","Lorenzo",""],["Kononenko","Olena",""],["Andriyash","Igor",""],["Wheeler","Jonathan",""],["Gautier","Julien",""],["Goddet","Jean-Philippe",""],["Tafzi","Amar",""],["Lahaye","Ronan",""],["Giaccaglia","Camilla",""],["Flacco","Alessandro",""],["Tomkus","Vidmantas",""],["Mackevičiūtė","Migle",""],["Dudutis","Juozas",""],["Stankevic","Valdemar",""],["Gečys","Paulius",""],["Račiukaitis","Gediminas",""],["Kraft","Henri",""],["Dinh","Xuan Quyen",""],["Thaury","Cédric",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 13:42:15 GMT"}],"updateDate":"2024-08-02","timestamp":1722519735000,"abstract":"  Laser-plasma accelerators represent a promising technology for future compact\naccelerating systems, enabling the acceleration of tens of pC to above $1\\,$GeV\nover just a few centimeters. Nonetheless, these devices currently lack the\nstability, beam quality and average current of conventional systems. While many\nefforts have focused on improving acceleration stability and quality, little\nprogress has been made in increasing the beam's average current, which is\nessential for future laser-plasma-based applications. In this paper, we\ninvestigate a laser-plasma acceleration regime aimed at increasing the beam\naverage current with energies up to few-MeVs, efficiently enhancing the beam\ncharge. We present experimental results on configurations that allow reaching\ncharges of $5-30\\,$nC and a maximum conversion efficiency of around $14\\,$%.\nThrough comprehensive Particle-In-Cell simulations, we interpret the\nexperimental results and present a detailed study on electron dynamics. From\nour analysis, we show that most electrons are not trapped in a plasma wave;\nrather, they experience ponderomotive acceleration. Thus, we prove the laser\npulse as the main driver of the particles' energy gain process.\n","subjects":["Physics/Plasma Physics","Physics/Accelerator Physics","Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j2KlADw6twZX0AhYvebyFndKuQrcfaSD_cnAYLbzsdI","pdfSize":"4198736","txDigest":"2TBVFYuMvtrjEJfA5tSs2j7eRqsoaM1LXkaChn6aKrVi","endEpoch":"1","status":"CERTIFIED"}
