{"id":"2408.14541","title":"The potential for long-lived intermediate mass black hole binaries in\n  the lowest density dwarf galaxies","authors":"Fazeel Mahmood Khan, Fiza Javed, Kelly Holley-Bockelmann, Lucio Mayer,\n  Peter Berczik, and Andrea V. Macci\\`o","authorsParsed":[["Khan","Fazeel Mahmood",""],["Javed","Fiza",""],["Holley-Bockelmann","Kelly",""],["Mayer","Lucio",""],["Berczik","Peter",""],["Macciò","Andrea V.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 18:00:03 GMT"}],"updateDate":"2024-08-28","timestamp":1724695203000,"abstract":"  Intermediate Mass Black Hole (IMBH) mergers with masses $10^4 - 10^6$\n$M_{\\odot}$ are expected to produce gravitational waves (GWs) detectable by the\nLaser Interferometer Space Antenna (LISA) with high signal to noise ratios out\nto redshift 20. IMBH mergers are expected to take place within dwarf galaxies,\nhowever, the dynamics, timescales, and effect on their hosts are largely\nunexplored. In a previous study, we examined how IMBHs would pair and merge\nwithin nucleated dwarf galaxies. IMBHs in nucleated hosts evolve very\nefficiently, forming a binary system and coalescing within a few hundred\nmillion years. Although the fraction of dwarf galaxies ($10^7$ M$_{\\odot} \\leq$\n$M_{\\star} \\leq 10^{10}$ M$_{\\odot}$) hosting nuclear star clusters is between\n60-100\\%, this fraction drops to 20-70\\% for lower-mass dwarfs\n($M_{\\star}\\approx 10^7$ M$_{\\odot}$), with the largest drop in low-density\nenvironments. Here, we extend our previous study by performing direct $N-$body\nsimulations to explore the dynamics and evolution of IMBHs within non-nucleated\ndwarf galaxies, under the assumption that IMBHs exist within these dwarfs. To\nour surprise, none of IMBHs in our simulation suite merge within a Hubble time,\ndespite many attaining high eccentricities $e \\sim 0.7-0.95$. We conclude that\nextremely low stellar density environments in the centers of non-nucleated\ndwarfs do not provide an ample supply of stars to interact with IMBHs binary\nresulting in its stalling, in spite of triaxiality and high eccentricity,\ncommon means to drive a binary to coalescence. Our findings underline the\nimportance of considering all detailed host properties to predict IMBH merger\nrates for LISA.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}