{"id":"2408.02141","title":"An efficient strategy for path planning with a tethered marsupial\n  robotics system","authors":"Jes\\'us Capit\\'an, Jos\\'e M. D\\'iaz-B\\'a\\~nez, Miguel A.\n  P\\'erez-Cuti\\~no, Fabio Rodr\\'iguez and Inmaculada Ventura","authorsParsed":[["Capitán","Jesús",""],["Díaz-Báñez","José M.",""],["Pérez-Cutiño","Miguel A.",""],["Rodríguez","Fabio",""],["Ventura","Inmaculada",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 20:53:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722804783000,"abstract":"  A marsupial robotics system comprises three components: an Unmanned Ground\nVehicle (UGV), an Unmanned Aerial Vehicle (UAV), and a tether connecting both\nrobots. Marsupial systems are highly beneficial in industry as they extend the\nUAV's battery life during flight. This paper introduces a novel strategy for a\nspecific path planning problem in marsupial systems, where each of the\ncomponents must avoid collisions with ground and aerial obstacles modeled as 3D\ncuboids. Given an initial configuration in which the UAV is positioned atop the\nUGV, the goal is to reach an aerial target with the UAV. We assume that the UGV\nfirst moves to a position from which the UAV can take off and fly through a\nvertical plane to reach an aerial target. We propose an approach that\ndiscretizes the space to approximate an optimal solution, minimizing the sum of\nthe lengths of the ground and air paths. First, we assume a taut tether and use\na novel algorithm that leverages the convexity of the tether and the geometry\nof obstacles to efficiently determine the locus of feasible take-off points for\nthe UAV. We then apply this result to scenarios that involve loose tethers. The\nsimulation test results show that our approach can solve complex situations in\nseconds, outperforming a baseline planning algorithm based on RRT* (Rapidly\nexploring Random Trees).\n","subjects":["Computing Research Repository/Robotics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"e5_B14H8MdYd9Hv-mlEVg4G_oc4uLNc7vmJTbXR4Ng8","pdfSize":"897468"}
