{"id":"2408.13969","title":"The General Three-Body Problem in Conformal-Euclidean Space: Hidden\n  Symmetries and New Properties of a Low-Dimensional Syste","authors":"A. S. Gevorkyan, A. V. Bogdanov and V. V. Mareev","authorsParsed":[["Gevorkyan","A. S.",""],["Bogdanov","A. V.",""],["Mareev","V. V.",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 01:10:18 GMT"}],"updateDate":"2024-08-27","timestamp":1724634618000,"abstract":"  Despite the huge number of research into the three-body problem in physics\nand mathematics, the study of this problem still remains relevant both from the\npoint of view of its broad application and taking into account its fundamental\nsignificance for the theory of dynamical systems. In addition, to solve the\nproblem of quantum-to-classical transition, it is important to answer the\nquestion: is irreversibility fundamental to the description of the classical\nworld? To answer this question, we considered a reference classical dynamical\nsystem, the general three-body problem, formulating it in conformal Euclidean\nspace and rigorously proving its equivalence to the Newtonian three-body\nproblem. It is shown that a curved configuration space with a local coordinate\nsystem reveals new hidden symmetries of the internal motion of a dynamical\nsystem, which makes it possible to reduce the problem to a 6th order system\ninstead of the known 8th order. The most important consequence of this\nconsideration is that the chronologizing parameter of the motion of a system of\nparticles, which we call internal time, is in the general case irreversible,\nwhich is characteristic of the general three-body problem. An equation is\nderived that describes the evolution of the flow of geodesic trajectories, with\nthe help of which the entropy of the system is constructed. New criteria for\nassessing the complexity of a low-dimensional dynamic system and the dimension\nof stochastic fractal structures arising in three-dimensional space are\nobtained. An effective mathematical algorithm has been developed for the\nnumerical simulation of the general three-body problem, which is traditionally\na difficult-to-solve system of stiff ordinary differential equations.\n","subjects":["Physics/Mathematical Physics","Mathematics/Mathematical Physics","Nonlinear Sciences/Chaotic Dynamics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}