{"id":"2408.01509","title":"Reconstructing and Forecasting Marine Dynamic Variable Fields across\n  Space and Time Globally and Gaplessly","authors":"Zhixi Xiong, Yukang Jiang, Wenfang Lu, Xueqin Wang, and Ting Tian","authorsParsed":[["Xiong","Zhixi",""],["Jiang","Yukang",""],["Lu","Wenfang",""],["Wang","Xueqin",""],["Tian","Ting",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:07:30 GMT"}],"updateDate":"2024-08-06","timestamp":1722622050000,"abstract":"  Spatiotemporal projections in marine science are essential for understanding\nocean systems and their impact on Earth's climate. However, existing AI-based\nand statistics-based inversion methods face challenges in leveraging ocean\ndata, generating continuous outputs, and incorporating physical constraints. We\npropose the Marine Dynamic Reconstruction and Forecast Neural Networks\n(MDRF-Net), which integrates marine physical mechanisms and observed data to\nreconstruct and forecast continuous ocean temperature-salinity and dynamic\nfields. MDRF-Net leverages statistical theories and techniques, incorporating\nparallel neural network sharing initial layer, two-step training strategy, and\nensemble methodology, facilitating in exploring challenging marine areas like\nthe Arctic zone. We have theoretically justified the efficacy of our ensemble\nmethod and the rationality of it by providing an upper bound on its\ngeneralization error.The effectiveness of MDRF-Net's is validated through a\ncomprehensive simulation study, which highlights its capability to reliably\nestimate unknown parameters. Comparison with other inversion methods and\nreanalysis data are also conducted, and the global test error is 0.455{\\deg}C\nfor temperature and 0.0714psu for salinity. Overall, MDRF-Net effectively\nlearns the ocean dynamics system using physical mechanisms and statistical\ninsights, contributing to a deeper understanding of marine systems and their\nimpact on the environment and human use of the ocean.\n","subjects":["Statistics/Applications"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"ukq5MP2ouvrKhwutg7xqxmu4UAv_bJT-i_OQmWiO1LY","pdfSize":"30106393"}
