{"id":"2408.11732","title":"K2-399 b is not a planet. The Saturn that wandered through the Neptune\n  desert is actually a hierarchical eclipsing binary","authors":"J. Lillo-Box, D. W. Latham, K. A. Collins, D. J. Armstrong, D.\n  Gandolfi, E. L. N. Jensen, A. Castro-Gonz\\'alez, O. Balsalobre-Ruza, B.\n  Montesinos, S. G. Sousa, J. Aceituno, R. P. Schwarz, N. Narita, A. Fukui, J.\n  Cabrera, A. Hadjigeorghiou, M. Kuzuhara, T. Hirano, M. Fridlund, A. P.\n  Hatzes, O. Barrag\\'an, N. M. Batalha","authorsParsed":[["Lillo-Box","J.",""],["Latham","D. W.",""],["Collins","K. A.",""],["Armstrong","D. J.",""],["Gandolfi","D.",""],["Jensen","E. L. N.",""],["Castro-González","A.",""],["Balsalobre-Ruza","O.",""],["Montesinos","B.",""],["Sousa","S. G.",""],["Aceituno","J.",""],["Schwarz","R. P.",""],["Narita","N.",""],["Fukui","A.",""],["Cabrera","J.",""],["Hadjigeorghiou","A.",""],["Kuzuhara","M.",""],["Hirano","T.",""],["Fridlund","M.",""],["Hatzes","A. P.",""],["Barragán","O.",""],["Batalha","N. M.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 15:56:22 GMT"}],"updateDate":"2024-09-18","timestamp":1724255782000,"abstract":"  The transit technique has been very efficient in detecting planet candidate\nsignals over the past decades. The so-called statistical validation approach\nhas become a popular way of verifying a candidate's planetary nature. However,\nthe incomplete consideration of false positive scenarios and data quality can\nlead to the misinterpretation of the results. In this work we revise the\nplanetary status of K2-399\\,b, a validated planet with an estimated false\npositive probability of 0.078% located in the middle of the so-called Neptunian\ndesert, and hence a potential key target for atmospheric prospects. We use\nradial velocity data from the CARMENES, HARPS and TRES spectrographs, as well\nas ground-based multi-band transit photometry LCOGT MuSCAT3 and broad band\nphotometry to test the planetary scenario. Our analysis of the available data\ndoes not support the existence of this (otherwise key) planet, and instead\npoints to a scenario composed of an early G-dwarf orbited in a\n$846.62^{+0.22}_{-0.28}$~days period by a pair of eclipsing M-dwarfs (hence a\nhierarchical eclipsing binary) likely in the mid-type domain. We thus demote\nK2-399 b as a planet. We conclude that the validation process, while very\nuseful to prioritise follow-up efforts, must always be conducted with careful\nattention to data quality while ensuring that all possible scenarios have been\nproperly tested to get reliable results. We also encourage developers of\nvalidation algorithms to ensure the accuracy of a priori probabilities for\ndifferent stellar scenarios that can lead to this kind of false validation. We\nfurther encourage the use of follow-up observations when possible (such as\nradial velocity and/or multi-band light curves) to confirm the planetary nature\nof detected transiting signals rather than only relying on validation tools.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics","Astrophysics/Solar and Stellar Astrophysics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}