{"id":"2408.15829","title":"SITransformer: Shared Information-Guided Transformer for Extreme\n  Multimodal Summarization","authors":"Sicheng Liu, Lintao Wang, Xiaogan Zhu, Xuequan Lu, Zhiyong Wang, Kun\n  Hu","authorsParsed":[["Liu","Sicheng",""],["Wang","Lintao",""],["Zhu","Xiaogan",""],["Lu","Xuequan",""],["Wang","Zhiyong",""],["Hu","Kun",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 14:44:42 GMT"},{"version":"v2","created":"Thu, 29 Aug 2024 02:16:02 GMT"}],"updateDate":"2024-08-30","timestamp":1724856282000,"abstract":"  Extreme Multimodal Summarization with Multimodal Output (XMSMO) becomes an\nattractive summarization approach by integrating various types of information\nto create extremely concise yet informative summaries for individual\nmodalities. Existing methods overlook the issue that multimodal data often\ncontains more topic irrelevant information, which can mislead the model into\nproducing inaccurate summaries especially for extremely short ones. In this\npaper, we propose SITransformer, a Shared Information-guided Transformer for\nextreme multimodal summarization. It has a shared information guided pipeline\nwhich involves a cross-modal shared information extractor and a cross-modal\ninteraction module. The extractor formulates semantically shared salient\ninformation from different modalities by devising a novel filtering process\nconsisting of a differentiable top-k selector and a shared-information guided\ngating unit. As a result, the common, salient, and relevant contents across\nmodalities are identified. Next, a transformer with cross-modal attentions is\ndeveloped for intra- and inter-modality learning with the shared information\nguidance to produce the extreme summary. Comprehensive experiments demonstrate\nthat SITransformer significantly enhances the summarization quality for both\nvideo and text summaries for XMSMO. Our code will be publicly available at\nhttps://github.com/SichengLeoLiu/MMAsia24-XMSMO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/publicdomain/zero/1.0/"}