{"id":"2408.05874","title":"LLM-Based Robust Product Classification in Commerce and Compliance","authors":"Sina Gholamian, Gianfranco Romani, Bartosz Rudnikowicz, Laura Skylaki","authorsParsed":[["Gholamian","Sina",""],["Romani","Gianfranco",""],["Rudnikowicz","Bartosz",""],["Skylaki","Laura",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 22:59:32 GMT"}],"updateDate":"2024-08-13","timestamp":1723417172000,"abstract":"  Product classification is a crucial task in international trade, as\ncompliance regulations are verified and taxes and duties are applied based on\nproduct categories. Manual classification of products is time-consuming and\nerror-prone, and the sheer volume of products imported and exported renders the\nmanual process infeasible. Consequently, e-commerce platforms and enterprises\ninvolved in international trade have turned to automatic product classification\nusing machine learning. However, current approaches do not consider the\nreal-world challenges associated with product classification, such as very\nabbreviated and incomplete product descriptions. In addition, recent\nadvancements in generative Large Language Models (LLMs) and their reasoning\ncapabilities are mainly untapped in product classification and e-commerce. In\nthis research, we explore the real-life challenges of industrial classification\nand we propose data perturbations that allow for realistic data simulation.\nFurthermore, we employ LLM-based product classification to improve the\nrobustness of the prediction in presence of incomplete data. Our research shows\nthat LLMs with in-context learning outperform the supervised approaches in the\nclean-data scenario. Additionally, we illustrate that LLMs are significantly\nmore robust than the supervised approaches when data attacks are present.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}