{"id":"2408.06615","title":"Gaussian mixture Taylor approximations of risk measures constrained by\n  PDEs with Gaussian random field inputs","authors":"Dingcheng Luo, Joshua Chen, Peng Chen, Omar Ghattas","authorsParsed":[["Luo","Dingcheng",""],["Chen","Joshua",""],["Chen","Peng",""],["Ghattas","Omar",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 04:05:12 GMT"}],"updateDate":"2024-08-14","timestamp":1723521912000,"abstract":"  This work considers the computation of risk measures for quantities of\ninterest governed by PDEs with Gaussian random field parameters using Taylor\napproximations. While efficient, Taylor approximations are local to the point\nof expansion, and hence may degrade in accuracy when the variances of the input\nparameters are large. To address this challenge, we approximate the underlying\nGaussian measure by a mixture of Gaussians with reduced variance in a dominant\ndirection of parameter space. Taylor approximations are constructed at the\nmeans of each Gaussian mixture component, which are then combined to\napproximate the risk measures. The formulation is presented in the setting of\ninfinite-dimensional Gaussian random parameters for risk measures including the\nmean, variance, and conditional value-at-risk. We also provide detailed\nanalysis of the approximations errors arising from two sources: the Gaussian\nmixture approximation and the Taylor approximations. Numerical experiments are\nconducted for a semilinear advection-diffusion-reaction equation with a random\ndiffusion coefficient field and for the Helmholtz equation with a random wave\nspeed field. For these examples, the proposed approximation strategy can\nachieve less than $1\\%$ relative error in estimating CVaR with only\n$\\mathcal{O}(10)$ state PDE solves, which is comparable to a standard Monte\nCarlo estimate with $\\mathcal{O}(10^4)$ samples, thus achieving significant\nreduction in computational cost. The proposed method can therefore serve as a\nway to rapidly and accurately estimate risk measures under limited\ncomputational budgets.\n","subjects":["Mathematics/Numerical Analysis","Computing Research Repository/Numerical Analysis","Statistics/Computation"],"license":"http://creativecommons.org/licenses/by/4.0/"}