{"id":"2408.00021","title":"Optimal design problem with thermal radiation","authors":"Kosuke Kita, Kei Matsushima, Tomoyuki Oka","authorsParsed":[["Kita","Kosuke",""],["Matsushima","Kei",""],["Oka","Tomoyuki",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 01:09:34 GMT"}],"updateDate":"2024-08-02","timestamp":1722388174000,"abstract":"  This paper is concerned with configurations of two-material thermal\nconductors that minimize the Dirichlet energy for steady-state diffusion\nequations with nonlinear boundary conditions described mainly by maximal\nmonotone operators. To find such configurations, a homogenization theorem will\nbe proved and applied to an existence theorem for minimizers of a relaxation\nproblem whose minimum value is equivalent to an original design problem. As a\ntypical example of nonlinear boundary conditions, thermal radiation boundary\nconditions will be the focus, and then the Fr\\'echet derivative of the\nDirichlet energy will be derived, which is used to estimate the minimum value.\nSince optimal configurations of the relaxation problem involve the so-called\ngrayscale domains that do not make sense in general, a perimeter constraint\nproblem via the positive part of the level set function will be introduced as\nan approximation problem to avoid such domains, and moreover, the existence\ntheorem for minimizers of the perimeter constraint problem will be proved. In\nparticular, it will also be proved that the limit of minimizers for the\napproximation problem becomes that of the relaxation problem in a specific\ncase, and then candidates for minimizers of the approximation problem will be\nconstructed by employing time-discrete versions of nonlinear diffusion\nequations. In this paper, it will be shown that optimized configurations deeply\ndepend on force terms as a characteristic of nonlinear problems and will also\nbe applied to real physical problems.\n","subjects":["Mathematics/Analysis of PDEs","Mathematics/Optimization and Control"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}