{"id":"2408.12584","title":"Electric field control of superconductivity and quantized anomalous Hall\n  effects in rhombohedral tetralayer graphene","authors":"Youngjoon Choi, Ysun Choi, Marco Valentini, Caitlin L. Patterson,\n  Ludwig F. W. Holleis, Owen I. Sheekey, Hari Stoyanov, Xiang Cheng, Takashi\n  Taniguchi, Kenji Watanabe and Andrea F. Young","authorsParsed":[["Choi","Youngjoon",""],["Choi","Ysun",""],["Valentini","Marco",""],["Patterson","Caitlin L.",""],["Holleis","Ludwig F. W.",""],["Sheekey","Owen I.",""],["Stoyanov","Hari",""],["Cheng","Xiang",""],["Taniguchi","Takashi",""],["Watanabe","Kenji",""],["Young","Andrea F.",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 17:50:17 GMT"}],"updateDate":"2024-08-23","timestamp":1724349017000,"abstract":"  Inducing superconducting correlations in chiral edge states is predicted to\ngenerate topologically protected zero energy modes with exotic quantum\nstatistics. Experimental efforts to date have focused on engineering interfaces\nbetween superconducting materials, typically amorphous metals, and\nsemiconducting quantum Hall or quantum anomalous Hall (QAH) systems. However,\nthe strong interfacial disorder inherent can prevent the formation of isolated\ntopological modes. An appealing alternative is to use low-density flat band\nmaterials where the ground state can be tuned between intrinsic superconducting\nand quantum anomalous Hall states using only the electric field effect.\nHowever, quantized transport and superconductivity have not been simultaneously\nachieved. Here, we show that rhombohedral tetralayer graphene aligned to a\nhexagonal boron nitride substrate hosts a quantized anomalous Hall state at\nsuperlattice filling $\\nu = -1$ as well as a superconducting state at $\\nu\n\\approx -3.1$ at zero magnetic field. Remarkably, gate voltage can also be used\nto actuate nonvolatile switching of the chirality in the quantum anomalous Hall\nstate, allowing arbitrarily reconfigurable networks of topological edge modes\nin locally gated devices. Thermodynamic compressibility measurements further\nreveal a topologically ordered fractional Chern insulator at $\\nu = 2/3$, also\nstable at zero magnetic field, enabling proximity coupling between\nsuperconductivity and fractionally charged edge modes. Finally, we show that\nintegrating an additional transition metal dichalcogenide layer to the\nheterostructure enhances the maximum superconducting critical temperature and\nnucleates new superconducting pockets, while leaving the topology of $\\nu = -1$\nthe quantum anomalous Hall state intact. Our results pave the way for hybrid\ninterfaces between superconductors and topological edge states in the\nlow-disorder limit.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Strongly Correlated Electrons","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kHsgbpMLqkLMzHBRDJIa_-_Q6TV1NFy8RaxYSLmlklw","pdfSize":"5995494"}
