{"id":"2408.08126","title":"Decoding Memes: A Comparative Study of Machine Learning Models for\n  Template Identification","authors":"Levente Murg\\'as, Marcell Nagy, Kate Barnes, Roland Molontay","authorsParsed":[["Murgás","Levente",""],["Nagy","Marcell",""],["Barnes","Kate",""],["Molontay","Roland",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:52:06 GMT"}],"updateDate":"2024-08-16","timestamp":1723726326000,"abstract":"  Image-with-text memes combine text with imagery to achieve comedy, but in\ntoday's world, they also play a pivotal role in online communication,\ninfluencing politics, marketing, and social norms. A \"meme template\" is a\npreexisting layout or format that is used to create memes. It typically\nincludes specific visual elements, characters, or scenes with blank spaces or\ncaptions that can be customized, allowing users to easily create their versions\nof popular meme templates by adding personal or contextually relevant content.\nDespite extensive research on meme virality, the task of automatically\nidentifying meme templates remains a challenge.\n  This paper presents a comprehensive comparison and evaluation of existing\nmeme template identification methods, including both established approaches\nfrom the literature and novel techniques. We introduce a rigorous evaluation\nframework that not only assesses the ability of various methods to correctly\nidentify meme templates but also tests their capacity to reject non-memes\nwithout false assignments. Our study involves extensive data collection from\nsites that provide meme annotations (Imgflip) and various social media\nplatforms (Reddit, X, and Facebook) to ensure a diverse and representative\ndataset. We compare meme template identification methods, highlighting their\nstrengths and limitations. These include supervised and unsupervised\napproaches, such as convolutional neural networks, distance-based\nclassification, and density-based clustering. Our analysis helps researchers\nand practitioners choose suitable methods and points to future research\ndirections in this evolving field.\n","subjects":["Computing Research Repository/Computers and Society"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/"}