{"id":"2408.16079","title":"Shape It Up: An Empirically Grounded Approach for Designing Shape\n  Palettes","authors":"Chin Tseng, Arran Zeyu Wang, Ghulam Jilani Quadri, Danielle Albers\n  Szafir","authorsParsed":[["Tseng","Chin",""],["Wang","Arran Zeyu",""],["Quadri","Ghulam Jilani",""],["Szafir","Danielle Albers",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 18:20:50 GMT"}],"updateDate":"2024-08-30","timestamp":1724869250000,"abstract":"  Shape is commonly used to distinguish between categories in multi-class\nscatterplots. However, existing guidelines for choosing effective shape\npalettes rely largely on intuition and do not consider how these needs may\nchange as the number of categories increases. Although shapes can be a finite\nnumber compared to colors, they can not be represented by a numerical space,\nmaking it difficult to propose a general guideline for shape choices or shed\nlight on the design heuristics of designer-crafted shape palettes. This paper\npresents a series of four experiments evaluating the efficiency of 39 shapes\nacross three tasks -- relative mean judgment tasks, expert choices, and data\ncorrelation estimation. Given how complex and tangled results are, rather than\nrelying on conventional features for modeling, we built a model and introduced\na corresponding design tool that offers recommendations for shape encodings.\nThe perceptual effectiveness of shapes significantly varies across specific\npairs, and certain shapes may enhance perceptual efficiency and accuracy.\nHowever, how performance varies does not map well to classical features of\nshape such as angles, fill, or convex hull. We developed a model based on\npairwise relations between shapes measured in our experiments and the number of\nshapes required to intelligently recommend shape palettes for a given design.\nThis tool provides designers with agency over shape selection while\nincorporating empirical elements of perceptual performance captured in our\nstudy. Our model advances the understanding of shape perception in\nvisualization contexts and provides practical design guidelines for advanced\nshape usage in visualization design that optimize perceptual efficiency.\n","subjects":["Computing Research Repository/Human-Computer Interaction"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}