{"id":"2408.10631","title":"LLM-Barber: Block-Aware Rebuilder for Sparsity Mask in One-Shot for\n  Large Language Models","authors":"Yupeng Su, Ziyi Guan, Xiaoqun Liu, Tianlai Jin, Dongkuan Wu, Graziano\n  Chesi, Ngai Wong, Hao Yu","authorsParsed":[["Su","Yupeng",""],["Guan","Ziyi",""],["Liu","Xiaoqun",""],["Jin","Tianlai",""],["Wu","Dongkuan",""],["Chesi","Graziano",""],["Wong","Ngai",""],["Yu","Hao",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 08:13:52 GMT"}],"updateDate":"2024-08-21","timestamp":1724141632000,"abstract":"  Large language models (LLMs) have grown significantly in scale, leading to a\ncritical need for efficient model pruning techniques. Existing post-training\npruning techniques primarily focus on measuring weight importance on converged\ndense models to determine salient weights to retain. However, they often\noverlook the changes in weight importance during the pruning process, which can\nlead to performance degradation in the pruned models. To address this issue, we\npresent LLM-Barber (Block-Aware Rebuilder for Sparsity Mask in One-Shot), a\nnovel one-shot pruning framework that rebuilds the sparsity mask of pruned\nmodels without any retraining or weight reconstruction. LLM-Barber incorporates\nblock-aware error optimization across Self-Attention and MLP blocks, ensuring\nglobal performance optimization. Inspired by the recent discovery of prominent\noutliers in LLMs, LLM-Barber introduces an innovative pruning metric that\nidentifies weight importance using weights multiplied by gradients. Our\nexperiments show that LLM-Barber can efficiently prune models like LLaMA and\nOPT families with 7B to 13B parameters on a single A100 GPU in just 30 minutes,\nachieving state-of-the-art results in both perplexity and zero-shot performance\nacross various language benchmarks. Code is available at\nhttps://github.com/YupengSu/LLM-Barber.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}