{"id":"2408.10294","title":"Relation between interface symmetry and propagation robustness along\n  domain walls based on valley topological photonic crystals","authors":"Ga\\\"etan L\\'ev\\^eque, Pascal Szriftgiser, Alberto Amo, Yan Pennec","authorsParsed":[["Lévêque","Gaëtan",""],["Szriftgiser","Pascal",""],["Amo","Alberto",""],["Pennec","Yan",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 17:56:43 GMT"}],"updateDate":"2024-08-21","timestamp":1724090203000,"abstract":"  Valley photonic crystals provide efficient designs for the routing of light\nthrough channels in extremely compact geometries. The topological origin of the\nrobust transport and the specific geometries under which it can take place have\nbeen questioned in recent works. In this article, we introduce a design for\nvalley photonic crystals with richer arrangement possibilities than the\nstandard valley photonic crystals based on two holes of different sizes in the\nunit cell. Our approach is based on the permutation of three sets of rhombi in\nan hexagonal lattice to investigate the interplay between Berry curvature,\nvalley Chern number and chirality of interfaces to achieve robust edge-modes\npropagation along domain walls. We study three types of interfaces with\ndifferent symmetries: the non-chiral interface with glide-mirror symmetry\ncommonly used in honeycomb-type valley crystals, and two chiral interfaces with\nor without inversion symmetry of the adjacent bulk lattices. In the latter\ncase, no valley topology is expected. We show that for the three families,\nedges preserving the shape of the interface through 120{\\deg} sharp corners can\nsustain edge-modes with comparable robustness. Moreover, interfaces with\nglide-mirror symmetry offer promising performances in circuits with more exotic\nconfigurations, like 60{\\deg} and 90{\\deg} corners or arbitrary curves in which\nvalley preservation is not guaranteed. Our work raises questions about the\ntopological origin of the robustness of transport in valley photonic crystals,\ndiscusses the role of the chirality of the interfaces in the propagation around\nsharp corners, and provides a lattice scheme with broad design possibilities.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by/4.0/"}