{"id":"2408.11305","title":"UniFashion: A Unified Vision-Language Model for Multimodal Fashion\n  Retrieval and Generation","authors":"Xiangyu Zhao, Yuehan Zhang, Wenlong Zhang, Xiao-Ming Wu","authorsParsed":[["Zhao","Xiangyu",""],["Zhang","Yuehan",""],["Zhang","Wenlong",""],["Wu","Xiao-Ming",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 03:17:20 GMT"}],"updateDate":"2024-08-22","timestamp":1724210240000,"abstract":"  The fashion domain encompasses a variety of real-world multimodal tasks,\nincluding multimodal retrieval and multimodal generation. The rapid\nadvancements in artificial intelligence generated content, particularly in\ntechnologies like large language models for text generation and diffusion\nmodels for visual generation, have sparked widespread research interest in\napplying these multimodal models in the fashion domain. However, tasks\ninvolving embeddings, such as image-to-text or text-to-image retrieval, have\nbeen largely overlooked from this perspective due to the diverse nature of the\nmultimodal fashion domain. And current research on multi-task single models\nlack focus on image generation. In this work, we present UniFashion, a unified\nframework that simultaneously tackles the challenges of multimodal generation\nand retrieval tasks within the fashion domain, integrating image generation\nwith retrieval tasks and text generation tasks. UniFashion unifies embedding\nand generative tasks by integrating a diffusion model and LLM, enabling\ncontrollable and high-fidelity generation. Our model significantly outperforms\nprevious single-task state-of-the-art models across diverse fashion tasks, and\ncan be readily adapted to manage complex vision-language tasks. This work\ndemonstrates the potential learning synergy between multimodal generation and\nretrieval, offering a promising direction for future research in the fashion\ndomain. The source code is available at\nhttps://github.com/xiangyu-mm/UniFashion.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"IdQSbUVAxWt-r2IVjxCQNRZ5S3YZJ2FYqd1TCrBhEfM","pdfSize":"1577496"}
