{"id":"2408.06463","title":"Statistical Quality Comparison of the Bitstrings Generated by a Physical\n  Unclonable Function across Xilinx, Altera and Microsemi Devices","authors":"Jenilee Jao and Kristi Hoffman and Cheryl Reid and Ryan Thomson and\n  Michael Thompson and Jim Plusquellic","authorsParsed":[["Jao","Jenilee",""],["Hoffman","Kristi",""],["Reid","Cheryl",""],["Thomson","Ryan",""],["Thompson","Michael",""],["Plusquellic","Jim",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:28:57 GMT"}],"updateDate":"2024-08-14","timestamp":1723490937000,"abstract":"  Entropy or randomness represents a foundational security property in\nsecurity-related operations, such as key generation. Key generation in turn is\ncentral to security protocols such as authentication and encryption. Physical\nunclonable functions (PUF) are hardware-based primitives that can serve as key\ngeneration engines in modern microelectronic devices and applications. PUFs\nderive entropy from manufacturing variations that exist naturally within and\nacross otherwise identical copies of a device. However, the levels of random\nvariations that represent entropy, which are strongly correlated to the quality\nof the PUF-generated bitstrings, vary from one manufacturer to another. In this\npaper, we evaluate entropy across a set of devices manufactured by three\nmainstream FPGA vendors, Xilinx, Altera and Microsemi. The devices selected for\nevaluation are considered low-end commercial devices to make the analysis\nrelevant to IoT applications. The SiRF PUF is used in the evaluation, and is\nconstructed nearly identically across the three vendor devices, setting aside\nminor differences that exist in certain logic element primitives used within\nthe PUF architecture, and which have only a minor impact on our comparative\nanalysis. The SiRF PUF uses a high-resolution time-to-digital converter (TDC)\ncrafted from high-speed carry-chain logic embedded within each device to\nmeasure path delays in an engineered netlist of logic gates as a source of\nentropy. Therefore, our analysis includes an evaluation of actual path delay\nvariation as it exists across the three device classes, as well as a\nstatistical evaluation of the PUF-generated bitstrings. A reliablity analysis\nis also provided using data collected in industrial-standard temperature\nexperiments to round out the evaluation of important statistical properties of\nthe PUF.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"eEGgSsb2mTdKVdMG_7Lv6z9fdX5HSOvrzk0gv5ToxGk","pdfSize":"19549855"}
