{"id":"2408.06383","title":"Dilated Convolution with Learnable Spacings","authors":"Ismail Khalfaoui-Hassani","authorsParsed":[["Khalfaoui-Hassani","Ismail",""]],"versions":[{"version":"v1","created":"Sat, 10 Aug 2024 12:12:39 GMT"}],"updateDate":"2024-08-14","timestamp":1723291959000,"abstract":"  This thesis presents and evaluates the Dilated Convolution with Learnable\nSpacings (DCLS) method. Through various supervised learning experiments in the\nfields of computer vision, audio, and speech processing, the DCLS method proves\nto outperform both standard and advanced convolution techniques. The research\nis organized into several steps, starting with an analysis of the literature\nand existing convolution techniques that preceded the development of the DCLS\nmethod. We were particularly interested in the methods that are closely related\nto our own and that remain essential to capture the nuances and uniqueness of\nour approach. The cornerstone of our study is the introduction and application\nof the DCLS method to convolutional neural networks (CNNs), as well as to\nhybrid architectures that rely on both convolutional and visual attention\napproaches. DCLS is shown to be particularly effective in tasks such as\nclassification, semantic segmentation, and object detection. Initially using\nbilinear interpolation, the study also explores other interpolation methods,\nfinding that Gaussian interpolation slightly improves performance. The DCLS\nmethod is further applied to spiking neural networks (SNNs) to enable synaptic\ndelay learning within a neural network that could eventually be transferred to\nso-called neuromorphic chips. The results show that the DCLS method stands out\nas a new state-of-the-art technique in SNN audio classification for certain\nbenchmark tasks in this field. These tasks involve datasets with a high\ntemporal component. In addition, we show that DCLS can significantly improve\nthe accuracy of artificial neural networks for the multi-label audio\nclassification task. We conclude with a discussion of the chosen experimental\nsetup, its limitations, the limitations of our method, and our results.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Sound","Electrical Engineering and Systems Science/Audio and Speech Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}