{"id":"2408.07052","title":"The News Comment Gap and Algorithmic Agenda Setting in Online Forums","authors":"Flora B\\\"owing, Patrick Gildersleve","authorsParsed":[["Böwing","Flora",""],["Gildersleve","Patrick",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 17:43:32 GMT"},{"version":"v2","created":"Fri, 23 Aug 2024 09:29:34 GMT"}],"updateDate":"2024-08-26","timestamp":1723571012000,"abstract":"  The disparity between news stories valued by journalists and those preferred\nby readers, known as the \"News Gap\", is well-documented. However, the\ndifference in expectations regarding news related user-generated content is\nless studied. Comment sections, hosted by news websites, are popular venues for\nreader engagement, yet still subject to editorial decisions. It is thus\nimportant to understand journalist vs reader comment preferences and how these\nare served by various comment ranking algorithms that represent discussions\ndifferently. We analyse 1.2 million comments from Austrian newspaper Der\nStandard to understand the \"News Comment Gap\" and the effects of different\nranking algorithms. We find that journalists prefer positive, timely, complex,\ndirect responses, while readers favour comments similar to article content from\nelite authors. We introduce the versatile Feature-Oriented Ranking Utility\nMetric (FORUM) to assess the impact of different ranking algorithms and find\ndramatic differences in how they prioritise the display of comments by\nsentiment, topical relevance, lexical diversity, and readability. Journalists\ncan exert substantial influence over the discourse through both curatorial and\nalgorithmic means. Understanding these choices' implications is vital in\nfostering engaging and civil discussions while aligning with journalistic\nobjectives, especially given the increasing legal scrutiny and societal\nimportance of online discourse.\n","subjects":["Computing Research Repository/Computers and Society","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computation and Language","Computing Research Repository/Social and Information Networks","Physics/Physics and Society"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xWZtPTIPOpEvCIqM28XPUALr2R9OyeC9PaoEUze3MSA","pdfSize":"2631968"}
