{"id":"2408.04301","title":"Tackling Noisy Clients in Federated Learning with End-to-end Label\n  Correction","authors":"Xuefeng Jiang, Sheng Sun, Jia Li, Jingjing Xue, Runhan Li, Zhiyuan Wu,\n  Gang Xu, Yuwei Wang, Min Liu","authorsParsed":[["Jiang","Xuefeng",""],["Sun","Sheng",""],["Li","Jia",""],["Xue","Jingjing",""],["Li","Runhan",""],["Wu","Zhiyuan",""],["Xu","Gang",""],["Wang","Yuwei",""],["Liu","Min",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 08:35:32 GMT"}],"updateDate":"2024-08-09","timestamp":1723106132000,"abstract":"  Recently, federated learning (FL) has achieved wide successes for diverse\nprivacy-sensitive applications without sacrificing the sensitive private\ninformation of clients. However, the data quality of client datasets can not be\nguaranteed since corresponding annotations of different clients often contain\ncomplex label noise of varying degrees, which inevitably causes the performance\ndegradation. Intuitively, the performance degradation is dominated by clients\nwith higher noise rates since their trained models contain more misinformation\nfrom data, thus it is necessary to devise an effective optimization scheme to\nmitigate the negative impacts of these noisy clients. In this work, we propose\na two-stage framework FedELC to tackle this complicated label noise issue. The\nfirst stage aims to guide the detection of noisy clients with higher label\nnoise, while the second stage aims to correct the labels of noisy clients' data\nvia an end-to-end label correction framework which is achieved by learning\npossible ground-truth labels of noisy clients' datasets via back propagation.\nWe implement sixteen related methods and evaluate five datasets with three\ntypes of complicated label noise scenarios for a comprehensive comparison.\nExtensive experimental results demonstrate our proposed framework achieves\nsuperior performance than its counterparts for different scenarios.\nAdditionally, we effectively improve the data quality of detected noisy\nclients' local datasets with our label correction framework. The code is\navailable at https://github.com/Sprinter1999/FedELC.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"rfRmWeZjti-2Em2iuY4Uth3xk_E93_ydRubIo0CosmA","pdfSize":"1743699"}
