{"id":"2408.15415","title":"Hybrid Plant Models Call for a Different Plant Modelling Paradigm and a\n  New Generation of Software (Heresy in the land of moles, fractions, &\n  rigorous physical properties)","authors":"Vladimir Mahalec","authorsParsed":[["Mahalec","Vladimir",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 21:45:09 GMT"}],"updateDate":"2024-08-29","timestamp":1724795109000,"abstract":"  This paper is an invitation to the process systems engineering community to\nchange the paradigm for process plants. The goal is to achieve much easier\nconvergence while retaining accuracy on par with the rigorous models. Accurate\nplant models of existing plants can be linear or much less nonlinear if they\nare based on mass component flows and stream properties per unit mass\nproperties instead of molar flows and mole fractions. Accurate stream\nproperties per unit mass can be calculated at stream specific conditions by\nlinear approximations which in many instances eliminates mole fraction-based\nflash calculations. Hybrid data-driven node models fit naturally in this\nparadigm, since they used measured data, which is either in mass or in\nvolumetric units, but never in moles. Instantiation of models at all levels of\nabstraction (planning, scheduling, optimization, and control models) from the\nsame plant topology representation will ensure inheritance of solutions from\nmass-only to mass-and-energy to mass-and-energy-and-stream-properties, thereby\nensuring consistency of solutions between these models. None of the existing\nsoftware provides inheritance between different levels of plant abstraction\n(i.e. inheritance between models for different business applications) or\ndifferent levels of abstractions per plant sections or per time periods, which\nmotivates this exposition.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}