{"id":"2408.15270","title":"SkillMimic: Learning Reusable Basketball Skills from Demonstrations","authors":"Yinhuai Wang, Qihan Zhao, Runyi Yu, Ailing Zeng, Jing Lin, Zhengyi\n  Luo, Hok Wai Tsui, Jiwen Yu, Xiu Li, Qifeng Chen, Jian Zhang, Lei Zhang, Ping\n  Tan","authorsParsed":[["Wang","Yinhuai",""],["Zhao","Qihan",""],["Yu","Runyi",""],["Zeng","Ailing",""],["Lin","Jing",""],["Luo","Zhengyi",""],["Tsui","Hok Wai",""],["Yu","Jiwen",""],["Li","Xiu",""],["Chen","Qifeng",""],["Zhang","Jian",""],["Zhang","Lei",""],["Tan","Ping",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:19:04 GMT"}],"updateDate":"2024-08-29","timestamp":1723475944000,"abstract":"  Mastering basketball skills such as diverse layups and dribbling involves\ncomplex interactions with the ball and requires real-time adjustments.\nTraditional reinforcement learning methods for interaction skills rely on\nlabor-intensive, manually designed rewards that do not generalize well across\ndifferent skills. Inspired by how humans learn from demonstrations, we propose\nSkillMimic, a data-driven approach that mimics both human and ball motions to\nlearn a wide variety of basketball skills. SkillMimic employs a unified\nconfiguration to learn diverse skills from human-ball motion datasets, with\nskill diversity and generalization improving as the dataset grows. This\napproach allows training a single policy to learn multiple skills, enabling\nsmooth skill switching even if these switches are not present in the reference\ndataset. The skills acquired by SkillMimic can be easily reused by a high-level\ncontroller to accomplish complex basketball tasks. To evaluate our approach, we\nintroduce two basketball datasets: one estimated through monocular RGB videos\nand the other using advanced motion capture equipment, collectively containing\nabout 35 minutes of diverse basketball skills. Experiments show that our method\ncan effectively learn various basketball skills included in the dataset with a\nunified configuration, including various styles of dribbling, layups, and\nshooting. Furthermore, by training a high-level controller to reuse the\nacquired skills, we can achieve complex basketball tasks such as layup scoring,\nwhich involves dribbling toward the basket, timing the dribble and layup to\nscore, retrieving the rebound, and repeating the process. The project page and\nvideo demonstrations are available at https://ingrid789.github.io/SkillMimic/\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Graphics","Computing Research Repository/Machine Learning","Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}