{"id":"2408.04767","title":"Data-Driven Pixel Control: Challenges and Prospects","authors":"Saurabh Farkya, Zachary Alan Daniels, Aswin Raghavan, Gooitzen van der\n  Wal, Michael Isnardi, Michael Piacentino, David Zhang","authorsParsed":[["Farkya","Saurabh",""],["Daniels","Zachary Alan",""],["Raghavan","Aswin",""],["van der Wal","Gooitzen",""],["Isnardi","Michael",""],["Piacentino","Michael",""],["Zhang","David",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 21:49:19 GMT"}],"updateDate":"2024-08-12","timestamp":1723153759000,"abstract":"  Recent advancements in sensors have led to high resolution and high data\nthroughput at the pixel level. Simultaneously, the adoption of increasingly\nlarge (deep) neural networks (NNs) has lead to significant progress in computer\nvision. Currently, visual intelligence comes at increasingly high computational\ncomplexity, energy, and latency. We study a data-driven system that combines\ndynamic sensing at the pixel level with computer vision analytics at the video\nlevel and propose a feedback control loop to minimize data movement between the\nsensor front-end and computational back-end without compromising detection and\ntracking precision. Our contributions are threefold: (1) We introduce\nanticipatory attention and show that it leads to high precision prediction with\nsparse activation of pixels; (2) Leveraging the feedback control, we show that\nthe dimensionality of learned feature vectors can be significantly reduced with\nincreased sparsity; and (3) We emulate analog design choices (such as varying\nRGB or Bayer pixel format and analog noise) and study their impact on the key\nmetrics of the data-driven system. Comparative analysis with traditional pixel\nand deep learning models shows significant performance enhancements. Our system\nachieves a 10X reduction in bandwidth and a 15-30X improvement in Energy-Delay\nProduct (EDP) when activating only 30% of pixels, with a minor reduction in\nobject detection and tracking precision. Based on analog emulation, our system\ncan achieve a throughput of 205 megapixels/sec (MP/s) with a power consumption\nof only 110 mW per MP, i.e., a theoretical improvement of ~30X in EDP.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Systems and Control","Electrical Engineering and Systems Science/Systems and Control"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"-zKvItVhmLtrmMpvgNKSjqc-HdMtCY9_iWNtSQIs6jI","pdfSize":"358394"}
