{"id":"2408.08842","title":"Phase-Separated Charge Order and Twinning Across Length Scales in\n  CsV$_3$Sb$_5$","authors":"Jayden Plumb, Andrea Capa Salinas, Krishnanand Mallayya, Elliot\n  Kisiel, Fellipe B. Carneiro, Reina Gomez, Ganesh Pokharel, Eun-Ah Kim,\n  Suchismita Sarker, Zahirul Islam, Sam Daly and Stephen D. Wilson","authorsParsed":[["Plumb","Jayden",""],["Salinas","Andrea Capa",""],["Mallayya","Krishnanand",""],["Kisiel","Elliot",""],["Carneiro","Fellipe B.",""],["Gomez","Reina",""],["Pokharel","Ganesh",""],["Kim","Eun-Ah",""],["Sarker","Suchismita",""],["Islam","Zahirul",""],["Daly","Sam",""],["Wilson","Stephen D.",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 17:04:41 GMT"},{"version":"v2","created":"Mon, 19 Aug 2024 22:14:09 GMT"}],"updateDate":"2024-09-09","timestamp":1723827881000,"abstract":"  We present X-ray scattering studies resolving structural twinning and phase\nseparation in the charge density wave (CDW) state of the kagome superconductor\nCsV$_3$Sb$_5$. The three-dimensional CDW state in CsV$_3$Sb$_5$ is reported to\nform a complex superposition of Star of David (SoD) or Tri-Hexagonal (TrH)\npatterns of distortion within its kagome planes, but the out-of-plane stacking\nis marked by metastability. In order to resolve the impact of this\nmetastability, we present reciprocal space mapping and real-space images of\nCsV$_3$Sb$_5$ collected across multiple length scales using\ntemperature-dependent high-dynamic range mapping (HDRM) and dark-field X-ray\nmicroscopy (DFXM). The experimental data provide evidence for a rich\nmicrostructure that forms in the CDW state. Data evidence metastability in the\nformation of $2\\times 2\\times 4$ and $2\\times 2\\times 2$ CDW supercells\ndependent on thermal history and mechanical deformation. We further directly\nresolve the real space phase segregation of both supercells as well as a\nreal-space, structural twinning driven by the broken rotational symmetry of the\nCDW state. Our combined results provide insights into the role of\nmicrostructure and twinning in experiments probing the electronic properties of\nCsV$_3$Sb$_5$ where rotational symmetry is broken by the three-dimensional\ncharge density wave order but locally preserved for any single kagome layer.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Superconductivity"],"license":"http://creativecommons.org/licenses/by/4.0/"}