{"id":"2408.12501","title":"Tunneling photo-thermoelectric effect in monolayer graphene/bilayer\n  hexagonal boron nitride/bilayer graphene asymmetric van der Waals tunnel\n  junctions","authors":"Sabin Park, Rai Moriya, Yijin Zhang, Kenji Watanabe, Takashi\n  Taniguchi, Tomoki Machida","authorsParsed":[["Park","Sabin",""],["Moriya","Rai",""],["Zhang","Yijin",""],["Watanabe","Kenji",""],["Taniguchi","Takashi",""],["Machida","Tomoki",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 15:52:04 GMT"}],"updateDate":"2024-08-23","timestamp":1724341924000,"abstract":"  Graphene is known to exhibit a pronounced photo-thermoelectric effect (PTE)\nin its in-plane carrier transport and attracting attention toward various\noptoelectronic applications. In this study, we demonstrate an out-of-plane PTE\nby utilizing electron tunneling across a barrier, namely, the tunneling\nphoto-thermoelectric effect (TPTE). This was achieved in a monolayer graphene\n(MLG)/bilayer hexagonal boron nitride (h-BN)/bilayer graphene (BLG) asymmetric\ntunnel junction. MLG and BLG exhibit different cyclotron resonance (CR) optical\nabsorption energies when their energies are Landau quantized under an\nout-of-plane magnetic field. We tuned the magnetic field under mid-infrared\n(MIR) irradiation to bring MLG into CR conditions, whereas BLG was not in CR.\nThe CR absorption in the MLG generates an electron temperature difference\nbetween the MLG and BLG, and induces an out-of-plane TPTE voltage across the\nh-BN tunnel barrier. The TPTE exhibited a unique dependence on the Fermi energy\nof the MLG, which differed from that of the in-plane PTE of the MLG. The TPTE\nsignal was large when the Fermi energy of the MLG was tuned near the phase\ntransition between the quantum Hall state (QHS) and non-QHS, that is, the\ntransition between carrier localization and delocalization. The TPTE provides\nanother degree of freedom for probing the electronic and optoelectronic\nproperties of two-dimensional material heterostructures.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}