{"id":"2408.17250","title":"The Pristine Survey -- XXVII. Journey to the Galactic outskirts --\n  Mapping the outer halo red giant stars down to the very metal-poor end","authors":"Akshara Viswanathan, Amanda Bystr\\\"om, Else Starkenburg, Anne Foppen,\n  Jill Straat, Martin Montelius, Federico Sestito, Kim A. Venn, Camila\n  Navarrete, Tadafumi Matsuno, Nicolas F. Martin, Guillaume F. Thomas, Anke\n  Ardern-Arentsen, Giuseppina Battaglia, Morgan Fouesneau, Julio Navarro, Sara\n  Vitali","authorsParsed":[["Viswanathan","Akshara",""],["Byström","Amanda",""],["Starkenburg","Else",""],["Foppen","Anne",""],["Straat","Jill",""],["Montelius","Martin",""],["Sestito","Federico",""],["Venn","Kim A.",""],["Navarrete","Camila",""],["Matsuno","Tadafumi",""],["Martin","Nicolas F.",""],["Thomas","Guillaume F.",""],["Ardern-Arentsen","Anke",""],["Battaglia","Giuseppina",""],["Fouesneau","Morgan",""],["Navarro","Julio",""],["Vitali","Sara",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 12:49:29 GMT"}],"updateDate":"2024-09-02","timestamp":1725022169000,"abstract":"  Context: In the context of Galactic archaeology, the outer halo remains\nrelatively unexplored with respect to its metallicity distribution, merger\ndebris, and the abundance of known very/extremely metal-poor ([Fe/H]<-2.5)\nstars. Aim: We utilize the Pristine survey's publicly available, Pristine data\nrelease 1 (PDR1) and Pristine-Gaia synthetic (PGS) catalogues of photometric\nmetallicities, to select Red Giant Branch (RGB) stars in the outer halo.\nMethods: The RGB selection pipeline selects giants based on the absence of a\nwell-measured parallax in the brightness range where dwarfs have reasonable\nparallax estimate from Gaia DR3 data. The photometric distances are calculated\nusing a BaSTI-isochrone fitting code and the photometric metallicities.\nResults: Photometric distances derived from PDR1- and PGS-giants show typical\nuncertainties of 12% and a scatter of up to 20% and 40% respectively, when\nvalidated against inverted-parallax and Starhorse-code distances. The\nPDR1-giants catalogue provides a low-to-no bias view of the metallicity\nstructure versus distance compared to the PGS-giants catalogue (with a\ndistance-metallicity selection bias), while the PGS-giants catalogue provides\nan all-sky view of the outer halo, especially in the VMP end. The PDR1-giants\ncatalogue is used to study the metallicity distribution function of the halo\nout to ~100 kpc, using Gaussian Mixture Model decomposition. Additionally, we\nuse the PDR1-giants with radial velocities from spectroscopic surveys to map\nthe metallicity view of the integrals-of-motion space where accreted dwarf\ngalaxy debris conserve their orbital parameters for a long time. Using the\nPGS-giants catalogue, we associate 41 stars tentatively to the stellar\ncounterpart of the Magellanic stream in the VMP end, out to 70 kpc.\nConclusions: We publish two RGB catalogues between -4.0<[Fe/H]<+0.1 with\nreliable photometric distances and metallicities.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}