{"id":"2408.01571","title":"Counterfactual Explanations for Medical Image Classification and\n  Regression using Diffusion Autoencoder","authors":"Matan Atad, David Schinz, Hendrik Moeller, Robert Graf, Benedikt\n  Wiestler, Daniel Rueckert, Nassir Navab, Jan S. Kirschke, Matthias Keicher","authorsParsed":[["Atad","Matan",""],["Schinz","David",""],["Moeller","Hendrik",""],["Graf","Robert",""],["Wiestler","Benedikt",""],["Rueckert","Daniel",""],["Navab","Nassir",""],["Kirschke","Jan S.",""],["Keicher","Matthias",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 21:01:30 GMT"}],"updateDate":"2024-08-06","timestamp":1722632490000,"abstract":"  Counterfactual explanations (CEs) aim to enhance the interpretability of\nmachine learning models by illustrating how alterations in input features would\naffect the resulting predictions. Common CE approaches require an additional\nmodel and are typically constrained to binary counterfactuals. In contrast, we\npropose a novel method that operates directly on the latent space of a\ngenerative model, specifically a Diffusion Autoencoder (DAE). This approach\noffers inherent interpretability by enabling the generation of CEs and the\ncontinuous visualization of the model's internal representation across decision\nboundaries.\n  Our method leverages the DAE's ability to encode images into a semantically\nrich latent space in an unsupervised manner, eliminating the need for labeled\ndata or separate feature extraction models. We show that these latent\nrepresentations are helpful for medical condition classification and the\nordinal regression of severity pathologies, such as vertebral compression\nfractures (VCF) and diabetic retinopathy (DR). Beyond binary CEs, our method\nsupports the visualization of ordinal CEs using a linear model, providing\ndeeper insights into the model's decision-making process and enhancing\ninterpretability.\n  Experiments across various medical imaging datasets demonstrate the method's\nadvantages in interpretability and versatility. The linear manifold of the\nDAE's latent space allows for meaningful interpolation and manipulation, making\nit a powerful tool for exploring medical image properties. Our code is\navailable at https://github.com/matanat/dae_counterfactual.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"m3lhz2WhHuPfcMmrQS9E9NzAZFgpdAVdTC-CS_S0MHw","pdfSize":"18855675"}
