{"id":"2408.12966","title":"pyPCG: A Python Toolbox Specialized for Phonocardiography Analysis","authors":"Krist\\'of M\\\"uller, Janka Hatvani, Mikl\\'os Koller, M\\'arton \\'Aron\n  Goda","authorsParsed":[["Müller","Kristóf",""],["Hatvani","Janka",""],["Koller","Miklós",""],["Goda","Márton Áron",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 10:27:02 GMT"}],"updateDate":"2024-08-26","timestamp":1724408822000,"abstract":"  Phonocardiography has recently gained popularity in low-cost and remote\nmonitoring, including passive fetal heart monitoring. Development for methods\nwhich analyse phonocardiographical data try to capitalize on this opportunity,\nand in recent years a multitude of such algorithms and models have been\npublished. Although there is little to no standardization in these published\nalgorithms and multiple parts of these models have to be reimplemented on a\ncase-by-case basis. Datasets containing heart sound recordings also lack\nstandardization in both data storage and labeling, especially in fetal\nphonocardiography. We are presenting a toolbox that can serve as a basis for a\nfuture standard framework for heart sound analysis. This toolbox contains some\nof the most widely used processing steps, and with these, complex analysis\nprocesses can be created. These functions can be individually tested. Due to\nthe interdependence of the steps, we validated the current segmentation stage\nusing a manually labeled fetal phonocardiogram dataset comprising 50 one-minute\nabdominal PCG recordings, which include 6,758 S1 and 6,729 S2 labels. Our\nresults were compared to other common and available segmentation methods, peak\ndetection with the Neurokit2 library, and the Hidden Semi-Markov Model by\nSpringer et al. With a 30 ms tolerance our best model achieved a 97.1% F1 score\nand 10.8 +/- 7.9 ms mean absolute error for S1 detection. This detection\naccuracy outperformed all tested methods. With this a more accurate S2\ndetection method can be created as a multi-step process. After an accurate\nsegmentation the extracted features should be representative of the selected\nsegments, which allows for more accurate statistics or classification models.\nThe toolbox contains functions for both feature extraction and statistics\ncreation which are compatible with the previous steps.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"iYtctBcOoJq21lGUP1Q5lW02W22WY2k2qAUtVZOurxA","pdfSize":"1438995"}
