{"id":"2408.13656","title":"Localize-and-Stitch: Efficient Model Merging via Sparse Task Arithmetic","authors":"Yifei He, Yuzheng Hu, Yong Lin, Tong Zhang, Han Zhao","authorsParsed":[["He","Yifei",""],["Hu","Yuzheng",""],["Lin","Yong",""],["Zhang","Tong",""],["Zhao","Han",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 19:14:02 GMT"}],"updateDate":"2024-08-28","timestamp":1724526842000,"abstract":"  Model merging offers an effective strategy to combine the strengths of\nmultiple finetuned models into a unified model that preserves the specialized\ncapabilities of each. Existing methods merge models in a global manner,\nperforming arithmetic operations across all model parameters. However, such\nglobal merging often leads to task interference, degrading the performance of\nthe merged model. In this work, we introduce Localize-and-Stitch, a novel\napproach that merges models in a localized way. Our algorithm works in two\nsteps: i) Localization: identify tiny ($1\\%$ of the total parameters) localized\nregions in the finetuned models containing essential skills for the downstream\ntasks, and ii) Stitching: reintegrate only these essential regions back into\nthe pretrained model for task synergy. We demonstrate that our approach\neffectively locates sparse regions responsible for finetuned performance, and\nthe localized regions could be treated as compact and interpretable\nrepresentations of the finetuned models (tasks). Empirically, we evaluate our\nmethod on various vision and language benchmarks, showing that it outperforms\nexisting model merging methods under different data availability scenarios.\nBeyond strong empirical performance, our algorithm also facilitates model\ncompression and preserves pretrained knowledge, enabling flexible and continual\nskill composition from multiple finetuned models with minimal storage and\ncomputational overhead. Our code is available at\nhttps://github.com/yifei-he/Localize-and-Stitch.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computation and Language","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}