{"id":"2408.11492","title":"Estimating Peer Direct and Indirect Effects in Observational Network\n  Data","authors":"Xiaojing Du, Jiuyong Li, Debo Cheng, Lin Liu, Wentao Gao, Xiongren\n  Chen","authorsParsed":[["Du","Xiaojing",""],["Li","Jiuyong",""],["Cheng","Debo",""],["Liu","Lin",""],["Gao","Wentao",""],["Chen","Xiongren",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:02:05 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 05:16:48 GMT"}],"updateDate":"2024-09-16","timestamp":1724234525000,"abstract":"  Estimating causal effects is crucial for decision-makers in many\napplications, but it is particularly challenging with observational network\ndata due to peer interactions. Many algorithms have been proposed to estimate\ncausal effects involving network data, particularly peer effects, but they\noften overlook the variety of peer effects. To address this issue, we propose a\ngeneral setting which considers both peer direct effects and peer indirect\neffects, and the effect of an individual's own treatment, and provide\nidentification conditions of these causal effects and proofs. To estimate these\ncausal effects, we utilize attention mechanisms to distinguish the influences\nof different neighbors and explore high-order neighbor effects through\nmulti-layer graph neural networks (GNNs). Additionally, to control the\ndependency between node features and representations, we incorporate the\nHilbert-Schmidt Independence Criterion (HSIC) into the GNN, fully utilizing the\nstructural information of the graph, to enhance the robustness and accuracy of\nthe model. Extensive experiments on two semi-synthetic datasets confirm the\neffectiveness of our approach. Our theoretical findings have the potential to\nimprove intervention strategies in networked systems, with applications in\nareas such as social networks and epidemiology.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}