{"id":"2408.00965","title":"Integrating ESG and AI: A Comprehensive Responsible AI Assessment\n  Framework","authors":"Sung Une Lee, Harsha Perera, Yue Liu, Boming Xia, Qinghua Lu, Liming\n  Zhu, Jessica Cairns, Moana Nottage","authorsParsed":[["Lee","Sung Une",""],["Perera","Harsha",""],["Liu","Yue",""],["Xia","Boming",""],["Lu","Qinghua",""],["Zhu","Liming",""],["Cairns","Jessica",""],["Nottage","Moana",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 00:58:01 GMT"},{"version":"v2","created":"Tue, 6 Aug 2024 00:12:50 GMT"}],"updateDate":"2024-08-07","timestamp":1722560281000,"abstract":"  Artificial Intelligence (AI) is a widely developed and adopted technology\nacross entire industry sectors. Integrating environmental, social, and\ngovernance (ESG) considerations with AI investments is crucial for ensuring\nethical and sustainable technological advancement. Particularly from an\ninvestor perspective, this integration not only mitigates risks but also\nenhances long-term value creation by aligning AI initiatives with broader\nsocietal goals. Yet, this area has been less explored in both academia and\nindustry. To bridge the gap, we introduce a novel ESG-AI framework, which is\ndeveloped based on insights from engagements with 28 companies and comprises\nthree key components. The framework provides a structured approach to this\nintegration, developed in collaboration with industry practitioners. The ESG-AI\nframework provides an overview of the environmental and social impacts of AI\napplications, helping users such as investors assess the materiality of AI use.\nMoreover, it enables investors to evaluate a company's commitment to\nresponsible AI through structured engagements and thorough assessment of\nspecific risk areas. We have publicly released the framework and toolkit in\nApril 2024, which has received significant attention and positive feedback from\nthe investment community. This paper details each component of the framework,\ndemonstrating its applicability in real-world contexts and its potential to\nguide ethical AI investments.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}