{"id":"2408.13113","title":"Extremal Structures with Embedded Pre-Failure Indicators","authors":"Christoffer Fyllgraf Christensen, Jonas Engqvist, Fengwen Wang, Ole\n  Sigmund, Mathias Wallin","authorsParsed":[["Christensen","Christoffer Fyllgraf",""],["Engqvist","Jonas",""],["Wang","Fengwen",""],["Sigmund","Ole",""],["Wallin","Mathias",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 14:39:24 GMT"}],"updateDate":"2024-08-26","timestamp":1724423964000,"abstract":"  Preemptive identification of potential failure under loading of engineering\nstructures is a critical challenge. Our study presents an innovative approach\nto built-in pre-failure indicators within multiscale structural designs\nutilizing the design freedom of topology optimization. The indicators are\nengineered to visibly signal load conditions approaching the global critical\nbuckling load. By showing non-critical local buckling when activated, the\nindicators provide early warning without compromising the overall structural\nintegrity of the design. This proactive safety feature enhances design\nreliability. With multiscale analysis, macroscale stresses are related to\nmicroscale buckling stability. This relationship is applied through tailored\nstress constraints to prevent local buckling in general while deliberately\ntriggering it at predefined locations under specific load conditions.\nExperimental testing of 3D-printed designs confirms a strong correlation with\nnumerical simulations. This not only demonstrates the feasibility of creating\nstructures that can signal the need for load reduction or maintenance but also\nsignificantly narrows the gap between theoretical optimization models and their\npractical application. This research contributes to the design of safer\nstructures by introducing built-in early-warning failure systems.\n","subjects":["Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"cJuqPJadoF61wukdPMwsuDrd8-OsE0OcHdRJUnW5xAw","pdfSize":"13723433"}
