{"id":"2408.12174","title":"Low Temperature Deposition of Functional Thin Films on Insulating\n  Substrates: Selective Ion Acceleration using Synchronized Floating Potential\n  HiPIMS","authors":"Jyotish Patidar (1), Oleksandr Pshyk (1), Lars Sommerh\\\"auser (1) and\n  Sebastian Siol (1) ((1) Empa, Swiss Federal Laboratories for Materials\n  Science and Technology, D\\\"ubendorf, Switzerland)","authorsParsed":[["Patidar","Jyotish",""],["Pshyk","Oleksandr",""],["Sommerhäuser","Lars",""],["Siol","Sebastian",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 07:42:00 GMT"}],"updateDate":"2024-08-23","timestamp":1724312520000,"abstract":"  Ionized physical vapor deposition techniques, such as high-power impulse\nmagnetron sputtering (HiPIMS) are gaining popularity due to their ability to\nproduce high-quality thin films at low deposition temperatures. In those\ntechniques, ions are commonly accelerated onto the growing film using negative\npotential applied to the substrate. One key challenge however is, how such\npotentials can be applied on insulating or electrically floating substrates. In\nthis work, we present a novel approach for low-temperature deposition of\nhigh-quality thin films on insulating substrates using Synchronized Floating\nPotential High-Power Impulse Magnetron Sputtering (SFP-HiPIMS). This technique\nleverages the negative floating potential, induced on the substrate during the\nHiPIMS discharge. By synchronizing the ion arrival with the substrate's\nfloating potential, specific ions can be accelerated preferentially, thereby\nenhancing adatom mobility and improving film quality while mitigating the\ndetrimental effects of Ar+ ion bombardment. Our proof-of-concept study\ndemonstrates the deposition of high-quality, textured Al0.8Sc0.2N thin films on\nvarious insulating substrates at low temperatures. We show that synchronizing\nthe Al and Sc ion fluxes with the induced negative floating potential\nsignificantly enhances the films' crystallinity, c-axis texture and at the same\ntime reduces residual stress. In addition, it enables epitaxial growth on\nsapphire at temperatures as low as 100{\\deg}C. The results of this study\ndemonstrate that SFP-HiPIMS provides a practical and economical solution for a\nlong-standing challenge in physical vapor deposition, which can be implemented\nin standard deposition equipment. SFP-HiPIMS therefore paves the way for\nadvanced manufacturing processes in various emerging technologies.\n","subjects":["Physics/Applied Physics","Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}