{"id":"2408.17128","title":"Time varying channel estimation for RIS assisted network with outdated\n  CSI: Looking beyond coherence time","authors":"Souvik Deb and Sasthi C. Ghosh","authorsParsed":[["Deb","Souvik",""],["Ghosh","Sasthi C.",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:13:41 GMT"}],"updateDate":"2024-09-02","timestamp":1725009221000,"abstract":"  The channel estimation (CE) overhead for unstructured multipath-rich channels\nincreases linearly with the number of reflective elements of reconfigurable\nintelligent surface (RIS). This results in a significant portion of the channel\ncoherence time being spent on CE, reducing data communication time.\nFurthermore, due to the mobility of the user equipment (UE) and the time\nconsumed during CE, the estimated channel state information (CSI) may become\noutdated during actual data communication. In recent studies, the timing for CE\nhas been primarily determined based on the coherence time interval, which is\ndependent on the velocity of the UE. However, the effect of the current channel\ncondition and pathloss of the UEs can also be utilized to control the duration\nbetween successive CE to reduce the overhead while still maintaining the\nquality of service. Furthermore, for muti-user systems, the appropriate\ncoherence time intervals of different users may be different depending on their\nvelocities. Therefore CE carried out ignoring the difference in coherence time\nof different UEs may result in the estimated CSI being detrimentally outdated\nfor some users. In contrast, others may not have sufficient time for data\ncommunication. To this end, based on the throughput analysis on outdated CSI,\nan algorithm has been designed to dynamically predict the next time instant for\nCE after the current CSI acquisition. In the first step, optimal RIS phase\nshifts to maximise channel gain is computed. Based on this and the amount of\ndegradation of SINR due to outdated CSI, transmit powers are allocated for the\nUEs and finally the next time instant for CE is predicted such that the\naggregated throughput is maximized. Simulation results confirm that our\nproposed algorithm outperforms the coherence time-based strategies.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://creativecommons.org/licenses/by/4.0/"}