{"id":"2408.07369","title":"ProCom: A Few-shot Targeted Community Detection Algorithm","authors":"Xixi Wu, Kaiyu Xiong, Yun Xiong, Xiaoxin He, Yao Zhang, Yizhu Jiao,\n  and Jiawei Zhang","authorsParsed":[["Wu","Xixi",""],["Xiong","Kaiyu",""],["Xiong","Yun",""],["He","Xiaoxin",""],["Zhang","Yao",""],["Jiao","Yizhu",""],["Zhang","Jiawei",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 08:34:00 GMT"}],"updateDate":"2024-08-15","timestamp":1723624440000,"abstract":"  Targeted community detection aims to distinguish a particular type of\ncommunity in the network. This is an important task with a lot of real-world\napplications, e.g., identifying fraud groups in transaction networks.\nTraditional community detection methods fail to capture the specific features\nof the targeted community and detect all types of communities indiscriminately.\nSemi-supervised community detection algorithms, emerged as a feasible\nalternative, are inherently constrained by their limited adaptability and\nsubstantial reliance on a large amount of labeled data, which demands extensive\ndomain knowledge and manual effort.\n  In this paper, we address the aforementioned weaknesses in targeted community\ndetection by focusing on few-shot scenarios. We propose ProCom, a novel\nframework that extends the ``pre-train, prompt'' paradigm, offering a\nlow-resource, high-efficiency, and transferable solution. Within the framework,\nwe devise a dual-level context-aware pre-training method that fosters a deep\nunderstanding of latent communities in the network, establishing a rich\nknowledge foundation for downstream task. In the prompt learning stage, we\nreformulate the targeted community detection task into pre-training objectives,\nallowing the extraction of specific knowledge relevant to the targeted\ncommunity to facilitate effective and efficient inference. By leveraging both\nthe general community knowledge acquired during pre-training and the specific\ninsights gained from the prompt communities, ProCom exhibits remarkable\nadaptability across different datasets. We conduct extensive experiments on\nfive benchmarks to evaluate the ProCom framework, demonstrating its SOTA\nperformance under few-shot scenarios, strong efficiency, and transferability\nacross diverse datasets.\n","subjects":["Computing Research Repository/Social and Information Networks"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}