{"id":"2408.06597","title":"Line Spectral Estimation with Unlimited Sensing","authors":"Hongwei Wang, Jun Fang, Hongbin Li, Geert Leus","authorsParsed":[["Wang","Hongwei",""],["Fang","Jun",""],["Li","Hongbin",""],["Leus","Geert",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 03:21:02 GMT"}],"updateDate":"2024-08-14","timestamp":1723519262000,"abstract":"  In the paper, we consider the line spectral estimation problem in an\nunlimited sensing framework (USF), where a modulo analog-to-digital converter\n(ADC) is employed to fold the input signal back into a bounded interval before\nquantization. Such an operation is mathematically equivalent to taking the\nmodulo of the input signal with respect to the interval. To overcome the noise\nsensitivity of higher-order difference-based methods, we explore the properties\nof the first-order difference of modulo samples, and develop two line spectral\nestimation algorithms based on first-order difference, which are robust against\nnoise. Specifically, we show that, with a high probability, the first-order\ndifference of the original samples is equivalent to that of the modulo samples.\nBy utilizing this property, line spectral estimation is solved via a robust\nsparse signal recovery approach. The second algorithms is built on our finding\nthat, with a sufficiently high sampling rate, the first-order difference of the\noriginal samples can be decomposed as a sum of the first-order difference of\nthe modulo samples and a sequence whose elements are confined to be three\npossible values. This decomposition enables us to formulate the line spectral\nestimation problem as a mixed integer linear program that can be efficiently\nsolved. Simulation results show that both proposed methods are robust against\nnoise and achieve a significant performance improvement over the higher-order\ndifference-based method.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}