{"id":"2408.02458","title":"A Minimal Stochastic Variability Model of Blazars in Turbulent Cascade","authors":"Nan Ding, Yunyong Tang, Qiusheng Gu, Rui Xue, Yongyun Chen","authorsParsed":[["Ding","Nan",""],["Tang","Yunyong",""],["Gu","Qiusheng",""],["Xue","Rui",""],["Chen","Yongyun",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 13:32:37 GMT"}],"updateDate":"2024-08-06","timestamp":1722864757000,"abstract":"  In this paper, we propose a novel minimal physical model to elucidate the\nlong-term stochastic variability of blazars. The model is built on the\nrealistic background of magnetized plasma jets dissipating energy through a\nturbulent cascade process that transfers energy to small-scale structures with\nhighly anisotropic radiation. The model demonstrates the ability to\nspontaneously generate variability features consistent with observations of\nblazars under uniformly random fluctuations in the underlying physical\nparameters. This indicates that the model possesses self-similarity across\nmultiple time scales, providing a natural explanation for the universal power\nspectral density (PSD) structure observed in different types of blazars.\nMoreover, the model exhibits that when the cascade process produces a\nrelatively flat blob energy distribution, the spectral index of the\nmodel-simulated PSD in the high-frequency regime will be steeper than that\npredicted by the Damped Random Walk (DRW) model, which is in agreement with\nrecent observations of active galactic nucleus (AGN) variability, providing a\nplausible theoretical explanation. The model is also able to reproduce the\nobserved fractional variability amplitude (FVA) characteristics of blazars, and\nsuggests that the specific particle acceleration and radiative cooling\nprocesses within the blob may not be the key factor shaping the long-term\nstochastic variability. This minimal model provides a new physical perspective\nfor understanding the long-term stochastic variability of blazars.\n","subjects":["Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"uyjCZ861vmD7PhhFEKCz_VIrbaO8CpHFNZlQEjU4294","pdfSize":"2948969","txDigest":"67PU6TVwWVi4RVNuizecCkrHAy9NwjSsiNt3iwJL7dA9","endEpoch":"1","status":"CERTIFIED"}
