{"id":"2408.01302","title":"Thermodynamics of the parity-doublet model: Asymmetric and neutron\n  matter","authors":"J\\\"urgen Eser, Jean-Paul Blaizot","authorsParsed":[["Eser","Jürgen",""],["Blaizot","Jean-Paul",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 14:44:01 GMT"}],"updateDate":"2024-08-05","timestamp":1722609841000,"abstract":"  We consider isospin-asymmetric matter in the parity-doublet model within an\nextended mean-field calculation, increasing continuously the neutron excess all\nthe way to pure neutron matter. We compute the liquid-gas and the chiral phase\ntransitions occurring at zero to moderate temperatures, but put special\nemphasis on the phase structure of matter at zero temperature and large baryon\ndensities. The calculation of the free energy involves the solution of gap\nequations. This is achieved by transforming these gap equations into ordinary\ndifferential equations that control the flow with increasing baryon density of\nvarious physical quantities: the isoscalar condensate, the densities of protons\nand neutrons, as well as those of their respective chiral partners. In this\nformulation, the initial conditions for the differential equations determine\nthe entire phase structure. It is further demonstrated that the threshold for\nthe onset of the population of the chiral partners is exclusively determined by\nthe fermionic parameters, most notably by the chiral-invariant mass of the\nnucleon. We underline the role of a parity symmetry energy in driving the\nequilibration of the nucleons and their parity partners across the chiral\ntransition. We provide a detailed analysis of the changes in the matter\nproperties as one varies the neutron excess, including a special discussion of\nthe chiral limit, and we compare systematically the parity-doublet model to its\ncorresponding singlet model, where the chiral partner of the nucleon is\nneglected. Finally, we focus on neutron matter and compute the equation of\nstate and the speed of sound. The results are confronted to those of other\ncalculations as well as to recent Bayesian analyses of neutron-star\nobservations.\n","subjects":["Physics/Nuclear Theory","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"zthOT-mBg7YqwiNHCRfcqsqu0qFxHEyUjJrL5MCEZuQ","pdfSize":"6939935","txDigest":"vZpaECZ3vUM8nMvsibThEYzxS8eBHqVKqPM4rLasLW5","endEpoch":"1","status":"CERTIFIED"}
