{"id":"2408.05240","title":"Gravitational-Wave Tests of General Relativity with Ground-Based\n  Detectors and Pulsar-Timing Arrays","authors":"Nicolas Yunes, Xavier Siemens, Kent Yagi","authorsParsed":[["Yunes","Nicolas",""],["Siemens","Xavier",""],["Yagi","Kent",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 18:17:20 GMT"}],"updateDate":"2024-08-13","timestamp":1722881840000,"abstract":"  This review is focused on tests of Einstein's theory of general relativity\nwith gravitational waves that are detectable by ground-based interferometers\nand pulsar-timing experiments. Einstein's theory has been greatly constrained\nin the quasi-linear, quasi-stationary regime, where gravity is weak and\nvelocities are small. Gravitational waves are allowing us to probe a\ncomplimentary, yet previously unexplored regime: the non-linear and dynamical\n\\emph{extreme gravity regime}. Such a regime is, for example, applicable to\ncompact binaries coalescing, where characteristic velocities can reach fifty\npercent the speed of light and gravitational fields are large and dynamical.\nThis review begins with the theoretical basis and the predicted\ngravitational-wave observables of modified gravity theories. The review\ncontinues with a brief description of the detectors, including both\ngravitational-wave interferometers and pulsar-timing arrays, leading to a\ndiscussion of the data analysis formalism that is applicable for such tests.\nThe review then discusses gravitational-wave tests using compact binary\nsystems, and ends with a description of the first gravitational wave\nobservations by advanced LIGO, the stochastic gravitational wave background\nobservations by pulsar timing arrays, and the tests that can be performed with\nthem..\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"LT07iK_06mUh-xlsXcCikrI_mms2IGB4QtUh11xoS_4","pdfSize":"4795701"}
