{"id":"2408.10526","title":"Kagome materials $A$V$_3$Sb$_5$ ($A$=K,Rb,Cs): pairing symmetry and\n  pressure-tuning studies","authors":"Yuwei Zhou, Ge Ye, Shuaishuai Luo, Yu Song, Xin Lu and Huiqiu Yuan","authorsParsed":[["Zhou","Yuwei",""],["Ye","Ge",""],["Luo","Shuaishuai",""],["Song","Yu",""],["Lu","Xin",""],["Yuan","Huiqiu",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 14:56:24 GMT"}],"updateDate":"2024-09-05","timestamp":1723820184000,"abstract":"  The vanadium-based kagome metals $A$V$_3$Sb$_5$ ($A$ = K, Rb, and Cs) host a\nsuperconducting ground state that coexists with an unconventional charge\ndensity wave (CDW). The CDW state exhibits experimental signatures of\nchirality, electronic nematicity, and time-reversal-symmetry-breaking, raising\nthe questions whether the superconductivity (SC) in $A$V$_3$Sb$_5$ may also be\nunconventional, how SC interplays with CDW, and how the two orders evolve upon\ntuning. This article reviews studies of the superconducting pairing symmetry,\nand the tuning of SC and CDW in the $A$V$_3$Sb$_5$ compounds. Various\nexperimental techniques consistently find that CsV$_3$Sb$_5$ exhibits nodeless\nSC, which remains robust regardless whether the CDW is present. Under\nhydrostatic pressure, SC in $A$V$_3$Sb$_5$ becomes enhanced as the CDW is\ngradually suppressed, revealing a competition between the two orders. In\nCsV$_3$Sb$_5$, a new CDW state emerges under pressure that competes more\nstrongly with SC relative to the CDW at ambient pressure, and results in two\nsuperconducting domes that coexist with CDW. After the CDW in $A$V$_3$Sb$_5$ is\nfully suppressed with hydrostatic pressure, a further increase in pressure\nleads to a nonmonotonic evolution of the superconducting transition temperature\ndriven by lattice modulations. Thickness is shown to be a powerful tuning\nparameter in $A$V$_3$Sb$_5$ thin flakes, revealing the evolution of CDW and SC\nupon dimensional reduction, and can be combined with hydrostatic pressure to\nshed light on the interplay between SC and CDW. Based on results reviewed in\nthis article, we discuss outstanding issues to be addressed in the\n$A$V$_3$Sb$_5$ systems.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Strongly Correlated Electrons"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}