{"id":"2408.00086","title":"Non-Noetherian Conformal Cheshire Effect","authors":"Eloy Ay\\'on-Beato, Mokhtar Hassaine, Pedro A. S\\'anchez","authorsParsed":[["Ayón-Beato","Eloy",""],["Hassaine","Mokhtar",""],["Sánchez","Pedro A.",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 18:01:47 GMT"}],"updateDate":"2024-08-02","timestamp":1722448907000,"abstract":"  The gravitational Cheshire effect refers to the possibility of turning off\nthe gravitational field while still leaving an imprint of the nonminimal\ncoupling of matter to gravity. This allows nontrivial solutions in flat\nspacetime for which no backreaction is possible. The effect was originally\nshown to manifest itself for standard nonminimal couplings, such as those\nallowing conventional conformally invariant scalar fields. Recently, the most\ngeneral scalar field action yielding a conformally invariant second-order\nequation was constructed, and entails a more involved nonminimal coupling\nexplicitly breaking the conformal invariance of the action without spoiling it\nin the equation. We have succeeded in fully describing the spherically\nsymmetric stealth solutions on flat spacetime supporting the Cheshire effect\nwithin this general non-Noetherian conformal theory. The allowed configurations\nare divided into two branches: The first one essentially corresponds to an\nextension of the solutions already known for the standard Noetherian conformal\ntheory. The second branch is only possible due to the non-Noetherian conformal\ncontribution of the action. The complete characterization of this branch is\nexpressed by a nonlinear first-order partial differential equation. We have\nfound the general solution of this equation using both seemingly new and\nwell-established mathematical tools.\n","subjects":["Physics/High Energy Physics - Theory","Physics/General Relativity and Quantum Cosmology"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"9jNmRa4Px_KX9YSgvq9FsGU1QNFqHEozgjU_v9gbQzU","pdfSize":"278222","txDigest":"7jEonW5sab9LVsUbouxnV8ogtibGodE4YwEVTNnfRHrJ","endEpoch":"100","status":"CERTIFIED"}
