{"id":"2408.01556","title":"pathfinder: A Semantic Framework for Literature Review and Knowledge\n  Discovery in Astronomy","authors":"Kartheik G. Iyer, Mikaeel Yunus, Charles O'Neill, Christine Ye, Alina\n  Hyk, Kiera McCormick, Ioana Ciuca, John F. Wu, Alberto Accomazzi, Simone\n  Astarita, Rishabh Chakrabarty, Jesse Cranney, Anjalie Field, Tirthankar\n  Ghosal, Michele Ginolfi, Marc Huertas-Company, Maja Jablonska, Sandor Kruk,\n  Huiling Liu, Gabriel Marchidan, Rohit Mistry, J.P. Naiman, J. E. G. Peek,\n  Mugdha Polimera, Sergio J. Rodriguez, Kevin Schawinski, Sanjib Sharma,\n  Michael J. Smith, Yuan-Sen Ting, Mike Walmsley (UniverseTBD)","authorsParsed":[["Iyer","Kartheik G.","","UniverseTBD"],["Yunus","Mikaeel","","UniverseTBD"],["O'Neill","Charles","","UniverseTBD"],["Ye","Christine","","UniverseTBD"],["Hyk","Alina","","UniverseTBD"],["McCormick","Kiera","","UniverseTBD"],["Ciuca","Ioana","","UniverseTBD"],["Wu","John F.","","UniverseTBD"],["Accomazzi","Alberto","","UniverseTBD"],["Astarita","Simone","","UniverseTBD"],["Chakrabarty","Rishabh","","UniverseTBD"],["Cranney","Jesse","","UniverseTBD"],["Field","Anjalie","","UniverseTBD"],["Ghosal","Tirthankar","","UniverseTBD"],["Ginolfi","Michele","","UniverseTBD"],["Huertas-Company","Marc","","UniverseTBD"],["Jablonska","Maja","","UniverseTBD"],["Kruk","Sandor","","UniverseTBD"],["Liu","Huiling","","UniverseTBD"],["Marchidan","Gabriel","","UniverseTBD"],["Mistry","Rohit","","UniverseTBD"],["Naiman","J. P.","","UniverseTBD"],["Peek","J. E. G.","","UniverseTBD"],["Polimera","Mugdha","","UniverseTBD"],["Rodriguez","Sergio J.","","UniverseTBD"],["Schawinski","Kevin","","UniverseTBD"],["Sharma","Sanjib","","UniverseTBD"],["Smith","Michael J.","","UniverseTBD"],["Ting","Yuan-Sen","","UniverseTBD"],["Walmsley","Mike","","UniverseTBD"]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 20:05:24 GMT"}],"updateDate":"2024-08-06","timestamp":1722629124000,"abstract":"  The exponential growth of astronomical literature poses significant\nchallenges for researchers navigating and synthesizing general insights or even\ndomain-specific knowledge. We present Pathfinder, a machine learning framework\ndesigned to enable literature review and knowledge discovery in astronomy,\nfocusing on semantic searching with natural language instead of syntactic\nsearches with keywords. Utilizing state-of-the-art large language models (LLMs)\nand a corpus of 350,000 peer-reviewed papers from the Astrophysics Data System\n(ADS), Pathfinder offers an innovative approach to scientific inquiry and\nliterature exploration. Our framework couples advanced retrieval techniques\nwith LLM-based synthesis to search astronomical literature by semantic context\nas a complement to currently existing methods that use keywords or citation\ngraphs. It addresses complexities of jargon, named entities, and temporal\naspects through time-based and citation-based weighting schemes. We demonstrate\nthe tool's versatility through case studies, showcasing its application in\nvarious research scenarios. The system's performance is evaluated using custom\nbenchmarks, including single-paper and multi-paper tasks. Beyond literature\nreview, Pathfinder offers unique capabilities for reformatting answers in ways\nthat are accessible to various audiences (e.g. in a different language or as\nsimplified text), visualizing research landscapes, and tracking the impact of\nobservatories and methodologies. This tool represents a significant advancement\nin applying AI to astronomical research, aiding researchers at all career\nstages in navigating modern astronomy literature.\n","subjects":["Astrophysics/Instrumentation and Methods for Astrophysics","Computing Research Repository/Digital Libraries","Computing Research Repository/Information Retrieval"],"license":"http://creativecommons.org/licenses/by/4.0/"}