{"id":"2408.05117","title":"Beyond the Eye: A Relational Model for Early Dementia Detection Using\n  Retinal OCTA Images","authors":"Shouyue Liu, Jinkui Hao, Yonghuai Liu, Huazhu Fu, Xinyu Guo, Shuting\n  Zhang and Yitian Zhao","authorsParsed":[["Liu","Shouyue",""],["Hao","Jinkui",""],["Liu","Yonghuai",""],["Fu","Huazhu",""],["Guo","Xinyu",""],["Zhang","Shuting",""],["Zhao","Yitian",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 15:10:34 GMT"}],"updateDate":"2024-08-12","timestamp":1723216234000,"abstract":"  Early detection of dementia, such as Alzheimer's disease (AD) or mild\ncognitive impairment (MCI), is essential to enable timely intervention and\npotential treatment. Accurate detection of AD/MCI is challenging due to the\nhigh complexity, cost, and often invasive nature of current diagnostic\ntechniques, which limit their suitability for large-scale population screening.\nGiven the shared embryological origins and physiological characteristics of the\nretina and brain, retinal imaging is emerging as a potentially rapid and\ncost-effective alternative for the identification of individuals with or at\nhigh risk of AD. In this paper, we present a novel PolarNet+ that uses retinal\noptical coherence tomography angiography (OCTA) to discriminate early-onset AD\n(EOAD) and MCI subjects from controls. Our method first maps OCTA images from\nCartesian coordinates to polar coordinates, allowing approximate sub-region\ncalculation to implement the clinician-friendly early treatment of diabetic\nretinopathy study (ETDRS) grid analysis. We then introduce a multi-view module\nto serialize and analyze the images along three dimensions for comprehensive,\nclinically useful information extraction. Finally, we abstract the sequence\nembedding into a graph, transforming the detection task into a general graph\nclassification problem. A regional relationship module is applied after the\nmulti-view module to excavate the relationship between the sub-regions. Such\nregional relationship analyses validate known eye-brain links and reveal new\ndiscriminative patterns.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"p53eqpjE74V_4CkfIcsKI5FMlEZ1-NYxwLCRDqAizak","pdfSize":"6945780"}
