{"id":"2408.15800","title":"Emulating Brain-like Rapid Learning in Neuromorphic Edge Computing","authors":"Kenneth Stewart, Michael Neumeier, Sumit Bam Shrestha, Garrick\n  Orchard, Emre Neftci","authorsParsed":[["Stewart","Kenneth",""],["Neumeier","Michael",""],["Shrestha","Sumit Bam",""],["Orchard","Garrick",""],["Neftci","Emre",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 13:51:52 GMT"}],"updateDate":"2024-08-29","timestamp":1724853112000,"abstract":"  Achieving personalized intelligence at the edge with real-time learning\ncapabilities holds enormous promise in enhancing our daily experiences and\nhelping decision making, planning, and sensing. However, efficient and reliable\nedge learning remains difficult with current technology due to the lack of\npersonalized data, insufficient hardware capabilities, and inherent challenges\nposed by online learning.\n  Over time and across multiple developmental stages, the brain has evolved to\nefficiently incorporate new knowledge by gradually building on previous\nknowledge. In this work, we emulate the multiple stages of learning with\ndigital neuromorphic technology that simulates the neural and synaptic\nprocesses of the brain using two stages of learning. First, a meta-training\nstage trains the hyperparameters of synaptic plasticity for one-shot learning\nusing a differentiable simulation of the neuromorphic hardware. This\nmeta-training process refines a hardware local three-factor synaptic plasticity\nrule and its associated hyperparameters to align with the trained task domain.\nIn a subsequent deployment stage, these optimized hyperparameters enable fast,\ndata-efficient, and accurate learning of new classes. We demonstrate our\napproach using event-driven vision sensor data and the Intel Loihi neuromorphic\nprocessor with its plasticity dynamics, achieving real-time one-shot learning\nof new classes that is vastly improved over transfer learning. Our methodology\ncan be deployed with arbitrary plasticity models and can be applied to\nsituations demanding quick learning and adaptation at the edge, such as\nnavigating unfamiliar environments or learning unexpected categories of data\nthrough user engagement.\n","subjects":["Computing Research Repository/Neural and Evolutionary Computing","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ekYEB128cYXws6QKCUyvy5ClIvTtFIhWw872v1rWEE8","pdfSize":"1943705"}
