{"id":"2408.09500","title":"Black hole thermodynamics from an ensemble-averaged theory","authors":"Peng Cheng, Yu-Xiao Liu, and Shao-Wen Wei","authorsParsed":[["Cheng","Peng",""],["Liu","Yu-Xiao",""],["Wei","Shao-Wen",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 14:49:33 GMT"}],"updateDate":"2024-08-20","timestamp":1723992573000,"abstract":"  The path integral approach to a quantum theory of gravity is widely regarded\nas an indispensable strategy. However, determining what additional elements,\nbeyond black hole or AdS spacetime, should be incorporated into the path\nintegral remains crucial yet perplexing. We argue that the spacetime with a\nconical singularity in its Euclidean counterpart should be the most important\ningredient to append to the path integral. Therefore, physical quantities\nshould be ensemble-averaged over all geometries since they are described by the\nsame Lorentzian metric. When the ensemble average is introduced, the\nHawking-Page transition for the Schwarzschild-AdS black hole and the\nsmall-large black hole transition for the Reissner-Nordstrom-AdS black hole\nnaturally arise as semi-classical approximations, when the size of the black\nhole system is much larger than the Planck length. Away from the semi-classical\nlimit, the system is a superposition of different geometries, and the averaged\nquantities would deviate from the black hole thermodynamics. Expanding around\nthe classical saddles, the subleading order of Newton's constant contributions\ncan be derived, which are both half of the Hawking temperature for the\nSchwarzschild and Reissner-Nordstrom black holes. The result may imply a\nuniversal structure. The subsubleading terms and more intriguing physics that\ndiverge from black hole thermodynamics are revealed. The ensemble-averaged\ntheory provides a new way of studying subleading effects and extending the\ntraditional AdS/CFT correspondence.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ET0lLvBll5g1KSc1l5mhCi7KrMPe31MJQS8oZdH1I-w","pdfSize":"1129238"}
