{"id":"2408.15995","title":"TEDRA: Text-based Editing of Dynamic and Photoreal Actors","authors":"Basavaraj Sunagad, Heming Zhu, Mohit Mendiratta, Adam Kortylewski,\n  Christian Theobalt, Marc Habermann","authorsParsed":[["Sunagad","Basavaraj",""],["Zhu","Heming",""],["Mendiratta","Mohit",""],["Kortylewski","Adam",""],["Theobalt","Christian",""],["Habermann","Marc",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 17:59:02 GMT"}],"updateDate":"2024-08-29","timestamp":1724867942000,"abstract":"  Over the past years, significant progress has been made in creating\nphotorealistic and drivable 3D avatars solely from videos of real humans.\nHowever, a core remaining challenge is the fine-grained and user-friendly\nediting of clothing styles by means of textual descriptions. To this end, we\npresent TEDRA, the first method allowing text-based edits of an avatar, which\nmaintains the avatar's high fidelity, space-time coherency, as well as\ndynamics, and enables skeletal pose and view control. We begin by training a\nmodel to create a controllable and high-fidelity digital replica of the real\nactor. Next, we personalize a pretrained generative diffusion model by\nfine-tuning it on various frames of the real character captured from different\ncamera angles, ensuring the digital representation faithfully captures the\ndynamics and movements of the real person. This two-stage process lays the\nfoundation for our approach to dynamic human avatar editing. Utilizing this\npersonalized diffusion model, we modify the dynamic avatar based on a provided\ntext prompt using our Personalized Normal Aligned Score Distillation Sampling\n(PNA-SDS) within a model-based guidance framework. Additionally, we propose a\ntime step annealing strategy to ensure high-quality edits. Our results\ndemonstrate a clear improvement over prior work in functionality and visual\nquality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"60DBB1CgwRNBDvtiMgaxzVs5_SLP9PS33zWKtNwVIto","pdfSize":"7423658"}
