{"id":"2408.08191","title":"Beyond Full Label: Single-Point Prompt for Infrared Small Target Label\n  Generation","authors":"Shuai Yuan, Hanlin Qin, Renke Kou, Xiang Yan, Zechuan Li, Chenxu Peng,\n  Abd-Krim Seghouane","authorsParsed":[["Yuan","Shuai",""],["Qin","Hanlin",""],["Kou","Renke",""],["Yan","Xiang",""],["Li","Zechuan",""],["Peng","Chenxu",""],["Seghouane","Abd-Krim",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 14:49:12 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 11:54:53 GMT"},{"version":"v3","created":"Mon, 19 Aug 2024 01:35:50 GMT"},{"version":"v4","created":"Tue, 20 Aug 2024 23:05:20 GMT"}],"updateDate":"2024-08-22","timestamp":1723733352000,"abstract":"  In this work, we make the first attempt to construct a learning-based\nsingle-point annotation paradigm for infrared small target label generation\n(IRSTLG). Our intuition is that label generation requires just one more point\nprompt than target detection: IRSTLG can be regarded as an infrared small\ntarget detection (IRSTD) task with the target location hint. Based on this\ninsight, we introduce an energy double guided single-point prompt (EDGSP)\nframework, which adeptly transforms the target detection network into a refined\nlabel generation method. Specifically, the proposed EDGSP includes: 1) target\nenergy initialization (TEI) to create a foundational outline for sufficient\nshape evolution of pseudo label, 2) double prompt embedding (DPE) for rapid\nlocalization of interested regions and reinforcement of individual differences\nto avoid label adhesion, and 3) bounding box-based matching (BBM) to eliminate\nfalse alarms. Experimental results show that pseudo labels generated by three\nbaselines equipped with EDGSP achieve 100% object-level probability of\ndetection (Pd) and 0% false-alarm rate (Fa) on SIRST, NUDT-SIRST, and IRSTD-1k\ndatasets, with a pixel-level intersection over union (IoU) improvement of\n13.28% over state-of-the-art (SOTA) label generation methods. In the practical\napplication of downstream IRSTD, EDGSP realizes, for the first time, a\nsingle-point generated pseudo mask beyond the full label. Even with coarse\nsingle-point annotations, it still achieves 99.5% performance of full labeling.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}