{"id":"2408.17132","title":"Droplet size and velocity measurements in a cryogenic jet flame of a\n  rocket-type combustor using high speed imaging","authors":"Nicolas Fdida, Lucien Vingert, Arnaud Ristori, Yves Le Sant","authorsParsed":[["Fdida","Nicolas",""],["Vingert","Lucien",""],["Ristori","Arnaud",""],["Sant","Yves Le",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 09:16:32 GMT"}],"updateDate":"2024-09-02","timestamp":1725009392000,"abstract":"  Injectors of cryogenic liquid rocket engines produce large polydisperse and\ndense sprays due to the pressure and mass flow conditions. Atomization is the\ndominating process that drives the flame behaviour in cryogenic jet flames,\nwhen the propellants are injected in subcritical conditions. The main objective\nof this study is the characterization of a liquid oxygen (LOX) spray in gaseous\nhydrogen (GH2), in reacting conditions. In the breakup region where liquid\nparticles are not spherical, laser based drop size techniques suffer from a low\nvalidation data rate, thus imaging techniques can be better suited to\ncharacterize the spray. High speed shadowgraphs were used to provide the spray\ncharacteristics such as sizes and velocities of the LOX dispersed phase\natomized by a GH2 co-flow injected by a shear coaxial injector in a 1MPa\ncombustion chamber. Cryogenic combustion investigations presented in this paper\nwere carried out on the Mascotte test bench, at Onera. The reacting case was\ncompared qualitatively to a cold flow test, with gaseous He instead of GH2, for\nwhich LOX spray shadowgraphs were also recorded. Velocity of the dispersed\nphase in reacting conditions was obtained with two different imaging methods,\nwhich were applied to the same shadowgraphs: a PTV algorithm and a PIV\nsoftware, developed at Onera. Droplet sizes were measured by image processing\nin the atomization zone and results were compared with Sauter mean diameters\nobtained with phase Doppler measurements from the literature. The droplet size\nis combined with PTV to obtain droplet size/velocity correlations which show\nthe influence of the flame on the droplet size evolution.\n","subjects":["Physics/Fluid Dynamics","Physics/Applied Physics"],"license":"http://creativecommons.org/licenses/by/4.0/"}