{"id":"2408.01667","title":"Automated Phishing Detection Using URLs and Webpages","authors":"Huilin Wang, Bryan Hooi","authorsParsed":[["Wang","Huilin",""],["Hooi","Bryan",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 05:08:27 GMT"},{"version":"v2","created":"Fri, 16 Aug 2024 03:25:51 GMT"}],"updateDate":"2024-08-19","timestamp":1722661707000,"abstract":"  Phishing detection is a critical cybersecurity task that involves the\nidentification and neutralization of fraudulent attempts to obtain sensitive\ninformation, thereby safeguarding individuals and organizations from data\nbreaches and financial loss. In this project, we address the constraints of\ntraditional reference-based phishing detection by developing an LLM agent\nframework. This agent harnesses Large Language Models to actively fetch and\nutilize online information, thus providing a dynamic reference system for more\naccurate phishing detection. This innovation circumvents the need for a static\nknowledge base, offering a significant enhancement in adaptability and\nefficiency for automated security measures.\n  The project report includes an initial study and problem analysis of existing\nsolutions, which motivated us to develop a new framework. We demonstrate the\nframework with LLMs simulated as agents and detail the techniques required for\nconstruction, followed by a complete implementation with a proof-of-concept as\nwell as experiments to evaluate our solution's performance against other\nsimilar solutions. The results show that our approach has achieved with\naccuracy of 0.945, significantly outperforms the existing solution(DynaPhish)\nby 0.445. Furthermore, we discuss the limitations of our approach and suggest\nimprovements that could make it more effective.\n  Overall, the proposed framework has the potential to enhance the\neffectiveness of current reference-based phishing detection approaches and\ncould be adapted for real-world applications.\n","subjects":["Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"IehvCURn_PPteFbCwbFi_2lTZ256Ih1p8V3FWcUIVP4","pdfSize":"2361743"}
