{"id":"2408.02314","title":"Quantum Clustering for Cybersecurity","authors":"Walid El Maouaki, Nouhaila Innan, Alberto Marchisio, Taoufik Said,\n  Mohamed Bennai, Muhammad Shafique","authorsParsed":[["Maouaki","Walid El",""],["Innan","Nouhaila",""],["Marchisio","Alberto",""],["Said","Taoufik",""],["Bennai","Mohamed",""],["Shafique","Muhammad",""]],"versions":[{"version":"v1","created":"Mon, 5 Aug 2024 08:48:03 GMT"}],"updateDate":"2024-08-06","timestamp":1722847683000,"abstract":"  In this study, we develop a novel quantum machine learning (QML) framework to\nanalyze cybersecurity vulnerabilities using data from the 2022 CISA Known\nExploited Vulnerabilities catalog, which includes detailed information on\nvulnerability types, severity levels, common vulnerability scoring system\n(CVSS) scores, and product specifics. Our framework preprocesses this data into\na quantum-compatible format, enabling clustering analysis through our advanced\nquantum techniques, QCSWAPK-means and QkernelK-means. These quantum algorithms\ndemonstrate superior performance compared to state-of-the-art classical\nclustering techniques like k-means and spectral clustering, achieving\nSilhouette scores of 0.491, Davies-Bouldin indices below 0.745, and\nCalinski-Harabasz scores exceeding 884, indicating more distinct and\nwell-separated clusters. Our framework categorizes vulnerabilities into\ndistinct groups, reflecting varying levels of risk severity: Cluster 0,\nprimarily consisting of critical Microsoft-related vulnerabilities; Cluster 1,\nfeaturing medium severity vulnerabilities from various enterprise software\nvendors and network solutions; Cluster 2, with high severity vulnerabilities\nfrom Adobe, Cisco, and Google; and Cluster 3, encompassing vulnerabilities from\nMicrosoft and Oracle with high to medium severity. These findings highlight the\npotential of QML to enhance the precision of vulnerability assessments and\nprioritization, advancing cybersecurity practices by enabling more strategic\nand proactive defense mechanisms.\n","subjects":["Physics/Quantum Physics","Computing Research Repository/Cryptography and Security"],"license":"http://creativecommons.org/licenses/by/4.0/"}