{"id":"2408.11037","title":"First Light And Reionisation Epoch Simulations (FLARES) XVI: Size\n  Evolution of Massive Dusty Galaxies at Cosmic Dawn from UV to IR","authors":"Paurush Punyasheel, Aswin P. Vijayan, Thomas R. Greve, William J.\n  Roper, Hiddo Algera, Steven Gillman, Bitten Gullberg, Dimitrios Irodotou,\n  Christopher C. Lovell, Louise T. C. Seeyave, Peter A. Thomas, and Stephen M.\n  Wilkins","authorsParsed":[["Punyasheel","Paurush",""],["Vijayan","Aswin P.",""],["Greve","Thomas R.",""],["Roper","William J.",""],["Algera","Hiddo",""],["Gillman","Steven",""],["Gullberg","Bitten",""],["Irodotou","Dimitrios",""],["Lovell","Christopher C.",""],["Seeyave","Louise T. C.",""],["Thomas","Peter A.",""],["Wilkins","Stephen M.",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 17:45:00 GMT"}],"updateDate":"2024-08-29","timestamp":1724175900000,"abstract":"  We use the First Light And Reionisation Epoch Simulations (FLARES) to study\nthe evolution of the rest-frame ultraviolet (UV) and far-infrared (FIR) sizes\nfor a statistical sample of massive ($\\gtrsim10^{9}$M$_{\\odot}$) high redshift\ngalaxies (z $\\in$ [5,10]). Galaxies are post-processed using the SKIRT\nradiative transfer code, to self-consistently obtain the full spectral energy\ndistribution and surface brightness distribution. We create mock observations\nof the galaxies for the Near Infrared Camera (NIRCam) to study the rest-frame\nUV 1500 $\\unicode{xC5}$ morphology. We also generate mock rest-frame FIR (50\n$\\mu$m) photometry and mock ALMA (158 $\\mu$m) (0.01\"-0.03\" and $\\approx$0.3\"\nangular resolution) observations to study the dust-continuum. We find the\neffect of dust on observed sizes reduces with increasing wavelength from the UV\nto optical ($\\sim$0.6 times the UV at 0.4$\\mu$m), with no evolution in FIR\nsizes. Observed sizes vary within 0.4-1.2 times the intrinsic sizes at\ndifferent signal to noise ratios (SNR = 5-20) across redshifts. The effect of\nPSF and noise makes bright structures prominent, whereas fainter regions blend\nwith noise, leading to an underestimation (factor of 0.4-0.8) of sizes at\nSNR=5. At SNR=15-20, the underestimation reduces (factor of 0.6-0.9) at z=5-8\nbut due to PSF, at z=9-10, bright cores are dominant, resulting in an\noverestimation (factor of 1.0-1.2). For ALMA, low resolution sizes are effected\nby noise which acts as extended emission. The size evolution in UV broadly\nagrees with current observational samples and other simulations. This work is\none of the first to analyse the panchromatic sizes of a statistically\nsignificant sample of simulated high-redshift galaxies, complementing a growing\nbody of research highlighting the importance of conducting an equivalent\ncomparison between observed galaxies and their simulated counterparts in the\nearly Universe.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"gpQmSqNw6wyFZMhLrqTu81wZC6kHsPqiwwkXkNNxA8o","pdfSize":"5890216"}
