{"id":"2408.05115","title":"Nanoscale Control of Quantum States in Radical Molecules on\n  Superconducting Pb(111)","authors":"Chao Li, Vladislav Pokorn\\'y, Martin \\v{Z}onda, Jung-Ching Liu, Ping\n  Zhou, Outhmane Chahib, Thilo Glatzel, Robert H\\\"aner, Silvio Decurtins,\n  Shi-Xia Liu, R\\'emy Pawlak, Ernst Meyer","authorsParsed":[["Li","Chao",""],["Pokorný","Vladislav",""],["Žonda","Martin",""],["Liu","Jung-Ching",""],["Zhou","Ping",""],["Chahib","Outhmane",""],["Glatzel","Thilo",""],["Häner","Robert",""],["Decurtins","Silvio",""],["Liu","Shi-Xia",""],["Pawlak","Rémy",""],["Meyer","Ernst",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 15:05:52 GMT"}],"updateDate":"2024-08-12","timestamp":1723215952000,"abstract":"  Magnetic impurities on superconductors present a viable platform for building\nadvanced applications in quantum technologies. However, a controlled\nmanipulation of their quantum states continues to pose a significant challenge,\nhindering the progress in the field. Here we show the manipulation of magnetic\nstates in the radical molecule 4,5,9,10-tetrabromo-1,3,6,8-tetraazapyrene\n(TBTAP) on a Pb(111) superconducting surface using low-temperature scanning\ntunneling microscopy. Tunneling spectra reveal Yu-Shiba-Rusinov (YSR) states\nnear the Fermi energy in isolated molecules. A quantum phase transition from\nsinglet to doublet ground state is induced by changing the tip-molecule\ndistance. Additionally, the presence of a second TBTAP molecule allows tuning\nof the YSR state position by altering the relative distance and can induce\nsplitting of the YSR states for certain orientations. The construction of\nmolecular chains up to pentamers shows periodic arrangements of charged and\nneutral molecules, with even-numbered chains forming a charged dimer structure\nat one end. Information can be encoded in these chains by switching the dimer\nposition. These findings elucidate interactions between molecular assemblies\nand superconducting substrates, paving the way for advanced quantum-state\nengineering.\n","subjects":["Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}