{"id":"2408.06933","title":"Simple fluctuations in simple glass formers","authors":"Corentin C. L. Laudicina, Patrick Charbonneau, Yi Hu, Liesbeth M. C.\n  Janssen, Peter K. Morse, Ilian Pihlajamaa, Grzegorz Szamel","authorsParsed":[["Laudicina","Corentin C. L.",""],["Charbonneau","Patrick",""],["Hu","Yi",""],["Janssen","Liesbeth M. C.",""],["Morse","Peter K.",""],["Pihlajamaa","Ilian",""],["Szamel","Grzegorz",""]],"versions":[{"version":"v1","created":"Tue, 13 Aug 2024 14:38:41 GMT"}],"updateDate":"2024-08-14","timestamp":1723559921000,"abstract":"  Critical single-particle fluctuations associated with particle displacements\nare inherent to simple glass-forming liquids in the limit of large dimensions\nand leave a pseudo-critical trace across all finite dimensions. This\ncharacteristic could serve as a crucial test for distinguishing between\ntheories of glass formation. We here examine these critical fluctuations, as\ncaptured by the well-established non-Gaussian parameter, within both\nmode-coupling theory (MCT) and dynamical mean-field theory (DMFT) across\ndimensions for hard sphere liquids and for the minimally structured\nMari--Kurchan model. We establish general scaling laws relevant to any liquid\ndynamics theory in large dimensions and show that the dimensional scalings\npredicted by MCT are inconsistent with those from DMFT. Simulation results for\nhard spheres in moderately high dimensions align with the DMFT scenario,\nreinforcing the relevance of mean-field theory for capturing glass physics in\nfinite dimensions. We identify potential adjustments to MCT to account for\ncertain mean-field physics. Our findings also highlight that local structure\nand spatial dimensionality can affect single-particle critical fluctuations in\nnon-trivial ways.\n","subjects":["Condensed Matter/Disordered Systems and Neural Networks","Condensed Matter/Soft Condensed Matter","Condensed Matter/Statistical Mechanics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}