{"id":"2408.06232","title":"Overcoming the Zero-Rate Hashing Bound with Holographic Quantum Error\n  Correction","authors":"Junyu Fan and Matthew Steinberg and Alexander Jahn and Charles Cao and\n  Sebastian Feld","authorsParsed":[["Fan","Junyu",""],["Steinberg","Matthew",""],["Jahn","Alexander",""],["Cao","Charles",""],["Feld","Sebastian",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:35:03 GMT"}],"updateDate":"2024-08-13","timestamp":1723476903000,"abstract":"  Several recent techniques for modifying topological codes with single-qubit\nClifford operators have shown high resilience against pure Pauli noise.\nParamount to these findings has been the demonstration that several variants\nexhibit error thresholds often attaining or exceeding the zero-rate hashing\nbound, a known benchmark for code-capacity noise channels, for biased noise.\nAdditionally, direct comparison with the hashing bound has shown that several\ntopological codes outperform the hashing bound at points of finite Pauli noise\nbiases. Motivated by these observations, we study zero-rate holographic quantum\nerror correction codes, discovering very high threshold values under diverse\nand finitely-biased noise channels using a tensor-network decoding approach.\nOur results establish that all codes tested achieve or surpass the hashing\nbound at various points, ranging from pure 2-Pauli noise ($\\eta = 0$) to pure\n1-Pauli noise ($\\eta = +\\infty$), thereby demonstrating that holographic codes\nexhibit excellent error tolerance in the code-capacity picture. Such findings\nimply the existence of a structured and systematic method for constructing\nhigh-threshold codes suitable for realistically motivated noise channels. To\nour knowledge, this work is also the first instance of such remarkable\nthreshold behavior in stabilizer quantum codes for the pure 2-Pauli noise\nregime, as well as for finitely-biased noise channels.\n","subjects":["Physics/Quantum Physics","Physics/High Energy Physics - Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}