{"id":"2408.10843","title":"Detecting Wildfires on UAVs with Real-time Segmentation Trained by\n  Larger Teacher Models","authors":"Julius Pesonen, Teemu Hakala, V\\\"ain\\\"o Karjalainen, Niko Koivum\\\"aki,\n  Lauri Markelin, Anna-Maria Raita-Hakola, Juha Suomalainen, Ilkka P\\\"ol\\\"onen,\n  Eija Honkavaara","authorsParsed":[["Pesonen","Julius",""],["Hakala","Teemu",""],["Karjalainen","Väinö",""],["Koivumäki","Niko",""],["Markelin","Lauri",""],["Raita-Hakola","Anna-Maria",""],["Suomalainen","Juha",""],["Pölönen","Ilkka",""],["Honkavaara","Eija",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 11:42:54 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 07:39:49 GMT"}],"updateDate":"2024-09-13","timestamp":1724067774000,"abstract":"  Early detection of wildfires is essential to prevent large-scale fires\nresulting in extensive environmental, structural, and societal damage. Uncrewed\naerial vehicles (UAVs) can cover large remote areas effectively with quick\ndeployment requiring minimal infrastructure and equipping them with small\ncameras and computers enables autonomous real-time detection. In remote areas,\nhowever, the UAVs are limited to on-board computing for detection due to the\nlack of high-bandwidth mobile networks. This limits the detection to methods\nwhich are light enough for the on-board computer alone. For accurate\ncamera-based localisation, segmentation of the detected smoke is essential but\ntraining data for deep learning-based wildfire smoke segmentation is limited.\nThis study shows how small specialised segmentation models can be trained using\nonly bounding box labels, leveraging zero-shot foundation model supervision.\nThe method offers the advantages of needing only fairly easily obtainable\nbounding box labels and requiring training solely for the smaller student\nnetwork. The proposed method achieved 63.3% mIoU on a manually annotated and\ndiverse wildfire dataset. The used model can perform in real-time at ~25 fps\nwith a UAV-carried NVIDIA Jetson Orin NX computer while reliably recognising\nsmoke, demonstrated at real-world forest burning events. Code is available at\nhttps://gitlab.com/fgi_nls/public/wildfire-real-time-segmentation\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}