{"id":"2408.04075","title":"Toward the Automated Localization of Buggy Mobile App UIs from Bug\n  Descriptions","authors":"Antu Saha, Yang Song, Junayed Mahmud, Ying Zhou, Kevin Moran and Oscar\n  Chaparro","authorsParsed":[["Saha","Antu",""],["Song","Yang",""],["Mahmud","Junayed",""],["Zhou","Ying",""],["Moran","Kevin",""],["Chaparro","Oscar",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 20:26:20 GMT"}],"updateDate":"2024-08-09","timestamp":1723062380000,"abstract":"  Bug report management is a costly software maintenance process comprised of\nseveral challenging tasks. Given the UI-driven nature of mobile apps, bugs\ntypically manifest through the UI, hence the identification of buggy UI screens\nand UI components (Buggy UI Localization) is important to localizing the buggy\nbehavior and eventually fixing it. However, this task is challenging as\ndevelopers must reason about bug descriptions (which are often low-quality),\nand the visual or code-based representations of UI screens.\n  This paper is the first to investigate the feasibility of automating the task\nof Buggy UI Localization through a comprehensive study that evaluates the\ncapabilities of one textual and two multi-modal deep learning (DL) techniques\nand one textual unsupervised technique. We evaluate such techniques at two\nlevels of granularity, Buggy UI Screen and UI Component localization. Our\nresults illustrate the individual strengths of models that make use of\ndifferent representations, wherein models that incorporate visual information\nperform better for UI screen localization, and models that operate on textual\nscreen information perform better for UI component localization -- highlighting\nthe need for a localization approach that blends the benefits of both types of\ntechniques. Furthermore, we study whether Buggy UI Localization can improve\ntraditional buggy code localization, and find that incorporating localized\nbuggy UIs leads to improvements of 9%-12% in Hits@10.\n","subjects":["Computing Research Repository/Software Engineering"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"mdd_PupTVFnV5RoOYILPFzIyZI1hQcXhQO-6YwD_lM4","pdfSize":"1774271"}
