{"id":"2408.15845","title":"Surrogate Models studies for laser-plasma accelerator electron source\n  design through numerical optimisation","authors":"G. Kane, P. Drobniak, S. Kazamias, V. Kubytskyi, M. Lenivenko, B.\n  Lucas, J. Serhal, K. Cassou, A. Beck, A. Specka, F. Massimo","authorsParsed":[["Kane","G.",""],["Drobniak","P.",""],["Kazamias","S.",""],["Kubytskyi","V.",""],["Lenivenko","M.",""],["Lucas","B.",""],["Serhal","J.",""],["Cassou","K.",""],["Beck","A.",""],["Specka","A.",""],["Massimo","F.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:07:12 GMT"}],"updateDate":"2024-08-29","timestamp":1724857632000,"abstract":"  The optimisation of the plasma target design for high quality beam\nlaser-driven plasma injector electron source relies on numerical parametric\nstudies using Particle in Cell (PIC) codes. The common input parameters to\nexplore are laser characteristics and plasma density profiles extracted from\ncomputational fluid dynamic studies compatible with experimental measurements\nof target plasma density profiles. We demonstrate the construction of surrogate\nmodels using machine learning technique for a laser-plasma injector (LPI)\nelectron source based on more than 12000 simulations of a laser wakefield\nacceleration performed for sparsely spaced input parameters [1]. Surrogate\nmodels are very interesting for LPI design and optimisation because they are\nmuch faster than PIC simulations. We develop and compare the performance of\nthree surrogate models, namely, Gaussian processes (GP), multilayer perceptron\n(MLP), and decision trees (DT). We then use the best surrogate model to quickly\nfind optimal working points to get a selected electron beam energy, charge and\nenergy spread using different methods, namely random search, Bayesian\noptimisation and multi-objective Bayesian optimisation\n","subjects":["Physics/Plasma Physics","Physics/Accelerator Physics","Physics/Data Analysis, Statistics and Probability"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"RtJwL8NzvOjmIj28QRJuFG6dcoEAFwjFE9lBqznOmgg","pdfSize":"1399328"}
