{"id":"2408.17171","title":"SafeTail: Efficient Tail Latency Optimization in Edge Service Scheduling\n  via Computational Redundancy Management","authors":"Jyoti Shokhanda, Utkarsh Pal, Aman Kumar, Soumi Chattopadhyay, Arani\n  Bhattacharya","authorsParsed":[["Shokhanda","Jyoti",""],["Pal","Utkarsh",""],["Kumar","Aman",""],["Chattopadhyay","Soumi",""],["Bhattacharya","Arani",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 10:17:37 GMT"}],"updateDate":"2024-09-02","timestamp":1725013057000,"abstract":"  Optimizing tail latency while efficiently managing computational resources is\ncrucial for delivering high-performance, latency-sensitive services in edge\ncomputing. Emerging applications, such as augmented reality, require\nlow-latency computing services with high reliability on user devices, which\noften have limited computational capabilities. Consequently, these devices\ndepend on nearby edge servers for processing. However, inherent uncertainties\nin network and computation latencies stemming from variability in wireless\nnetworks and fluctuating server loads make service delivery on time\nchallenging. Existing approaches often focus on optimizing median latency but\nfall short of addressing the specific challenges of tail latency in edge\nenvironments, particularly under uncertain network and computational\nconditions. Although some methods do address tail latency, they typically rely\non fixed or excessive redundancy and lack adaptability to dynamic network\nconditions, often being designed for cloud environments rather than the unique\ndemands of edge computing. In this paper, we introduce SafeTail, a framework\nthat meets both median and tail response time targets, with tail latency\ndefined as latency beyond the 90^th percentile threshold. SafeTail addresses\nthis challenge by selectively replicating services across multiple edge servers\nto meet target latencies. SafeTail employs a reward-based deep learning\nframework to learn optimal placement strategies, balancing the need to achieve\ntarget latencies with minimizing additional resource usage. Through\ntrace-driven simulations, SafeTail demonstrated near-optimal performance and\noutperformed most baseline strategies across three diverse services.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"k6MFLiVk82iIhvgIJ5vMurmH4AkprOj4xYfSBIG5Hq4","pdfSize":"1941130"}
