{"id":"2408.15314","title":"Bayesian inference for the Markov-modulated Poisson process with an\n  outcome process","authors":"Yu Luo, Chris Sherlock","authorsParsed":[["Luo","Yu",""],["Sherlock","Chris",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 18:00:00 GMT"}],"updateDate":"2024-08-29","timestamp":1724781600000,"abstract":"  In medical research, understanding changes in outcome measurements is crucial\nfor inferring shifts in a patient's underlying health condition. While data\nfrom clinical and administrative systems hold promise for advancing this\nunderstanding, traditional methods for modelling disease progression struggle\nwith analyzing a large volume of longitudinal data collected irregularly and do\nnot account for the phenomenon where the poorer an individual's health, the\nmore frequently they interact with the healthcare system. In addition, data\nfrom the claim and health care system provide no information for terminating\nevents, such as death. To address these challenges, we start from the\ncontinuous-time hidden Markov model to understand disease progression by\nmodelling the observed data as an outcome whose distribution depends on the\nstate of a latent Markov chain representing the underlying health state.\nHowever, we also allow the underlying health state to influence the timings of\nthe observations via a point process. Furthermore, we create an addition\n\"death\" state and model the unobserved terminating event, a transition to this\nstate, via an additional Poisson process whose rate depends on the latent state\nof the Markov chain. This extension allows us to model disease severity and\ndeath not only based on the types of care received but also on the temporal and\nfrequency aspects of different observed events. We present an exact Gibbs\nsampler procedure that alternates sampling the complete path of the hidden\nchain (the latent health state throughout the observation window) conditional\non the complete paths. When the unobserved, terminating event occurs early in\nthe observation window, there are no more observed events, and naive use of a\nmodel with only \"live\" health states would lead to biases in parameter\nestimates; our inclusion of a \"death\" state mitigates against this.\n","subjects":["Statistics/Applications","Statistics/Computation"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}