{"id":"2408.12077","title":"Through-the-Wall Radar Human Activity Micro-Doppler Signature\n  Representation Method Based on Joint Boulic-Sinusoidal Pendulum Model","authors":"Xiaopeng Yang, Weicheng Gao, Xiaodong Qu, Zeyu Ma, Hao Zhang","authorsParsed":[["Yang","Xiaopeng",""],["Gao","Weicheng",""],["Qu","Xiaodong",""],["Ma","Zeyu",""],["Zhang","Hao",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 02:33:29 GMT"}],"updateDate":"2024-08-23","timestamp":1724294009000,"abstract":"  With the help of micro-Doppler signature, ultra-wideband (UWB)\nthrough-the-wall radar (TWR) enables the reconstruction of range and velocity\ninformation of limb nodes to accurately identify indoor human activities.\nHowever, existing methods are usually trained and validated directly using\nrange-time maps (RTM) and Doppler-time maps (DTM), which have high feature\nredundancy and poor generalization ability. In order to solve this problem,\nthis paper proposes a human activity micro-Doppler signature representation\nmethod based on joint Boulic-sinusoidal pendulum motion model. In detail, this\npaper presents a simplified joint Boulic-sinusoidal pendulum human motion model\nby taking head, torso, both hands and feet into consideration improved from\nBoulic-Thalmann kinematic model. The paper also calculates the minimum number\nof key points needed to describe the Doppler and micro-Doppler information\nsufficiently. Both numerical simulations and experiments are conducted to\nverify the effectiveness. The results demonstrate that the proposed number of\nkey points of micro-Doppler signature can precisely represent the indoor human\nlimb node motion characteristics, and substantially improve the generalization\ncapability of the existing methods for different testers.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}