{"id":"2408.14463","title":"Unitary Designs from Random Symmetric Quantum Circuits","authors":"Austin Hulse, Hanqing Liu, Iman Marvian","authorsParsed":[["Hulse","Austin",""],["Liu","Hanqing",""],["Marvian","Iman",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 17:52:46 GMT"}],"updateDate":"2024-08-27","timestamp":1724694766000,"abstract":"  In this work, we study distributions of unitaries generated by random quantum\ncircuits that contain only gates respecting a symmetry. We develop a unified\napproach applicable to all symmetry groups and obtain an equation that\ndetermines the exact design properties of such distributions. It has been\nrecently shown that the locality of gates imposes various constraints on the\nset of realizable unitaries, which in general, significantly depend on the\nsymmetry under consideration. Generically, such constraints include\nrestrictions on the relative phases between sectors with inequivalent\nirreducible representations of the symmetry. We call a set of symmetric gates\nsemi-universal if they realize all unitaries that respect the symmetry, up to\nsuch restrictions. For instance, while in the case of Z_2, U(1), and SU(2)\nsymmetries, 2-qubit gates are semi-universal on qubit systems, in the case of\nSU(d) symmetry with d\\ge 3, semi-universality can be achieved only with 3-qudit\ngates. The failure of semi-universality implies that the distribution generated\nby the circuit is not even a 2-design for the Haar (uniform) distribution over\nthe group of all unitaries respecting the symmetry. On the other hand, when\nsemi-universality holds, under mild conditions on the gate set, which hold,\ne.g., in the case of U(1) and SU(2), the distribution of unitaries generated by\nthe random circuit becomes a t-design for t growing polynomially with the\nnumber of qudits with a degree that is determined by the locality of gates.\nMore generally, we present a simple linear equation that determines the maximum\nvalue of the integer t, for which the uniform distribution of unitaries\ngenerated by the circuits is a t-design, and solve this equation for various\nexamples.\n","subjects":["Physics/Quantum Physics","Condensed Matter/Statistical Mechanics","Physics/High Energy Physics - Theory","Physics/Mathematical Physics","Mathematics/Mathematical Physics","Physics/Nuclear Theory"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}