{"id":"2408.06220","title":"A Digital Twin Framework Utilizing Machine Learning for Robust\n  Predictive Maintenance: Enhancing Tire Health Monitoring","authors":"Vispi Karkaria, Jie Chen, Christopher Luey, Chase Siuta, Damien Lim,\n  Robert Radulescu, Wei Chen","authorsParsed":[["Karkaria","Vispi",""],["Chen","Jie",""],["Luey","Christopher",""],["Siuta","Chase",""],["Lim","Damien",""],["Radulescu","Robert",""],["Chen","Wei",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 15:21:35 GMT"}],"updateDate":"2024-08-13","timestamp":1723476095000,"abstract":"  We introduce a novel digital twin framework for predictive maintenance of\nlong-term physical systems. Using monitoring tire health as an application, we\nshow how the digital twin framework can be used to enhance automotive safety\nand efficiency, and how the technical challenges can be overcome using a\nthree-step approach. Firstly, for managing the data complexity over a long\noperation span, we employ data reduction techniques to concisely represent\nphysical tires using historical performance and usage data. Relying on these\ndata, for fast real-time prediction, we train a transformer-based model offline\non our concise dataset to predict future tire health over time, represented as\nRemaining Casing Potential (RCP). Based on our architecture, our model\nquantifies both epistemic and aleatoric uncertainty, providing reliable\nconfidence intervals around predicted RCP. Secondly, to incorporate real-time\ndata, we update the predictive model in the digital twin framework, ensuring\nits accuracy throughout its life span with the aid of hybrid modeling and the\nuse of discrepancy function. Thirdly, to assist decision making in predictive\nmaintenance, we implement a Tire State Decision Algorithm, which strategically\ndetermines the optimal timing for tire replacement based on RCP forecasted by\nour transformer model. This approach ensures our digital twin accurately\npredicts system health, continually refines its digital representation, and\nsupports predictive maintenance decisions. Our framework effectively embodies a\nphysical system, leveraging big data and machine learning for predictive\nmaintenance, model updates, and decision-making.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"hkGdaBkuUVkJ7OHrG2UmOXoTXyhiAU-7Int5I2wQ_v0","pdfSize":"2494525"}
