{"id":"2408.14087","title":"LSM-YOLO: A Compact and Effective ROI Detector for Medical Detection","authors":"Zhongwen Yu, Qiu Guan, Jianmin Yang, Zhiqiang Yang, Qianwei Zhou, Yang\n  Chen, Feng Chen","authorsParsed":[["Yu","Zhongwen",""],["Guan","Qiu",""],["Yang","Jianmin",""],["Yang","Zhiqiang",""],["Zhou","Qianwei",""],["Chen","Yang",""],["Chen","Feng",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:16:58 GMT"}],"updateDate":"2024-08-27","timestamp":1724660218000,"abstract":"  In existing medical Region of Interest (ROI) detection, there lacks an\nalgorithm that can simultaneously satisfy both real-time performance and\naccuracy, not meeting the growing demand for automatic detection in medicine.\nAlthough the basic YOLO framework ensures real-time detection due to its fast\nspeed, it still faces challenges in maintaining precision concurrently. To\nalleviate the above problems, we propose a novel model named Lightweight Shunt\nMatching-YOLO (LSM-YOLO), with Lightweight Adaptive Extraction (LAE) and\nMultipath Shunt Feature Matching (MSFM). Firstly, by using LAE to refine\nfeature extraction, the model can obtain more contextual information and\nhigh-resolution details from multiscale feature maps, thereby extracting\ndetailed features of ROI in medical images while reducing the influence of\nnoise. Secondly, MSFM is utilized to further refine the fusion of high-level\nsemantic features and low-level visual features, enabling better fusion between\nROI features and neighboring features, thereby improving the detection rate for\nbetter diagnostic assistance. Experimental results demonstrate that LSM-YOLO\nachieves 48.6% AP on a private dataset of pancreatic tumors, 65.1% AP on the\nBCCD blood cell detection public dataset, and 73.0% AP on the Br35h brain tumor\ndetection public dataset. Our model achieves state-of-the-art performance with\nminimal parameter cost on the above three datasets. The source codes are at:\nhttps://github.com/VincentYuuuuuu/LSM-YOLO.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}