{"id":"2408.13367","title":"Generative Blockchain: Transforming Blockchain from Transaction\n  Recording to Transaction Generation through Proof-of-Merit","authors":"Haozhao Zhang, Zhe Zhang, Zhiqiang Zheng, Varghese Jacob","authorsParsed":[["Zhang","Haozhao",""],["Zhang","Zhe",""],["Zheng","Zhiqiang",""],["Jacob","Varghese",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 20:51:10 GMT"}],"updateDate":"2024-08-27","timestamp":1724446270000,"abstract":"  This paper proposes a new paradigm: generative blockchain, which aims to\ntransform conventional blockchain technology by combining transaction\ngeneration and recording, rather than focusing solely on transaction recording.\nCentral to our design is a novel consensus mechanism, Proof-of-Merit (PoM),\nspecifically crafted for environments where businesses must solve complex\nproblems before transactions can be recorded. PoM integrates the generation and\nrecording of transactions within a unified blockchain system, fundamentally\ndiffering from prevailing consensus mechanisms that primarily record existing\ntransactions. We demonstrate PoM on a ride service on-demand platform, where\nthe task of solving complex transaction-generating problems is delegated to a\npool of independent problem solvers. These solvers generate transactions, and\ntheir solutions are selected based on merit. The winning solvers then register\nthese transactions onto the blockchain and are rewarded accordingly. We\nintroduce a Decentralized Control Parameter (DCP) to balance two key\nperformance metrics: efficiency and equity. The applicability of our generative\nblockchain is illustrated through a ridesharing context, where matchers\n(solvers) are tasked with matching riders to drivers. We demonstrate PoM's\nperformance and nuanced properties using agent-based simulation, exploring how\nto find the optimal DCP value to achieve a desirable balance of efficiency and\nequity in a generative blockchain.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/"}