{"id":"2408.16644","title":"Thermoelectric Properties of Type-I and Type-II Nodal Line Semimetals: A\n  Comparative Study","authors":"Mohammad Norman Gaza Laksono and M Aziz Majidi and Ahmad R. T. Nugraha","authorsParsed":[["Laksono","Mohammad Norman Gaza",""],["Majidi","M Aziz",""],["Nugraha","Ahmad R. T.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 15:50:06 GMT"},{"version":"v2","created":"Thu, 12 Sep 2024 16:34:11 GMT"}],"updateDate":"2024-09-13","timestamp":1724946606000,"abstract":"  We investigate the thermoelectric (TE) properties of nodal line semimetals\n(NLSs) using a combination of semi-analytical calculations within Boltzmann's\nlinear transport theory and the relaxation time approximation, along with\nfirst-principles calculations for the so-called type-I and type-II NLSs. We\nconsider the conduction and valence bands that cross near the Fermi level of\nthese materials through first-principles calculations of typical type-I (TiS)\nand type-II (Mg$_3$Bi$_2$) NLSs and use the two-band model fit to find the\nFermi velocity $v_{F}$ and effective mass $m$ that will be employed as the\ninitial energy dispersion parameters. The optimum curvature value for each\nenergy band is searched by tuning the energy dispersion parameters to improve\nthe TE properties of the NLss. We can obtain the best $\\sim$$3.5\\%$ increase in\nthe Seebeck coefficient peak value compared to those using the initial\nparameter value in the type-I NLS, with the Seebeck coefficient ranging from\n$0.509S_{0}$ to $0.527S_{0}$ where $S_0 \\approx 86.17~\\mu$V/K. Meanwhile, the\nbest increase in power factor, as large as $\\sim$$83\\%$ the initial value, can\nbe obtained in the type-II NLS when $v_{F}$ is lowered. By systematically\ncomparing all of our calculation results, we observed that tuning $v_{F}$\nsignificantly improves TE properties in both types of NLS compared to tuning\n$m$. Our work is expected to trigger further calculations to scan other\npotential TE materials, particularly in the class of semimetals, by\nmanipulating their band structure through the variation of the curvatures of\ntheir energy bands.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}