{"id":"2408.14839","title":"Electronic Structure and Topology in Gulf-edged Zigzag Graphene\n  Nanoribbons","authors":"Tsai-Jung Liu, Florian M. Arnold, Alireza Ghasemifard, Qing-Long Liu,\n  Dorothea Golze, Agnieszka Kuc, Thomas Heine","authorsParsed":[["Liu","Tsai-Jung",""],["Arnold","Florian M.",""],["Ghasemifard","Alireza",""],["Liu","Qing-Long",""],["Golze","Dorothea",""],["Kuc","Agnieszka",""],["Heine","Thomas",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 07:47:30 GMT"}],"updateDate":"2024-08-28","timestamp":1724744850000,"abstract":"  With advanced synthetic techniques, a wide variety of well-defined graphene\nnano-ribbons (GNRs) can be produced with atomic precision. Hence, finding the\nrelation between their structures and properties becomes important for the\nrational design of GNRs. In this work, we explore the complete chemical space\nof gulf-edged zigzag graphene nanoribbons (ZGNR-Gs), a subclass of zigzag GNRs\nin which the zigzag edges miss carbon atoms in a regular sequence. We\ndemonstrate that the electronic properties of ZGNR-Gs depend on four structural\nparameters: ribbon width, gulf edge size, unit length, and gulf offset. Using\ntight-binding calculations and the Hubbard model, we find that all ZGNR-Gs are\nsemiconductors with varying band gaps; there are no metals in this class of\nmaterials. Notably, when spin polarization is considered, most ZGNR-Gs exhibit\nantiferromagnetic behavior, with the spin moments and spin-induced band gap\nopening being stabilized by longer zigzag segments at the edges. Furthermore,\nwe provide simple empirical rules that describe the Z2 topological invariant\nbased on the aforementioned structural parameters. By analyzing the full\nchemical space of ZGNR-Gs, we offer insights into the design of GNRs with\ndesired electronic, magnetic, and topological properties for nanoelectronic\napplications.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"i-Xo6IBf86WHz5QcnSAEAjdz4jQDATls0uRro5VAKEc","pdfSize":"6979181"}
