{"id":"2408.01999","title":"Reinforcement Learning for an Efficient and Effective Malware\n  Investigation during Cyber Incident Response","authors":"Dipo Dunsin, Mohamed Chahine Ghanem, Karim Ouazzane, Vassil Vassilev","authorsParsed":[["Dunsin","Dipo",""],["Ghanem","Mohamed Chahine",""],["Ouazzane","Karim",""],["Vassilev","Vassil",""]],"versions":[{"version":"v1","created":"Sun, 4 Aug 2024 11:55:24 GMT"}],"updateDate":"2024-08-06","timestamp":1722772524000,"abstract":"  This research focused on enhancing post-incident malware forensic\ninvestigation using reinforcement learning RL. We proposed an advanced MDP post\nincident malware forensics investigation model and framework to expedite post\nincident forensics. We then implement our RL Malware Investigation Model based\non structured MDP within the proposed framework. To identify malware artefacts,\nthe RL agent acquires and examines forensics evidence files, iteratively\nimproving its capabilities using Q Table and temporal difference learning. The\nQ learning algorithm significantly improved the agent ability to identify\nmalware. An epsilon greedy exploration strategy and Q learning updates enabled\nefficient learning and decision making. Our experimental testing revealed that\noptimal learning rates depend on the MDP environment complexity, with simpler\nenvironments benefiting from higher rates for quicker convergence and complex\nones requiring lower rates for stability. Our model performance in identifying\nand classifying malware reduced malware analysis time compared to human\nexperts, demonstrating robustness and adaptability. The study highlighted the\nsignificance of hyper parameter tuning and suggested adaptive strategies for\ncomplex environments. Our RL based approach produced promising results and is\nvalidated as an alternative to traditional methods notably by offering\ncontinuous learning and adaptation to new and evolving malware threats which\nultimately enhance the post incident forensics investigations.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"4tecXHKElx84p057j7sa_DPqC8X_P_5QNNtjSe_HYUc","pdfSize":"4723375"}
