{"id":"2408.16710","title":"Fundamentals of LEO Based Localization","authors":"Don-Roberts Emenonye, Harpreet S. Dhillon, and R. Michael Buehrer","authorsParsed":[["Emenonye","Don-Roberts",""],["Dhillon","Harpreet S.",""],["Buehrer","R. Michael",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 17:05:15 GMT"},{"version":"v2","created":"Tue, 3 Sep 2024 21:24:56 GMT"}],"updateDate":"2024-09-05","timestamp":1724951115000,"abstract":"  In this paper, we derive the fundamental limits of low earth orbit (LEO)\nenabled localization by analyzing the available information in signals from\nmultiple LEOs during different transmission time slots received on a multiple\nantennas and evaluate the utility of these signals for $9$D localization ($3$D\nposition, $3$D orientation, and $3$D velocity estimation). We start by deriving\nthe Fisher Information Matrix (FIM) for the channel parameters that are present\nin the signals received from LEOs in the same or multiple constellations during\nmultiple transmission time slots. To accomplish this, we define a system model\nthat captures i) time offset between LEOs caused by having relatively cheap\nclocks, ii) frequency offset between LEOs, iii) the unknown Doppler rate caused\nby high mobility LEOs, and iv) multiple transmission time slots from a\nparticular LEO. We transform the FIM for the channel parameters to the FIM for\nthe location parameters and determine the required conditions for localization.\nTo do this, we start with the $3$D localization cases: i) $3$D positioning with\nknown velocity and orientation, ii) $3$D orientation estimation with known\nposition and velocity, and iii) $3$D velocity estimation with known position\nand orientation. Subsequently, we derive the FIM for the full $9$D localization\ncase ($3$D position, $3$D orientation, and $3$D velocity estimation) in terms\nof the FIM for the $3$D localization. Using these results, we determine the\nnumber of LEOs, the operating frequency, the number of transmission time slots,\nand the number of receive antennas that allow for different levels of location\nestimation.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by/4.0/"}