{"id":"2408.08107","title":"Communication-robust and Privacy-safe Distributed Estimation for\n  Heterogeneous Community-level Behind-the-meter Solar Power Generation","authors":"Jinglei Feng, Zhengshuo Li","authorsParsed":[["Feng","Jinglei",""],["Li","Zhengshuo",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 12:11:03 GMT"}],"updateDate":"2024-08-16","timestamp":1723723863000,"abstract":"  The rapid growth of behind-the-meter (BTM) solar power generation systems\npresents challenges for distribution system planning and scheduling due to\ninvisible solar power generation. To address the data leakage problem of\ncentralized machine-learning methods in BTM solar power generation estimation,\nthe federated learning (FL) method has been investigated for its distributed\nlearning capability. However, the conventional FL method has encountered\nvarious challenges, including heterogeneity, communication failures, and\nmalicious privacy attacks. To overcome these challenges, this study proposes a\ncommunication-robust and privacy-safe distributed estimation method for\nheterogeneous community-level BTM solar power generation. Specifically, this\nstudy adopts multi-task FL as the main structure and learns the common and\nunique features of all communities. Simultaneously, it embeds an updated\nparameters estimation method into the multi-task FL, automatically identifies\nsimilarities between any two clients, and estimates the updated parameters for\nunavailable clients to mitigate the negative effects of communication failures.\nFinally, this study adopts a differential privacy mechanism under the dynamic\nprivacy budget allocation strategy to combat malicious privacy attacks and\nimprove model training efficiency. Case studies show that in the presence of\nheterogeneity and communication failures, the proposed method exhibits better\nestimation accuracy and convergence performance as compared with traditional FL\nand localized learning methods, while providing stronger privacy protection.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"n3gL7ZJC-24bCK9F5MlGbyoBZ0F-3wwMx_K5_ZWZPrg","pdfSize":"1244441"}
