{"id":"2408.11499","title":"Power-Domain Interference Graph Estimation for Multi-hop BLE Networks","authors":"Haifeng Jia, Yichen Wei, Yibo Pi and Cailian Chen","authorsParsed":[["Jia","Haifeng",""],["Wei","Yichen",""],["Pi","Yibo",""],["Chen","Cailian",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:15:39 GMT"},{"version":"v2","created":"Thu, 22 Aug 2024 13:41:54 GMT"}],"updateDate":"2024-08-23","timestamp":1724235339000,"abstract":"  Traditional wisdom for network management allocates network resources\nseparately for the measurement and communication tasks. Heavy measurement tasks\nmay compete limited resources with communication tasks and significantly\ndegrade overall network performance. It is therefore challenging for the\ninterference graph, deemed as incurring heavy measurement overhead, to be used\nin practice in wireless networks. To address this challenge in wireless sensor\nnetworks, our core insight is to use power as a new dimension for interference\ngraph estimation (IGE) such that IGE can be done simultaneously with the\ncommunication tasks using the same frequency-time resources. We propose to\nmarry power-domain IGE with concurrent flooding to achieve simultaneous\nmeasurement and communication in BLE networks, where the power linearity\nprerequisite for power-domain IGE holds naturally true in concurrent flooding.\nWith extensive experiments, we conclude the necessary conditions for the power\nlinearity to hold and analyze several nonlinearity issues of power related to\nhardware imperfections. We design and implement network protocols and power\ncontrol algorithms for IGE in multi-hop BLE networks and conduct experiments to\nshow that the marriage is mutually beneficial for both IGE and concurrent\nflooding. Furthermore, we demonstrate the potential of IGE in improving channel\nmap convergence and convergecast in BLE networks.\n","subjects":["Computing Research Repository/Networking and Internet Architecture"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}