{"id":"2408.14083","title":"Fluid wetting and penetration characteristics in T-shaped microchannels","authors":"Huijie Zhang, Anja Lippert, Ronny Leonhardt, Tobias Tolle, Luise\n  Nagel3, Tomislav Maric","authorsParsed":[["Zhang","Huijie",""],["Lippert","Anja",""],["Leonhardt","Ronny",""],["Tolle","Tobias",""],["Nagel3","Luise",""],["Maric","Tomislav",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 08:10:42 GMT"}],"updateDate":"2024-08-27","timestamp":1724659842000,"abstract":"  A thorough understanding of media tightness in automotive electronics is\ncrucial for ensuring more reliable and compact product designs, ultimately\nimproving product quality. Concerning the fundamental characteristics of fluid\nleakage issues, the dynamic wetting and penetration behavior on small scales is\nof special interest and importance. In this work, four T-shaped microchannels\nwith one inlet and two outlets are experimentally investigated in terms of\ncontact angle dynamics and interface movement over time, generating novel\ninsight into the wetting mechanisms and fluid distribution. With a main channel\nwidth of 1 mm, a crevice width of w = 0.3 mm, 0.4 mm and a rounding edge radius\nof r = 0.1 mm, 0.2 mm, the geometrical effects on the fluid penetration depth\nin the crevice and the interface edge pinning effect are analyzed\nquantitatively using an automated image processing procedure. It is found that\nthe measured dynamic contact angles in all parts can be well described by\nmolecular kinetic theory using local contact line velocities, even with local\nsurface effects and abrupt geometry changes. Moreover, a smaller crevice width,\na sharper edge and a larger flow velocity tend to enhance the interface pinning\neffect and prevent fluid penetration into the crevice. The rounding radius has\na more significant effect on the interface pinning compared with crevice width.\nThe experimental data and image processing algorithm are made publicly\navailable.\n","subjects":["Physics/Fluid Dynamics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M9PyO2mSiDQUvsJ4evwt1SToFtYXblFVKlIJsnzblx8","pdfSize":"22709108"}
