{"id":"2408.01695","title":"Transformer for seismic image super-resolution","authors":"Shiqi Dong, Xintong Dong, Kaiyuan Zheng, Ming Cheng, Tie Zhong,\n  Hongzhou Wang","authorsParsed":[["Dong","Shiqi",""],["Dong","Xintong",""],["Zheng","Kaiyuan",""],["Cheng","Ming",""],["Zhong","Tie",""],["Wang","Hongzhou",""]],"versions":[{"version":"v1","created":"Sat, 3 Aug 2024 07:30:38 GMT"}],"updateDate":"2024-08-06","timestamp":1722670238000,"abstract":"  Seismic images obtained by stacking or migration are usually characterized as\nlow signal-to-noise ratio (SNR), low dominant frequency and sparse sampling\nboth in depth (or time) and offset dimensions. For improving the resolution of\nseismic images, we proposed a deep learning-based method to achieve\nsuper-resolution (SR) in only one step, which means performing the denoising,\ninterpolation and frequency extrapolation at the same time. We design a seismic\nimage super-resolution Transformer (SIST) to extract and fuse local and global\nfeatures, which focuses more on the energy and extension shapes of effective\nevents (horizons, folds and faults, etc.) from noisy seismic images. We extract\nthe edge images of input images by Canny algorithm as masks to generate the\ninput data with double channels, which improves the amplitude preservation and\nreduces the interference of noises. The residual groups containing\nSwin-Transformer blocks and residual connections consist of the backbone of\nSIST, which extract the global features in a window with preset size and\ndecrease computational cost meanwhile. The pixel shuffle layers are used to\nup-sample the output feature maps from the backbone to improve the edges,\nmeanwhile up-sampling the input data through a skip connection to enhance the\namplitude preservation of the final images especially for clarifying weak\nevents. 3-dimensional synthetic seismic volumes with complex geological\nstructures are created, and the amplitudes of half of the volumes are mixtures\nof strong and weak, then select 2-dimensional slices randomly to generate\ntraining datasets which fits field data well to perform supervised learning.\nBoth numerical tests on synthetic and field data in different exploration\nregions demonstrate the feasibility of our method.\n","subjects":["Physics/Geophysics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}