{"id":"2408.09104","title":"HybridOcc: NeRF Enhanced Transformer-based Multi-Camera 3D Occupancy\n  Prediction","authors":"Xiao Zhao, Bo Chen, Mingyang Sun, Dingkang Yang, Youxing Wang, Xukun\n  Zhang, Mingcheng Li, Dongliang Kou, Xiaoyi Wei, and Lihua Zhang","authorsParsed":[["Zhao","Xiao",""],["Chen","Bo",""],["Sun","Mingyang",""],["Yang","Dingkang",""],["Wang","Youxing",""],["Zhang","Xukun",""],["Li","Mingcheng",""],["Kou","Dongliang",""],["Wei","Xiaoyi",""],["Zhang","Lihua",""]],"versions":[{"version":"v1","created":"Sat, 17 Aug 2024 05:50:51 GMT"}],"updateDate":"2024-08-20","timestamp":1723873851000,"abstract":"  Vision-based 3D semantic scene completion (SSC) describes autonomous driving\nscenes through 3D volume representations. However, the occlusion of invisible\nvoxels by scene surfaces poses challenges to current SSC methods in\nhallucinating refined 3D geometry. This paper proposes HybridOcc, a hybrid 3D\nvolume query proposal method generated by Transformer framework and NeRF\nrepresentation and refined in a coarse-to-fine SSC prediction framework.\nHybridOcc aggregates contextual features through the Transformer paradigm based\non hybrid query proposals while combining it with NeRF representation to obtain\ndepth supervision. The Transformer branch contains multiple scales and uses\nspatial cross-attention for 2D to 3D transformation. The newly designed NeRF\nbranch implicitly infers scene occupancy through volume rendering, including\nvisible and invisible voxels, and explicitly captures scene depth rather than\ngenerating RGB color. Furthermore, we present an innovative occupancy-aware ray\nsampling method to orient the SSC task instead of focusing on the scene\nsurface, further improving the overall performance. Extensive experiments on\nnuScenes and SemanticKITTI datasets demonstrate the effectiveness of our\nHybridOcc on the SSC task.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}