{"id":"2408.03675","title":"NACL: A General and Effective KV Cache Eviction Framework for LLMs at\n  Inference Time","authors":"Yilong Chen and Guoxia Wang and Junyuan Shang and Shiyao Cui and\n  Zhenyu Zhang and Tingwen Liu and Shuohuan Wang and Yu Sun and Dianhai Yu and\n  Hua Wu","authorsParsed":[["Chen","Yilong",""],["Wang","Guoxia",""],["Shang","Junyuan",""],["Cui","Shiyao",""],["Zhang","Zhenyu",""],["Liu","Tingwen",""],["Wang","Shuohuan",""],["Sun","Yu",""],["Yu","Dianhai",""],["Wu","Hua",""]],"versions":[{"version":"v1","created":"Wed, 7 Aug 2024 10:31:07 GMT"},{"version":"v2","created":"Thu, 8 Aug 2024 01:20:13 GMT"}],"updateDate":"2024-08-09","timestamp":1723026667000,"abstract":"  Large Language Models (LLMs) have ignited an innovative surge of AI\napplications, marking a new era of exciting possibilities equipped with\nextended context windows. However, hosting these models is cost-prohibitive\nmainly due to the extensive memory consumption of KV Cache involving\nlong-context modeling. Despite several works proposing to evict unnecessary\ntokens from the KV Cache, most of them rely on the biased local statistics of\naccumulated attention scores and report performance using unconvincing metric\nlike perplexity on inadequate short-text evaluation. In this paper, we propose\nNACL, a general framework for long-context KV cache eviction that achieves more\noptimal and efficient eviction in a single operation during the encoding phase.\nDue to NACL's efficiency, we combine more accurate attention score statistics\nin PROXY TOKENS EVICTION with the diversified random eviction strategy of\nRANDOM EVICTION, aiming to alleviate the issue of attention bias and enhance\nthe robustness in maintaining pivotal tokens for long-context modeling tasks.\nNotably, our method significantly improves the performance on short- and\nlong-text tasks by 80% and 76% respectively, reducing KV Cache by up to 50%\nwith over 95% performance maintenance. The code is available at\nhttps://github.com/PaddlePaddle/Research/tree/master/NLP/ACL2024-NACL.\n","subjects":["Computing Research Repository/Computation and Language"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}