{"id":"2408.00350","title":"A Simple Background Augmentation Method for Object Detection with\n  Diffusion Model","authors":"Yuhang Li, Xin Dong, Chen Chen, Weiming Zhuang, Lingjuan Lyu","authorsParsed":[["Li","Yuhang",""],["Dong","Xin",""],["Chen","Chen",""],["Zhuang","Weiming",""],["Lyu","Lingjuan",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 07:40:00 GMT"}],"updateDate":"2024-08-02","timestamp":1722498000000,"abstract":"  In computer vision, it is well-known that a lack of data diversity will\nimpair model performance. In this study, we address the challenges of enhancing\nthe dataset diversity problem in order to benefit various downstream tasks such\nas object detection and instance segmentation. We propose a simple yet\neffective data augmentation approach by leveraging advancements in generative\nmodels, specifically text-to-image synthesis technologies like Stable\nDiffusion. Our method focuses on generating variations of labeled real images,\nutilizing generative object and background augmentation via inpainting to\naugment existing training data without the need for additional annotations. We\nfind that background augmentation, in particular, significantly improves the\nmodels' robustness and generalization capabilities. We also investigate how to\nadjust the prompt and mask to ensure the generated content comply with the\nexisting annotations. The efficacy of our augmentation techniques is validated\nthrough comprehensive evaluations of the COCO dataset and several other key\nobject detection benchmarks, demonstrating notable enhancements in model\nperformance across diverse scenarios. This approach offers a promising solution\nto the challenges of dataset enhancement, contributing to the development of\nmore accurate and robust computer vision models.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"j1eO_ODqRfXrZiczabtrFv50iIdmaJNNt8E1ArIntd4","pdfSize":"6502581"}
