{"id":"2408.04624","title":"Flaring Activity for Low-Mass Stars in the $\\beta$ Pictoris Moving Group","authors":"Jordan N. Ealy, Joshua E. Schlieder, Thaddeus D. Komacek, Emily A.\n  Gilbert","authorsParsed":[["Ealy","Jordan N.",""],["Schlieder","Joshua E.",""],["Komacek","Thaddeus D.",""],["Gilbert","Emily A.",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 17:55:15 GMT"}],"updateDate":"2024-08-09","timestamp":1723139715000,"abstract":"  Stellar flares from K and M dwarfs release panchromatic radiation\ncharacterized by a significantly higher brightness temperature ($\\sim$9-20 kK)\nthan the star. The increased frequency of magnetic activity on young low-mass\nstars results in the energy released during flaring events becoming a notable\ncontributor to the radiation environment. This study focuses on the $\\beta$\nPictoris moving group (24 $\\pm$ 3 Myr) for the analysis of young, low-mass star\nflaring rates within the framework of larger flare studies. The calibration of\nlong-term optical flare statistics is crucial to updating flare activity-age\nrelations and the interpretation of exoplanet atmosphere observations. Using\nthe $\\beta$ Pictoris moving group, we develop a modular flare extraction\npipeline sensitive to low-mass stellar flares in observations from the\nTransiting Exoplanet Survey Satellite. This pipeline is built to characterize\nflare properties of these stars such as total energy and cumulative flare rate.\nConsistent with previous studies, this sample (N=49) shows higher cumulative\nflare rates than early type and old field stars by at least an order of\nmagnitude. Fitted flare frequency distributions for both early and late type M\ndwarfs show an average slope of $1.58 \\pm 0.23$ with earlier stars flaring with\nlower or similar rates to late types. A typical member in this sample has daily\n($\\mathrm{\\sim 1 \\, d^{-1}}$ ) flares with TESS band energies of $10^{32} -\n10^{33}$ ergs. The optical flare rates and energies for this group provide\nessential context into the co-evolution of host stars and associated planets.\n","subjects":["Astrophysics/Solar and Stellar Astrophysics","Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"2B8iN9OL2QnAIJLMizNcldYlP_-ujdcKKtDEwoR3qzM","pdfSize":"1074201"}
