{"id":"2408.10569","title":"Navigating Dimensionality through State Machines in Automotive System\n  Validation","authors":"Laurenz Adolph, barbara Sch\\\"utt, David Kraus, Eric Sax","authorsParsed":[["Adolph","Laurenz",""],["Schütt","barbara",""],["Kraus","David",""],["Sax","Eric",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 06:17:21 GMT"}],"updateDate":"2024-08-21","timestamp":1724134641000,"abstract":"  The increasing automation of vehicles is resulting in the integration of more\nextensive in-vehicle sensor systems, electronic control units, and software.\nAdditionally, vehicle-to-everything communication is seen as an opportunity to\nextend automated driving capabilities through information from a source outside\nthe ego vehicle. However, the validation and verification of automated driving\nfunctions already pose a challenge due to the number of possible scenarios that\ncan occur for a driving function, which makes it difficult to achieve\ncomprehensive test coverage. Currently, the establishment of Safety Of The\nIntended Functionality ( SOTIF ) mandates the implementation of scenario-based\ntesting. The introduction of additional external systems through\nvehicle-to-everything further complicates the problem and increases the\nscenario space. In this paper, a methodology based on state charts is proposed\nfor modeling the interaction with external systems, which may remain as black\nboxes. This approach leverages the testability and coverage analysis inherent\nin state charts by combining them with scenario-based testing. The overall\nobjective is to reduce the space of scenarios necessary for testing a networked\ndriving function and to streamline validation and verification. The utilization\nof this approach is demonstrated using a simulated signalized intersection with\na roadside unit that detects vulnerable road users.\n","subjects":["Computing Research Repository/Robotics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}