{"id":"2408.11505","title":"MSCPT: Few-shot Whole Slide Image Classification with Multi-scale and\n  Context-focused Prompt Tuning","authors":"Minghao Han, Linhao Qu, Dingkang Yang, Xukun Zhang, Xiaoying Wang,\n  Lihua Zhang","authorsParsed":[["Han","Minghao",""],["Qu","Linhao",""],["Yang","Dingkang",""],["Zhang","Xukun",""],["Wang","Xiaoying",""],["Zhang","Lihua",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 10:25:51 GMT"}],"updateDate":"2024-08-22","timestamp":1724235951000,"abstract":"  Multiple instance learning (MIL) has become a standard paradigm for weakly\nsupervised classification of whole slide images (WSI). However, this paradigm\nrelies on the use of a large number of labelled WSIs for training. The lack of\ntraining data and the presence of rare diseases present significant challenges\nfor these methods. Prompt tuning combined with the pre-trained Vision-Language\nmodels (VLMs) is an effective solution to the Few-shot Weakly Supervised WSI\nclassification (FSWC) tasks. Nevertheless, applying prompt tuning methods\ndesigned for natural images to WSIs presents three significant challenges: 1)\nThese methods fail to fully leverage the prior knowledge from the VLM's text\nmodality; 2) They overlook the essential multi-scale and contextual information\nin WSIs, leading to suboptimal results; and 3) They lack exploration of\ninstance aggregation methods. To address these problems, we propose a\nMulti-Scale and Context-focused Prompt Tuning (MSCPT) method for FSWC tasks.\nSpecifically, MSCPT employs the frozen large language model to generate\npathological visual language prior knowledge at multi-scale, guiding\nhierarchical prompt tuning. Additionally, we design a graph prompt tuning\nmodule to learn essential contextual information within WSI, and finally, a\nnon-parametric cross-guided instance aggregation module has been introduced to\nget the WSI-level features. Based on two VLMs, extensive experiments and\nvisualizations on three datasets demonstrated the powerful performance of our\nMSCPT.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}