{"id":"2408.16897","title":"Algebraic method of group classification for semi-normalized classes of\n  differential equations","authors":"Celestin Kurujyibwami, Dmytro R. Popovych and Roman O. Popovych","authorsParsed":[["Kurujyibwami","Celestin",""],["Popovych","Dmytro R.",""],["Popovych","Roman O.",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 20:42:04 GMT"}],"updateDate":"2024-09-02","timestamp":1724964124000,"abstract":"  We generalize the notion of semi-normalized classes of systems of\ndifferential equations, study properties of such classes and extend the\nalgebraic method of group classification to them. In particular, we prove the\nimportant theorems on factoring out symmetry groups and invariance algebras of\nsystems from semi-normalized classes and on splitting such groups and algebras\nwithin disjointedly semi-normalized classes. Nontrivial particular examples of\nclasses that arise in real-world applications and showcase the relevance of the\ndeveloped theory are provided. To convincingly illustrate the efficiency of the\nproposed method, we apply it to the group classification problem for the class\nof linear Schr\\\"odinger equations with complex-valued potentials and the\ngeneral value of the space dimension. We compute the equivalence groupoid of\nthe class by the direct method and thus show that this class is uniformly\nsemi-normalized with respect to the linear superposition of solutions. This is\nwhy the group classification problem reduces to the classification of specific\nlow-dimensional subalgebras of the associated equivalence algebra, which is\ncompletely realized for the case of space dimension two. Splitting into\ndifferent classification cases is based on three integer parameters that are\ninvariant with respect to equivalence transformations. We also single out those\nof the obtained results that are relevant to linear Schr\\\"odinger equations\nwith real-valued potentials.\n","subjects":["Physics/Mathematical Physics","Mathematics/Analysis of PDEs","Mathematics/Mathematical Physics","Physics/Quantum Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}