{"id":"2408.05365","title":"FiSTECH: Financial Style Transfer to Enhance Creativity without\n  Hallucinations in LLMs","authors":"Sohini Roychowdhury, Marko Krema, Brian Moore, Xingjian Lai, Dike\n  Effedua, Bharat Jethwani","authorsParsed":[["Roychowdhury","Sohini",""],["Krema","Marko",""],["Moore","Brian",""],["Lai","Xingjian",""],["Effedua","Dike",""],["Jethwani","Bharat",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 22:29:23 GMT"},{"version":"v2","created":"Thu, 19 Sep 2024 01:23:47 GMT"}],"updateDate":"2024-09-20","timestamp":1723242563000,"abstract":"  Financial report generation using general purpose large language models\n(LLMs) pose two major challenges namely, the lack of compound sentences and\nhallucinations. Advanced prompt engineering and retrieval augmented generation\n(RAG) techniques are limited in scope for curing these writing style\ndiscrepancies. In this work we propose a novel two-stage fine-tuning (FT)\nprocess wherein public domain financial reports are processed into\nprompt-completions and augmented using simple LLM prompts to then enable\nsectional financial report generation using minimal instructions and tabular\ndata inputs. The proposed fine-tuning process exploits the self-learning\ncapability of LLMs by allowing hallucinations in the first stage and showing\nthe corrections in the second stage. Our proposed fine-tuning framework results\ndoubles the number of correct questions answers and reduces hallucinations by\nover 50%. Additionally, the two-stage FT model has lower perplexity, improved\nROUGE, TER and BLEU scores, higher creativity and knowledge density with lower\nuncertainty and cross entropy. Thus, the proposed framework can be generalized\nto domain specific fine-tuning tasks at minimized tuning costs.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computational Engineering, Finance, and Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}