{"id":"2408.13156","title":"Ultrafast measurement of field-particle energy transfer during chorus\n  emissions in space","authors":"C. M. Liu, B. N. Zhao, J. B. Cao, C. J. Pollock, C. T. Russell, Y. Y.\n  Liu, X. N. Xing, P. A. Linqvist, and J. L. Burch","authorsParsed":[["Liu","C. M.",""],["Zhao","B. N.",""],["Cao","J. B.",""],["Pollock","C. J.",""],["Russell","C. T.",""],["Liu","Y. Y.",""],["Xing","X. N.",""],["Linqvist","P. A.",""],["Burch","J. L.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 15:26:42 GMT"}],"updateDate":"2024-08-26","timestamp":1724426802000,"abstract":"  Chorus is one of the strongest electromagnetic emissions naturally occurring\nin space, and can cause hazardous radiations to humans and satellites1-3.\nAlthough chorus has attracted extreme interest and been intensively studied for\ndecades4-7, its generation and evolution remain highly debated, due to the\ncomplexity of the underlying physics and the limited capacity of previous\nspacecraft missions7. Chorus has also been believed to be governed by planetary\nmagnetic dipolar fields5,7. Contrary to such conventional expectation, here we\nreport unexpected observations of chorus in the terrestrial neutral sheet where\nmagnetic dipolar effect is absent. Using unprecedentedly high-cadence data from\nthe Magnetospheric Multiscale Mission, we present the first, ultrafast\nmeasurements of the wave dispersion relation and electron three-dimensional\ndistributions within the waves, showing smoking-gun evidences for\nchorus-electron interactions and development of electron holes in the wave\nphase space. We estimate field-particle energy transfer inside the waves and\nfind that the waves were extracting energy from local thermal electrons, in\nline with the wave positive growth rate derived from instability analysis. Our\nobservations, opening new pathways for resolving long-standing controversies\nregarding the chorus emissions, are crucial for understanding nonlinear energy\ntransport ubiquitously observed in space and astrophysical environments.\n","subjects":["Physics/Space Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}