{"id":"2408.16415","title":"UAV's Rotor Micro-Doppler Feature Extraction Using Integrated Sensing\n  and Communication Signal: Algorithm Design and Testbed Evaluation","authors":"Jiachen Wei, Dingyou Ma, Feiyang He, Qixun Zhang, Zhiyong Feng,\n  Zhengfeng Liu, Taohong Liang","authorsParsed":[["Wei","Jiachen",""],["Ma","Dingyou",""],["He","Feiyang",""],["Zhang","Qixun",""],["Feng","Zhiyong",""],["Liu","Zhengfeng",""],["Liang","Taohong",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 10:21:02 GMT"}],"updateDate":"2024-08-30","timestamp":1724926862000,"abstract":"  With the rapid application of unmanned aerial vehicles (UAVs) in urban areas,\nthe identification and tracking of hovering UAVs have become critical\nchallenges, significantly impacting the safety of aircraft take-off and landing\noperations. As a promising technology for 6G mobile systems, integrated sensing\nand communication (ISAC) can be used to detect high-mobility UAVs with a low\ndeployment cost. The micro-Doppler signals from UAV rotors can be leveraged to\naddress the detection of low-mobility and hovering UAVs using ISAC signals.\nHowever, determining whether the frame structure of the ISAC system can be used\nto identify UAVs, and how to accurately capture the weak rotor micro-Doppler\nsignals of UAVs in complex environments, remain two challenging problems. This\npaper first proposes a novel frame structure for UAV micro-Doppler extraction\nand the representation of UAV micro-Doppler signals within the channel state\ninformation (CSI). Furthermore, to address complex environments and the\ninterference caused by UAV body vibrations, the rotor micro-Doppler null space\npursuit (rmD-NSP) algorithm and the feature extraction algorithm\nsynchroextracting transform (SET) are designed to effectively separate UAV's\nrotor micro-Doppler signals and enhance their features in the spectrogram.\nFinally, both simulation and hardware testbed demonstrate that the proposed\nrmD-NSP algorithm enables the ISAC base station (BS) to accurately and\ncompletely extract UAV's rotor micro-Doppler signals. Within a 0.1s observation\nperiod, ISAC BS successfully captures eight rotations of the DJI M300 RTK UAV's\nrotor in urban environments. Compared to the existing AM-FM NSP and NSP signal\ndecomposition algorithms, the integrity of the rotor micro-Doppler features is\nimproved by 60%.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing","Computing Research Repository/Emerging Technologies"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}