{"id":"2408.04923","title":"Synthetic Grid Generator: Synthesizing Large-Scale Power Distribution\n  Grids using Open Street Map","authors":"Chandra Sekhar Charan Dande, Luca Mattorolo, Joel da Silva Andre,\n  Lydia Lavecchia, Nikolaos Efkarpidis, and Damiano Toffanin","authorsParsed":[["Dande","Chandra Sekhar Charan",""],["Mattorolo","Luca",""],["Andre","Joel da Silva",""],["Lavecchia","Lydia",""],["Efkarpidis","Nikolaos",""],["Toffanin","Damiano",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 08:07:32 GMT"},{"version":"v2","created":"Mon, 26 Aug 2024 16:30:18 GMT"}],"updateDate":"2024-08-27","timestamp":1723190852000,"abstract":"  Nowadays, various stakeholders involved in the analysis of electric power\ndistribution grids face difficulties in the data acquisition related to the\ngrid topology and parameters of grid assets. To mitigate the problem and\npossibly accelerate the accomplishment of grid studies without access to real\ndata, we propose a novel approach for generating synthetic distribution grids\n(Syngrids) of (almost) arbitrary size replicating the characteristics of real\nmedium- and low-voltage distribution networks. The method enables large-scale\ntesting without incurring the burden of retrieving and pre-processing\nreal-world data. The proposed algorithm exploits the publicly available\ninformation of Open Street Map (OSM). By leveraging geospatial data of real\nbuildings and road networks, the approach allows to construct a Syngrid of\nchosen size with realistic topology and electrical parameters. It is shown that\ntypical power-flow and short-circuit calculations can be performed on Syngrids\nensuring convergence. Within the context of validating the effectiveness of the\nalgorithm and the meaningful similarity of the output to real grids, the\ntopological and electrical characteristics of a Syngrid are compared to their\nreal-world counterparts. Finally, an open-source web platform named as\nSynthetic Grid Generator (SGG) and based on the proposed algorithm can be used\nby various stakeholders for the creation of synthetic grids.\n","subjects":["Electrical Engineering and Systems Science/Systems and Control","Computing Research Repository/Systems and Control"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"sUrjVu6Jgq6G3XLFeac4_RnY_wDz9IPLQmAiYalosmY","pdfSize":"5050370"}
