{"id":"2408.15707","title":"Atmospheric retrievals suggest the presence of a secondary atmosphere\n  and possible sulfur species on L 98-59 d from JWST NIRSpec G395H transmission\n  spectroscopy","authors":"Agnibha Banerjee, Joanna K. Barstow, Am\\'elie Gressier, N\\'estor\n  Espinoza, David K. Sing, Natalie H. Allen, Stephan M. Birkmann, Ryan C.\n  Challener, Nicolas Crouzet, Carole A. Haswell, Nikole K. Lewis, Stephen R.\n  Lewis, Jingxuan Yang","authorsParsed":[["Banerjee","Agnibha",""],["Barstow","Joanna K.",""],["Gressier","Amélie",""],["Espinoza","Néstor",""],["Sing","David K.",""],["Allen","Natalie H.",""],["Birkmann","Stephan M.",""],["Challener","Ryan C.",""],["Crouzet","Nicolas",""],["Haswell","Carole A.",""],["Lewis","Nikole K.",""],["Lewis","Stephen R.",""],["Yang","Jingxuan",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 11:11:14 GMT"}],"updateDate":"2024-08-29","timestamp":1724843474000,"abstract":"  L 98-59 d is a Super-Earth planet orbiting an M-type star. We performed\nretrievals on the transmission spectrum of L 98-59 d obtained using NIRSpec\nG395H during a single transit, from JWST Cycle 1 GTO 1224. The wavelength range\nof this spectrum allows us to detect the presence of several atmospheric\nspecies. We found that the spectrum is consistent with a high mean molecular\nweight atmosphere. The atmospheric spectrum indicates the possible presence of\nthe sulfur-bearing species H$_2$S and SO$_2$, which could hint at active\nvolcanism on this planet if verified by future observations. We also tested for\nsigns of stellar contamination in the spectrum, and found signs of unocculted\nfaculae on the star. The tentative signs of an atmosphere on L 98-59 d\npresented in this work from just one transit bodes well for possible molecular\ndetections in the future, particularly as it is one of the best targets among\nsmall exoplanets for atmospheric characterization using JWST.\n","subjects":["Astrophysics/Earth and Planetary Astrophysics"],"license":"http://creativecommons.org/licenses/by/4.0/"}