{"id":"2408.13623","title":"Prompt-Softbox-Prompt: A free-text Embedding Control for Image Editing","authors":"Yitong Yang, Yinglin Wang, Jing Wang, Tian Zhang","authorsParsed":[["Yang","Yitong",""],["Wang","Yinglin",""],["Wang","Jing",""],["Zhang","Tian",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 16:33:26 GMT"},{"version":"v2","created":"Tue, 27 Aug 2024 01:59:59 GMT"}],"updateDate":"2024-08-28","timestamp":1724517206000,"abstract":"  Text-driven diffusion models have achieved remarkable success in image\nediting, but a crucial component in these models-text embeddings-has not been\nfully explored. The entanglement and opacity of text embeddings present\nsignificant challenges to achieving precise image editing. In this paper, we\nprovide a comprehensive and in-depth analysis of text embeddings in Stable\nDiffusion XL, offering three key insights. First, while the 'aug_embedding'\ncaptures the full semantic content of the text, its contribution to the final\nimage generation is relatively minor. Second, 'BOS' and 'Padding_embedding' do\nnot contain any semantic information. Lastly, the 'EOS' holds the semantic\ninformation of all words and contains the most style features. Each word\nembedding plays a unique role without interfering with one another. Based on\nthese insights, we propose a novel approach for controllable image editing\nusing a free-text embedding control method called PSP (Prompt-Softbox-Prompt).\nPSP enables precise image editing by inserting or adding text embeddings within\nthe cross-attention layers and using Softbox to define and control the specific\narea for semantic injection. This technique allows for obejct additions and\nreplacements while preserving other areas of the image. Additionally, PSP can\nachieve style transfer by simply replacing text embeddings. Extensive\nexperimental results show that PSP achieves significant results in tasks such\nas object replacement, object addition, and style transfer.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}