{"id":"2408.04494","title":"A new quantization scheme of black holes in effective loop quantum\n  gravity","authors":"Wen-Cong Gan, Anzhong Wang","authorsParsed":[["Gan","Wen-Cong",""],["Wang","Anzhong",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 14:43:10 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 01:57:46 GMT"}],"updateDate":"2024-08-12","timestamp":1723128190000,"abstract":"  Loop quantum cosmology has achieved great successes, in which the\npolymerization plays a crucial role. In particular, the phase-space-variable\ndependent polymerization turns out to be the unique one that leads to\nconsistent quantization of the homogeneous and isotropic universe. However,\nwhen applying the same scheme to the quantization of black holes, it meets\nresistances, when the Kantowski-Sachs (KS) gauge is adopted. In this paper, we\ncontinue to study the quantum effects of the polymerization near the location\nthat a classical black hole horizon used to be, from the point of view of\neffective loop quantum gravity in the KS gauge. In particular, we find a\nphase-space-variable dependent polymerization scheme that leads to negligible\nquantum effects near the location of the classical black hole horizon, but\nsignificantly alters the spacetime structure near the origin, so that the\nclassical singularity is finally replaced by a finite and regular transition\nsurface. The final geodesically-complete spacetime consists of the regular\ntransition surface that connects a black hole in one side and an anti-trapped\nregion in the other side. In the anti-trapped region, no white hole horizons\nare found and the spacetime is extended to infinity, at which the geometric\nradius of the two-spheres becomes infinitely large.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/Astrophysics of Galaxies","Physics/High Energy Physics - Phenomenology","Physics/High Energy Physics - Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"ds_Mqo2XUtH1RsXIFqdZkDolGj-cbcsGf3Moj-NqugA","pdfSize":"1866848"}
