{"id":"2408.05808","title":"Fast and Communication-Efficient Multi-UAV Exploration Via Voronoi\n  Partition on Dynamic Topological Graph","authors":"Qianli Dong, Haobo Xi, Shiyong Zhang, Qingchen Bi, Tianyi Li, Ziyu\n  Wang, Xuebo Zhang","authorsParsed":[["Dong","Qianli",""],["Xi","Haobo",""],["Zhang","Shiyong",""],["Bi","Qingchen",""],["Li","Tianyi",""],["Wang","Ziyu",""],["Zhang","Xuebo",""]],"versions":[{"version":"v1","created":"Sun, 11 Aug 2024 15:56:58 GMT"}],"updateDate":"2024-08-13","timestamp":1723391818000,"abstract":"  Efficient data transmission and reasonable task allocation are important to\nimprove multi-robot exploration efficiency. However, most communication data\ntypes typically contain redundant information and thus require massive\ncommunication volume. Moreover, exploration-oriented task allocation is far\nfrom trivial and becomes even more challenging for resource-limited unmanned\naerial vehicles (UAVs). In this paper, we propose a fast and\ncommunication-efficient multi-UAV exploration method for exploring large\nenvironments. We first design a multi-robot dynamic topological graph (MR-DTG)\nconsisting of nodes representing the explored and exploring regions and edges\nconnecting nodes. Supported by MR-DTG, our method achieves efficient\ncommunication by only transferring the necessary information required by\nexploration planning. To further improve the exploration efficiency, a\nhierarchical multi-UAV exploration method is devised using MR-DTG.\nSpecifically, the \\emph{graph Voronoi partition} is used to allocate MR-DTG's\nnodes to the closest UAVs, considering the actual motion cost, thus achieving\nreasonable task allocation. To our knowledge, this is the first work to address\nmulti-UAV exploration using \\emph{graph Voronoi partition}. The proposed method\nis compared with a state-of-the-art method in simulations. The results show\nthat the proposed method is able to reduce the exploration time and\ncommunication volume by up to 38.3\\% and 95.5\\%, respectively. Finally, the\neffectiveness of our method is validated in the real-world experiment with 6\nUAVs. We will release the source code to benefit the community.\n","subjects":["Computing Research Repository/Robotics","Computing Research Repository/Multiagent Systems"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"lxorm-oe0ozPBQ8vkkL83aYfLAbQGbGtBmGWvuS1vFc","pdfSize":"3516895"}
