{"id":"2408.11563","title":"Exploring the Impact of Nuclear Parton Distribution Functions on Open\n  Heavy Flavor Azimuthal Angular Correlations in Pb-Pb Collisions at\n  $\\sqrt{s_{NN}}$ = 5.5 TeV","authors":"Swapnesh Khade, Ravindra Singh, Yoshini Bailung, Ankhi Roy","authorsParsed":[["Khade","Swapnesh",""],["Singh","Ravindra",""],["Bailung","Yoshini",""],["Roy","Ankhi",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 12:17:45 GMT"}],"updateDate":"2024-08-22","timestamp":1724242665000,"abstract":"  In this paper, we explore the impact of nuclear parton distribution functions\n(nPDFs) on the azimuthal angular correlation of open heavy flavor hadrons in\nPb-Pb collisions at $\\sqrt{s_{NN}}$ = 5.5 TeV, utilizing PYTHIA8 + Angantyr\nmodel and various PDFs. The method involves a transverse momentum\n($p_{\\rm{T}}$) differential assessment of azimuthal angular correlations\nbetween prompt $\\rm{D^0-\\bar{D}^0}$, $\\rm{B-\\bar{B}}$, and non-prompt D-mesons.\nThe results show that nPDFs significantly modify the near-side and away-side\npeaks of the azimuthal angular correlation distribution. A differential\n$p_{\\rm{T}}$ analysis allowed us to find the interplay between various\nproduction mechanisms and the significant impact of nPDFs on the dynamics of\nheavy flavor hadron production. Apart from the contributions originating from\nleading order (LO) production processes like pair creation in the away side\ncorrelation distribution, the identification of a double peak structure in the\nnear side of azimuthal angular correlation indicates contributions from\nnext-to-leading order (NLO) processes. The paper also emphasizes the relevance\nof nPDF in the context of heavy quark thermalization in heavy-ion collision\nanalyses. The findings indicate that nPDFs alter charm quark thermalization at\nlow $p_{\\rm{T}}$, with negligible effects on beauty quark thermalization. This\ncomprehensive analysis of azimuthal correlations and nPDF effects enhances our\nunderstanding of the initial state conditions and the dynamics of heavy flavor\nproduction in heavy-ion collisions.\n","subjects":["Physics/High Energy Physics - Experiment","Physics/High Energy Physics - Phenomenology"],"license":"http://creativecommons.org/licenses/by/4.0/"}