{"id":"2408.15854","title":"Cartan-Schouten metrics for information geometry and machine learning","authors":"Andre Diatta, Bakary Manga and Fatimata Sy","authorsParsed":[["Diatta","Andre",""],["Manga","Bakary",""],["Sy","Fatimata",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 15:15:52 GMT"}],"updateDate":"2024-08-29","timestamp":1724858152000,"abstract":"  We study Cartan-Schouten metrics, explore invariant dual connections, and\npropose them as models for Information Geometry.\n  Based on the underlying Riemannian barycenter and the biinvariant mean of Lie\ngroups, we subsequently propose a new parametric mean for data science and\nmachine learning which comes with several advantages compared to traditional\ntools such as the arithmetic mean, median, mode, expectation, least square\nmethod, maximum likelihood, linear regression. We call a metric on a Lie group,\na Cartan-Schouten metric, if its Levi-Civita connection is biinvariant, so\nevery 1-parameter subgroup through the unit is a geodesic.\n  Except for not being left or right invariant in general, Cartan-Schouten\nmetrics enjoy the same geometry as biinvariant metrics, since they share the\nsame Levi-Civita connection. To bypass the non-invariance apparent drawback, we\nshow that Cartan-Schouten metrics are completely determined by their value at\nthe unit. We give an explicit formula for recovering them from their value at\nthe unit, thus making them much less computationally demanding, compared to\ngeneral metrics on manifolds. Furthermore, Lie groups with Cartan-Schouten\nmetrics are complete Riemannian or pseudo-Riemannian manifolds. We give a\ncomplete characterization of Lie groups with Riemannian or Lorentzian\nCartan-Schouten metrics. Cartan-Schouten metrics are in abundance on\n2-nilpotent Lie groups. Namely, on every 2-nilpotent Lie group, there is a 1-1\ncorrespondence between the set of left invariant metrics and that of\nCartan-Schouten metrics.\n","subjects":["Mathematics/Differential Geometry","Computing Research Repository/Information Theory","Physics/Mathematical Physics","Mathematics/Information Theory","Mathematics/Mathematical Physics","Mathematics/Probability","Mathematics/Statistics Theory","Statistics/Statistics Theory"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"fR1zlBwHNOeKjfVpauWGVIhnMeZVL6u90LWFKQn4RRk","pdfSize":"346120"}
