{"id":"2408.14310","title":"The Power of Proportional Fairness for Non-Clairvoyant Scheduling under\n  Polyhedral Constraints","authors":"Sven J\\\"ager, Alexander Lindermayr, Nicole Megow","authorsParsed":[["Jäger","Sven",""],["Lindermayr","Alexander",""],["Megow","Nicole",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 14:42:00 GMT"}],"updateDate":"2024-08-27","timestamp":1724683320000,"abstract":"  The Polytope Scheduling Problem (PSP) was introduced by Im, Kulkarni, and\nMunagala (JACM 2018) as a very general abstraction of resource allocation over\ntime and captures many well-studied problems including classical unrelated\nmachine scheduling, multidimensional scheduling, and broadcast scheduling. In\nPSP, jobs with different arrival times receive processing rates that are\nsubject to arbitrary packing constraints. An elegant and well-known algorithm\nfor instantaneous rate allocation with good fairness and efficiency properties\nis the Proportional Fairness algorithm (PF), which was analyzed for PSP by Im\net al.\n  We drastically improve the analysis of the PF algorithm for both the general\nPSP and several of its important special cases subject to the objective of\nminimizing the sum of weighted completion times. We reduce the upper bound on\nthe competitive ratio from 128 to 27 for general PSP and to 4 for the prominent\nclass of monotone PSP. For certain heterogeneous machine environments we even\nclose the substantial gap to the lower bound of 2 for non-clairvoyant\nscheduling. Our analysis also gives the first polynomial-time improvements over\nthe nearly 30-year-old bounds on the competitive ratio of the doubling\nframework by Hall, Shmoys, and Wein (SODA 1996) for clairvoyant online\npreemptive scheduling on unrelated machines. Somewhat surprisingly, we achieve\nthis improvement by a non-clairvoyant algorithm, thereby demonstrating that\nnon-clairvoyance is not a (significant) hurdle.\n  Our improvements are based on exploiting monotonicity properties of PSP,\nproviding tight dual fitting arguments on structured instances, and showing new\nadditivity properties on the optimal objective value for scheduling on\nunrelated machines. Finally, we establish new connections of PF to matching\nmarkets, and thereby provide new insights on equilibria and their computational\ncomplexity.\n","subjects":["Computing Research Repository/Data Structures and Algorithms"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"M3aw8xcDfMNe02sA7zHGnVqHt2sL4bnxTnWYOGwX4rg","pdfSize":"494874"}
