{"id":"2408.11655","title":"High-areal-capacity Na-ion battery electrode with uncompromised energy\n  and power densities by simultaneous electrospinning-spraying fabrication","authors":"Mengzheng Ouyang, Zhenyu Guo, Luis E Salinas-Farran, Yan Zhao, Siyu\n  Zhao, Kaitian Zheng, Hao Zhang, Mengnan Wang, Guangdong Li, Feiran Li, Xinhua\n  Liu, Shichun Yang, Fei Xie, Paul R. Shearing, Maria-Magdalena Titirici, Nigel\n  P. Brandon","authorsParsed":[["Ouyang","Mengzheng",""],["Guo","Zhenyu",""],["Salinas-Farran","Luis E",""],["Zhao","Yan",""],["Zhao","Siyu",""],["Zheng","Kaitian",""],["Zhang","Hao",""],["Wang","Mengnan",""],["Li","Guangdong",""],["Li","Feiran",""],["Liu","Xinhua",""],["Yang","Shichun",""],["Xie","Fei",""],["Shearing","Paul R.",""],["Titirici","Maria-Magdalena",""],["Brandon","Nigel P.",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:26:27 GMT"}],"updateDate":"2024-08-22","timestamp":1724250387000,"abstract":"  Sodium-ion batteries (SIBs) are cost-effective alternatives to lithium-ion\nbatteries (LIBs), but their low energy density remains a challenge. Current\nelectrode designs fail to simultaneously achieve high areal loading, high\nactive content, and superior performance. In response, this work introduces an\nideal electrode structure, featuring a continuous conductive network with\nactive particles securely trapped in the absence of binder, fabricated using a\nuniversal technique that combines electrospinning and electrospraying (co-ESP).\nWe found that the particle size must be larger than the network's pores for\noptimised performance, an aspect overlooked in previous research. The\nfree-standing co-ESP Na2V3(PO4)3 (NVP) cathodes demonstrated state-of-the-art\n296 mg cm-2 areal loading with 97.5 wt.% active content, as well as remarkable\nrate-performance and cycling stability. Co-ESP full cells showed uncompromised\nenergy and power densities (231.6 Wh kg-1 and 7152.6 W kg-1), leading among\nreported SIBs with industry-relevant areal loadings. The structural merit is\nanalysed using multi-scale X-ray computed tomography, providing valuable design\ninsights.Finally, the superior performance is validated in the pouch cells,\nhighlighting the electrode's scalability and potential for commercial\napplication.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}