{"id":"2408.00971","title":"Two distinct types of echoes in compact objects","authors":"Shui-Fa Shen, Kai Lin, Tao Zhu, Yu-Peng Yan, Cheng-Gang Shao,\n  Wei-Liang Qian","authorsParsed":[["Shen","Shui-Fa",""],["Lin","Kai",""],["Zhu","Tao",""],["Yan","Yu-Peng",""],["Shao","Cheng-Gang",""],["Qian","Wei-Liang",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 01:34:39 GMT"},{"version":"v2","created":"Fri, 13 Sep 2024 16:13:04 GMT"}],"updateDate":"2024-09-16","timestamp":1722562479000,"abstract":"  In the black hole perturbation theory framework, two different physical\npictures for echoes in compact objects have been proposed. The first mechanism\ninterprets echoes as repeated reflections of gravitational waves within a\npotential well, where the echo period is defined by twice the distance related\nto the spatial displacement operator that separates two local maxima of the\neffective potential. The second mechanism associates echoes with a\ndiscontinuity in the effective potential, potentially associated with specific\naccretion processes, without necessarily introducing a second local maximum in\nthe effective potential. This discontinuity leads to echo signals that are\ntypically attenuated over time more quickly, with their period dictated by the\ncharacteristics of the transfer amplitudes. In both scenarios, the echoes\ncorrespond to a new category of quasinormal modes with minor real parts, with\ntheir period connected to the spacing between successive modes in the frequency\ndomain. This work elaborates on a unified framework in compact stars that\nencompasses both echo mechanisms. It suggests that these two types of echoes\nderive from different physical origins and can be independently triggered. The\noccurrence and interplay between these two types of echoes are demonstrated\nthrough numerical simulations. %The observational relevance of this study is\nalso addressed.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}