{"id":"2408.00144","title":"Distributed In-Context Learning under Non-IID Among Clients","authors":"Siqi Liang, Sumyeong Ahn and Jiayu Zhou","authorsParsed":[["Liang","Siqi",""],["Ahn","Sumyeong",""],["Zhou","Jiayu",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 20:06:25 GMT"}],"updateDate":"2024-08-02","timestamp":1722456385000,"abstract":"  Advancements in large language models (LLMs) have shown their effectiveness\nin multiple complicated natural language reasoning tasks. A key challenge\nremains in adapting these models efficiently to new or unfamiliar tasks.\nIn-context learning (ICL) provides a promising solution for few-shot adaptation\nby retrieving a set of data points relevant to a query, called in-context\nexamples (ICE), from a training dataset and providing them during the inference\nas context. Most existing studies utilize a centralized training dataset, yet\nmany real-world datasets may be distributed among multiple clients, and remote\ndata retrieval can be associated with costs. Especially when the client data\nare non-identical independent distributions (non-IID), retrieving from clients\na proper set of ICEs needed for a test query presents critical challenges. In\nthis paper, we first show that in this challenging setting, test queries will\nhave different preferences among clients because of non-IIDness, and equal\ncontribution often leads to suboptimal performance. We then introduce a novel\napproach to tackle the distributed non-IID ICL problem when a data usage budget\nis present. The principle is that each client's proper contribution (budget)\nshould be designed according to the preference of each query for that client.\nOur approach uses a data-driven manner to allocate a budget for each client,\ntailored to each test query. Through extensive empirical studies on diverse\ndatasets, our framework demonstrates superior performance relative to competing\nbaselines.\n","subjects":["Computing Research Repository/Computation and Language","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"4v2GTp37WlWnEcS_lRFhLTqcxng72eRgtj-aKDRY50U","pdfSize":"1974657"}
