{"id":"2408.16288","title":"OpenFGL: A Comprehensive Benchmarks for Federated Graph Learning","authors":"Xunkai Li, Yinlin Zhu, Boyang Pang, Guochen Yan, Yeyu Yan, Zening Li,\n  Zhengyu Wu, Wentao Zhang, Rong-Hua Li, Guoren Wang","authorsParsed":[["Li","Xunkai",""],["Zhu","Yinlin",""],["Pang","Boyang",""],["Yan","Guochen",""],["Yan","Yeyu",""],["Li","Zening",""],["Wu","Zhengyu",""],["Zhang","Wentao",""],["Li","Rong-Hua",""],["Wang","Guoren",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:40:01 GMT"}],"updateDate":"2024-08-30","timestamp":1724913601000,"abstract":"  Federated graph learning (FGL) has emerged as a promising distributed\ntraining paradigm for graph neural networks across multiple local systems\nwithout direct data sharing. This approach is particularly beneficial in\nprivacy-sensitive scenarios and offers a new perspective on addressing\nscalability challenges in large-scale graph learning. Despite the proliferation\nof FGL, the diverse motivations from practical applications, spanning various\nresearch backgrounds and experimental settings, pose a significant challenge to\nfair evaluation. To fill this gap, we propose OpenFGL, a unified benchmark\ndesigned for the primary FGL scenarios: Graph-FL and Subgraph-FL. Specifically,\nOpenFGL includes 38 graph datasets from 16 application domains, 8 federated\ndata simulation strategies that emphasize graph properties, and 5 graph-based\ndownstream tasks. Additionally, it offers 18 recently proposed SOTA FGL\nalgorithms through a user-friendly API, enabling a thorough comparison and\ncomprehensive evaluation of their effectiveness, robustness, and efficiency.\nEmpirical results demonstrate the ability of FGL while also revealing its\npotential limitations, offering valuable insights for future exploration in\nthis thriving field.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Databases","Computing Research Repository/Social and Information Networks"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"xQf9JO87wHcrrInqwk6Pw09-aAEKgmojxwlvxWmeh_4","pdfSize":"5409461"}
