{"id":"2408.12794","title":"Refining the isovector component of the Woods-Saxon potential","authors":"L. Xayavong, Y. Lim, N. A. Smirnova, and G. Nam","authorsParsed":[["Xayavong","L.",""],["Lim","Y.",""],["Smirnova","N. A.",""],["Nam","G.",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 02:17:16 GMT"}],"updateDate":"2024-08-26","timestamp":1724379436000,"abstract":"  We investigate the isovector component in the phenomenological mean field\nmodel of nuclei. Lane's isospin dependence, initially proposed for the nuclear\noptical potential, is reexamined within the context of bound states using the\nWoods-Saxon potential. We demonstrate that the original parametrization can be\nreexpressed in terms of parameters associated with the compound nucleus,\nenhancing its suitability for bound states. Comparisons with the conventional\nsymmetry term are performed to assess how well each approach fits experimental\ndata on single-particle/hole energies and reproduces charge-radius systematics.\nOur results indicate that Lane's formula provides better accuracy compared with\nthe traditional approach to the nuclear potential. Additionally, we find that\nthe isovector component of the nuclear potential favors a surface-peaked form\nfactor, especially one described by the first derivative of the Fermi like\nfunction divided by the radial coordinate. This consideration is crucial for\nopen-shell nuclei where Woods-Saxon eigenfunctions serve as a realistic basis\nfor other many-body methods. Our findings also enable discrimination among\nvarious shell-model calculations of the isospin-symmetry breaking correction to\nsuperallowed $0^+\\rightarrow0^+$ nuclear $\\beta$ decays [I.~S. Towner and J.~C.\nHardy, Phys. Rev. C {\\bf 77}, 025501 (2008)]. This disparity currently\nconstitutes the main source of theoretical uncertainty in subsequent tests of\nthe standard model.\n","subjects":["Physics/Nuclear Theory","Physics/Nuclear Experiment"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Cg3dXEzv0LQ5_1jG7Rjc7dGPq1zHwjk71YJzNXwj5cU","pdfSize":"880863"}
