{"id":"2408.14915","title":"Can Transformers Do Enumerative Geometry?","authors":"Baran Hashemi, Roderic G. Corominas, Alessandro Giacchetto","authorsParsed":[["Hashemi","Baran",""],["Corominas","Roderic G.",""],["Giacchetto","Alessandro",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 09:44:01 GMT"}],"updateDate":"2024-08-28","timestamp":1724751841000,"abstract":"  How can Transformers model and learn enumerative geometry? What is a robust\nprocedure for using Transformers in abductive knowledge discovery within a\nmathematician-machine collaboration? In this work, we introduce a new paradigm\nin computational enumerative geometry in analyzing the $\\psi$-class\nintersection numbers on the moduli space of curves. By formulating the\nenumerative problem as a continuous optimization task, we develop a\nTransformer-based model for computing $\\psi$-class intersection numbers based\non the underlying quantum Airy structure. For a finite range of genera, our\nmodel is capable of regressing intersection numbers that span an extremely wide\nrange of values, from $10^{-45}$ to $10^{45}$. To provide a proper inductive\nbias for capturing the recursive behavior of intersection numbers, we propose a\nnew activation function, Dynamic Range Activator (DRA). Moreover, given the\nsevere heteroscedasticity of $\\psi$-class intersections and the required\nprecision, we quantify the uncertainty of the predictions using Conformal\nPrediction with a dynamic sliding window that is aware of the number of marked\npoints. Next, we go beyond merely computing intersection numbers and explore\nthe enumerative \"world-model\" of the Transformers. Through a series of causal\ninference and correlational interpretability analyses, we demonstrate that\nTransformers are actually modeling Virasoro constraints in a purely data-driven\nmanner. Additionally, we provide evidence for the comprehension of several\nvalues appearing in the large genus asymptotic of $\\psi$-class intersection\nnumbers through abductive hypothesis testing.\n","subjects":["Computing Research Repository/Machine Learning","Mathematics/Algebraic Geometry"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"c_9grX7j_F8o9h56ffPpe5mDstmw-Ofedwn1brMEcoY","pdfSize":"7654425"}
