{"id":"2408.11257","title":"A case study on different one-factor Cheyette models for short maturity\n  caplet calibration","authors":"Arun Kumar Polala and Bernhard Hientzsch","authorsParsed":[["Polala","Arun Kumar",""],["Hientzsch","Bernhard",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 00:42:09 GMT"}],"updateDate":"2024-08-22","timestamp":1724200929000,"abstract":"  In [1], we calibrated a one-factor Cheyette SLV model with a local volatility\nthat is linear in the benchmark forward rate and an uncorrelated CIR stochastic\nvariance to 3M caplets of various maturities. While caplet smiles for many\nmaturities could be reasonably well calibrated across the range of strikes, for\ninstance the 1Y maturity could not be calibrated well across that entire range\nof strikes. Here, we study whether models with alternative local volatility\nterms and/or alternative stochastic volatility or variance models can calibrate\nthe 1Y caplet smile better across the strike range better than the model\nstudied in [1]. This is made possible and feasible by the generic simulation,\npricing, and calibration frameworks introduced in [1] and some new frameworks\npresented in this paper. We find that some model settings calibrate well to the\n1Y smile across the strike range under study. In particular, a model setting\nwith a local volatility that is piece-wise linear in the benchmark forward rate\ntogether with an uncorrelated CIR stochastic variance and one with a local\nvolatility that is linear in the benchmark rate together with a correlated\nlognormal stochastic volatility with quadratic drift (QDLNSV) as in [2]\ncalibrate well. We discuss why the later might be a preferable model.\n  [1] Arun Kumar Polala and Bernhard Hientzsch. Parametric differential machine\nlearning for pricing and calibration. arXiv preprint arXiv:2302.06682 , 2023.\n  [2] Artur Sepp and Parviz Rakhmonov. A Robust Stochastic Volatility Model for\nInterest Rate Dynamics. Risk Magazine, 2023\n","subjects":["Quantitative Finance/Computational Finance","Computing Research Repository/Numerical Analysis","Mathematics/Numerical Analysis","Quantitative Finance/Mathematical Finance"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}