{"id":"2408.03271","title":"Study of the physical and chemical properties of dense clumps in several\n  high-mass star-forming regions","authors":"A. G. Pazukhin, I. I. Zinchenko, E. A. Trofimova","authorsParsed":[["Pazukhin","A. G.",""],["Zinchenko","I. I.",""],["Trofimova","E. A.",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 16:00:39 GMT"}],"updateDate":"2024-08-07","timestamp":1722960039000,"abstract":"  Massive stars play an important role in the Universe. Unlike low-mass stars,\nthe formation of these objects located at great distances is still unclear. It\nis expected to be governed by some combination of self-gravity, turbulence, and\nmagnetic fields. Our aim is to study of the chemical and physical conditions of\ndense clumps in several high-mass star-forming regions. We performed\nobservations towards 5 high-mass star-forming regions (L1287, S187, S231,\nDR21(OH), NGC7538) with the IRAM 30 m telescope. We covered the 2-3 and 4 mm\nwavelength band and analyzed the lines of HCN, HNC, HCO$^+$, HC$_3$N, HNCO,\nOCS, CS, SiO, SO$_2$ and SO. Using astrodendro algorithm on the 850 $\\mu$m dust\nemission data from the SCUBA Legacy catalogue, we identified dense gas clumps\nand determined their masses, H$_2$ column densities and sizes. Furthermore, the\nkinetic temperatures, molecular abundances and dynamical state were obtained.\nThe Red Midcourse Space Experiment Source survey (RMS) was used to determine\nthe clump types. We identified $\\sim$20 clumps. We found no significant\ncorrelation between line width and size, but the linewidth-mass and mass-size\nrelationships are strongly correlated. Virial analysis indicated that the\nclumps with HII regions and young stellar objects (YSOs) are gravitationally\nbound. Furthermore, it was suggested that significant magnetic fields provide\nadditional support for clump stability. The molecular abundances decrease from\nYSOs to submm and HII regions.\n","subjects":["Astrophysics/Astrophysics of Galaxies"],"license":"http://creativecommons.org/licenses/by/4.0/"}