{"id":"2408.11147","title":"Insights into Protein Unfolding under pH, Temperature, and Shear using\n  Molecular Dynamics Simulations","authors":"Yinhao Jia, Clare Cocker and Janani Sampath","authorsParsed":[["Jia","Yinhao",""],["Cocker","Clare",""],["Sampath","Janani",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 19:09:51 GMT"}],"updateDate":"2024-08-22","timestamp":1724180991000,"abstract":"  Protein biologics hold immense potential in therapeutic applications, but\ntheir ephemeral nature has hindered their widespread application. The effects\nof different stressors on protein folding have long been studied, but whether\nthese stressors induce protein unfolding through different pathways remains\nunclear. In this work, we conduct all-atom molecular dynamics simulations to\ninvestigate the unfolding of bovine serum albumin (BSA) under three distinct\nexternal stressors: high temperature, acidic pH, and shear stress. Our findings\nreveal that each stressor induces unique unfolding patterns in BSA, indicating\nstressor-specific unfolding pathways. Detailed structural analysis showed that\nhigh temperature significantly disrupts the protein's secondary structure,\nwhile acidic pH causes notable alterations in the tertiary structure, leading\nto domain separation and an extended shape. Shear stress initially perturbs the\ntertiary structure, initiating structural rearrangements followed by a loss of\nsecondary structure. These distinct unfolding behaviors suggest that different\nstabilization strategies are required to enhance protein stability under\nvarious denaturation conditions. Insights from these unfolding studies can\ninform the design of materials, especially polymers, aimed at improving protein\nstability.\n","subjects":["Physics/Biological Physics","Condensed Matter/Soft Condensed Matter","Quantitative Biology/Biomolecules"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"Q3xXhWlxkEMMd71ml0OmpH76ZYlF2LLxdMq1RkXAuFA","pdfSize":"4895977"}
