{"id":"2408.09663","title":"CHASE: 3D-Consistent Human Avatars with Sparse Inputs via Gaussian\n  Splatting and Contrastive Learning","authors":"Haoyu Zhao, Hao Wang, Chen Yang, Wei Shen","authorsParsed":[["Zhao","Haoyu",""],["Wang","Hao",""],["Yang","Chen",""],["Shen","Wei",""]],"versions":[{"version":"v1","created":"Mon, 19 Aug 2024 02:46:23 GMT"},{"version":"v2","created":"Tue, 20 Aug 2024 01:51:58 GMT"}],"updateDate":"2024-08-21","timestamp":1724035583000,"abstract":"  Recent advancements in human avatar synthesis have utilized radiance fields\nto reconstruct photo-realistic animatable human avatars. However, both\nNeRFs-based and 3DGS-based methods struggle with maintaining 3D consistency and\nexhibit suboptimal detail reconstruction, especially with sparse inputs. To\naddress this challenge, we propose CHASE, which introduces supervision from\nintrinsic 3D consistency across poses and 3D geometry contrastive learning,\nachieving performance comparable with sparse inputs to that with full inputs.\nFollowing previous work, we first integrate a skeleton-driven rigid deformation\nand a non-rigid cloth dynamics deformation to coordinate the movements of\nindividual Gaussians during animation, reconstructing basic avatar with coarse\n3D consistency. To improve 3D consistency under sparse inputs, we design\nDynamic Avatar Adjustment(DAA) to adjust deformed Gaussians based on a selected\nsimilar pose/image from the dataset. Minimizing the difference between the\nimage rendered by adjusted Gaussians and the image with the similar pose serves\nas an additional form of supervision for avatar. Furthermore, we propose a 3D\ngeometry contrastive learning strategy to maintain the 3D global consistency of\ngenerated avatars. Though CHASE is designed for sparse inputs, it surprisingly\noutperforms current SOTA methods \\textbf{in both full and sparse settings} on\nthe ZJU-MoCap and H36M datasets, demonstrating that our CHASE successfully\nmaintains avatar's 3D consistency, hence improving rendering quality.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}