{"id":"2408.12420","title":"Dataset | Mindset = Explainable AI | Interpretable AI","authors":"Caesar Wu, Rajkumar Buyya, Yuan Fang Li, Pascal Bouvry","authorsParsed":[["Wu","Caesar",""],["Buyya","Rajkumar",""],["Li","Yuan Fang",""],["Bouvry","Pascal",""]],"versions":[{"version":"v1","created":"Thu, 22 Aug 2024 14:12:53 GMT"}],"updateDate":"2024-08-23","timestamp":1724335973000,"abstract":"  We often use \"explainable\" Artificial Intelligence (XAI)\" and \"interpretable\nAI (IAI)\" interchangeably when we apply various XAI tools for a given dataset\nto explain the reasons that underpin machine learning (ML) outputs. However,\nthese notions can sometimes be confusing because interpretation often has a\nsubjective connotation, while explanations lean towards objective facts. We\nargue that XAI is a subset of IAI. The concept of IAI is beyond the sphere of a\ndataset. It includes the domain of a mindset. At the core of this ambiguity is\nthe duality of reasons, in which we can reason either outwards or inwards. When\ndirected outwards, we want the reasons to make sense through the laws of\nnature. When turned inwards, we want the reasons to be happy, guided by the\nlaws of the heart. While XAI and IAI share reason as the common notion for the\ngoal of transparency, clarity, fairness, reliability, and accountability in the\ncontext of ethical AI and trustworthy AI (TAI), their differences lie in that\nXAI emphasizes the post-hoc analysis of a dataset, and IAI requires a priori\nmindset of abstraction. This hypothesis can be proved by empirical experiments\nbased on an open dataset and harnessed by High-Performance Computing (HPC). The\ndemarcation of XAI and IAI is indispensable because it would be impossible to\ndetermine regulatory policies for many AI applications, especially in\nhealthcare, human resources, banking, and finance. We aim to clarify these\nnotions and lay the foundation of XAI, IAI, EAI, and TAI for many practitioners\nand policymakers in future AI applications and research.\n","subjects":["Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"gp9N2VAp8lpMX7yLULRljeSVku2nymKq358UYmEvKoY","pdfSize":"2321660"}
