{"id":"2408.14644","title":"Visions of Destruction: Exploring a Potential of Generative AI in\n  Interactive Art","authors":"Mar Canet Sola and Varvara Guljajeva","authorsParsed":[["Sola","Mar Canet",""],["Guljajeva","Varvara",""]],"versions":[{"version":"v1","created":"Mon, 26 Aug 2024 21:20:45 GMT"}],"updateDate":"2024-08-28","timestamp":1724707245000,"abstract":"  This paper explores the potential of generative AI within interactive art,\nemploying a practice-based research approach. It presents the interactive\nartwork \"Visions of Destruction\" as a detailed case study, highlighting its\ninnovative use of generative AI to create a dynamic, audience-responsive\nexperience. This artwork applies gaze-based interaction to dynamically alter\ndigital landscapes, symbolizing the impact of human activities on the\nenvironment by generating contemporary collages created with AI, trained on\ndata about human damage to nature, and guided by audience interaction. The\ntransformation of pristine natural scenes into human-made and industrialized\nlandscapes through viewer interaction serves as a stark reminder of\nenvironmental degradation. The paper thoroughly explores the technical\nchallenges and artistic innovations involved in creating such an interactive\nart installation, emphasizing the potential of generative AI to revolutionize\nartistic expression, audience engagement, and especially the opportunities for\nthe interactive art field. It offers insights into the conceptual framework\nbehind the artwork, aiming to evoke a deeper understanding and reflection on\nthe Anthropocene era and human-induced climate change. This study contributes\nsignificantly to the field of creative AI and interactive art, blending\ntechnology and environmental consciousness in a compelling, thought-provoking\nmanner.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"zdcAUJBlOGfBrHiNX0EtK7bGglm_F3SW0PSPib4Trcc","pdfSize":"9973797"}
