{"id":"2408.07264","title":"Lesion-aware network for diabetic retinopathy diagnosis","authors":"Xue Xia, Kun Zhan, Yuming Fang, Wenhui Jiang, Fei Shen","authorsParsed":[["Xia","Xue",""],["Zhan","Kun",""],["Fang","Yuming",""],["Jiang","Wenhui",""],["Shen","Fei",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 03:06:04 GMT"}],"updateDate":"2024-08-15","timestamp":1723604764000,"abstract":"  Deep learning brought boosts to auto diabetic retinopathy (DR) diagnosis,\nthus, greatly helping ophthalmologists for early disease detection, which\ncontributes to preventing disease deterioration that may eventually lead to\nblindness. It has been proved that convolutional neural network (CNN)-aided\nlesion identifying or segmentation benefits auto DR screening. The key to\nfine-grained lesion tasks mainly lies in: (1) extracting features being both\nsensitive to tiny lesions and robust against DR-irrelevant interference, and\n(2) exploiting and re-using encoded information to restore lesion locations\nunder extremely imbalanced data distribution. To this end, we propose a\nCNN-based DR diagnosis network with attention mechanism involved, termed\nlesion-aware network, to better capture lesion information from imbalanced\ndata. Specifically, we design the lesion-aware module (LAM) to capture\nnoise-like lesion areas across deeper layers, and the feature-preserve module\n(FPM) to assist shallow-to-deep feature fusion. Afterward, the proposed\nlesion-aware network (LANet) is constructed by embedding the LAM and FPM into\nthe CNN decoders for DR-related information utilization. The proposed LANet is\nthen further extended to a DR screening network by adding a classification\nlayer. Through experiments on three public fundus datasets with pixel-level\nannotations, our method outperforms the mainstream methods with an area under\ncurve of 0.967 in DR screening, and increases the overall average precision by\n7.6%, 2.1%, and 1.2% in lesion segmentation on three datasets. Besides, the\nablation study validates the effectiveness of the proposed sub-modules.\n","subjects":["Electrical Engineering and Systems Science/Image and Video Processing","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}