{"id":"2408.11642","title":"A diamond heater-thermometer microsensor for measuring localized thermal\n  conductivity: a case study in gelatin hydrogel","authors":"Linjie Ma, Jiahua Zhang, Zheng Hao, Jixiang Jing, Tongtong Zhang, Yuan\n  Lin, Zhiqin Chu","authorsParsed":[["Ma","Linjie",""],["Zhang","Jiahua",""],["Hao","Zheng",""],["Jing","Jixiang",""],["Zhang","Tongtong",""],["Lin","Yuan",""],["Chu","Zhiqin",""]],"versions":[{"version":"v1","created":"Wed, 21 Aug 2024 14:11:11 GMT"}],"updateDate":"2024-08-22","timestamp":1724249471000,"abstract":"  Understanding the microscopic thermal effects of the hydrogel is important\nfor its application in diverse fields, including thermal-related studies in\ntissue engineering and thermal management for flexible electronic devices. In\nrecent decades, localized thermal properties, such as thermal conductivity,\nhave often been overlooked due to technical limitations. To tackle this, we\npropose a new hybrid diamond microsensor that is capable of simultaneous\ntemperature control and readout in a decoupled manner. Specifically, the sensor\nconsists of a silicon pillar (heater) at about 10 microns in length, topped by\na micron-sized diamond particle that contains silicon-vacancy (SiV) centers\n(thermometer) with 1.29 K*Hz^(-1/2) temperature measurement sensitivity.\nCombining this innovative, scalable sensor with a newly established simulation\nmodel that can transform heating-laser-induced temperature change into thermal\nconductivity, we introduced an all-optical decoupled method with about 0.05\nW/(m* K) precision, which can reduce laser crosstalk. For the first time, we\ntrack the thermal conductivity change of hydrogels during the gelation process\nand demonstrate the existence of variation. We introduce a rapid, undisturbed\ntechnique for measuring microscale thermal conductivity, potentially serving as\na valuable tool for cellular thermometry and highlight the idea that decoupling\ncan reduce crosstalk from different lasers, which is helpful for quantum\nsensing.\n","subjects":["Physics/Optics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"3J65rjEjJnofbubvfvEcs5wptyuAfdkQDOEKg-T7L2k","pdfSize":"2252771"}
