{"id":"2408.04276","title":"Early Risk Assessment Model for ICA Timing Strategy in Unstable Angina\n  Patients Using Multi-Modal Machine Learning","authors":"Candi Zheng, Kun Liu, Yang Wang, Shiyi Chen, Hongli Li","authorsParsed":[["Zheng","Candi",""],["Liu","Kun",""],["Wang","Yang",""],["Chen","Shiyi",""],["Li","Hongli",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 07:24:28 GMT"}],"updateDate":"2024-08-09","timestamp":1723101868000,"abstract":"  Background: Invasive coronary arteriography (ICA) is recognized as the gold\nstandard for diagnosing cardiovascular diseases, including unstable angina\n(UA). The challenge lies in determining the optimal timing for ICA in UA\npatients, balancing the need for revascularization in high-risk patients\nagainst the potential complications in low-risk ones. Unlike myocardial\ninfarction, UA does not have specific indicators like ST-segment deviation or\ncardiac enzymes, making risk assessment complex. Objectives: Our study aims to\nenhance the early risk assessment for UA patients by utilizing machine learning\nalgorithms. These algorithms can potentially identify patients who would\nbenefit most from ICA by analyzing less specific yet related indicators that\nare challenging for human physicians to interpret. Methods: We collected data\nfrom 640 UA patients at Shanghai General Hospital, including medical history\nand electrocardiograms (ECG). Machine learning algorithms were trained using\nmulti-modal demographic characteristics including clinical risk factors,\nsymptoms, biomarker levels, and ECG features extracted by pre-trained neural\nnetworks. The goal was to stratify patients based on their revascularization\nrisk. Additionally, we translated our models into applicable and explainable\nlook-up tables through discretization for practical clinical use. Results: The\nstudy achieved an Area Under the Curve (AUC) of $0.719 \\pm 0.065$ in risk\nstratification, significantly surpassing the widely adopted GRACE score's AUC\nof $0.579 \\pm 0.044$. Conclusions: The results suggest that machine learning\ncan provide superior risk stratification for UA patients. This improved\nstratification could help in balancing the risks, costs, and complications\nassociated with ICA, indicating a potential shift in clinical assessment\npractices for unstable angina.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}