{"id":"2408.15490","title":"Symbiotic Sensing and Communication: Framework and Beamforming Design","authors":"Fanghao Xia and Zesong Fei and Xinyi Wang and Weijie Yuan and Qingqing\n  Wu and Yuanwei Liu and Tony Q. S. Quek","authorsParsed":[["Xia","Fanghao",""],["Fei","Zesong",""],["Wang","Xinyi",""],["Yuan","Weijie",""],["Wu","Qingqing",""],["Liu","Yuanwei",""],["Quek","Tony Q. S.",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 02:31:08 GMT"}],"updateDate":"2024-08-29","timestamp":1724812268000,"abstract":"  In this paper, we propose a novel symbiotic sensing and communication (SSAC)\nframework, comprising a base station (BS) and a passive sensing node. In\nparticular, the BS transmits communication waveform to serve vehicle users\n(VUEs), while the sensing node is employed to execute sensing tasks based on\nthe echoes in a bistatic manner, thereby avoiding the issue of\nself-interference. Besides the weak target of interest, the sensing node tracks\nVUEs and shares sensing results with BS to facilitate sensing-assisted\nbeamforming. By considering both fully digital arrays and hybrid analog-digital\n(HAD) arrays, we investigate the beamforming design in the SSAC system. We\nfirst derive the Cramer-Rao lower bound (CRLB) of the two-dimensional angles of\narrival estimation as the sensing metric. Next, we formulate an achievable sum\nrate maximization problem under the CRLB constraint, where the channel state\ninformation is reconstructed based on the sensing results. Then, we propose two\npenalty dual decomposition (PDD)-based alternating algorithms for fully digital\nand HAD arrays, respectively. Simulation results demonstrate that the proposed\nalgorithms can achieve an outstanding data rate with effective localization\ncapability for both VUEs and the weak target. In particular, the HAD\nbeamforming design exhibits remarkable performance gain compared to\nconventional schemes, especially with fewer radio frequency chains.\n","subjects":["Electrical Engineering and Systems Science/Signal Processing"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}