{"id":"2408.04745","title":"AI for operational methane emitter monitoring from space","authors":"Anna Vaughan, Gonzalo Mateo-Garcia, Itziar Irakulis-Loitxate, Marc\n  Watine, Pablo Fernandez-Poblaciones, Richard E. Turner, James Requeima,\n  Javier Gorro\\~no, Cynthia Randles, Manfredi Caltagirone and Claudio Cifarelli","authorsParsed":[["Vaughan","Anna",""],["Mateo-Garcia","Gonzalo",""],["Irakulis-Loitxate","Itziar",""],["Watine","Marc",""],["Fernandez-Poblaciones","Pablo",""],["Turner","Richard E.",""],["Requeima","James",""],["Gorroño","Javier",""],["Randles","Cynthia",""],["Caltagirone","Manfredi",""],["Cifarelli","Claudio",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 20:06:37 GMT"}],"updateDate":"2024-08-12","timestamp":1723147597000,"abstract":"  Mitigating methane emissions is the fastest way to stop global warming in the\nshort-term and buy humanity time to decarbonise. Despite the demonstrated\nability of remote sensing instruments to detect methane plumes, no system has\nbeen available to routinely monitor and act on these events. We present\nMARS-S2L, an automated AI-driven methane emitter monitoring system for\nSentinel-2 and Landsat satellite imagery deployed operationally at the United\nNations Environment Programme's International Methane Emissions Observatory. We\ncompile a global dataset of thousands of super-emission events for training and\nevaluation, demonstrating that MARS-S2L can skillfully monitor emissions in a\ndiverse range of regions globally, providing a 216% improvement in mean average\nprecision over a current state-of-the-art detection method. Running this system\noperationally for six months has yielded 457 near-real-time detections in 22\ndifferent countries of which 62 have already been used to provide formal\nnotifications to governments and stakeholders.\n","subjects":["Computing Research Repository/Artificial Intelligence","Physics/Atmospheric and Oceanic Physics"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"x-2-1XQWwhpo7QDDGNHaokdyEnJYXveSvrCQ7Ys_OcI","pdfSize":"42519734"}
