{"id":"2408.07554","title":"Cyclic and helical symmetry-informed machine learned force fields:\n  Application to lattice vibrations in carbon nanotubes","authors":"Abhiraj Sharma, Shashikant Kumar, Phanish Suryanarayana","authorsParsed":[["Sharma","Abhiraj",""],["Kumar","Shashikant",""],["Suryanarayana","Phanish",""]],"versions":[{"version":"v1","created":"Wed, 14 Aug 2024 13:41:49 GMT"}],"updateDate":"2024-08-15","timestamp":1723642909000,"abstract":"  We present a formalism for developing cyclic and helical symmetry-informed\nmachine learned force fields (MLFFs). In particular, employing the smooth\noverlap of atomic positions descriptors with the polynomial kernel method, we\nderive cyclic and helical symmetry-adapted expressions for the energy, atomic\nforces, and phonons (describe lattice vibration frequencies and modes). We use\nthis formulation to construct a symmetry-informed MLFF for carbon nanotubes\n(CNTs), where the model is trained through Bayesian linear regression, with the\ndata generated from ab initio density functional theory (DFT) calculations\nperformed during on-the-fly symmetry-informed MLFF molecular dynamics\nsimulations of representative CNTs. We demonstrate the accuracy of the MLFF\nmodel by comparisons with DFT calculations for the energies and forces, and\ndensity functional perturbation theory calculations for the phonons, while\nconsidering CNTs not used in the training. In particular, we obtain a root mean\nsquare error of $1.4 \\times 10^{-4}$ Ha/atom, $4.7 \\times 10^{-4}$ Ha/Bohr, and\n4.8 cm$^{-1}$ in the energy, forces, and phonon frequencies, respectively,\nwhich are well within the accuracy targeted in ab initio calculations. We apply\nthis framework to study phonons in CNTs of various diameters and chiralities,\nwhere we identify the torsional rigid body mode that is unique to cylindrical\nstructures and establish laws for variation of the phonon frequencies\nassociated with the ring modes and radial breathing modes. Overall, the\nproposed formalism provides an avenue for studying nanostructures with cyclic\nand helical symmetry at ab initio accuracy, while providing orders-of-magnitude\nspeedup relative to such methods.\n","subjects":["Condensed Matter/Materials Science","Condensed Matter/Mesoscale and Nanoscale Physics","Physics/Computational Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}