{"id":"2408.12837","title":"Underwater SONAR Image Classification and Analysis using LIME-based\n  Explainable Artificial Intelligence","authors":"Purushothaman Natarajan and Athira Nambiar","authorsParsed":[["Natarajan","Purushothaman",""],["Nambiar","Athira",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 04:54:18 GMT"}],"updateDate":"2024-08-26","timestamp":1724388858000,"abstract":"  Deep learning techniques have revolutionized image classification by\nmimicking human cognition and automating complex decision-making processes.\nHowever, the deployment of AI systems in the wild, especially in high-security\ndomains such as defence, is curbed by the lack of explainability of the model.\nTo this end, eXplainable AI (XAI) is an emerging area of research that is\nintended to explore the unexplained hidden black box nature of deep neural\nnetworks. This paper explores the application of the eXplainable Artificial\nIntelligence (XAI) tool to interpret the underwater image classification\nresults, one of the first works in the domain to the best of our knowledge. Our\nstudy delves into the realm of SONAR image classification using a custom\ndataset derived from diverse sources, including the Seabed Objects KLSG\ndataset, the camera SONAR dataset, the mine SONAR images dataset, and the SCTD\ndataset. An extensive analysis of transfer learning techniques for image\nclassification using benchmark Convolutional Neural Network (CNN) architectures\nsuch as VGG16, ResNet50, InceptionV3, DenseNet121, etc. is carried out. On top\nof this classification model, a post-hoc XAI technique, viz. Local\nInterpretable Model-Agnostic Explanations (LIME) are incorporated to provide\ntransparent justifications for the model's decisions by perturbing input data\nlocally to see how predictions change. Furthermore, Submodular Picks LIME\n(SP-LIME) a version of LIME particular to images, that perturbs the image based\non the submodular picks is also extensively studied. To this end, two\nsubmodular optimization algorithms i.e. Quickshift and Simple Linear Iterative\nClustering (SLIC) are leveraged towards submodular picks. The extensive\nanalysis of XAI techniques highlights interpretability of the results in a more\nhuman-compliant way, thus boosting our confidence and reliability.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}