{"id":"2408.00150","title":"StyleRF-VolVis: Style Transfer of Neural Radiance Fields for Expressive\n  Volume Visualization","authors":"Kaiyuan Tang and Chaoli Wang","authorsParsed":[["Tang","Kaiyuan",""],["Wang","Chaoli",""]],"versions":[{"version":"v1","created":"Wed, 31 Jul 2024 20:26:30 GMT"}],"updateDate":"2024-08-02","timestamp":1722457590000,"abstract":"  In volume visualization, visualization synthesis has attracted much attention\ndue to its ability to generate novel visualizations without following the\nconventional rendering pipeline. However, existing solutions based on\ngenerative adversarial networks often require many training images and take\nsignificant training time. Still, issues such as low quality, consistency, and\nflexibility persist. This paper introduces StyleRF-VolVis, an innovative style\ntransfer framework for expressive volume visualization (VolVis) via neural\nradiance field (NeRF). The expressiveness of StyleRF-VolVis is upheld by its\nability to accurately separate the underlying scene geometry (i.e., content)\nand color appearance (i.e., style), conveniently modify color, opacity, and\nlighting of the original rendering while maintaining visual content consistency\nacross the views, and effectively transfer arbitrary styles from reference\nimages to the reconstructed 3D scene. To achieve these, we design a base NeRF\nmodel for scene geometry extraction, a palette color network to classify\nregions of the radiance field for photorealistic editing, and an unrestricted\ncolor network to lift the color palette constraint via knowledge distillation\nfor non-photorealistic editing. We demonstrate the superior quality,\nconsistency, and flexibility of StyleRF-VolVis by experimenting with various\nvolume rendering scenes and reference images and comparing StyleRF-VolVis\nagainst other image-based (AdaIN), video-based (ReReVST), and NeRF-based (ARF\nand SNeRF) style rendering solutions.\n","subjects":["Computing Research Repository/Graphics","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}