{"id":"2408.12866","title":"Obfuscated Memory Malware Detection","authors":"Sharmila S P, Aruna Tiwari, Narendra S Chaudhari","authorsParsed":[["P","Sharmila S",""],["Tiwari","Aruna",""],["Chaudhari","Narendra S",""]],"versions":[{"version":"v1","created":"Fri, 23 Aug 2024 06:39:15 GMT"}],"updateDate":"2024-08-26","timestamp":1724395155000,"abstract":"  Providing security for information is highly critical in the current era with\ndevices enabled with smart technology, where assuming a day without the\ninternet is highly impossible. Fast internet at a cheaper price, not only made\ncommunication easy for legitimate users but also for cybercriminals to induce\nattacks in various dimensions to breach privacy and security. Cybercriminals\ngain illegal access and breach the privacy of users to harm them in multiple\nways. Malware is one such tool used by hackers to execute their malicious\nintent. Development in AI technology is utilized by malware developers to cause\nsocial harm. In this work, we intend to show how Artificial Intelligence and\nMachine learning can be used to detect and mitigate these cyber-attacks induced\nby malware in specific obfuscated malware. We conducted experiments with memory\nfeature engineering on memory analysis of malware samples. Binary\nclassification can identify whether a given sample is malware or not, but\nidentifying the type of malware will only guide what next step to be taken for\nthat malware, to stop it from proceeding with its further action. Hence, we\npropose a multi-class classification model to detect the three types of\nobfuscated malware with an accuracy of 89.07% using the Classic Random Forest\nalgorithm. To the best of our knowledge, there is very little amount of work\ndone in classifying multiple obfuscated malware by a single model. We also\ncompared our model with a few state-of-the-art models and found it\ncomparatively better.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-sa/4.0/"}