{"id":"2408.16017","title":"Differentially Private Publication of Electricity Time Series Data in\n  Smart Grids","authors":"Sina Shaham, Gabriel Ghinita, Bhaskar Krishnamachari, Cyrus Shahabi","authorsParsed":[["Shaham","Sina",""],["Ghinita","Gabriel",""],["Krishnamachari","Bhaskar",""],["Shahabi","Cyrus",""]],"versions":[{"version":"v1","created":"Sat, 24 Aug 2024 23:30:09 GMT"}],"updateDate":"2024-08-30","timestamp":1724542209000,"abstract":"  Smart grids are a valuable data source to study consumer behavior and guide\nenergy policy decisions. In particular, time-series of power consumption over\ngeographical areas are essential in deciding the optimal placement of expensive\nresources (e.g., transformers, storage elements) and their activation\nschedules. However, publication of such data raises significant privacy issues,\nas it may reveal sensitive details about personal habits and lifestyles.\nDifferential privacy (DP) is well-suited for sanitization of individual data,\nbut current DP techniques for time series lead to significant loss in utility,\ndue to the existence of temporal correlation between data readings. We\nintroduce {\\em STPT (Spatio-Temporal Private Timeseries)}, a novel method for\nDP-compliant publication of electricity consumption data that analyzes\nspatio-temporal attributes and captures both micro and macro patterns by\nleveraging RNNs. Additionally, it employs a partitioning method for releasing\nelectricity consumption time series based on identified patterns. We\ndemonstrate through extensive experiments, on both real-world and synthetic\ndatasets, that STPT significantly outperforms existing benchmarks, providing a\nwell-balanced trade-off between data utility and user privacy.\n","subjects":["Computing Research Repository/Cryptography and Security","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"jJp6CNVWeKgP2uafPKvd5Nmwta6m5eTZ0YZ7K_VWpNQ","pdfSize":"1292090"}
