{"id":"2408.00236","title":"Uncertainty-Aware Liquid State Modeling from Experimental Scattering\n  Measurements","authors":"Brennon L. Shanks","authorsParsed":[["Shanks","Brennon L.",""]],"versions":[{"version":"v1","created":"Thu, 1 Aug 2024 02:11:39 GMT"},{"version":"v2","created":"Tue, 13 Aug 2024 17:55:48 GMT"}],"updateDate":"2024-08-15","timestamp":1722478299000,"abstract":"  This dissertation is founded on the central notion that structural\ncorrelations in dense fluids, such as dense gases, liquids, and glasses, are\ndirectly related to fundamental interatomic forces. This relationship was\nidentified early in the development of statistical theories of fluids through\nthe mathematical formulations of Gibbs in the 1910s. However, it took nearly 80\nyears before practical implementations of structure-based theories became\nwidely used for interpreting and understanding the atomic structures of fluids\nfrom experimental X-ray and neutron scattering data. The breakthrough in\nsuccessfully applying structure-potential relations is largely attributed to\nthe advancements in molecular mechanics simulations and the enhancement of\ncomputational resources. Despite advancements in understanding the relationship\nbetween structure and interatomic forces, a significant gap remains. Current\ntechniques for interpreting experimental scattering measurements are widely\nused, yet there is little evidence that they yield physically accurate\npredictions for interatomic forces. In fact, it is generally assumed that these\nmethods produce interatomic forces that poorly model the atomistic and\nthermodynamic behavior of fluids, rendering them unreliable and\nnon-transferable. This thesis aims to address these limitations by refining the\nstatistical theory, computational methods, and philosophical approach to\nstructure-based analyses, thereby developing more robust and accurate\ntechniques for characterizing structure-potential relationships.\n","subjects":["Physics/Chemical Physics"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}