{"id":"2408.15902","title":"Growth of (Cu,C)Ba$_{2}$Ca$_{2}$Cu$_3$O$_{9+\\delta}$ thin films on\n  flexible Hastelloy tapes","authors":"Meng-Jun Ou, Yuecong Liu, Yi Wang, Hai-Hu Wen","authorsParsed":[["Ou","Meng-Jun",""],["Liu","Yuecong",""],["Wang","Yi",""],["Wen","Hai-Hu",""]],"versions":[{"version":"v1","created":"Wed, 28 Aug 2024 16:15:27 GMT"}],"updateDate":"2024-08-29","timestamp":1724861727000,"abstract":"  The applications of superconducting cable or magnet require that the\nsuperconductors are made into wires or tapes. For cuprate superconductors, this\nis a big challenge because of the strong flux motion induced by high\nanisotropy, very short coherence length and strong thermal fluctuation, etc.\nOne of the ways is to fabricate superconducting films on flexible metallic\ntapes with oxide buffer layers. The successful one so far is the\nREBa$_2$Cu$_3$O$_7$ (REBCO, RE=rare earth elements) films in tape form, as\ncalled the coated conductors. While the superconducting transition temperature\nof REBCO system is limited to about 90 K. Here we report the successful\nfabrication of another new non-toxic superconducting film, namely\n(Cu,C)Ba$_{2}$Ca$_{2}$Cu$_3$O$_{9+\\delta}$ on these flexible metallic tapes\nwith LaMnO$_3$ and CeO$_2$ as the top layers. The onset superconducting\ntransition occurs at 112 K and 110 K, and the zero-resistance transition\ntemperatures are about 96 K and 98 K, respectively. The temperature dependent\nresistivity under magnetic fields in different directions reveal a relatively\nsmall anisotropy. Further optimization of the films will improve the zero\nresistance transition temperature, thus can also improve the characteristic\nproperties for applications. Our results show that the\n(Cu,C)Ba$_{2}$Ca$_{2}$Cu$_3$O$_{9+\\delta}$ is a promising candidate material\nfor the high power applications in liquid nitrogen temperature region.\n","subjects":["Condensed Matter/Superconductivity"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}