{"id":"2408.03339","title":"The Ontoverse: Democratising Access to Knowledge Graph-based Data\n  Through a Cartographic Interface","authors":"Johannes Zimmermann, Dariusz Wiktorek, Thomas Meusburger, Miquel\n  Monge-Dalmau, Antonio Fabregat, Alexander Jarasch, G\\\"unter Schmidt, Jorge S.\n  Reis-Filho, and T. Ian Simpson","authorsParsed":[["Zimmermann","Johannes",""],["Wiktorek","Dariusz",""],["Meusburger","Thomas",""],["Monge-Dalmau","Miquel",""],["Fabregat","Antonio",""],["Jarasch","Alexander",""],["Schmidt","Günter",""],["Reis-Filho","Jorge S.",""],["Simpson","T. Ian",""]],"versions":[{"version":"v1","created":"Mon, 22 Jul 2024 10:29:25 GMT"}],"updateDate":"2024-08-08","timestamp":1721644165000,"abstract":"  As the number of scientific publications and preprints is growing\nexponentially, several attempts have been made to navigate this complex and\nincreasingly detailed landscape. These have almost exclusively taken\nunsupervised approaches that fail to incorporate domain knowledge and lack the\nstructural organisation required for intuitive interactive human exploration\nand discovery. Especially in highly interdisciplinary fields, a deep\nunderstanding of the connectedness of research works across topics is essential\nfor generating insights. We have developed a unique approach to data navigation\nthat leans on geographical visualisation and uses hierarchically structured\ndomain knowledge to enable end-users to explore knowledge spaces grounded in\ntheir desired domains of interest. This can take advantage of existing\nontologies, proprietary intelligence schemata, or be directly derived from the\nunderlying data through hierarchical topic modelling. Our approach uses natural\nlanguage processing techniques to extract named entities from the underlying\ndata and normalise them against relevant domain references and navigational\nstructures. The knowledge is integrated by first calculating similarities\nbetween entities based on their shared extracted feature space and then by\nalignment to the navigational structures. The result is a knowledge graph that\nallows for full text and semantic graph query and structured topic driven\nnavigation. This allows end-users to identify entities relevant to their needs\nand access extensive graph analytics. The user interface facilitates graphical\ninteraction with the underlying knowledge graph and mimics a cartographic map\nto maximise ease of use and widen adoption. We demonstrate an exemplar project\nusing our generalisable and scalable infrastructure for an academic biomedical\nliterature corpus that is grounded against hundreds of different named domain\nentities.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Artificial Intelligence","Computing Research Repository/Emerging Technologies","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/"}