{"id":"2408.07986","title":"Experimental evaluation of offline reinforcement learning for HVAC\n  control in buildings","authors":"Jun Wang, Linyan Li, Qi Liu, Yu Yang","authorsParsed":[["Wang","Jun",""],["Li","Linyan",""],["Liu","Qi",""],["Yang","Yu",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 07:25:52 GMT"}],"updateDate":"2024-08-16","timestamp":1723706752000,"abstract":"  Reinforcement learning (RL) techniques have been increasingly investigated\nfor dynamic HVAC control in buildings. However, most studies focus on exploring\nsolutions in online or off-policy scenarios without discussing in detail the\nimplementation feasibility or effectiveness of dealing with purely offline\ndatasets or trajectories. The lack of these works limits the real-world\ndeployment of RL-based HVAC controllers, especially considering the abundance\nof historical data. To this end, this paper comprehensively evaluates the\nstrengths and limitations of state-of-the-art offline RL algorithms by\nconducting analytical and numerical studies. The analysis is conducted from two\nperspectives: algorithms and dataset characteristics. As a prerequisite, the\nnecessity of applying offline RL algorithms is first confirmed in two building\nenvironments. The ability of observation history modeling to reduce violations\nand enhance performance is subsequently studied. Next, the performance of\nRL-based controllers under datasets with different qualitative and quantitative\nconditions is investigated, including constraint satisfaction and power\nconsumption. Finally, the sensitivity of certain hyperparameters is also\nevaluated. The results indicate that datasets of a certain suboptimality level\nand relatively small scale can be utilized to effectively train a\nwell-performed RL-based HVAC controller. Specifically, such controllers can\nreduce at most 28.5% violation ratios of indoor temperatures and achieve at\nmost 12.1% power savings compared to the baseline controller. In summary, this\npaper presents our well-structured investigations and new findings when\napplying offline reinforcement learning to building HVAC systems.\n","subjects":["Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}