{"id":"2408.15094","title":"Constrained Diffusion Models via Dual Training","authors":"Shervin Khalafi and Dongsheng Ding and Alejandro Ribeiro","authorsParsed":[["Khalafi","Shervin",""],["Ding","Dongsheng",""],["Ribeiro","Alejandro",""]],"versions":[{"version":"v1","created":"Tue, 27 Aug 2024 14:25:42 GMT"}],"updateDate":"2024-08-28","timestamp":1724768742000,"abstract":"  Diffusion models have attained prominence for their ability to synthesize a\nprobability distribution for a given dataset via a diffusion process, enabling\nthe generation of new data points with high fidelity. However, diffusion\nprocesses are prone to generating biased data based on the training dataset. To\naddress this issue, we develop constrained diffusion models by imposing\ndiffusion constraints based on desired distributions that are informed by\nrequirements. Specifically, we cast the training of diffusion models under\nrequirements as a constrained distribution optimization problem that aims to\nreduce the distribution difference between original and generated data while\nobeying constraints on the distribution of generated data. We show that our\nconstrained diffusion models generate new data from a mixture data distribution\nthat achieves the optimal trade-off among objective and constraints. To train\nconstrained diffusion models, we develop a dual training algorithm and\ncharacterize the optimality of the trained constrained diffusion model. We\nempirically demonstrate the effectiveness of our constrained models in two\nconstrained generation tasks: (i) we consider a dataset with one or more\nunderrepresented classes where we train the model with constraints to ensure\nfairly sampling from all classes during inference; (ii) we fine-tune a\npre-trained diffusion model to sample from a new dataset while avoiding\noverfitting.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Computer Vision and Pattern Recognition","Mathematics/Optimization and Control"],"license":"http://creativecommons.org/licenses/by-sa/4.0/","blobId":"Wi1uhVufh_7bQ6nz9Hy303l6KpmlGMykcOxemTu2nqQ","pdfSize":"1834995"}
