{"id":"2408.08023","title":"Causal Discovery from Time-Series Data with Short-Term Invariance-Based\n  Convolutional Neural Networks","authors":"Rujia Shen, Boran Wang, Chao Zhao, Yi Guan and Jingchi Jiang","authorsParsed":[["Shen","Rujia",""],["Wang","Boran",""],["Zhao","Chao",""],["Guan","Yi",""],["Jiang","Jingchi",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 08:43:28 GMT"}],"updateDate":"2024-08-16","timestamp":1723711408000,"abstract":"  Causal discovery from time-series data aims to capture both intra-slice\n(contemporaneous) and inter-slice (time-lagged) causality between variables\nwithin the temporal chain, which is crucial for various scientific disciplines.\nCompared to causal discovery from non-time-series data, causal discovery from\ntime-series data necessitates more serialized samples with a larger amount of\nobserved time steps. To address the challenges, we propose a novel\ngradient-based causal discovery approach STIC, which focuses on\n\\textbf{S}hort-\\textbf{T}erm \\textbf{I}nvariance using \\textbf{C}onvolutional\nneural networks to uncover the causal relationships from time-series data.\nSpecifically, STIC leverages both the short-term time and mechanism invariance\nof causality within each window observation, which possesses the property of\nindependence, to enhance sample efficiency. Furthermore, we construct two\ncausal convolution kernels, which correspond to the short-term time and\nmechanism invariance respectively, to estimate the window causal graph. To\ndemonstrate the necessity of convolutional neural networks for causal discovery\nfrom time-series data, we theoretically derive the equivalence between\nconvolution and the underlying generative principle of time-series data under\nthe assumption that the additive noise model is identifiable. Experimental\nevaluations conducted on both synthetic and FMRI benchmark datasets demonstrate\nthat our STIC outperforms baselines significantly and achieves the\nstate-of-the-art performance, particularly when the datasets contain a limited\nnumber of observed time steps. Code is available at\n\\url{https://github.com/HITshenrj/STIC}.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"kK4DJsyH8lIYaqWdPvFIMo_vmZujWw8Zrm4N-1uQKDs","pdfSize":"863337"}
