{"id":"2408.04521","title":"Electrical resistivity, thermal conductivity, and viscosity of Fe-H\n  alloys at Earth's core conditions","authors":"Cong Liu, Ronald Cohen","authorsParsed":[["Liu","Cong",""],["Cohen","Ronald",""]],"versions":[{"version":"v1","created":"Thu, 8 Aug 2024 15:23:29 GMT"},{"version":"v2","created":"Fri, 9 Aug 2024 17:27:56 GMT"}],"updateDate":"2024-08-12","timestamp":1723130609000,"abstract":"  The transport properties (electrical resistivity, thermal conductivity, and\nviscosity) of iron-hydrogen alloy are of great significance in the stability\nand evolution of planetary magnetic fields. Here, we investigate the thermal\ntransport properties of iron doped with varying hydrogen content as functions\nof pressure (P) and temperature (T) for the top and bottom of Earth's outer\ncore and beyond, corresponding to pressures of about 130 to 300 GPa and\ntemperatures of 4000 to 7000 K. Using first-principles density functional\ntheory molecular dynamic simulations (FPMD), we verify that crystalline FeH$_x$\nis superionic with H diffusing freely. We find a low frequency viscosity of\n10-11 mPa$\\cdot$s for liquid Fe-H alloys at Earth's outer core conditions by\nthe linear response Green-Kubo formula. Using the KKR method within density\nfunctional theory (DFT) plus Dynamical mean-field Theory (DMFT), we find\nsaturation of electrical resistivity with increasing temperatures in liquid\niron at outer core conditions. The effect of H on electrical and thermal\ntransport we find is small, so that the exact H content of the core is not\nneeded. The primary effect of H is on the equation of state, decreasing the\ndensity at constant P and T. We find the Lorenz number is smaller than the\nideal value, and obtain for X(H)= 0.20, or 0.45 wt% H , thermal conductivity\n$\\kappa$ of $\\sim$105 and $\\sim$190 $Wm^{-1}K^{-1}$, respectively, at\nconditions near the core-mantle and inner-outer core boundary.\n","subjects":["Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"C6ZMQ6SzDvGwOW54GUKhpl9POO0XQKIdZ_OzjSPiBUc","pdfSize":"3248889"}
