{"id":"2408.02898","title":"Evidence chain for time-reversal symmetry-breaking kagome\n  superconductivity","authors":"Hanbin Deng, Guowei Liu, Z. Guguchia, Tianyu Yang, Jinjin Liu, Zhiwei\n  Wang, Yaofeng Xie, Sen Shao, Haiyang Ma, William Li\\`ege, Fr\\'ed\\'eric\n  Bourdarot, Xiao-Yu Yan, Hailang Qin, C. Mielke III, R. Khasanov, H. Luetkens,\n  Xianxin Wu, Guoqing Chang, Jianpeng Liu, Morten Holm Christensen, Andreas\n  Kreisel, Brian M{\\o}ller Andersen, Wen Huang, Yue Zhao, Philippe Bourges,\n  Yugui Yao, Pengcheng Dai, Jia-Xin Yin","authorsParsed":[["Deng","Hanbin",""],["Liu","Guowei",""],["Guguchia","Z.",""],["Yang","Tianyu",""],["Liu","Jinjin",""],["Wang","Zhiwei",""],["Xie","Yaofeng",""],["Shao","Sen",""],["Ma","Haiyang",""],["Liège","William",""],["Bourdarot","Frédéric",""],["Yan","Xiao-Yu",""],["Qin","Hailang",""],["Mielke","C.","III"],["Khasanov","R.",""],["Luetkens","H.",""],["Wu","Xianxin",""],["Chang","Guoqing",""],["Liu","Jianpeng",""],["Christensen","Morten Holm",""],["Kreisel","Andreas",""],["Andersen","Brian Møller",""],["Huang","Wen",""],["Zhao","Yue",""],["Bourges","Philippe",""],["Yao","Yugui",""],["Dai","Pengcheng",""],["Yin","Jia-Xin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 02:06:21 GMT"}],"updateDate":"2024-08-07","timestamp":1722909981000,"abstract":"  Superconductivity and magnetism are antagonistic quantum matter, while their\nintertwining has long been considered in frustrated-lattice systems1-3. In this\nwork, we utilize scanning tunneling microscopy and muon spin resonance to\ndiscover time-reversal symmetry-breaking superconductivity in kagome metal\nCs(V,Ta)3Sb5, where the Cooper pairing exhibits magnetism and is modulated by\nit. In the magnetic channel, we observe spontaneous internal magnetism in a\nfull-gap superconducting state. Under perturbations of inverse magnetic fields,\nwe detect a time-reversal asymmetrical interference of Bogoliubov\nquasi-particles at a circular vector. At this vector, the pairing gap\nspontaneously modulates, which is distinct from pair density waves occurring at\na point vector and consistent with the theoretical proposal of unusual\ninterference effect under time-reversal symmetry-breaking. The correlation\nbetween internal magnetism, Bogoliubov quasi-particles, and pairing modulation\nprovides a chain of experimental clues for time-reversal symmetry-breaking\nkagome superconductivity.\n","subjects":["Condensed Matter/Superconductivity","Condensed Matter/Materials Science"],"license":"http://creativecommons.org/licenses/by/4.0/"}