{"id":"2408.05204","title":"Evaluating the capability of large language models to personalize\n  science texts for diverse middle-school-age learners","authors":"Michael Vaccaro Jr, Mikayla Friday, Arash Zaghi","authorsParsed":[["Vaccaro","Michael","Jr"],["Friday","Mikayla",""],["Zaghi","Arash",""]],"versions":[{"version":"v1","created":"Fri, 9 Aug 2024 17:53:35 GMT"}],"updateDate":"2024-08-12","timestamp":1723226015000,"abstract":"  Large language models (LLMs), including OpenAI's GPT-series, have made\nsignificant advancements in recent years. Known for their expertise across\ndiverse subject areas and quick adaptability to user-provided prompts, LLMs\nhold unique potential as Personalized Learning (PL) tools. Despite this\npotential, their application in K-12 education remains largely unexplored. This\npaper presents one of the first randomized controlled trials (n = 23) to\nevaluate the effectiveness of GPT-4 in personalizing educational science texts\nfor middle school students. In this study, GPT-4 was used to profile student\nlearning preferences based on choices made during a training session. For the\nexperimental group, GPT-4 was used to rewrite science texts to align with the\nstudent's predicted profile while, for students in the control group, texts\nwere rewritten to contradict their learning preferences. The results of a\nMann-Whitney U test showed that students significantly preferred (at the .10\nlevel) the rewritten texts when they were aligned with their profile (p =\n.059). These findings suggest that GPT-4 can effectively interpret and tailor\neducational content to diverse learner preferences, marking a significant\nadvancement in PL technology. The limitations of this study and ethical\nconsiderations for using artificial intelligence in education are also\ndiscussed.\n","subjects":["Computing Research Repository/Human-Computer Interaction","Computing Research Repository/Computation and Language","Computing Research Repository/Computers and Society"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}