{"id":"2408.06467","title":"Generalization Enhancement Strategies to Enable Cross-year Cropland\n  Mapping with Convolutional Neural Networks Trained Using Historical Samples","authors":"Sam Khallaghi, Rahebe Abedi, Hanan Abou Ali, Hamed Alemohammad, Mary\n  Dziedzorm Asipunu, Ismail Alatise, Nguyen Ha, Boka Luo, Cat Mai, Lei Song,\n  Amos Wussah, Sitian Xiong, Yao-Ting Yao, Qi Zhang, Lyndon D. Estes","authorsParsed":[["Khallaghi","Sam",""],["Abedi","Rahebe",""],["Ali","Hanan Abou",""],["Alemohammad","Hamed",""],["Asipunu","Mary Dziedzorm",""],["Alatise","Ismail",""],["Ha","Nguyen",""],["Luo","Boka",""],["Mai","Cat",""],["Song","Lei",""],["Wussah","Amos",""],["Xiong","Sitian",""],["Yao","Yao-Ting",""],["Zhang","Qi",""],["Estes","Lyndon D.",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 19:42:09 GMT"},{"version":"v2","created":"Wed, 14 Aug 2024 21:53:32 GMT"}],"updateDate":"2024-08-19","timestamp":1723491729000,"abstract":"  The accuracy of mapping agricultural fields across large areas is steadily\nimproving with high-resolution satellite imagery and deep learning (DL) models,\neven in regions where fields are small and geometrically irregular. However,\ndeveloping effective DL models often requires large, expensive label datasets,\ntypically available only for specific years or locations. This limits the\nability to create annual maps essential for agricultural monitoring, as domain\nshifts occur between years and regions due to changes in farming practices and\nenvironmental conditions. The challenge is to design a model flexible enough to\naccount for these shifts without needing yearly labels. While domain adaptation\ntechniques or semi-supervised training are common solutions, we explored\nenhancing the model's generalization power. Our results indicate that a\nholistic approach is essential, combining methods to improve generalization.\nSpecifically, using an area-based loss function, such as Tversky-focal loss\n(TFL), significantly improved predictions across multiple years. The use of\ndifferent augmentation techniques helped to encode different types of\ninvariance, particularly photometric augmentations encoded invariance to\nbrightness changes, though they increased false positives. The combination of\nphotometric augmentation, TFL loss, and MC-dropout produced the best results,\nalthough dropout alone led to more false negatives in subsequent year\npredictions. Additionally, the choice of input normalization had a significant\nimpact, with the best results obtained when statistics were calculated either\nlocally or across the entire dataset over all bands (lab and gab). We developed\na workflow that enabled a U-Net model to generate effective multi-year crop\nmaps over large areas. Our code, available at:\nhttps://github.com/agroimpacts/cnn-generalization-enhancement, will be\nregularly updated with improvements.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/","blobId":"z0CCAd5dWW7Hc8d5LKPCVRGtwcj9BDzmW7kz-sJO5u0","pdfSize":"10967409"}
