{"id":"2408.16291","title":"Flexible framework for generating synthetic electrocardiograms and\n  photoplethysmograms","authors":"Katri Karhinoja, Antti Vasankari, Jukka-Pekka Sirki\\\"a, Antti Airola,\n  David Wong and Matti Kaisti","authorsParsed":[["Karhinoja","Katri",""],["Vasankari","Antti",""],["Sirkiä","Jukka-Pekka",""],["Airola","Antti",""],["Wong","David",""],["Kaisti","Matti",""]],"versions":[{"version":"v1","created":"Thu, 29 Aug 2024 06:48:07 GMT"}],"updateDate":"2024-08-30","timestamp":1724914087000,"abstract":"  By generating synthetic biosignals, the quantity and variety of health data\ncan be increased. This is especially useful when training machine learning\nmodels by enabling data augmentation and introduction of more physiologically\nplausible variation to the data. For these purposes, we have developed a\nsynthetic biosignal model for two signal modalities, electrocardiography (ECG)\nand photoplethysmography (PPG). The model produces realistic signals that\naccount for physiological effects such as breathing modulation and changes in\nheart rate due to physical stress. Arrhythmic signals can be generated with\nbeat intervals extracted from real measurements. The model also includes a\nflexible approach to adding different kinds of noise and signal artifacts. The\nnoise is generated from power spectral densities extracted from both measured\nnoisy signals and modeled power spectra. Importantly, the model also\nautomatically produces labels for noise, segmentation (e.g. P and T waves, QRS\ncomplex, for electrocardiograms), and artifacts. We assessed how this\ncomprehensive model can be used in practice to improve the performance of\nmodels trained on ECG or PPG data. For example, we trained an LSTM to detect\nECG R-peaks using both real ECG signals from the MIT-BIH arrythmia set and our\nnew generator. The F1 score of the model was 0.83 using real data, in\ncomparison to 0.98 using our generator. In addition, the model can be used for\nexample in signal segmentation, quality detection and bench-marking detection\nalgorithms. The model code has been released in\n\\url{https://github.com/UTU-Health-Research/framework_for_synthetic_biosignals}\n","subjects":["Computing Research Repository/Machine Learning","Electrical Engineering and Systems Science/Signal Processing"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"Z1c85L1i_r51J6Rt0cOll5Q4WTucjuZSiTACzxc62aU","pdfSize":"4652567"}
