{"id":"2408.02988","title":"Fast Whole-Brain MR Multi-Parametric Mapping with Scan-Specific\n  Self-Supervised Networks","authors":"Amir Heydari, Abbas Ahmadi, Tae Hyung Kim, Berkin Bilgic","authorsParsed":[["Heydari","Amir",""],["Ahmadi","Abbas",""],["Kim","Tae Hyung",""],["Bilgic","Berkin",""]],"versions":[{"version":"v1","created":"Tue, 6 Aug 2024 06:43:06 GMT"}],"updateDate":"2024-08-07","timestamp":1722926586000,"abstract":"  Quantification of tissue parameters using MRI is emerging as a powerful tool\nin clinical diagnosis and research studies. The need for multiple long scans\nwith different acquisition parameters prohibits quantitative MRI from reaching\nwidespread adoption in routine clinical and research exams. Accelerated\nparameter mapping techniques leverage parallel imaging, signal modelling and\ndeep learning to offer more practical quantitative MRI acquisitions. However,\nthe achievable acceleration and the quality of maps are often limited. Joint\nMAPLE is a recent state-of-the-art multi-parametric and scan-specific parameter\nmapping technique with promising performance at high acceleration rates. It\nsynergistically combines parallel imaging, model-based and machine learning\napproaches for joint mapping of T1, T2*, proton density and the field\ninhomogeneity. However, Joint MAPLE suffers from prohibitively long\nreconstruction time to estimate the maps from a multi-echo, multi-flip angle\n(MEMFA) dataset at high resolution in a scan-specific manner. In this work, we\npropose a faster version of Joint MAPLE which retains the mapping performance\nof the original version. Coil compression, random slice selection,\nparameter-specific learning rates and transfer learning are synergistically\ncombined in the proposed framework. It speeds-up the reconstruction time up to\n700 times than the original version and processes a whole-brain MEMFA dataset\nin 21 minutes on average, which originally requires ~260 hours for Joint MAPLE.\nThe mapping performance of the proposed framework is ~2-fold better than the\nstandard and the state-of-the-art evaluated reconstruction techniques on\naverage in terms of the root mean squared error.\n","subjects":["Quantitative Biology/Quantitative Methods","Physics/Medical Physics"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}