{"id":"2408.06051","title":"Perceptual Similarity for Measuring Decision-Making Style and Policy\n  Diversity in Games","authors":"Chiu-Chou Lin, Wei-Chen Chiu, I-Chen Wu","authorsParsed":[["Lin","Chiu-Chou",""],["Chiu","Wei-Chen",""],["Wu","I-Chen",""]],"versions":[{"version":"v1","created":"Mon, 12 Aug 2024 10:55:42 GMT"},{"version":"v2","created":"Fri, 30 Aug 2024 03:19:26 GMT"}],"updateDate":"2024-09-02","timestamp":1723460142000,"abstract":"  Defining and measuring decision-making styles, also known as playstyles, is\ncrucial in gaming, where these styles reflect a broad spectrum of individuality\nand diversity. However, finding a universally applicable measure for these\nstyles poses a challenge. Building on Playstyle Distance, the first\nunsupervised metric to measure playstyle similarity based on game screens and\nraw actions, we introduce three enhancements to increase accuracy: multiscale\nanalysis with varied state granularity, a perceptual kernel rooted in\npsychology, and the utilization of the intersection-over-union method for\nefficient evaluation. These innovations not only advance measurement precision\nbut also offer insights into human cognition of similarity. Across two racing\ngames and seven Atari games, our techniques significantly improve the precision\nof zero-shot playstyle classification, achieving an accuracy exceeding 90\npercent with fewer than 512 observation-action pairs, which is less than half\nan episode of these games. Furthermore, our experiments with 2048 and Go\ndemonstrate the potential of discrete playstyle measures in puzzle and board\ngames. We also develop an algorithm for assessing decision-making diversity\nusing these measures. Our findings improve the measurement of end-to-end game\nanalysis and the evolution of artificial intelligence for diverse playstyles.\n","subjects":["Computing Research Repository/Artificial Intelligence","Computing Research Repository/Information Retrieval","Computing Research Repository/Machine Learning"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}