{"id":"2408.10667","title":"Room-temperature cavity exciton-polariton condensation in perovskite\n  quantum dots","authors":"Ioannis Georgakilas, David Tiede, Darius Urbonas, Clara Bujalance,\n  Laura Cali\\`o, Rafa{\\l} Mirek, Virginia Oddi, Rui Tao, Dmitry N. Dirin,\n  Gabriele Rain\\`o, Simon C. Boehme, Juan F. Galisteo-L\\'opez, Rainer F. Mahrt,\n  Maksym V. Kovalenko, Hern\\'an Miguez, and Thilo St\\\"oferle","authorsParsed":[["Georgakilas","Ioannis",""],["Tiede","David",""],["Urbonas","Darius",""],["Bujalance","Clara",""],["Caliò","Laura",""],["Mirek","Rafał",""],["Oddi","Virginia",""],["Tao","Rui",""],["Dirin","Dmitry N.",""],["Rainò","Gabriele",""],["Boehme","Simon C.",""],["Galisteo-López","Juan F.",""],["Mahrt","Rainer F.",""],["Kovalenko","Maksym V.",""],["Miguez","Hernán",""],["Stöferle","Thilo",""]],"versions":[{"version":"v1","created":"Tue, 20 Aug 2024 09:11:05 GMT"}],"updateDate":"2024-08-21","timestamp":1724145065000,"abstract":"  The exploitation of the strong light-matter coupling regime and\nexciton-polariton condensates has emerged as a compelling approach to introduce\nstrong interactions and nonlinearities into numerous photonic applications,\nranging from low-threshold topological lasers to ultrafast all-optical logic\ndevices. The use of colloidal semiconductor quantum dots with strong\nthree-dimensional confinement as the active material in these microcavities\nwould be highly advantageous due to their versatile structural and\ncompositional tunability and wet-chemical processability, as well as\npotentially enhanced, confinement-induced polaritonic interactions. Yet, to\ndate, cavity exciton-polariton condensation has neither been achieved with\nepitaxial nor with colloidal quantum dots. Here, we demonstrate\nroom-temperature polariton condensation in a thin film of monodisperse,\ncolloidal CsPbBr$_3$ quantum dots placed in a tunable optical resonator with a\nGaussian-shaped deformation serving as wavelength-scale potential well for the\npolaritons. The onset of polariton condensation under pulsed optical excitation\nis manifested in emission by its characteristic superlinear intensity\ndependence, reduced linewidth, blueshift, and extended temporal coherence. Our\nresults, based on this highly engineerable class of perovskite materials with\nunique optical properties, pave the way for the development of polaritonic\ndevices for ultrabright coherent light sources and photonic information\nprocessing.\n","subjects":["Physics/Optics","Condensed Matter/Mesoscale and Nanoscale Physics","Condensed Matter/Other Condensed Matter"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}