{"id":"2408.09556","title":"Addressing Heterogeneity in Federated Learning: Challenges and Solutions\n  for a Shared Production Environment","authors":"Tatjana Legler, Vinit Hegiste, Ahmed Anwar, Martin Ruskowski","authorsParsed":[["Legler","Tatjana",""],["Hegiste","Vinit",""],["Anwar","Ahmed",""],["Ruskowski","Martin",""]],"versions":[{"version":"v1","created":"Sun, 18 Aug 2024 17:49:44 GMT"}],"updateDate":"2024-08-20","timestamp":1724003384000,"abstract":"  Federated learning (FL) has emerged as a promising approach to training\nmachine learning models across decentralized data sources while preserving data\nprivacy, particularly in manufacturing and shared production environments.\nHowever, the presence of data heterogeneity variations in data distribution,\nquality, and volume across different or clients and production sites, poses\nsignificant challenges to the effectiveness and efficiency of FL. This paper\nprovides a comprehensive overview of heterogeneity in FL within the context of\nmanufacturing, detailing the types and sources of heterogeneity, including\nnon-independent and identically distributed (non-IID) data, unbalanced data,\nvariable data quality, and statistical heterogeneity. We discuss the impact of\nthese types of heterogeneity on model training and review current methodologies\nfor mitigating their adverse effects. These methodologies include personalized\nand customized models, robust aggregation techniques, and client selection\ntechniques. By synthesizing existing research and proposing new strategies,\nthis paper aims to provide insight for effectively managing data heterogeneity\nin FL, enhancing model robustness, and ensuring fair and efficient training\nacross diverse environments. Future research directions are also identified,\nhighlighting the need for adaptive and scalable solutions to further improve\nthe FL paradigm in the context of Industry 4.0.\n","subjects":["Computing Research Repository/Machine Learning","Computing Research Repository/Artificial Intelligence"],"license":"http://creativecommons.org/licenses/by-nc-nd/4.0/"}