{"id":"2408.07922","title":"A Deep Features-Based Approach Using Modified ResNet50 and Gradient\n  Boosting for Visual Sentiments Classification","authors":"Muhammad Arslan, Muhammad Mubeen, Arslan Akram, Saadullah Farooq\n  Abbasi, Muhammad Salman Ali, and Muhammad Usman Tariq","authorsParsed":[["Arslan","Muhammad",""],["Mubeen","Muhammad",""],["Akram","Arslan",""],["Abbasi","Saadullah Farooq",""],["Ali","Muhammad Salman",""],["Tariq","Muhammad Usman",""]],"versions":[{"version":"v1","created":"Thu, 15 Aug 2024 04:18:40 GMT"}],"updateDate":"2024-08-16","timestamp":1723695520000,"abstract":"  The versatile nature of Visual Sentiment Analysis (VSA) is one reason for its\nrising profile. It isn't easy to efficiently manage social media data with\nvisual information since previous research has concentrated on Sentiment\nAnalysis (SA) of single modalities, like textual. In addition, most visual\nsentiment studies need to adequately classify sentiment because they are mainly\nfocused on simply merging modal attributes without investigating their\nintricate relationships. This prompted the suggestion of developing a fusion of\ndeep learning and machine learning algorithms. In this research, a deep\nfeature-based method for multiclass classification has been used to extract\ndeep features from modified ResNet50. Furthermore, gradient boosting algorithm\nhas been used to classify photos containing emotional content. The approach is\nthoroughly evaluated on two benchmarked datasets, CrowdFlower and GAPED.\nFinally, cutting-edge deep learning and machine learning models were used to\ncompare the proposed strategy. When compared to state-of-the-art approaches,\nthe proposed method demonstrates exceptional performance on the datasets\npresented.\n","subjects":["Computing Research Repository/Computer Vision and Pattern Recognition","Computing Research Repository/Machine Learning"],"license":"http://creativecommons.org/licenses/by/4.0/","blobId":"PPb1voN9LMrHdYgbHTdFWp7BAVgkRAHaH8-PvUn5_c0","pdfSize":"382265"}
