{"id":"2408.08956","title":"Theory-agnostic searches for non-gravitational modes in black hole\n  ringdown","authors":"Francesco Crescimbeni, Xisco Jimenez Forteza, Swetha Bhagwat, Julian\n  Westerweck, Paolo Pani","authorsParsed":[["Crescimbeni","Francesco",""],["Forteza","Xisco Jimenez",""],["Bhagwat","Swetha",""],["Westerweck","Julian",""],["Pani","Paolo",""]],"versions":[{"version":"v1","created":"Fri, 16 Aug 2024 18:01:02 GMT"},{"version":"v2","created":"Wed, 4 Sep 2024 08:52:47 GMT"}],"updateDate":"2024-09-05","timestamp":1723831262000,"abstract":"  In any extension of General Relativity (GR), extra fundamental degrees of\nfreedom couple to gravity. Besides deforming GR forecasts in a theory-dependent\nway, this coupling generically introduces extra modes in the gravitational-wave\nsignal. We propose a novel theory-agnostic test of gravity to search for these\nnongravitational modes in black hole merger ringdown signals. To leading order\nin the GR deviations, their frequencies and damping times match those of a test\nscalar or vector field in a Kerr background, with only amplitudes and phases as\nfree parameters. This test will be highly valuable for future detectors, which\nwill achieve signal-to-noise ratios higher than 100 (and as high as 1000 for\nspace-based detectors such as LISA). Such sensitivity will allow measurement of\nthese modes with amplitude ratios as low as 0.05 for ground-based detectors\n(and as low as 0.008 for LISA), relative to the fundamental mode, enabling\nstringent agnostic constraints or detection of scalar/vector modes. By applying\nthis test to GW150914, GW190521, and GW200129, we find that the current\nevidence for an extra mode is comparable to that for the first gravitational\novertone, but its inclusion modifies the inferred remnant spin.\n","subjects":["Physics/General Relativity and Quantum Cosmology","Astrophysics/High Energy Astrophysical Phenomena","Physics/High Energy Physics - Phenomenology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}