{"id":"2408.17423","title":"Corrections to Hawking radiation from asteroid-mass primordial black\n  holes: Numerical evaluation of dissipative effects","authors":"Emily Koivu, John Kushan, Makana Silva, Gabriel Vasquez, Arijit Das,\n  Christopher M Hirata","authorsParsed":[["Koivu","Emily",""],["Kushan","John",""],["Silva","Makana",""],["Vasquez","Gabriel",""],["Das","Arijit",""],["Hirata","Christopher M",""]],"versions":[{"version":"v1","created":"Fri, 30 Aug 2024 17:13:22 GMT"}],"updateDate":"2024-09-02","timestamp":1725038002000,"abstract":"  Primordial black holes (PBHs) are theorized objects that may make up some -\nor all - of the dark matter in the universe. At the lowest allowed masses,\nHawking radiation (in the form of photons or electrons and positrons) is the\nprimary tool to search for PBHs. This paper is part of an ongoing series in\nwhich we aim to calculate the $O(\\alpha)$ corrections to Hawking radiation from\nasteroid-mass primordial black holes, based on a perturbative quantum\nelectrodymanics (QED) calculation on Schwarzschild background. Silva et. al.\n(2023) divided the corrections into dissipative and conservative parts; this\nwork focuses on the numerical computation of the dissipative $O(\\alpha)$\ncorrections to the photon spectrum. We generate spectra for primordial black\nholes of mass $M=1$-$8 \\times 10^{21} m_{\\rm planck}$. This calculation\nconfirms the expectation that at low energies, the inner bremsstrahlung\nradiation is the dominant contribution to the Hawking radiation spectrum. At\nhigh energies, the main $O(\\alpha)$ effect is a suppression of the photon\nspectrum due to pair production (emitted $\\gamma\\rightarrow e^+e^-$), but this\nis small compared to the overall spectrum. We compare the low-energy tail in\nour curved spacetime QED calculation to several approximation schemes in the\nliterature, and find deviations that could have important implications for\nconstraints from Hawking radiation on primordial black holes as dark matter.\n","subjects":["Physics/General Relativity and Quantum Cosmology"],"license":"http://arxiv.org/licenses/nonexclusive-distrib/1.0/"}