{"id":"2408.01528","title":"Can multivariate Granger causality detect directed connectivity of a\n  multistable and dynamic biological decision network model?","authors":"Abdoreza Asadpour and KongFatt Wong-Lin","authorsParsed":[["Asadpour","Abdoreza",""],["Wong-Lin","KongFatt",""]],"versions":[{"version":"v1","created":"Fri, 2 Aug 2024 18:40:15 GMT"}],"updateDate":"2024-08-06","timestamp":1722624015000,"abstract":"  Extracting causal connections can advance interpretable AI and machine\nlearning. Granger causality (GC) is a robust statistical method for estimating\ndirected influences (DC) between signals. While GC has been widely applied to\nanalysing neuronal signals in biological neural networks and other domains, its\napplication to complex, nonlinear, and multistable neural networks is less\nexplored. In this study, we applied time-domain multi-variate Granger causality\n(MVGC) to the time series neural activity of all nodes in a trained multistable\nbiologically based decision neural network model with real-time decision\nuncertainty monitoring. Our analysis demonstrated that challenging two-choice\ndecisions, where input signals could be closely matched, and the appropriate\napplication of fine-grained sliding time windows, could readily reveal the\noriginal model's DC. Furthermore, the identified DC varied based on whether the\nnetwork had correct or error decisions. Integrating the identified DC from\ndifferent decision outcomes recovered most of the original model's\narchitecture, despite some spurious and missing connectivity. This approach\ncould be used as an initial exploration to enhance the interpretability and\ntransparency of dynamic multistable and nonlinear biological or AI systems by\nrevealing causal connections throughout different phases of neural network\ndynamics and outcomes.\n","subjects":["Quantitative Biology/Neurons and Cognition","Computing Research Repository/Machine Learning","Computing Research Repository/Neural and Evolutionary Computing","Mathematics/Dynamical Systems"],"license":"http://creativecommons.org/licenses/by-nc-sa/4.0/","blobId":"d189oRw4JHsVJIGh8-J2QbeFDayU_IPtwP7PRDqtJjY","pdfSize":"688277","txDigest":"9eEj6iF5XxZJDRU6L6Jzj4dTvsXeiQgz17PM8xfC6z1d","endEpoch":"1","status":"CERTIFIED"}
