{"id":"2409.10322","title":"Fairness, not Emotion, Drives Socioeconomic Decision Making","authors":"Rudra Mukhopadhyay, Sourin Chatterjee, Koel Das","authorsParsed":[["Mukhopadhyay","Rudra",""],["Chatterjee","Sourin",""],["Das","Koel",""]],"versions":[{"version":"v1","created":"Mon, 16 Sep 2024 14:34:48 GMT"}],"updateDate":"2024-09-17","timestamp":1726497288000,"abstract":"  Emotion and fairness play a key role in mediating socioeconomic decisions in\nhumans; however, the underlying neurocognitive mechanism remains largely\nunknown. In this study, we explored the interplay between proposers' emotions\nand fairness of offer magnitudes in rational decision-making. Employing a\ntime-bound UG paradigm, 40 (male, age: 18-20) participants were exposed to\nthree distinct proposers' emotions (Happy, Neutral, and Disgusted) followed by\none of the three offer ranges (Low, Intermediate, Maximum). Our findings show a\nrobust influence of fairness of offer on acceptance rates, with the impact of\nemotions obtained only within the low offer range. The increment of the offer\namount resulted in shorter reaction times, while emotional stimuli resulted in\nprolonged reaction times. A multilevel generalized linear model showed offer as\nthe dominant predictor of trial-specific responses. Subsequent agglomerative\nclustering grouped participants into five primary clusters based on responses\nmodulated by emotions/offers. The Drift Diffusion Model based on the clustering\nfurther corroborated our findings. Emotion-sensitive markers, including N170\nand LPP, demonstrated the participants' effect on facial expressions; however,\nfacial emotions had minimal effect on subsequent socioeconomic decisions. Our\nstudy suggests that, in general, participants gave more preference to the\nfairness of the offer with a slight effect of emotions in decision-making. We\nshow that though emotion is perceived and has an effect on decision-making\ntime, people mostly prioritise financial gain and fairness of offer. Moreover,\nit establishes a connection between reaction time and responses and further\ndives deep into individualistic decision-making processes revealing different\ncognitive strategies.\n","subjects":["Quantitative Biology/Neurons and Cognition"],"license":"http://creativecommons.org/licenses/by/4.0/","pdfSize":"4391446","blobId":"Nx7qWSuBR7P8dsufeVWpieRtz8QgxPNwe1pQzHuhU1w","objectId":"0x728af8f534c3bf7024f7f3ffe40ca4af88249cd4315ee894a4e5c7ee2dac61cf","registeredEpoch":"2","certifiedEpoch":"2","startEpoch":"2","endEpoch":"202"}
